------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\qc18278\OneDrive - University of Bristol\Documents\GitHub\os-sch-children-2021\analysis\log/07b_an_multi
> variable_cox_models_.log
  log type:  text
 opened on:  24 Jul 2021, 14:47:44

. 
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *************************************************************************************
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. forvalues period=0/3 {
  3. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  4. stsplit cat_time, at(0,78,147,400)
  5. recode cat_time 78=1 147=2 400=3
  6. recode `outcome' .=0 
  7. tab cat_time
  8. tab cat_time `outcome'
  9. 
. keep if cat_time==`period'
 10. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 11. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 12. if _rc==0{
 13. estimates
 14. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_ageband_`x'_timeperiod`pe
> riod'", replace
 15.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals
.         timer clear 
 16.         timer on 1
 17.         if e(N_fail)>0 estat phtest, d
 18.         timer off 1
 19.         timer list 
 20.         
. }
 21. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 22. 
. }
 23. 
. foreach exposure_type in  gp_number_kids {
 24. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_ageband_`x'"
 25. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 26. if _rc==0{
 27. estimates
 28. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_MAINFULLYADJMODEL_ageband_`x'_timeperiod`pe
> riod'", replace
 29. }
 30. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 31. 
. }
 32. }
 33. }
(13,844 observations (episodes) created)
(cat_time: 13844 changes made)
(covidadmission: 13844 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,007       53.62       53.62
          1 |      9,581       32.10       85.72
          2 |      4,263       14.28      100.00
------------+-----------------------------------
      Total |     29,851      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
Observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,759      3,248 |    16,007 
         1 |     6,907      2,674 |     9,581 
         2 |     3,032      1,231 |     4,263 
-----------+----------------------+----------
     Total |    22,698      7,153 |    29,851 
(13,844 observations deleted)
   1:     39.10 /        1 =      39.1050

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,007             Number of obs    =      16,007
No. of failures      =        3,248
Time at risk         =      1049868
                                                Wald chi2(42)    =       61.00
Log pseudolikelihood =   -23190.698             Prob > chi2      =      0.0291

                                        (Std. Err. adjusted for 1,113 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat4 |
              only <12 years  |   1.127692   .1436823     0.94   0.346     .8784892    1.447586
                  only 12-18  |   1.195784   .1995775     1.07   0.284     .8621568    1.658514
                       mixed  |    1.20201   .1436884     1.54   0.124     .9509449     1.51936
                              |
                         age1 |   1.006014   .0065799     0.92   0.359        .9932    1.018994
                         age2 |   .9808648    .020351    -0.93   0.352     .9417777    1.021574
                         age3 |   1.055226   .0623296     0.91   0.363     .9398686    1.184742
                       1.male |   .9617939   .0337433    -1.11   0.267     .8978809    1.030256
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.021082   .0530186     0.40   0.688     .9222799    1.130468
          Obese II (35-39.9)  |   .9673424   .0595415    -0.54   0.590     .8574076    1.091373
             Obese III (40+)  |   .9596607   .0784371    -0.50   0.614     .8176086    1.126393
                              |
                 smoke_nomiss |
                      Former  |   1.071058    .129815     0.57   0.571     .8445883    1.358253
                     Current  |   .9347277   .0526537    -1.20   0.231     .8370212     1.04384
                              |
                          imd |
                           4  |   1.060273   .0479161     1.30   0.195     .9703982    1.158472
             5 most deprived  |   .9470494   .0577026    -0.89   0.372     .8404463    1.067174
                              |
                tot_adults_hh |
                           2  |   .6573391   .1861887    -1.48   0.139     .3773027     1.14522
                           3  |   .5358369   .1136163    -2.94   0.003      .353629    .8119275
                              |
                    ethnicity |
      Asian or Asian British  |   .9675321   .0604252    -0.53   0.597     .8560622    1.093517
                       Other  |   .9158612   .0550438    -1.46   0.144     .8140891    1.030356
                              |
           1.htdiag_or_highbp |   .9910603   .0626412    -0.14   0.887     .8755861    1.121763
1.chronic_respiratory_disease |   .9243681   .0415467    -1.75   0.080     .8464217    1.009493
                     1.asthma |   .9349765   .0639925    -0.98   0.326     .8176021    1.069201
    1.chronic_cardiac_disease |   1.001245   .0466193     0.03   0.979     .9139184    1.096917
                              |
                      diabcat |
            T1DM, controlled  |   .9827163   .1125229    -0.15   0.879     .7851705    1.229964
          T1DM, uncontrolled  |   .7991275   .2375431    -0.75   0.451     .4462659    1.430996
            T2DM, controlled  |   1.051024   .0503344     1.04   0.299      .956859    1.154456
          T2DM, uncontrolled  |    1.04447   .1030304     0.44   0.659     .8608555    1.267248
          Diabetes, no HbA1c  |   3.150238   1.418891     2.55   0.011     1.303034    7.616071
                              |
            cancer_exhaem_cat |
                   Last year  |   .6509356   .2294968    -1.22   0.223     .3261629    1.299097
               2-5 years ago  |   .8164779    .121083    -1.37   0.172     .6105369    1.091885
                    5+ years  |   1.083201   .0485428     1.78   0.075     .9921172    1.182646
                              |
              cancer_haem_cat |
                   Last year  |   1.160194   .3475869     0.50   0.620     .6449353     2.08711
               2-5 years ago  |   .9013332   .1485133    -0.63   0.528     .6525778    1.244911
                    5+ years  |   1.136704   .0508804     2.86   0.004      1.04123    1.240933
                              |
      1.chronic_liver_disease |   .9608734   .0421253    -0.91   0.363     .8817571    1.047089
            1.stroke_dementia |   .9753079   .0430157    -0.57   0.571     .8945399    1.063368
                1.other_neuro |   1.015103   .0436865     0.35   0.728      .932991    1.104442
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.188331   .2852549     0.72   0.472     .7423507    1.902241
                       1.esrd |   1.052442   .0382065     1.41   0.159     .9801602    1.130053
           1.other_transplant |   .9432984   .0436294    -1.26   0.207     .8615478    1.032806
                   1.asplenia |   .9764377   .0433806    -0.54   0.591       .89501    1.065274
           1.ra_sle_psoriasis |   .9877028   .0431898    -0.28   0.777     .9065784    1.076087
               1.other_immuno |   .9561743   .0430764    -0.99   0.320     .8753662    1.044442
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_0_timeperiod0.ster not foun
> d)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_0_timeperiod0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.00797         0.17        1         0.6805
      2.kids_cat4 |     -0.01497         0.64        1         0.4254
      3.kids_cat4 |     -0.01108         0.33        1         0.5675
      age1        |     -0.01680         0.95        1         0.3305
      age2        |      0.01275         0.56        1         0.4560
      age3        |     -0.01067         0.39        1         0.5342
      0b.male     |            .            .        1             .
      1.male      |     -0.00314         0.03        1         0.8555
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01513         0.82        1         0.3651
      3.obese4cat |     -0.01941         1.25        1         0.2636
      4.obese4cat |     -0.00686         0.17        1         0.6775
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00994         0.33        1         0.5667
      3.smoke_no~s|      0.01060         0.42        1         0.5172
      1b.imd      |            .            .        1             .
      4.imd       |     -0.01384         0.71        1         0.4003
      5.imd       |      0.01882         1.27        1         0.2606
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.02305         1.78        1         0.1823
      3.tot_adul~h|      0.00628         0.12        1         0.7294
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.02442         2.25        1         0.1337
      5.ethnicity |      0.02273         1.82        1         0.1772
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.01823         1.13        1         0.2881
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01995         1.41        1         0.2358
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.00865         0.28        1         0.5961
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.02962         3.41        1         0.0649
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00368         0.05        1         0.8259
      3.diabcat   |      0.00583         0.14        1         0.7106
      4.diabcat   |      0.01439         0.74        1         0.3901
      5.diabcat   |     -0.00609         0.14        1         0.7104
      6.diabcat   |      0.00274         0.03        1         0.8708
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00421         0.06        1         0.8055
      3.cancer_e~t|      0.01556         0.81        1         0.3693
      4.cancer_e~t|      0.00415         0.06        1         0.8055
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.01569         0.91        1         0.3393
      3.cancer_h~t|     -0.00511         0.10        1         0.7513
      4.cancer_h~t|      0.02010         1.44        1         0.2301
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.01263         0.55        1         0.4598
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.00259         0.02        1         0.8795
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00309         0.03        1         0.8541
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.00447         0.07        1         0.7951
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.01164         0.48        1         0.4864
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.01522         0.90        1         0.3435
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.01704         1.03        1         0.3100
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00270         0.03        1         0.8740
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00426         0.06        1         0.7990
      ------------+---------------------------------------------------
      global test |                     28.64       42         0.9423
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:     63.27 /        1 =      63.2650
   1:      8.61 /        1 =       8.6060

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,561             Number of obs    =       1,561
No. of failures      =          304
Time at risk         =       103597
                                                Wald chi2(40)    =    21118.82
Log pseudolikelihood =   -1446.7309             Prob > chi2      =      0.0000

                                          (Std. Err. adjusted for 199 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              2 children <12  |   .9231302   .1696236    -0.44   0.663     .6439559    1.323335
              3 children <12  |   .9594746   .1603318    -0.25   0.804     .6915037    1.331289
             4+ children <12  |   1.002702   .1275653     0.02   0.983     .7814136    1.286658
                              |
                         age1 |   .9944829   .0209592    -0.26   0.793     .9542404    1.036422
                         age2 |   .9970464   .0678247    -0.04   0.965     .8725932     1.13925
                         age3 |    1.02368   .1987353     0.12   0.904     .6997026    1.497665
                       1.male |   .9820665   .1079411    -0.16   0.869     .7917416    1.218143
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.059584   .1927131     0.32   0.750     .7418604    1.513383
          Obese II (35-39.9)  |   .8353003    .196105    -0.77   0.443     .5272353    1.323368
             Obese III (40+)  |   1.018301   .2686569     0.07   0.945     .6071626    1.707841
                              |
                 smoke_nomiss |
                      Former  |   .7856552   .3897887    -0.49   0.627     .2971143    2.077497
                     Current  |   .8869324   .1612481    -0.66   0.509     .6210669    1.266609
                              |
                          imd |
                           4  |   .9282114   .1401094    -0.49   0.622     .6904969    1.247763
             5 most deprived  |   .5970854   .1308868    -2.35   0.019     .3885482    .9175463
                              |
                tot_adults_hh |
                           2  |   .8924915   .8244331    -0.12   0.902     .1459864     5.45627
                           3  |   .9296581   .6281056    -0.11   0.914     .2473007    3.494791
                              |
                    ethnicity |
      Asian or Asian British  |   1.126578   .2238892     0.60   0.549     .7631299     1.66312
                       Other  |   .8509118   .1659303    -0.83   0.408     .5806277    1.247014
                              |
           1.htdiag_or_highbp |   .8139971   .1468379    -1.14   0.254     .5715755    1.159237
1.chronic_respiratory_disease |   .9378383   .1500455    -0.40   0.688      .685399    1.283253
                     1.asthma |   .9876884   .2088115    -0.06   0.953     .6526251    1.494776
    1.chronic_cardiac_disease |   .9522781   .1463964    -0.32   0.750     .7045409    1.287127
                              |
                      diabcat |
            T1DM, controlled  |   1.343511   .3880339     1.02   0.307     .7627751    2.366388
          T1DM, uncontrolled  |   1.76e-19   9.89e-20   -77.04   0.000     5.88e-20    5.29e-19
            T2DM, controlled  |   1.397606   .2344979     2.00   0.046     1.005925    1.941797
          T2DM, uncontrolled  |   1.560662    .423686     1.64   0.101     .9166975    2.657001
                              |
            cancer_exhaem_cat |
                   Last year  |   2.06e-19   9.81e-20   -90.37   0.000     8.11e-20    5.24e-19
               2-5 years ago  |   .1493299    .152465    -1.86   0.063     .0201871    1.104636
                    5+ years  |   1.093753   .1688016     0.58   0.561     .8082599    1.480087
                              |
              cancer_haem_cat |
                   Last year  |   8.17e-19          .        .       .            .           .
               2-5 years ago  |   2.174298   .9428299     1.79   0.073     .9294302    5.086527
                    5+ years  |   1.511945   .1973583     3.17   0.002     1.170648    1.952745
                              |
      1.chronic_liver_disease |   .8239548   .1288052    -1.24   0.215     .6065113    1.119355
            1.stroke_dementia |   1.091461   .1732445     0.55   0.581     .7996488    1.489762
                1.other_neuro |   .9178061   .1621125    -0.49   0.627     .6492363    1.297475
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |    1.05238   1.169712     0.05   0.963     .1191429    9.295585
                       1.esrd |   1.172263   .1378607     1.35   0.177     .9309401    1.476142
           1.other_transplant |   .9707458   .1419085    -0.20   0.839     .7289077    1.292821
                   1.asplenia |    .947422   .1273347    -0.40   0.688     .7280161    1.232951
           1.ra_sle_psoriasis |   1.008111   .1452207     0.06   0.955     .7601354    1.336983
               1.other_immuno |   1.007513   .1412861     0.05   0.957     .7653932    1.326224
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_0_timeperiod0.ster not
>  found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_0_timeperiod0.ster saved
(13,844 observations (episodes) created)
(cat_time: 13844 changes made)
(covidadmission: 13844 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,007       53.62       53.62
          1 |      9,581       32.10       85.72
          2 |      4,263       14.28      100.00
------------+-----------------------------------
      Total |     29,851      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
Observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,759      3,248 |    16,007 
         1 |     6,907      2,674 |     9,581 
         2 |     3,032      1,231 |     4,263 
-----------+----------------------+----------
     Total |    22,698      7,153 |    29,851 
(20,270 observations deleted)
   1:     24.78 /        1 =      24.7780

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,581             Number of obs    =       9,581
No. of failures      =        2,674
Time at risk         =       470266
                                                Wald chi2(42)    =      155.78
Log pseudolikelihood =    -17400.03             Prob > chi2      =      0.0000

                                        (Std. Err. adjusted for 1,031 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat4 |
              only <12 years  |   .9530827   .1501577    -0.31   0.760      .699881    1.297887
                  only 12-18  |     .75041   .1714107    -1.26   0.209     .4795842    1.174174
                       mixed  |   .9189295   .1346833    -0.58   0.564      .689486    1.224726
                              |
                         age1 |   .9910441   .0073082    -1.22   0.222     .9768233    1.005472
                         age2 |   1.018788   .0236461     0.80   0.423     .9734805    1.066204
                         age3 |   .9557242   .0633835    -0.68   0.495     .8392299    1.088389
                       1.male |    .967119   .0381534    -0.85   0.397     .8951576    1.044865
                              |
                    obese4cat |
           Obese I (30-34.9)  |   .9136141   .0515564    -1.60   0.109     .8179531    1.020463
          Obese II (35-39.9)  |   1.018369   .0685784     0.27   0.787     .8924505    1.162054
             Obese III (40+)  |    .882714   .0804555    -1.37   0.171     .7383065    1.055367
                              |
                 smoke_nomiss |
                      Former  |   1.208724   .1435042     1.60   0.110     .9577875    1.525404
                     Current  |   1.082946   .0596064     1.45   0.148     .9722008    1.206307
                              |
                          imd |
                           4  |   .9858184   .0497476    -0.28   0.777     .8929816    1.088307
             5 most deprived  |   1.046648   .0680693     0.70   0.483     .9213876    1.188938
                              |
                tot_adults_hh |
                           2  |   .6478723   .2662984    -1.06   0.291      .289478    1.449984
                           3  |    1.10867   .3570723     0.32   0.749     .5897302    2.084256
                              |
                    ethnicity |
      Asian or Asian British  |    1.10486   .0694813     1.59   0.113     .9767374    1.249789
                       Other  |   .9136662   .0619876    -1.33   0.183      .799904    1.043608
                              |
           1.htdiag_or_highbp |   1.269682   .1030705     2.94   0.003     1.082919    1.488654
1.chronic_respiratory_disease |   1.002723   .0474028     0.06   0.954     .9139891    1.100071
                     1.asthma |   .9942365   .0713557    -0.08   0.936     .8637728    1.144405
    1.chronic_cardiac_disease |    1.02847   .0503743     0.57   0.567     .9343291    1.132096
                              |
                      diabcat |
            T1DM, controlled  |   .9652734   .1161198    -0.29   0.769     .7625232    1.221934
          T1DM, uncontrolled  |   1.160849   .2515274     0.69   0.491     .7591744    1.775049
            T2DM, controlled  |   .9809674   .0518122    -0.36   0.716     .8844968     1.08796
          T2DM, uncontrolled  |   .8393394   .0971337    -1.51   0.130     .6690077    1.053038
          Diabetes, no HbA1c  |    4.12576   .5981319     9.78   0.000     3.105282    5.481594
                              |
            cancer_exhaem_cat |
                   Last year  |   .7501807   .2714603    -0.79   0.427     .3691052     1.52469
               2-5 years ago  |   .8663211   .1316989    -0.94   0.345        .6431    1.167023
                    5+ years  |   .9449813   .0491137    -1.09   0.276     .8534608    1.046316
                              |
              cancer_haem_cat |
                   Last year  |   .4910251   .2416867    -1.45   0.148     .1871264    1.288464
               2-5 years ago  |   1.067528   .1616565     0.43   0.666     .7933801    1.436406
                    5+ years  |    1.06095   .0524834     1.20   0.232      .962914    1.168967
                              |
      1.chronic_liver_disease |   1.087011   .0520698     1.74   0.082     .9896005     1.19401
            1.stroke_dementia |   .9463888   .0469241    -1.11   0.266     .8587467    1.042976
                1.other_neuro |   .9830027   .0478537    -0.35   0.725     .8935466    1.081415
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   .7422874    .221439    -1.00   0.318     .4136584    1.331994
                       1.esrd |    1.00592   .0410826     0.14   0.885     .9285376    1.089751
           1.other_transplant |   1.032498   .0511088     0.65   0.518     .9370322    1.137689
                   1.asplenia |   1.008058    .050533     0.16   0.873     .9137257     1.11213
           1.ra_sle_psoriasis |   .9930956   .0460294    -0.15   0.881     .9068561    1.087536
               1.other_immuno |   1.057516   .0494077     1.20   0.231     .9649805    1.158926
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_0_timeperiod1.ster not foun
> d)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_0_timeperiod1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.02684         2.18        1         0.1396
      2.kids_cat4 |      0.01669         0.92        1         0.3374
      3.kids_cat4 |     -0.02789         2.33        1         0.1268
      age1        |      0.02164         1.46        1         0.2275
      age2        |     -0.01673         0.85        1         0.3564
      age3        |      0.01267         0.48        1         0.4870
      0b.male     |            .            .        1             .
      1.male      |      0.02483         1.80        1         0.1798
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.03316         2.82        1         0.0933
      3.obese4cat |     -0.01143         0.37        1         0.5436
      4.obese4cat |     -0.02577         1.97        1         0.1607
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.04635         5.33        1         0.0209
      3.smoke_no~s|      0.08313        18.81        1         0.0000
      1b.imd      |            .            .        1             .
      4.imd       |      0.01269         0.48        1         0.4898
      5.imd       |      0.03176         3.10        1         0.0782
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.02112         1.13        1         0.2881
      3.tot_adul~h|      0.00216         0.01        1         0.9115
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.02975         2.46        1         0.1169
      5.ethnicity |     -0.02049         1.17        1         0.2786
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.01716         0.91        1         0.3390
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.03279         3.08        1         0.0794
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.00801         0.18        1         0.6677
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.01470         0.64        1         0.4239
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.00011         0.00        1         0.9956
      3.diabcat   |      0.02023         1.09        1         0.2974
      4.diabcat   |     -0.03674         3.78        1         0.0517
      5.diabcat   |      0.01657         0.80        1         0.3698
      6.diabcat   |      0.02915         0.56        1         0.4548
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.01841         1.04        1         0.3085
      3.cancer_e~t|     -0.00874         0.21        1         0.6455
      4.cancer_e~t|     -0.03156         2.72        1         0.0990
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.01913         1.00        1         0.3166
      3.cancer_h~t|      0.03396         3.15        1         0.0761
      4.cancer_h~t|      0.01089         0.32        1         0.5716
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.02262         1.55        1         0.2134
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.00258         0.02        1         0.8890
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.02400         1.61        1         0.2041
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.00463         0.05        1         0.8157
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.03062         2.77        1         0.0961
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00105         0.00        1         0.9541
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.01782         1.00        1         0.3175
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.02844         2.17        1         0.1408
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.01594         0.70        1         0.4016
      ------------+---------------------------------------------------
      global test |                     68.61       42         0.0059
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:     39.24 /        1 =      39.2390
   1:      4.40 /        1 =       4.4000

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          959             Number of obs    =         959
No. of failures      =          270
Time at risk         =        46309
                                                Wald chi2(41)    =     7373.01
Log pseudolikelihood =   -1126.1342             Prob > chi2      =      0.0000

                                          (Std. Err. adjusted for 185 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              2 children <12  |   .9340059   .1634614    -0.39   0.696     .6627959    1.316192
              3 children <12  |   .8840933   .1742131    -0.63   0.532     .6008505    1.300858
             4+ children <12  |   .8825773   .1467221    -0.75   0.452     .6371573    1.222528
                              |
                         age1 |   .9686063   .0248352    -1.24   0.213     .9211332    1.018526
                         age2 |   1.112938   .0889395     1.34   0.181     .9515862     1.30165
                         age3 |   .7413676   .1645093    -1.35   0.177     .4799016    1.145289
                       1.male |   .8899187   .1051838    -0.99   0.324     .7058992     1.12191
                              |
                    obese4cat |
           Obese I (30-34.9)  |   .8933569   .1682688    -0.60   0.549     .6175846    1.292271
          Obese II (35-39.9)  |   .8911145   .2093734    -0.49   0.624      .562261    1.412307
             Obese III (40+)  |   1.047575   .3253869     0.15   0.881     .5698939    1.925647
                              |
                 smoke_nomiss |
                      Former  |   1.469411   .5289249     1.07   0.285     .7256838    2.975359
                     Current  |   .8882992   .1459196    -0.72   0.471     .6437743    1.225702
                              |
                          imd |
                           4  |   .9917083   .1786345    -0.05   0.963     .6967206    1.411592
             5 most deprived  |   1.242095   .2533333     1.06   0.288      .832812     1.85252
                              |
                tot_adults_hh |
                           2  |   .8740989    .933898    -0.13   0.900     .1076779    7.095692
                           3  |   1.189091   1.045107     0.20   0.844     .2123651    6.658044
                              |
                    ethnicity |
      Asian or Asian British  |   1.108967    .250476     0.46   0.647     .7122996    1.726532
                       Other  |   .8438524   .1726257    -0.83   0.407     .5651157    1.260073
                              |
           1.htdiag_or_highbp |   1.608412   .4123491     1.85   0.064     .9731383    2.658399
1.chronic_respiratory_disease |   1.044999   .1681381     0.27   0.784     .7623587    1.432427
                     1.asthma |    1.27273   .3119302     0.98   0.325     .7872584    2.057572
    1.chronic_cardiac_disease |   1.028749   .1509269     0.19   0.847     .7716681    1.371477
                              |
                      diabcat |
            T1DM, controlled  |   .5965282   .2403996    -1.28   0.200     .2707688    1.314206
          T1DM, uncontrolled  |    1.27678   .5828868     0.54   0.593     .5218172    3.124022
            T2DM, controlled  |   .7865219   .1870599    -1.01   0.313     .4934782    1.253585
          T2DM, uncontrolled  |   1.299288   .4655695     0.73   0.465     .6437207    2.622489
                              |
            cancer_exhaem_cat |
                   Last year  |   6.30e-16   3.61e-16   -61.08   0.000     2.05e-16    1.94e-15
               2-5 years ago  |   1.004403   .3861411     0.01   0.991     .4727863    2.133787
                    5+ years  |   .9624624   .1505305    -0.24   0.807      .708361    1.307714
                              |
              cancer_haem_cat |
                   Last year  |   9.38e-16   1.04e-15   -31.11   0.000     1.06e-16    8.30e-15
               2-5 years ago  |    1.37466   .7056891     0.62   0.535     .5026049    3.759795
                    5+ years  |   .9766642   .1689401    -0.14   0.891     .6958366    1.370829
                              |
      1.chronic_liver_disease |   1.042702   .1589947     0.27   0.784     .7733324      1.4059
            1.stroke_dementia |   .9578576   .1413448    -0.29   0.770     .7172899    1.279108
                1.other_neuro |   .9413527   .1423256    -0.40   0.689     .6999337    1.266041
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.936137   1.256482     1.02   0.309     .5426721    6.907722
                       1.esrd |    .961048   .1321489    -0.29   0.773     .7340077    1.258315
           1.other_transplant |   1.271105   .1715533     1.78   0.075     .9756635     1.65601
                   1.asplenia |   .9555182    .159739    -0.27   0.785     .6885558    1.325986
           1.ra_sle_psoriasis |   1.171426   .1766702     1.05   0.294     .8716451    1.574309
               1.other_immuno |   1.059431   .1558955     0.39   0.695      .793996    1.413602
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_0_timeperiod1.ster not
>  found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_0_timeperiod1.ster saved
(13,844 observations (episodes) created)
(cat_time: 13844 changes made)
(covidadmission: 13844 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,007       53.62       53.62
          1 |      9,581       32.10       85.72
          2 |      4,263       14.28      100.00
------------+-----------------------------------
      Total |     29,851      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
Observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,759      3,248 |    16,007 
         1 |     6,907      2,674 |     9,581 
         2 |     3,032      1,231 |     4,263 
-----------+----------------------+----------
     Total |    22,698      7,153 |    29,851 
(25,588 observations deleted)
   1:      8.89 /        1 =       8.8910

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,263             Number of obs    =       4,263
No. of failures      =        1,231
Time at risk         =       144133
                                                Wald chi2(41)    =       49.45
Log pseudolikelihood =   -6977.2395             Prob > chi2      =      0.1715

                                          (Std. Err. adjusted for 902 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat4 |
              only <12 years  |   1.410061   .3323173     1.46   0.145     .8884447    2.237925
                  only 12-18  |   1.761659   .5294437     1.88   0.060      .977472    3.174968
                       mixed  |    1.40576   .3162344     1.51   0.130     .9045405    2.184712
                              |
                         age1 |   1.001965    .010621     0.19   0.853     .9813629       1.023
                         age2 |   .9937658   .0338201    -0.18   0.854      .929642    1.062313
                         age3 |   1.004563   .0985143     0.05   0.963     .8289004    1.217452
                       1.male |   .9779223   .0566654    -0.39   0.700     .8729346    1.095537
                              |
                    obese4cat |
           Obese I (30-34.9)  |    1.08058   .0918683     0.91   0.362     .9147237     1.27651
          Obese II (35-39.9)  |   1.037195   .1027549     0.37   0.712     .8541457    1.259474
             Obese III (40+)  |   1.067963   .1277302     0.55   0.582      .844794    1.350085
                              |
                 smoke_nomiss |
                      Former  |   1.249605   .2368677     1.18   0.240     .8618352    1.811847
                     Current  |   .9968196   .0849573    -0.04   0.970     .8434708    1.178048
                              |
                          imd |
                           4  |   1.043269   .0740559     0.60   0.551     .9077672    1.198998
             5 most deprived  |   .9952347   .0935498    -0.05   0.959     .8277791    1.196566
                              |
                tot_adults_hh |
                           2  |   1.302443   .8675607     0.40   0.692     .3529969    4.805586
                           3  |   1.622047   .9757328     0.80   0.421     .4989168    5.273497
                              |
                    ethnicity |
      Asian or Asian British  |   1.021636   .1046621     0.21   0.834     .8357849    1.248815
                       Other  |      1.158   .1063945     1.60   0.110     .9671684    1.386485
                              |
           1.htdiag_or_highbp |   1.022258    .111067     0.20   0.839     .8261871    1.264859
1.chronic_respiratory_disease |   .9486237    .067493    -0.74   0.459     .8251491    1.090575
                     1.asthma |   .8721938   .0971581    -1.23   0.220     .7011217    1.085007
    1.chronic_cardiac_disease |   1.021534   .0730112     0.30   0.766     .8880052    1.175141
                              |
                      diabcat |
            T1DM, controlled  |   1.419037   .2219417     2.24   0.025     1.044391    1.928077
          T1DM, uncontrolled  |   .9852046   .3616724    -0.04   0.968     .4797854    2.023046
            T2DM, controlled  |   .9936133   .0778242    -0.08   0.935     .8522118    1.158477
          T2DM, uncontrolled  |   1.124831   .1796462     0.74   0.461     .8225121    1.538269
                              |
            cancer_exhaem_cat |
                   Last year  |   .3260783   .2215144    -1.65   0.099     .0861145    1.234718
               2-5 years ago  |   .9585081   .1913724    -0.21   0.832     .6481087    1.417567
                    5+ years  |   .9613779   .0727957    -0.52   0.603     .8287833    1.115186
                              |
              cancer_haem_cat |
                   Last year  |   1.976107   .6271012     2.15   0.032     1.060934    3.680715
               2-5 years ago  |   .7402985   .1937729    -1.15   0.251     .4432055    1.236541
                    5+ years  |   1.053112   .0800071     0.68   0.496     .9074176      1.2222
                              |
      1.chronic_liver_disease |   .9232915   .0683638    -1.08   0.281     .7985698    1.067492
            1.stroke_dementia |   .9910357   .0708911    -0.13   0.900     .8613921    1.140191
                1.other_neuro |   1.052542   .0706244     0.76   0.445     .9228369    1.200478
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.303175   .3801873     0.91   0.364     .7356543    2.308509
                       1.esrd |   .9816328   .0611024    -0.30   0.766     .8688913    1.109003
           1.other_transplant |   .8866469    .060828    -1.75   0.079      .775094    1.014255
                   1.asplenia |   1.034779   .0790336     0.45   0.654     .8909128    1.201877
           1.ra_sle_psoriasis |   1.098985   .0754986     1.37   0.169     .9605399    1.257384
               1.other_immuno |   .9792984   .0664974    -0.31   0.758     .8572664    1.118702
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_0_timeperiod2.ster not foun
> d)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_0_timeperiod2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.06801         5.66        1         0.0174
      2.kids_cat4 |     -0.03915         2.22        1         0.1362
      3.kids_cat4 |     -0.06747         5.67        1         0.0173
      age1        |     -0.00085         0.00        1         0.9753
      age2        |      0.00108         0.00        1         0.9678
      age3        |      0.00062         0.00        1         0.9816
      0b.male     |            .            .        1             .
      1.male      |     -0.03398         1.61        1         0.2040
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.03896         2.32        1         0.1275
      3.obese4cat |     -0.00284         0.01        1         0.9203
      4.obese4cat |      0.00214         0.01        1         0.9383
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.03093         1.25        1         0.2632
      3.smoke_no~s|      0.03025         1.15        1         0.2828
      1b.imd      |            .            .        1             .
      4.imd       |      0.02171         0.61        1         0.4339
      5.imd       |      0.04600         2.68        1         0.1017
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.00475         0.03        1         0.8650
      3.tot_adul~h|      0.00616         0.05        1         0.8208
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.00739         0.08        1         0.7742
      5.ethnicity |      0.04590         2.88        1         0.0898
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.03990         2.33        1         0.1266
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.03288         1.51        1         0.2186
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.01752         0.41        1         0.5198
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00398         0.02        1         0.8822
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.02072         0.57        1         0.4518
      3.diabcat   |      0.00999         0.12        1         0.7243
      4.diabcat   |      0.01162         0.19        1         0.6646
      5.diabcat   |     -0.00938         0.13        1         0.7137
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.03684         1.74        1         0.1871
      3.cancer_e~t|     -0.02591         0.83        1         0.3628
      4.cancer_e~t|     -0.02842         1.07        1         0.3018
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.00099         0.00        1         0.9720
      3.cancer_h~t|      0.02688         1.01        1         0.3142
      4.cancer_h~t|      0.03929         2.19        1         0.1389
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.03603         1.80        1         0.1797
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.01738         0.41        1         0.5235
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00604         0.04        1         0.8371
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.05455         3.33        1         0.0680
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.03563         1.94        1         0.1638
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.06816         5.93        1         0.0149
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.09353        13.21        1         0.0003
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.05153         3.41        1         0.0649
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.04117         2.13        1         0.1441
      ------------+---------------------------------------------------
      global test |                     58.24       41         0.0393
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:     14.38 /        1 =      14.3800
   1:      3.70 /        1 =       3.7000

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          414             Number of obs    =         414
No. of failures      =          120
Time at risk         =        13893
                                                Wald chi2(40)    =    11559.57
Log pseudolikelihood =   -386.91332             Prob > chi2      =      0.0000

                                          (Std. Err. adjusted for 145 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              2 children <12  |   1.147551    .342782     0.46   0.645     .6390158    2.060783
              3 children <12  |   1.249352   .3974027     0.70   0.484     .6697748    2.330457
             4+ children <12  |   1.064301   .2579069     0.26   0.797     .6619069    1.711323
                              |
                         age1 |   1.023516   .0389318     0.61   0.541     .9499861    1.102737
                         age2 |    .941933   .1160947    -0.49   0.627     .7397894    1.199311
                         age3 |   1.137071   .4037558     0.36   0.718     .5669429    2.280529
                       1.male |   .7697041   .1644521    -1.23   0.221     .5063599    1.170007
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.289372   .3750332     0.87   0.382     .7291105    2.280148
          Obese II (35-39.9)  |   1.790383   .6271392     1.66   0.096     .9011255    3.557187
             Obese III (40+)  |    1.22986   .4376059     0.58   0.561     .6123269    2.470178
                              |
                 smoke_nomiss |
                      Former  |   .5866623   .2495274    -1.25   0.210     .2548844    1.350309
                     Current  |   1.018601   .3428122     0.05   0.956       .52666    1.970052
                              |
                          imd |
                           4  |   .6838252   .1953391    -1.33   0.183     .3906554    1.197006
             5 most deprived  |   .6997791   .2705003    -0.92   0.356      .328041    1.492773
                              |
                tot_adults_hh |
                           2  |   3.87e+08          .        .       .            .           .
                           3  |   2.09e+08   1.40e+08    28.60   0.000     5.61e+07    7.75e+08
                              |
                    ethnicity |
      Asian or Asian British  |   1.177228   .4211054     0.46   0.648     .5839529    2.373249
                       Other  |   1.406784   .4703008     1.02   0.307     .7305716    2.708893
                              |
           1.htdiag_or_highbp |    .682034    .238102    -1.10   0.273     .3440699    1.351965
1.chronic_respiratory_disease |   1.176759   .2795347     0.69   0.493     .7387338    1.874508
                     1.asthma |     1.2496   .5208708     0.53   0.593     .5520322    2.828638
    1.chronic_cardiac_disease |   .8391128   .2497739    -0.59   0.556      .468218    1.503809
                              |
                      diabcat |
            T1DM, controlled  |   1.661064   .8952368     0.94   0.346     .5776011    4.776884
          T1DM, uncontrolled  |   2.54e-16   2.86e-16   -31.82   0.000     2.78e-17    2.32e-15
            T2DM, controlled  |   .8703002   .2718845    -0.44   0.657     .4717925    1.605414
          T2DM, uncontrolled  |   .2202622   .1930601    -1.73   0.084      .039524    1.227494
                              |
            cancer_exhaem_cat |
                   Last year  |   1.28e-16   1.19e-16   -39.43   0.000     2.08e-17    7.92e-16
               2-5 years ago  |   1.318086   .6904489     0.53   0.598     .4721296    3.679815
                    5+ years  |    .775144   .2318066    -0.85   0.394     .4313511    1.392945
                              |
              cancer_haem_cat |
                   Last year  |    1.98008   1.139801     1.19   0.235     .6407701    6.118754
               2-5 years ago  |   2.32e-16   1.67e-16   -49.89   0.000     5.64e-17    9.54e-16
                    5+ years  |    1.37789   .3706881     1.19   0.233     .8132412    2.334586
                              |
      1.chronic_liver_disease |   .8011335   .2216242    -0.80   0.423     .4658327     1.37778
            1.stroke_dementia |    .927098   .2403432    -0.29   0.770     .5577738    1.540967
                1.other_neuro |   .6515061   .1863728    -1.50   0.134     .3718946    1.141345
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   12.82008   8.644249     3.78   0.000      3.41938    48.06556
                       1.esrd |   1.479863   .2817602     2.06   0.040     1.018957     2.14925
           1.other_transplant |   1.226445   .2857169     0.88   0.381      .776872    1.936186
                   1.asplenia |   .9429553   .2950239    -0.19   0.851       .51071    1.741037
           1.ra_sle_psoriasis |   1.153509   .2855121     0.58   0.564     .7101248     1.87373
               1.other_immuno |   .7574423     .23406    -0.90   0.369     .4133487    1.387978
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_0_timeperiod2.ster not
>  found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_0_timeperiod2.ster saved
(13,844 observations (episodes) created)
(cat_time: 13844 changes made)
(covidadmission: 13844 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,007       53.62       53.62
          1 |      9,581       32.10       85.72
          2 |      4,263       14.28      100.00
------------+-----------------------------------
      Total |     29,851      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
Observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,759      3,248 |    16,007 
         1 |     6,907      2,674 |     9,581 
         2 |     3,032      1,231 |     4,263 
-----------+----------------------+----------
     Total |    22,698      7,153 |    29,851 
(29,851 observations deleted)
   1:      0.08 /        1 =       0.0800
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covidadmission)
   1:      0.06 /        1 =       0.0620
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covidadmission)
(3,913 observations (episodes) created)
(cat_time: 3913 changes made)
(covidadmission: 3913 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       54.06       54.06
          1 |      2,726       32.00       86.06
          2 |      1,187       13.94      100.00
------------+-----------------------------------
      Total |      8,518      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
Observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,626        979 |     4,605 
         1 |     1,956        770 |     2,726 
         2 |       834        353 |     1,187 
-----------+----------------------+----------
     Total |     6,416      2,102 |     8,518 
(3,913 observations deleted)
   1:      9.35 /        1 =       9.3500

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,605             Number of obs    =       4,605
No. of failures      =          979
Time at risk         =       300426
                                                Wald chi2(42)    =       27.90
Log pseudolikelihood =   -5770.0295             Prob > chi2      =      0.9535

                                          (Std. Err. adjusted for 928 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat4 |
              only <12 years  |   1.068637   .2699575     0.26   0.793     .6513296    1.753313
                  only 12-18  |   1.607534   .5088336     1.50   0.134     .8644281    2.989451
                       mixed  |   1.133295   .2735862     0.52   0.604     .7060836    1.818987
                              |
                         age1 |    .982313   .0287481    -0.61   0.542     .9275533    1.040305
                         age2 |   1.060288   .1660962     0.37   0.709     .7799761    1.441339
                         age3 |   .9047323   .2802265    -0.32   0.747     .4930306    1.660222
                       1.male |   .9637034   .0625402    -0.57   0.569     .8486021    1.094417
                              |
                    obese4cat |
           Obese I (30-34.9)  |   .9412714   .0924795    -0.62   0.538     .7763986    1.141156
          Obese II (35-39.9)  |   1.020279   .1153366     0.18   0.859     .8175146    1.273334
             Obese III (40+)  |   1.020258    .135682     0.15   0.880     .7861592    1.324066
                              |
                 smoke_nomiss |
                      Former  |    .862833   .1862663    -0.68   0.494       .56516    1.317292
                     Current  |   .8696079   .0915136    -1.33   0.184     .7075333    1.068809
                              |
                          imd |
                           4  |    .997136   .0816548    -0.04   0.972     .8492783    1.170735
             5 most deprived  |   .9020911   .1047155    -0.89   0.375     .7185255    1.132553
                              |
                tot_adults_hh |
                           2  |     .83295   .4257564    -0.36   0.721     .3058676    2.268321
                           3  |   .6488776   .2855313    -0.98   0.326     .2739057    1.537179
                              |
                    ethnicity |
      Asian or Asian British  |   .9987589   .1056724    -0.01   0.991      .811709    1.228913
                       Other  |   1.077632   .1069196     0.75   0.451     .8871897    1.308953
                              |
           1.htdiag_or_highbp |   .8864862   .0992081    -1.08   0.282     .7118896    1.103904
1.chronic_respiratory_disease |   1.047244    .082415     0.59   0.557     .8975544    1.221898
                     1.asthma |   .8538071   .1087415    -1.24   0.215     .6651968    1.095896
    1.chronic_cardiac_disease |   .9634735    .080303    -0.45   0.655     .8182656     1.13445
                              |
                      diabcat |
            T1DM, controlled  |   .6841812   .1782855    -1.46   0.145     .4105472    1.140195
          T1DM, uncontrolled  |    .831694   .3352513    -0.46   0.648     .3774409    1.832644
            T2DM, controlled  |   1.067944   .0952065     0.74   0.461     .8967355     1.27184
          T2DM, uncontrolled  |   1.206362   .2018724     1.12   0.262     .8690357    1.674625
          Diabetes, no HbA1c  |   1.081888   1.100548     0.08   0.938     .1473328    7.944468
                              |
            cancer_exhaem_cat |
                   Last year  |   .8932952   .4507503    -0.22   0.823     .3322652    2.401625
               2-5 years ago  |   1.100392   .2398384     0.44   0.661     .7178305    1.686837
                    5+ years  |   .9013208   .0771829    -1.21   0.225     .7620586    1.066033
                              |
              cancer_haem_cat |
                   Last year  |   1.620176   .5528868     1.41   0.157     .8300205    3.162537
               2-5 years ago  |   1.202867   .2679854     0.83   0.407     .7772835    1.861469
                    5+ years  |   .9363641    .085139    -0.72   0.470     .7835183    1.119026
                              |
      1.chronic_liver_disease |   1.020702   .0830283     0.25   0.801     .8702794    1.197125
            1.stroke_dementia |   1.088386   .0856734     1.08   0.282     .9327815    1.269949
                1.other_neuro |   1.135245   .0866365     1.66   0.096     .9775301    1.318407
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   .8876329   .1471973    -0.72   0.472     .6413241     1.22854
                       1.esrd |   1.013199   .0682139     0.19   0.846     .8879476    1.156118
           1.other_transplant |   1.075738   .0829156     0.95   0.344     .9249067    1.251168
                   1.asplenia |   .9673412   .0779836    -0.41   0.680     .8259596    1.132923
           1.ra_sle_psoriasis |   .9324528   .0753883    -0.87   0.387     .7958068    1.092562
               1.other_immuno |   1.011172   .0819873     0.14   0.891     .8625979    1.185336
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_1_timeperiod0.ster not foun
> d)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_1_timeperiod0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.01632         0.34        1         0.5604
      2.kids_cat4 |     -0.01603         0.33        1         0.5671
      3.kids_cat4 |     -0.01691         0.37        1         0.5424
      age1        |     -0.07855         7.47        1         0.0063
      age2        |      0.08079         8.01        1         0.0047
      age3        |     -0.08177         8.15        1         0.0043
      0b.male     |            .            .        1             .
      1.male      |     -0.03987         1.70        1         0.1925
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01400         0.22        1         0.6367
      3.obese4cat |     -0.00836         0.08        1         0.7802
      4.obese4cat |     -0.04166         1.91        1         0.1672
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.04832         2.35        1         0.1250
      3.smoke_no~s|     -0.00849         0.08        1         0.7753
      1b.imd      |            .            .        1             .
      4.imd       |     -0.04949         2.80        1         0.0940
      5.imd       |     -0.00130         0.00        1         0.9650
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.03052         1.04        1         0.3074
      3.tot_adul~h|      0.03510         1.43        1         0.2315
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.00462         0.02        1         0.8760
      5.ethnicity |     -0.02245         0.55        1         0.4582
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.03892         1.63        1         0.2015
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.02377         0.61        1         0.4366
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.04107         1.89        1         0.1693
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.05264         3.12        1         0.0771
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01400         0.22        1         0.6366
      3.diabcat   |      0.03327         1.14        1         0.2854
      4.diabcat   |      0.02525         0.81        1         0.3671
      5.diabcat   |     -0.02804         0.93        1         0.3351
      6.diabcat   |     -0.00563         0.04        1         0.8512
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.00029         0.00        1         0.9926
      3.cancer_e~t|      0.01676         0.29        1         0.5887
      4.cancer_e~t|     -0.03005         1.06        1         0.3034
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.04033         1.79        1         0.1815
      3.cancer_h~t|      0.01094         0.13        1         0.7196
      4.cancer_h~t|     -0.05230         3.32        1         0.0683
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.04845         2.69        1         0.1011
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.01800         0.35        1         0.5568
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.01772         0.32        1         0.5692
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.05404         3.06        1         0.0803
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.03015         0.99        1         0.3206
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.01278         0.17        1         0.6785
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.02221         0.53        1         0.4675
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.01699         0.30        1         0.5808
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00613         0.04        1         0.8366
      ------------+---------------------------------------------------
      global test |                     41.06       42         0.5121
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:     16.66 /        1 =      16.6610
   1:      4.02 /        1 =       4.0240

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          455             Number of obs    =         455
No. of failures      =           92
Time at risk         =        29767
                                                Wald chi2(41)    =    13540.27
Log pseudolikelihood =   -317.37083             Prob > chi2      =      0.0000

                                          (Std. Err. adjusted for 152 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              2 children <12  |   .5552799   .1908267    -1.71   0.087     .2831322    1.089017
              3 children <12  |   .9219322   .2983921    -0.25   0.802      .488877    1.738595
             4+ children <12  |   .7363266   .1935334    -1.16   0.244     .4398897    1.232529
                              |
                         age1 |   1.089267   .1038567     0.90   0.370     .9035996    1.313084
                         age2 |   .5586756    .304886    -1.07   0.286      .191705    1.628118
                         age3 |   3.241096   3.568567     1.07   0.286     .3745305    28.04765
                       1.male |   1.396051   .3404701     1.37   0.171     .8655849     2.25161
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.536887     .47292     1.40   0.163     .8408459    2.809103
          Obese II (35-39.9)  |    .891283   .3364509    -0.30   0.760     .4252998    1.867825
             Obese III (40+)  |   .6477047   .3458803    -0.81   0.416     .2274194    1.844704
                              |
                 smoke_nomiss |
                      Former  |    .685857   .5601923    -0.46   0.644      .138354    3.399974
                     Current  |   1.065357   .4423274     0.15   0.879     .4721537    2.403848
                              |
                          imd |
                           4  |   1.236259   .3761101     0.70   0.486     .6809987    2.244257
             5 most deprived  |   1.366304   .4705308     0.91   0.365     .6956788    2.683404
                              |
                tot_adults_hh |
                           2  |   2.65e+08          .        .       .            .           .
                           3  |   1.09e+08   6.82e+07    29.46   0.000     3.17e+07    3.72e+08
                              |
                    ethnicity |
      Asian or Asian British  |   .5771467   .2628661    -1.21   0.227      .236374      1.4092
                       Other  |   .4161361   .2132858    -1.71   0.087     .1523918    1.136342
                              |
           1.htdiag_or_highbp |   .5770837   .2639999    -1.20   0.229     .2354169    1.414621
1.chronic_respiratory_disease |   1.194445    .330711     0.64   0.521      .694209    2.055142
                     1.asthma |   1.225215    .581322     0.43   0.669     .4834448    3.105117
    1.chronic_cardiac_disease |   .6851199   .2476335    -1.05   0.295     .3373677    1.391328
                              |
                      diabcat |
            T1DM, controlled  |   .4659789   .5524261    -0.64   0.519     .0456302    4.758615
          T1DM, uncontrolled  |   1.08e-16   9.68e-17   -41.18   0.000     1.89e-17    6.24e-16
            T2DM, controlled  |   .5696121   .1953964    -1.64   0.101     .2907957    1.115759
          T2DM, uncontrolled  |   .8888593   .5047523    -0.21   0.836     .2920554    2.705209
          Diabetes, no HbA1c  |   1.06e-16   1.01e-16   -38.48   0.000     1.63e-17    6.91e-16
                              |
            cancer_exhaem_cat |
                   Last year  |   1.305429   1.014462     0.34   0.732     .2846269     5.98729
               2-5 years ago  |   1.207956   .8317746     0.27   0.784     .3132786    4.657702
                    5+ years  |   .6250395   .1946666    -1.51   0.131     .3394715    1.150831
                              |
              cancer_haem_cat |
                   Last year  |   4.590325    3.34801     2.09   0.037     1.099029    19.17246
               2-5 years ago  |   .5723654   .4761691    -0.67   0.502     .1120809    2.922908
                    5+ years  |   .9388441     .30369    -0.20   0.845     .4980277    1.769838
                              |
      1.chronic_liver_disease |   1.148405   .2928596     0.54   0.587      .696669    1.893056
            1.stroke_dementia |   .9320148   .2721313    -0.24   0.809     .5258811    1.651802
                1.other_neuro |   1.119951   .3346861     0.38   0.705     .6234848    2.011741
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   1.682124   .8769902     1.00   0.319     .6054479     4.67347
                       1.esrd |   1.068116    .213347     0.33   0.741     .7221011    1.579932
           1.other_transplant |    .743281    .210836    -1.05   0.296     .4262896    1.295989
                   1.asplenia |   1.137635   .3342077     0.44   0.661     .6396498    2.023317
           1.ra_sle_psoriasis |   .9209876   .2635591    -0.29   0.774     .5256121    1.613772
               1.other_immuno |   1.127338   .3516409     0.38   0.701      .611711    2.077601
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_1_timeperiod0.ster not
>  found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_1_timeperiod0.ster saved
(3,913 observations (episodes) created)
(cat_time: 3913 changes made)
(covidadmission: 3913 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       54.06       54.06
          1 |      2,726       32.00       86.06
          2 |      1,187       13.94      100.00
------------+-----------------------------------
      Total |      8,518      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
Observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,626        979 |     4,605 
         1 |     1,956        770 |     2,726 
         2 |       834        353 |     1,187 
-----------+----------------------+----------
     Total |     6,416      2,102 |     8,518 
(5,792 observations deleted)
   1:     18.78 /        1 =      18.7830

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,726             Number of obs    =       2,726
No. of failures      =          770
Time at risk         =       132595
                                                Wald chi2(41)    =       48.80
Log pseudolikelihood =   -4023.8681             Prob > chi2      =      0.1882

                                          (Std. Err. adjusted for 804 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat4 |
              only <12 years  |   1.855706   .5245201     2.19   0.029     1.066387    3.229263
                  only 12-18  |   2.085687   .7725899     1.98   0.047      1.00912    4.310773
                       mixed  |   2.026154   .5339818     2.68   0.007     1.208768    3.396268
                              |
                         age1 |   1.065865   .0323758     2.10   0.036     1.004261    1.131247
                         age2 |   .7145193   .1126757    -2.13   0.033     .5245468    .9732932
                         age3 |   1.909796   .5936302     2.08   0.037     1.038495    3.512123
                       1.male |   1.015405   .0745575     0.21   0.835     .8793028    1.172573
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.064623   .1074105     0.62   0.535     .8736098    1.297401
          Obese II (35-39.9)  |   .8736747   .1149257    -1.03   0.305     .6751188    1.130627
             Obese III (40+)  |   .9944109   .1477537    -0.04   0.970     .7431745     1.33058
                              |
                 smoke_nomiss |
                      Former  |   1.222111   .2775934     0.88   0.377     .7830084    1.907457
                     Current  |   1.143172   .1224255     1.25   0.212      .926732    1.410163
                              |
                          imd |
                           4  |   1.157737   .1021755     1.66   0.097       .97384    1.376361
             5 most deprived  |   .8591206   .1158664    -1.13   0.260     .6595621    1.119058
                              |
                tot_adults_hh |
                           2  |   .5929546   .4774215    -0.65   0.516     .1223688    2.873242
                           3  |   .8330468   .5150281    -0.30   0.768     .2479804    2.798476
                              |
                    ethnicity |
      Asian or Asian British  |   .9252182   .1104681    -0.65   0.515     .7321725    1.169163
                       Other  |   .8809261   .1050915    -1.06   0.288     .6972588    1.112974
                              |
           1.htdiag_or_highbp |   1.299835   .1957804     1.74   0.082     .9675661    1.746207
1.chronic_respiratory_disease |   1.094751    .100281     0.99   0.323     .9148369    1.310046
                     1.asthma |   .9908546   .1291604    -0.07   0.944     .7674562    1.279282
    1.chronic_cardiac_disease |   .9805149   .0872166    -0.22   0.825     .8236448    1.167262
                              |
                      diabcat |
            T1DM, controlled  |   1.028119    .279655     0.10   0.919     .6032691    1.752168
          T1DM, uncontrolled  |   1.366495   .4389253     0.97   0.331     .7281111    2.564593
            T2DM, controlled  |   .9103041   .0898202    -0.95   0.341     .7502361    1.104524
          T2DM, uncontrolled  |   1.362814   .2400119     1.76   0.079         .965    1.924624
          Diabetes, no HbA1c  |   7.51e-20          .        .       .            .           .
                              |
            cancer_exhaem_cat |
                   Last year  |   .7148971   .4619404    -0.52   0.603     .2014782     2.53664
               2-5 years ago  |   1.496636   .3838114     1.57   0.116     .9053695    2.474037
                    5+ years  |   1.083016   .0991969     0.87   0.384     .9050461    1.295983
                              |
              cancer_haem_cat |
                   Last year  |   1.538682   .6915919     0.96   0.338      .637616    3.713118
               2-5 years ago  |   .8495385   .2646081    -0.52   0.601     .4613781    1.564261
                    5+ years  |   1.181125   .1057068     1.86   0.063     .9910971    1.407588
                              |
      1.chronic_liver_disease |   1.190458   .1085383     1.91   0.056     .9956507    1.423381
            1.stroke_dementia |   .9060987   .0876843    -1.02   0.308     .7495553    1.095336
                1.other_neuro |   1.062338    .098686     0.65   0.515     .8855034    1.274486
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |     1.0336   .1816974     0.19   0.851     .7323511    1.458767
                       1.esrd |   1.001764   .0758555     0.02   0.981     .8635965    1.162037
           1.other_transplant |   1.025446   .0926621     0.28   0.781     .8590055    1.224136
                   1.asplenia |   1.083476   .0991719     0.88   0.381     .9055406    1.296376
           1.ra_sle_psoriasis |   1.164176   .1033029     1.71   0.087     .9783348    1.385319
               1.other_immuno |   .9453965   .0881366    -0.60   0.547     .7875152     1.13493
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_1_timeperiod1.ster not foun
> d)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_1_timeperiod1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.05120         1.62        1         0.2034
      2.kids_cat4 |      0.07070         3.32        1         0.0685
      3.kids_cat4 |      0.03839         0.82        1         0.3666
      age1        |     -0.05732         2.41        1         0.1208
      age2        |      0.05085         1.88        1         0.1704
      age3        |     -0.04804         1.67        1         0.1969
      0b.male     |            .            .        1             .
      1.male      |     -0.02716         0.65        1         0.4205
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01966         0.32        1         0.5735
      3.obese4cat |      0.00247         0.01        1         0.9432
      4.obese4cat |     -0.03036         0.79        1         0.3729
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.03439         1.10        1         0.2937
      3.smoke_no~s|     -0.04548         1.72        1         0.1900
      1b.imd      |            .            .        1             .
      4.imd       |      0.01452         0.20        1         0.6551
      5.imd       |      0.02536         0.62        1         0.4293
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.00728         0.05        1         0.8312
      3.tot_adul~h|     -0.01037         0.09        1         0.7582
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.00459         0.02        1         0.8944
      5.ethnicity |      0.03244         0.89        1         0.3458
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.02156         0.40        1         0.5255
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01440         0.18        1         0.6676
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.00612         0.03        1         0.8570
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.01145         0.11        1         0.7387
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.03837         1.36        1         0.2427
      3.diabcat   |      0.03921         1.23        1         0.2672
      4.diabcat   |     -0.04538         1.88        1         0.1700
      5.diabcat   |      0.00081         0.00        1         0.9811
      6.diabcat   |            .            .        1             .
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.05170         2.83        1         0.0927
      3.cancer_e~t|     -0.05811         3.35        1         0.0671
      4.cancer_e~t|      0.04574         1.78        1         0.1827
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.00890         0.07        1         0.7960
      3.cancer_h~t|     -0.00348         0.01        1         0.9204
      4.cancer_h~t|      0.09663         7.80        1         0.0052
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.02618         0.61        1         0.4360
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.03175         0.92        1         0.3371
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00813         0.06        1         0.8027
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.03147         0.85        1         0.3574
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.04507         1.75        1         0.1864
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.04702         1.93        1         0.1644
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.02423         0.53        1         0.4677
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.07020         4.54        1         0.0332
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.03047         0.87        1         0.3511
      ------------+---------------------------------------------------
      global test |                     42.57       41         0.4033
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:     10.68 /        1 =      10.6790
   1:      2.23 /        1 =       2.2300

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          271             Number of obs    =         271
No. of failures      =           69
Time at risk         =        12744
                                                Wald chi2(41)    =     8484.14
Log pseudolikelihood =   -171.08658             Prob > chi2      =      0.0000

                                          (Std. Err. adjusted for 124 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              2 children <12  |   .7952604   .5207687    -0.35   0.726     .2203475    2.870189
              3 children <12  |   2.101531   .9492826     1.64   0.100     .8670408    5.093685
             4+ children <12  |   1.238289   .4305147     0.61   0.539     .6264485    2.447701
                              |
                         age1 |   1.013911   .1313842     0.11   0.915     .7865018    1.307073
                         age2 |   1.238732   .9128628     0.29   0.771     .2922124     5.25117
                         age3 |   .5095366   .7538177    -0.46   0.649     .0280474    9.256747
                       1.male |   .5765407   .1996472    -1.59   0.112     .2924637    1.136549
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.010077   .4137313     0.02   0.980      .452584     2.25429
          Obese II (35-39.9)  |   .8142378    .404602    -0.41   0.679     .3074551    2.156358
             Obese III (40+)  |   .3373168   .2385813    -1.54   0.124     .0843316    1.349228
                              |
                 smoke_nomiss |
                      Former  |   4.004987   3.687491     1.51   0.132     .6589897    24.34017
                     Current  |   1.038987   .5342479     0.07   0.941     .3792466    2.846418
                              |
                          imd |
                           4  |   2.441947   .9943562     2.19   0.028     1.099332    5.424302
             5 most deprived  |   1.645191   .7967186     1.03   0.304     .6368015    4.250389
                              |
                tot_adults_hh |
                           2  |   1.80e+09          .        .       .            .           .
                           3  |   1.45e+09   1.54e+09    19.77   0.000     1.79e+08    1.17e+10
                              |
                    ethnicity |
      Asian or Asian British  |    .984707    .451025    -0.03   0.973     .4012652    2.416476
                       Other  |   1.289212   .6617068     0.49   0.621     .4714468    3.525461
                              |
           1.htdiag_or_highbp |   1.246457    .799321     0.34   0.731     .3546694    4.380575
1.chronic_respiratory_disease |   2.233535   .9088908     1.97   0.048     1.006037    4.958743
                     1.asthma |   1.472237   .5620723     1.01   0.311     .6966342    3.111361
    1.chronic_cardiac_disease |   2.458656   .8845606     2.50   0.012     1.214668     4.97666
                              |
                      diabcat |
            T1DM, controlled  |   3.305143     3.9114     1.01   0.312     .3249781    33.61448
          T1DM, uncontrolled  |    10.3965   8.751149     2.78   0.005     1.997087    54.12245
            T2DM, controlled  |    .622286   .2501636    -1.18   0.238     .2830092    1.368294
          T2DM, uncontrolled  |    1.14846   .5962647     0.27   0.790     .4151293    3.177226
          Diabetes, no HbA1c  |   4.69e-17   5.62e-17   -31.38   0.000     4.48e-18    4.91e-16
                              |
            cancer_exhaem_cat |
                   Last year  |   9.66e-17   1.32e-16   -27.08   0.000     6.69e-18    1.39e-15
               2-5 years ago  |   .3598708   .4256975    -0.86   0.388     .0354197    3.656351
                    5+ years  |   1.076383   .4341986     0.18   0.855     .4882067    2.373178
                              |
              cancer_haem_cat |
                   Last year  |   1.56e-17   2.12e-17   -28.47   0.000     1.08e-18    2.23e-16
               2-5 years ago  |   2.89e-17   4.42e-17   -24.88   0.000     1.44e-18    5.80e-16
                    5+ years  |   1.359252   .4865394     0.86   0.391     .6739309    2.741476
                              |
      1.chronic_liver_disease |    1.96616   .7351865     1.81   0.071     .9447953    4.091665
            1.stroke_dementia |   .7280113   .3257624    -0.71   0.478      .302867    1.749945
                1.other_neuro |   1.446105    .623024     0.86   0.392      .621552    3.364513
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   .7327814   .4121413    -0.55   0.580     .2433491    2.206578
                       1.esrd |   .5749188   .1678585    -1.90   0.058     .3244008    1.018899
           1.other_transplant |   .5176937   .1966486    -1.73   0.083     .2458893    1.089949
                   1.asplenia |   .7033492   .2531518    -0.98   0.328     .3473791    1.424093
           1.ra_sle_psoriasis |   2.064092   .7505297     1.99   0.046     1.012096    4.209559
               1.other_immuno |   .8343329   .3197954    -0.47   0.637     .3936211    1.768481
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_1_timeperiod1.ster not
>  found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_1_timeperiod1.ster saved
(3,913 observations (episodes) created)
(cat_time: 3913 changes made)
(covidadmission: 3913 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       54.06       54.06
          1 |      2,726       32.00       86.06
          2 |      1,187       13.94      100.00
------------+-----------------------------------
      Total |      8,518      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
Observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,626        979 |     4,605 
         1 |     1,956        770 |     2,726 
         2 |       834        353 |     1,187 
-----------+----------------------+----------
     Total |     6,416      2,102 |     8,518 
(7,331 observations deleted)
   1:      9.35 /        1 =       9.3450

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,187             Number of obs    =       1,187
No. of failures      =          353
Time at risk         =        40261
                                                Wald chi2(41)    =       49.71
Log pseudolikelihood =   -1532.4414             Prob > chi2      =      0.1651

                                          (Std. Err. adjusted for 605 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    kids_cat4 |
              only <12 years  |   1.025057    .384382     0.07   0.947     .4915409    2.137651
                  only 12-18  |    1.72738   .8662185     1.09   0.276      .646459    4.615669
                       mixed  |   1.076259   .3622096     0.22   0.827     .5564796    2.081538
                              |
                         age1 |   1.045697   .0537028     0.87   0.384     .9455655    1.156432
                         age2 |   .8113959   .2075075    -0.82   0.414     .4915247    1.339431
                         age3 |   1.518089   .7549314     0.84   0.401     .5727996    4.023386
                       1.male |   .9206914   .0996441    -0.76   0.445     .7447161    1.138249
                              |
                    obese4cat |
           Obese I (30-34.9)  |   .9706538   .1568832    -0.18   0.854     .7071113    1.332419
          Obese II (35-39.9)  |   .9640494   .1932564    -0.18   0.855     .6508258    1.428018
             Obese III (40+)  |   1.184438   .2407189     0.83   0.405      .795277     1.76403
                              |
                 smoke_nomiss |
                      Former  |   2.209252   .6540503     2.68   0.007     1.236649     3.94679
                     Current  |   1.010702   .1733646     0.06   0.951     .7221331    1.414584
                              |
                          imd |
                           4  |   1.005226   .1445864     0.04   0.971     .7582833    1.332589
             5 most deprived  |   1.154397   .1946681     0.85   0.395     .8294985    1.606553
                              |
                tot_adults_hh |
                           2  |   3.574664   4.896422     0.93   0.352     .2439471    52.38112
                           3  |   2.862248   3.491439     0.86   0.389     .2620542    31.26247
                              |
                    ethnicity |
      Asian or Asian British  |   1.134758    .207586     0.69   0.490     .7928474    1.624117
                       Other  |   1.115741   .1742923     0.70   0.483     .8214767    1.515414
                              |
           1.htdiag_or_highbp |   1.052231   .2003323     0.27   0.789     .7245234    1.528163
1.chronic_respiratory_disease |   1.011236   .1490395     0.08   0.940     .7575296    1.349913
                     1.asthma |   .8208839   .1665831    -0.97   0.331     .5515009    1.221848
    1.chronic_cardiac_disease |    .879941   .1284606    -0.88   0.381     .6609804    1.171436
                              |
                      diabcat |
            T1DM, controlled  |   1.810495   .6815117     1.58   0.115     .8657362    3.786248
          T1DM, uncontrolled  |   3.272201   2.040062     1.90   0.057      .964176    11.10513
            T2DM, controlled  |   1.333716   .1803757     2.13   0.033     1.023161     1.73853
          T2DM, uncontrolled  |   .7851631   .2780731    -0.68   0.495     .3921919    1.571886
          Diabetes, no HbA1c  |   3.84e-19          .        .       .            .           .
                              |
            cancer_exhaem_cat |
                   Last year  |   .8381107   .7946817    -0.19   0.852     .1306794    5.375211
               2-5 years ago  |   2.271053   1.263163     1.47   0.140     .7634622    6.755647
                    5+ years  |   1.226905   .1694532     1.48   0.139     .9359397    1.608326
                              |
              cancer_haem_cat |
                   Last year  |   3.082806   2.093079     1.66   0.097     .8147429    11.66465
               2-5 years ago  |   .3288625   .2224085    -1.64   0.100     .0873675    1.237881
                    5+ years  |   .7639496    .121097    -1.70   0.089     .5599343    1.042299
                              |
      1.chronic_liver_disease |   .9476901   .1447646    -0.35   0.725     .7024911    1.278474
            1.stroke_dementia |   .9532304   .1426694    -0.32   0.749     .7108845    1.278194
                1.other_neuro |   .9155764    .127849    -0.63   0.528     .6963615      1.2038
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   .9753864   .2667755    -0.09   0.927     .5706458    1.667196
                       1.esrd |   .8517525    .099005    -1.38   0.167     .6782229    1.069681
           1.other_transplant |   1.021046   .1313244     0.16   0.871     .7935343    1.313786
                   1.asplenia |   1.140952   .1525586     0.99   0.324     .8779134    1.482801
           1.ra_sle_psoriasis |     .80863   .1194308    -1.44   0.150     .6053848    1.080111
               1.other_immuno |   1.009332   .1415435     0.07   0.947     .7667716    1.328624
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_1_timeperiod2.ster not foun
> d)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_MAINFULLYADJMODEL_ageband_1_timeperiod2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.02510         0.37        1         0.5436
      2.kids_cat4 |      0.02744         0.37        1         0.5439
      3.kids_cat4 |     -0.01585         0.14        1         0.7070
      age1        |      0.07510         2.64        1         0.1044
      age2        |     -0.07612         2.44        1         0.1183
      age3        |      0.07627         2.38        1         0.1229
      0b.male     |            .            .        1             .
      1.male      |     -0.08336         2.76        1         0.0964
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.01909         0.17        1         0.6816
      3.obese4cat |      0.01076         0.06        1         0.8104
      4.obese4cat |     -0.00361         0.01        1         0.9391
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00870         0.03        1         0.8669
      3.smoke_no~s|      0.02971         0.42        1         0.5183
      1b.imd      |            .            .        1             .
      4.imd       |      0.06822         2.61        1         0.1063
      5.imd       |      0.06449         1.86        1         0.1732
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.04184         1.21        1         0.2704
      3.tot_adul~h|      0.05809         2.17        1         0.1412
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.02749         0.35        1         0.5559
      5.ethnicity |      0.03049         0.40        1         0.5290
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.05319         1.16        1         0.2811
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01637         0.13        1         0.7170
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.02876         0.37        1         0.5422
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.08535         3.62        1         0.0570
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02275         0.21        1         0.6465
      3.diabcat   |      0.01905         0.16        1         0.6919
      4.diabcat   |     -0.00820         0.03        1         0.8532
      5.diabcat   |     -0.01931         0.15        1         0.6962
      6.diabcat   |            .            .        1             .
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.02757         0.31        1         0.5791
      3.cancer_e~t|     -0.13867        13.28        1         0.0003
      4.cancer_e~t|     -0.02087         0.21        1         0.6494
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.02699         0.29        1         0.5883
      3.cancer_h~t|      0.06754         1.81        1         0.1782
      4.cancer_h~t|      0.12226         6.10        1         0.0135
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.09146         4.34        1         0.0371
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.05930         1.59        1         0.2067
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.02073         0.18        1         0.6692
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.02967         0.38        1         0.5372
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.03266         0.51        1         0.4738
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.06237         1.63        1         0.2018
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.11905         5.75        1         0.0165
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00278         0.00        1         0.9530
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.07458         2.61        1         0.1059
      ------------+---------------------------------------------------
      global test |                     63.62       41         0.0133
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      3.58 /        1 =       3.5840
   1:      1.65 /        1 =       1.6490

------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          112             Number of obs    =         112
No. of failures      =           35
Time at risk         =         3926
                                                Wald chi2(35)    =     1148.93
Log pseudolikelihood =   -50.798726             Prob > chi2      =      0.0000

                                           (Std. Err. adjusted for 73 clusters in household_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
               gp_number_kids |
              2 children <12  |   .2398646   .2677672    -1.28   0.201     .0268997    2.138874
              3 children <12  |   .4819089   .3993415    -0.88   0.378     .0949737    2.445269
             4+ children <12  |   .0463516   .0498917    -2.85   0.004     .0056215    .3821871
                              |
                         age1 |   .6416846   .1132755    -2.51   0.012     .4540048    .9069488
                         age2 |   3.461596   3.147603     1.37   0.172     .5824855    20.57158
                         age3 |   .1541983   .2962033    -0.97   0.330     .0035726    6.655394
                       1.male |   1.248579   1.251126     0.22   0.825     .1751777    8.899251
                              |
                    obese4cat |
           Obese I (30-34.9)  |   .7892529   .9777582    -0.19   0.848     .0696167    8.947852
          Obese II (35-39.9)  |   .2582793   .2433036    -1.44   0.151     .0407608    1.636577
             Obese III (40+)  |   6.327323   5.194775     2.25   0.025     1.265837    31.62731
                              |
                 smoke_nomiss |
                      Former  |   .5969842   1.831187    -0.17   0.866     .0014621    243.7447
                     Current  |   .9431018   .8036773    -0.07   0.945     .1774988    5.010969
                              |
                          imd |
                           4  |   3.091178   2.599461     1.34   0.180     .5947355     16.0666
             5 most deprived  |   1.565861   2.127651     0.33   0.741      .109185    22.45658
                              |
                tot_adults_hh |
                           2  |   6.70e+09          .        .       .            .           .
                           3  |   5.06e+08   9.53e+08    10.64   0.000     1.26e+07    2.03e+10
                              |
                    ethnicity |
      Asian or Asian British  |   .9301291   1.353955    -0.05   0.960      .053639    16.12894
                       Other  |    .712957   1.046666    -0.23   0.818     .0401278    12.66723
                              |
           1.htdiag_or_highbp |    .156311   .1822937    -1.59   0.112     .0158964    1.537027
1.chronic_respiratory_disease |   2.763274   2.820272     1.00   0.319     .3738221    20.42599
                     1.asthma |   6.002328   6.262533     1.72   0.086      .776637    46.38969
    1.chronic_cardiac_disease |   2.883304   2.281465     1.34   0.181     .6114522    13.59623
                              |
                      diabcat |
            T1DM, controlled  |   171.9734   337.1897     2.63   0.009     3.685554    8024.531
            T2DM, controlled  |    25.0142   27.83986     2.89   0.004     2.823786    221.5856
          T2DM, uncontrolled  |   2.50e-20          .        .       .            .           .
          Diabetes, no HbA1c  |   2.88e-20          .        .       .            .           .
                              |
            cancer_exhaem_cat |
                   Last year  |   7.21e-19          .        .       .            .           .
               2-5 years ago  |   123.9577   238.5474     2.50   0.012     2.852323    5387.014
                    5+ years  |   1.925692   1.371713     0.92   0.358     .4767133    7.778869
                              |
              cancer_haem_cat |
                   Last year  |          1  (omitted)
               2-5 years ago  |   1.69e-17          .        .       .            .           .
                    5+ years  |   9.958065   15.94595     1.44   0.151     .4316556    229.7273
                              |
      1.chronic_liver_disease |   .2828299   .3920212    -0.91   0.362      .018694    4.279052
            1.stroke_dementia |   2.992766   2.848956     1.15   0.250     .4632051    19.33624
                1.other_neuro |   4.215697   6.232146     0.97   0.330      .232553    76.42176
                              |
  reduced_kidney_function_cat |
Stage 3a/3b egfr 30-60        |   20.59374   38.03849     1.64   0.101     .5514292    769.0965
                       1.esrd |   .6525985   .4652643    -0.60   0.549     .1613576    2.639384
           1.other_transplant |   7.918786   8.847354     1.85   0.064     .8864289    70.74134
                   1.asplenia |   .4966652   .3369891    -1.03   0.302     .1313774    1.877617
           1.ra_sle_psoriasis |   1.520472   1.041115     0.61   0.541     .3973141    5.818657
               1.other_immuno |   1.319523   1.068699     0.34   0.732     .2697848    6.453816
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_1_timeperiod2.ster not
>  found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_MAINFULLYADJMODEL_ageband_1_timeperiod2.ster saved
(3,913 observations (episodes) created)
(cat_time: 3913 changes made)
(covidadmission: 3913 changes made)

Observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       54.06       54.06
          1 |      2,726       32.00       86.06
          2 |      1,187       13.94      100.00
------------+-----------------------------------
      Total |      8,518      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
Observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,626        979 |     4,605 
         1 |     1,956        770 |     2,726 
         2 |       834        353 |     1,187 
-----------+----------------------+----------
     Total |     6,416      2,102 |     8,518 
(8,518 observations deleted)
   1:      0.05 /        1 =       0.0470
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covidadmission)
   1:      0.05 /        1 =       0.0490
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covidadmission)

. /*SENSITIVITY ANALYSIS: 12 months FUP
> keep if has_12_m_follow_up == 1
> foreach exposure_type in kids_cat4   {
> 
> *Age spline model (not adj ethnicity)
> cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'
> basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
> if _rc==0{
> estimates
> estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x', replace
> *estat concordance /*c-statistic*/
> }
> else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome')"
> }       
> }
> */
. log close
      name:  <unnamed>
       log:  C:\Users\qc18278\OneDrive - University of Bristol\Documents\GitHub\os-sch-children-2021\analysis\log/07b_an_multi
> variable_cox_models_.log
  log type:  text
 closed on:  24 Jul 2021, 14:52:52
------------------------------------------------------------------------------------------------------------------------------
