------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\qc18278\OneDrive - University of Bristol\Documents\GitHub\os-sch-children-2021\analysis\log/10_an_intera
> ction_cox_models_sex_.log
  log type:  text
 opened on:  24 Jul 2021, 15:51:06

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interaction(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                              ///
>                         $demogadjlist                                                   ///
>                         $comordidadjlist                                                ///
>                         `interaction'                                                   ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *************************************************************************************
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. forvalues period=0/2 {
  3. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", clear
  4. gen first_vacc_plus_14d=covid_vacc_date+14
  5. gen second_vacc_plus_14d=covid_vacc_second_dose_date+14
  6. format first_vacc_plus_14d second_vacc_plus_14d %td
  7. stsplit vaccine, at()
  8. recode cat_time 78=1 147=2 400=3
  9. recode `outcome' .=0 
 10. tab cat_time
 11. tab cat_time `outcome'
 12. 
. keep if cat_time==`period'
 13. 
. foreach int_type in  male  {
 14. 
. tab male `outcome'
 15. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 16. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 17. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ///
> interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type')
 18. if _rc==0{
 19. testparm 1.`int_type'#i.`exposure_type'
 20. di _n "`exposure_type' " _n "****************"
 21. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 22. di "`exposure_type'" _n "****************"
 23. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 24. di "`exposure_type'" _n "****************"
 25. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 26. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`int_type'_`x'_timeperiod`period', replace
 27. }
 28. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 29. }
 30. }
 31. }
 32. }
file tempdata/cr_create_analysis_dataset_STSET__ageband_0.dta not found
r(601);

end of do-file

r(601);

. use use "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta", clear
invalid '"tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta' 
r(198);

. use  "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta", clear

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. gen first_vacc_plus_14d=covid_vacc_date+14
(8,060 missing values generated)

. gen second_vacc_plus_14d=covid_vacc_second_dose_date+14
(11,262 missing values generated)

. format first_vacc_plus_14d second_vacc_plus_14d %td

. 
. stsplit vaccine, at(first_vacc_plus_14d)
invalid numlist
r(121);

end of do-file

r(121);

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. stsplit vaccine, after(first_vacc_plus_14d) at(0)
(4,521 observations (episodes) created)

. 
end of do-file

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. replace vaccine = vac +1
(20,528 real changes made)

. 
end of do-file

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. replace vaccine = vac +1
(20,528 real changes made)

. stsplit vaccine, after(second_vacc_plus_14d) at(0)
variable vaccine already defined
r(110);

end of do-file

r(110);

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. stsplit vaccine2, after(second_vacc_plus_14d) at(0)
(2,470 observations (episodes) created)

. 
end of do-file

. use  "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta", clear

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. gen first_vacc_plus_14d=covid_vacc_date+14
(8,060 missing values generated)

. gen second_vacc_plus_14d=covid_vacc_second_dose_date+14
(11,262 missing values generated)

. format first_vacc_plus_14d second_vacc_plus_14d %td

. 
. stsplit vaccine, after(first_vacc_plus_14d) at(0)
(4,521 observations (episodes) created)

. replace vaccine = vac +1
(20,528 real changes made)

. stsplit vaccine2, after(second_vacc_plus_14d) at(2)
(2,436 observations (episodes) created)

. replace vaccine = vac +1
vac ambiguous abbreviation
r(111);

end of do-file

r(111);

. use  "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta", clear

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. gen first_vacc_plus_14d=covid_vacc_date+14
(8,060 missing values generated)

. gen second_vacc_plus_14d=covid_vacc_second_dose_date+14
(11,262 missing values generated)

. format first_vacc_plus_14d second_vacc_plus_14d %td

. 
. stsplit vaccine, after(first_vacc_plus_14d) at(0)
(4,521 observations (episodes) created)

. replace vaccine = vac +1
(20,528 real changes made)

. stsplit vaccine2, after(second_vacc_plus_14d) at(1)
(2,459 observations (episodes) created)

. replace vaccine2 = vac +1
vac ambiguous abbreviation
r(111);

end of do-file

r(111);

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. replace vaccine2 = vaccine2 +1
(22,987 real changes made)

. 
end of do-file

. br id *vacc* _*
variable id not found
r(111);

. br pat *vacc* _*

. br pat *vacc* _*

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. bysort pat: replace vaccine2=0 if _n==1
(16,007 real changes made)

. 
end of do-file

. use  "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta", clear

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. gen first_vacc_plus_14d=covid_vacc_date+14
(8,060 missing values generated)

. gen second_vacc_plus_14d=covid_vacc_second_dose_date+14
(11,262 missing values generated)

. format first_vacc_plus_14d second_vacc_plus_14d %td

. 
. stsplit vaccine, after(first_vacc_plus_14d) at(0)
(4,521 observations (episodes) created)

. replace vaccine = vaccine +1
(20,528 real changes made)

. stsplit vaccine2, after(second_vacc_plus_14d) at(1)
(2,459 observations (episodes) created)

. 
end of do-file

. br pat *vacc* _*

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. replace vaccine2 = vaccine2 +1
(22,987 real changes made)

. 
end of do-file

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. *Vaccine
. foreach outcome of any  non_covid_death covid_tpp_prob covid_death covid_icu covidadmission   {
  2. winexec "C:\Program Files\Stata16\StataMP-64.exe"  do "10_an_interaction_cox_models_vaccine" `outcome'
  3. }

. 
end of do-file

. use  "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta", clear

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. gen first_vacc_plus_14d=covid_vacc_date+14
(8,060 missing values generated)

. gen second_vacc_plus_14d=covid_vacc_second_dose_date+14
(11,262 missing values generated)

. format first_vacc_plus_14d second_vacc_plus_14d %td

. 
. stsplit vaccine, after(first_vacc_plus_14d) at(0)
(4,521 observations (episodes) created)

. replace vaccine = vaccine +1
(20,528 real changes made)

. stsplit vaccine2, after(second_vacc_plus_14d) at(1)
(2,459 observations (episodes) created)

. replace vaccine2 = vaccine2 +1
(22,987 real changes made)

. replace vaccine=2 if vaccine2==2
(17,322 real changes made)

. 
end of do-file

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. drop if vaccine==0
(2,366 observations deleted)

. recode vaccine 1=0 2=1
(vaccine: 20621 changes made)

. br patient_id first second _* vaccine

. 
end of do-file

. use  "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta", clear

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. gen first_vacc_plus_14d=covid_vacc_date+14
(8,060 missing values generated)

. gen second_vacc_plus_14d=covid_vacc_second_dose_date+14
(11,262 missing values generated)

. format first_vacc_plus_14d second_vacc_plus_14d %td

. 
. stsplit vaccine, after(first_vacc_plus_14d) at(0)
(4,521 observations (episodes) created)

. replace vaccine = vaccine +1
(20,528 real changes made)

. stsplit vaccine2, after(second_vacc_plus_14d) at(1)
(2,459 observations (episodes) created)

. replace vaccine2 = vaccine2 +1
(22,987 real changes made)

. replace vaccine=2 if vaccine2==2
(17,322 real changes made)

. 
end of do-file

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. br patient_id first second _* vaccine

. 
end of do-file

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. br patient_id first second _* vaccine enter

. 
end of do-file

. format enter %td

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. br patient_id first second _* vaccine enter

. 
end of do-file

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. cd "C:\Users\qc18278\OneDrive - University of Bristol\Documents\GitHub\os-sch-children-2021"
C:\Users\qc18278\OneDrive - University of Bristol\Documents\GitHub\os-sch-children-2021

. 
end of do-file

. do "C:\Users\qc18278\AppData\Local\Temp\STD1ff0_000000.tmp"

. *Model do file
. 
. *When running in parallel locally use "C:\Program Files\Stata16\StataMP-64.exe"
. *When running on server use "c:/program files/stata16/statamp-64.exe"
. 
. *Import dataset into STATA
. *import delimited `c(pwd)'/output/input.csv, clear
. 
. cd  "`c(pwd)'/analysis" /*sets working directory to workspace folder*/
C:\Users\qc18278\OneDrive - University of Bristol\Documents\GitHub\os-sch-children-2021\analysis

. set more off 

. 
. ***********************HOUSE-KEEPING*******************************************
. * Create directories required 
. capture mkdir output

. capture mkdir log

. capture mkdir tempdata

. 
. 
. * Set globals that will print in programs and direct output
. global outdir     "output" 

. global logdir     "log"

. global tempdir    "tempdata"

. 
. ********************************************************************************
. 
. 
. *  Pre-analysis data manipulation  *
. do "01_cr_analysis_dataset.do" 

. /*==============================================================================
> DO FILE NAME:                   01_cr_analysis_dataset
> PROJECT:                                Exposure children and COVID risk
> DATE:                                   25th June 2020 
> AUTHOR:                                 Harriet Forbes adapted from A Wong, A Schultze, C Rentsch,
>                                                  K Baskharan, E Williamson                                                  
>                             
> DESCRIPTION OF FILE:    program 01, data management for project  
>                                                 reformat variables 
>                                                 categorise variables
>                                                 label variables 
>                                                 apply exclusion criteria
> DATASETS USED:                  data in memory (from analysis/input.csv)
> DATASETS CREATED:               none
> OTHER OUTPUT:                   logfiles, printed to folder analysis/$logdir
>                                                         
> ==============================================================================*/
. global outdir     "output"

. global logdir     "log"

. global tempdir    "tempdata"

. 
. *Start dates
. global indexdate = "20/12/2020"

. 
. *Censor dates
. global study_end_censor         = "16/07/2021"

. global SUS_study_end_censor = "16/06/2021"

. 
. * Open a log file
. cap log close
