-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_cr_analysis_dataset.log
  log type:  text
 opened on:  17 Nov 2021, 09:51:26

. 
. 
. *Import dataset into STATA
. import delimited "output/input", clear
(62 vars, 30,000 obs)

. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates and TPP case outcome dates are given with month only, so addi
> ng day 
> 15 to enable  them to be processed as dates                                  
>                                                      */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(29,816 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(1,226 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(123 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 dialysis                     
>                    ///
>                                                 kidney_transplant            
>            ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 dereg_date  ///
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable diabetes was str7 now str10
(30,000 real changes made)
(28,467 real changes made)
(28,467 missing values generated)
variable cancer_haem was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable cancer_nonhaem was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable dialysis was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable kidney_transplant was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable other_transplant was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable asplenia was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable chronic_liver_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable other_neuro was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable stroke_dementia was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable esrf was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable hypertension was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable bmi_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable bp_sys_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable bp_dias_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable creatinine_date was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable smoking_status_date was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable dereg_date was str7 now str10
(30,000 real changes made)
(29,897 real changes made)
(29,897 missing values generated)

. 
. * Recode to dates from the strings 
. foreach var of varlist covid_icu_date positive_covid_test       ///
> covid_tpp_codes_clinical covid_tpp_codes_test covid_tpp_codes_seq ///
> died_date_ons covid_admission_date covid_tpp_probable ///
> covid_vacc_date  covid_vacc_second_dose_date    {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td        
  7. }
(5,999 missing values generated)
(24,000 missing values generated)
(15,000 missing values generated)
(15,000 missing values generated)
(15,000 missing values generated)
(5,999 missing values generated)
(16,218 missing values generated)
(1,500 missing values generated)
(15,000 missing values generated)
(24,000 missing values generated)

. 
. *Amend vaccine dates
. replace covid_vacc_second_dose_date=. if covid_vacc_date==covid_vacc_second_d
> ose_date
(10 real changes made, 10 to missing)

. 
. gen covid_admission_primary_date = covid_admission_date ///
> if (covid_admission_primary_diagnosi == "U071"| covid_admission_primary_diagn
> osi == "U072")
(23,117 missing values generated)

. 
. gen  covid_primary_care_codes_only=covid_tpp_probable
(1,500 missing values generated)

. format covid_primary_care_codes_only %td

. replace covid_tpp_probable=positive_covid_test_ever if covid_tpp_probable==. 
> & covid_tpp_probable>positive_covid_test
(298 real changes made)

. 
. 
. /*Tab all variables in initial extract*/
. sum, d f

                       dereg_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15dec2020      15dec2020
 5%    15jan2021      15dec2020
10%    15jan2021      15dec2020       Obs                 103
25%    15mar2021      15dec2020       Sum of Wgt.         103

50%    15jul2021                      Mean          12jun2021
                        Largest       Std. Dev.      99.70358
75%    15aug2021      15nov2021
90%    15oct2021      15nov2021       Variance       9940.804
95%    15nov2021      15nov2021       Skewness      -.2497305
99%    15nov2021      15nov2021       Kurtosis       1.842968

                       ethnicity_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%         1970           1970
 5%         1972           1970
10%         1975           1970       Obs              27,001
25%         1982           1970       Sum of Wgt.      27,001

50%         1996                      Mean           1995.592
                        Largest       Std. Dev.      15.06752
75%         2009           2021
90%         2016           2021       Variance       227.0302
95%         2019           2021       Skewness      -.0112988
99%         2021           2021       Kurtosis       1.788027

                   bmi_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2015      15feb2015
 5%    15jun2015      15feb2015
10%    15oct2015      15feb2015       Obs              28,500
25%    15oct2016      15feb2015       Sum of Wgt.      28,500

50%    15jun2018                      Mean          26jun2018
                        Largest       Std. Dev.      714.0644
75%    15mar2020      15nov2021
90%    15mar2021      15nov2021       Variance         509888
95%    15jul2021      15nov2021       Skewness      -.0029987
99%    15oct2021      15nov2021       Kurtosis       1.813113

                  bp_sys_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jul1972      15jan1970
10%    15feb1975      15jan1970       Obs              28,500
25%    15oct1982      15jan1970       Sum of Wgt.      28,500

50%    15jul1995                      Mean          17jul1995
                        Largest       Std. Dev.       5367.05
75%    15mar2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.88e+07
95%    15apr2018      15dec2020       Skewness      -.0075414
99%    15jun2020      15dec2020       Kurtosis       1.802392

                 bp_dias_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jul1972      15jan1970
10%    15jan1975      15jan1970       Obs              28,500
25%    15oct1982      15jan1970       Sum of Wgt.      28,500

50%    15nov1995                      Mean          08aug1995
                        Largest       Std. Dev.      5375.043
75%    15apr2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.89e+07
95%    15jun2018      15dec2020       Skewness      -.0209305
99%    15jun2020      15dec2020       Kurtosis       1.804537

                    creatinine_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15mar2019      15mar2019
 5%    15apr2019      15mar2019
10%    15may2019      15mar2019       Obs              28,500
25%    15aug2019      15mar2019       Sum of Wgt.      28,500

50%    15jan2020                      Mean          23jan2020
                        Largest       Std. Dev.      190.4786
75%    15jul2020      15dec2020
90%    15oct2020      15dec2020       Variance        36282.1
95%    15nov2020      15dec2020       Skewness       .0088164
99%    15dec2020      15dec2020       Kurtosis       1.796889

                  smoking_status_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    30jun1970      15jan1970
 5%    15aug1972      15jan1970
10%    15feb1975      15jan1970       Obs              28,500
25%    15aug1982      15jan1970       Sum of Wgt.      28,500

50%    15aug1995                      Mean          01jul1995
                        Largest       Std. Dev.      5371.615
75%    15apr2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.89e+07
95%    15jun2018      15dec2020       Skewness       .0011821
99%    15jun2020      15dec2020       Kurtosis       1.795684

              chronic_respiratory_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15may1970      15jan1970
 5%    15may1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    15aug1982      15jan1970       Sum of Wgt.       6,000

50%    15dec1995                      Mean          18sep1995
                        Largest       Std. Dev.      5447.766
75%    15oct2008      15dec2020
90%    15jan2016      15dec2020       Variance       2.97e+07
95%    15aug2018      15dec2020       Skewness      -.0325095
99%    30may2020      15dec2020       Kurtosis       1.770487

                chronic_cardiac_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jun1972      15jan1970
10%    15sep1974      15jan1970       Obs               6,000
25%    15oct1982      15jan1970       Sum of Wgt.       6,000

50%    15dec1994                      Mean          28mar1995
                        Largest       Std. Dev.      5403.063
75%    15jan2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.92e+07
95%    30may2018      15dec2020       Skewness       .0249091
99%    15jun2020      15dec2020       Kurtosis        1.79062

                   hba1c_mmol_per_mol_date
-------------------------------------------------------------
no observations

                    hba1c_percentage_date
-------------------------------------------------------------
no observations

                      cancer_haem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug1970      15jan1970
 5%    15aug1972      15jan1970
10%    15jan1975      15jan1970       Obs               6,000
25%    15nov1982      15jan1970       Sum of Wgt.       6,000

50%    15mar1995                      Mean          16may1995
                        Largest       Std. Dev.      5360.544
75%    15dec2007      15dec2020
90%    30dec2015      15dec2020       Variance       2.87e+07
95%    15jun2018      15dec2020       Skewness        .032285
99%    15jun2020      15dec2020       Kurtosis       1.809632

                     cancer_nonhaem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jul1972      15jan1970
10%    15mar1975      15jan1970       Obs               6,000
25%    30sep1982      15jan1970       Sum of Wgt.       6,000

50%    15jan1996                      Mean          22sep1995
                        Largest       Std. Dev.      5411.912
75%    15jul2008      15dec2020
90%    15mar2016      15dec2020       Variance       2.93e+07
95%    15jul2018      15dec2020       Skewness      -.0211313
99%    15jun2020      15dec2020       Kurtosis       1.782961

               permanent_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    30jun1970      15jan1970
 5%    15may1972      15jan1970
10%    15nov1974      15jan1970       Obs               6,000
25%    15mar1982      15jan1970       Sum of Wgt.       6,000

50%    15feb1995                      Mean          12mar1995
                        Largest       Std. Dev.      5399.945
75%    15dec2007      15dec2020
90%    15oct2015      15dec2020       Variance       2.92e+07
95%    15jun2018      15dec2020       Skewness       .0230645
99%    15jul2020      15dec2020       Kurtosis       1.796173

                        asplenia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15dec1972      15jan1970
10%    15jun1975      15jan1970       Obs               6,000
25%    01mar1983      15jan1970       Sum of Wgt.       6,000

50%    15jun1995                      Mean          16sep1995
                        Largest       Std. Dev.      5363.895
75%    30oct2008      15dec2020
90%    15feb2016      15dec2020       Variance       2.88e+07
95%    15may2018      15dec2020       Skewness       .0060798
99%    15jun2020      15dec2020       Kurtosis        1.78274

               temporary_immunodeficiency_date
-------------------------------------------------------------
no observations

                 chronic_liver_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15may1972      15jan1970
10%    15aug1974      15jan1970       Obs               6,000
25%    15sep1982      15jan1970       Sum of Wgt.       6,000

50%    15jun1995                      Mean          30may1995
                        Largest       Std. Dev.      5407.314
75%    15mar2008      15nov2020
90%    15jan2016      15nov2020       Variance       2.92e+07
95%    15jun2018      15dec2020       Skewness      -.0002729
99%    15jun2020      15dec2020       Kurtosis       1.794218

                    stroke_dementia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15may1972      15jan1970
10%    15nov1974      15jan1970       Obs               6,000
25%    15jul1982      15jan1970       Sum of Wgt.       6,000

50%    30nov1995                      Mean          09jul1995
                        Largest       Std. Dev.      5389.968
75%    15jan2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.91e+07
95%    15jun2018      15dec2020       Skewness      -.0241743
99%    30jun2020      15dec2020       Kurtosis        1.80084

                      other_neuro_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jun1972      15jan1970
10%    15jan1975      15jan1970       Obs               6,000
25%    15nov1982      15jan1970       Sum of Wgt.       6,000

50%    15jul1995                      Mean          22jul1995
                        Largest       Std. Dev.      5395.161
75%    15apr2008      15dec2020
90%    30dec2015      15dec2020       Variance       2.91e+07
95%    15jul2018      15dec2020       Skewness      -.0118461
99%    15jun2020      15dec2020       Kurtosis       1.799101

                          esrf_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug1970      15jan1970
 5%    15aug1972      15jan1970
10%    15apr1975      15jan1970       Obs               6,000
25%    15oct1982      15jan1970       Sum of Wgt.       6,000

50%    15may1995                      Mean          14may1995
                        Largest       Std. Dev.      5322.505
75%    15dec2007      15dec2020
90%    15jul2015      15dec2020       Variance       2.83e+07
95%    15apr2018      15dec2020       Skewness       .0107504
99%    15jun2020      15dec2020       Kurtosis       1.821349

                        dialysis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    30may1970      15jan1970
 5%    15feb1972      15jan1970
10%    15jan1975      15jan1970       Obs               6,000
25%    15jan1983      15jan1970       Sum of Wgt.       6,000

50%    15apr1995                      Mean          28may1995
                        Largest       Std. Dev.      5355.598
75%    15dec2007      15nov2020
90%    15oct2015      15dec2020       Variance       2.87e+07
95%    15may2018      15dec2020       Skewness      -.0027492
99%    15may2020      15dec2020       Kurtosis       1.826935

                   kidney_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15may1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    15jul1982      15jan1970       Sum of Wgt.       6,000

50%    15nov1995                      Mean          31aug1995
                        Largest       Std. Dev.      5406.763
75%    15jul2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.92e+07
95%    15may2018      15dec2020       Skewness      -.0282257
99%    15jun2020      15dec2020       Kurtosis       1.778134

                    other_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jul1972      15jan1970
10%    15feb1975      15jan1970       Obs               6,000
25%    30sep1982      15jan1970       Sum of Wgt.       6,000

50%    15aug1995                      Mean          15aug1995
                        Largest       Std. Dev.      5421.433
75%    15aug2008      15dec2020
90%    15feb2016      15dec2020       Variance       2.94e+07
95%    15jun2018      15dec2020       Skewness      -.0063493
99%    15jul2020      15dec2020       Kurtosis        1.77588

                      hypertension_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    30may1970      15jan1970
 5%    15aug1972      15jan1970
10%    15mar1975      15jan1970       Obs               6,000
25%    15jul1982      15jan1970       Sum of Wgt.       6,000

50%    15aug1995                      Mean          30aug1995
                        Largest       Std. Dev.      5434.166
75%    15jul2008      15nov2021
90%    15apr2016      15nov2021       Variance       2.95e+07
95%    15dec2018      15nov2021       Skewness        .008238
99%    15may2021      15nov2021       Kurtosis       1.807794

                    ra_sle_psoriasis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15may1972      15jan1970
10%    15oct1974      15jan1970       Obs               6,000
25%    30oct1982      15jan1970       Sum of Wgt.       6,000

50%    15apr1995                      Mean          10may1995
                        Largest       Std. Dev.      5383.654
75%    15apr2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.90e+07
95%    15jun2018      15dec2020       Skewness       .0050026
99%    15jun2020      15dec2020       Kurtosis       1.800516

                     has_12_m_follow_up
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           .5              0
10%            1              0       Obs              30,000
25%            1              0       Sum of Wgt.      30,000

50%            1                      Mean                .95
                        Largest       Std. Dev.      .2179486
75%            1              1
90%            1              1       Variance       .0475016
95%            1              1       Skewness      -4.129483
99%            1              1       Kurtosis       18.05263

                   died_ons_covid_flag_any
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,000
25%            0              0       Sum of Wgt.      30,000

50%            1                      Mean                 .6
                        Largest       Std. Dev.      .4899061
75%            1              1
90%            1              1       Variance        .240008
95%            1              1       Skewness      -.4082483
99%            1              1       Kurtosis       1.166667

               died_ons_covid_flag_underlying
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,000
25%            0              0       Sum of Wgt.      30,000

50%            1                      Mean                 .6
                        Largest       Std. Dev.      .4899061
75%            1              1
90%            1              1       Variance        .240008
95%            1              1       Skewness      -.4082483
99%            1              1       Kurtosis       1.166667

              covid_admission_primary_diagnosis
-------------------------------------------------------------
no observations

                            sgtf
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              26,987
25%            0              0       Sum of Wgt.      26,987

50%            1                      Mean           1.438285
                        Largest       Std. Dev.      2.707593
75%            1              9
90%            9              9       Variance       7.331059
95%            9              9       Skewness       2.339901
99%            9              9       Kurtosis       6.762884

                           lft_pcr
-------------------------------------------------------------
no observations

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              30,000
25%           21              0       Sum of Wgt.      30,000

50%           39                      Mean           40.14573
                        Largest       Std. Dev.       23.7866
75%           59            106
90%           73            107       Variance       565.8023
95%           80            108       Skewness        .146006
99%           89            109       Kurtosis       2.052791

                             sex
-------------------------------------------------------------
no observations

                             imd
-------------------------------------------------------------
      Percentiles      Smallest
 1%          100            100
 5%          100            100
10%          200            100       Obs              30,000
25%          200            100       Sum of Wgt.      30,000

50%          300                      Mean           261.0233
                        Largest       Std. Dev.       65.4367
75%          300            300
90%          300            300       Variance       4281.962
95%          300            300       Skewness       -1.43078
99%          300            300       Kurtosis       3.729302

                             stp
-------------------------------------------------------------
no observations

                          ethnicity
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              27,001
25%            1              1       Sum of Wgt.      27,001

50%            1                      Mean           1.604644
                        Largest       Std. Dev.      1.283349
75%            1              5
90%            5              5       Variance       1.646984
95%            5              5       Skewness       1.906515
99%            5              5       Kurtosis       5.100969

                        household_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%        535.5            226
 5%          672            239
10%          746            249       Obs              30,000
25%          867            274       Sum of Wgt.      30,000

50%         1002                      Mean           1000.898
                        Largest       Std. Dev.      198.7921
75%         1136           1766
90%         1256           1781       Variance        39518.3
95%         1326           1792       Skewness      -.0155374
99%         1458           2096       Kurtosis       2.997682

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              30,000
25%            2              0       Sum of Wgt.      30,000

50%            3                      Mean           2.503667
                        Largest       Std. Dev.      1.038792
75%            3              6
90%            4              6       Variance       1.079089
95%            4              6       Skewness       .0350141
99%            5              7       Kurtosis       2.943519

                       care_home_type
-------------------------------------------------------------
no observations

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0       -22.1911
 5%            0      -13.64185
10%     8.717818      -12.11514       Obs              30,000
25%     16.95484      -12.07156       Sum of Wgt.      30,000

50%     24.38333                      Mean           23.74885
                        Largest       Std. Dev.      11.19171
75%      31.3083        62.0827
90%     37.53418       62.78475       Variance       125.2544
95%     41.07991       65.46082       Skewness      -.2240288
99%     48.40473       65.69279       Kurtosis       2.936358

                           bp_sys
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     41.68177              0
10%     103.8682              0       Obs              30,000
25%     112.0537              0       Sum of Wgt.      30,000

50%     119.4649                      Mean           114.0977
                        Largest       Std. Dev.      27.94121
75%     126.4689       157.8505
90%     132.6148       158.2059       Variance        780.711
95%     136.3934       158.9164       Skewness       -3.31665
99%     142.9645       164.0677       Kurtosis       13.98669

                           bp_dias
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     19.28823              0
10%     63.80971              0       Obs              30,000
25%     71.88969              0       Sum of Wgt.      30,000

50%     79.32636                      Mean           75.99616
                        Largest       Std. Dev.       19.9684
75%     86.30523       115.2002
90%     92.49069       116.0232       Variance       398.7371
95%     96.18096       119.1797       Skewness      -2.604421
99%     102.9397       119.3067       Kurtosis       10.72772

                         creatinine
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     .0200335              0
10%     35.76303              0       Obs              30,000
25%     47.96177              0       Sum of Wgt.      30,000

50%     59.21538                      Mean           57.11227
                        Largest       Std. Dev.      19.65005
75%     69.64555       115.1491
90%     78.91317        115.977       Variance       386.1243
95%      84.4856       115.9786       Skewness      -.9677882
99%     94.84665       119.2906       Kurtosis       4.618714

                       smoking_status
-------------------------------------------------------------
no observations

                        diabetes_type
-------------------------------------------------------------
no observations

                     hba1c_mmol_per_mol
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -5.573039      -43.25651
 5%            0      -38.79994
10%     7.724801      -36.76918       Obs              30,000
25%     23.92008      -32.33202       Sum of Wgt.      30,000

50%     38.84896                      Mean           38.06336
                        Largest       Std. Dev.      21.32933
75%     52.73095       112.3476
90%     65.02536        112.456       Variance       454.9401
95%     72.36601       117.7825       Skewness      -.0491569
99%     86.12863       120.5967       Kurtosis       2.729344

                      hba1c_percentage
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0      -2.680104
 5%            0      -2.493295
10%     1.746185      -2.162857       Obs              30,000
25%     3.386608      -1.945798       Sum of Wgt.      30,000

50%     4.849743                      Mean           4.742702
                        Largest       Std. Dev.      2.236066
75%      6.26608       12.10635
90%     7.507564       12.14039       Variance       4.999991
95%     8.254481       12.67611       Skewness      -.2137253
99%      9.64413       12.88052       Kurtosis       2.907531

                           asthma
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               6,000
25%            0              0       Sum of Wgt.       6,000

50%            0                      Mean           .7178333
                        Largest       Std. Dev.      .9101392
75%            2              2
90%            2              2       Variance       .8283534
95%            2              2       Skewness       .5855997
99%            2              2       Kurtosis       1.463718

                         patient_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%         3024              4
 5%      14751.5              5
10%        30056             10       Obs              30,000
25%        76041             11       Sum of Wgt.      30,000

50%     151251.5                      Mean           150785.3
                        Largest       Std. Dev.      86659.53
75%       225588         299949
90%       270571         299950       Variance       7.51e+09
95%     285352.5         299959       Skewness      -.0134155
99%       297179         299966       Kurtosis       1.807104

                        diabetes_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15may1970      15jan1970
 5%    15mar1972      15jan1970
10%    15dec1974      15jan1970       Obs               1,533
25%    15jan1983      15jan1970       Sum of Wgt.       1,533

50%    15mar1996                      Mean          07dec1995
                        Largest       Std. Dev.      5480.991
75%    15aug2009      15nov2020
90%    15apr2016      15nov2020       Variance       3.00e+07
95%    15aug2018      15dec2020       Skewness      -.0392821
99%    15jun2020      15dec2020       Kurtosis       1.768252

                       covid_icu_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    07jan2021      21dec2020
10%    23jan2021      21dec2020       Obs              24,001
25%    14mar2021      21dec2020       Sum of Wgt.      24,001

50%    05jun2021                      Mean          04jun2021
                        Largest       Std. Dev.      95.48519
75%    26aug2021      17nov2021
90%    15oct2021      17nov2021       Variance       9117.422
95%    31oct2021      17nov2021       Skewness      -.0033724
99%    14nov2021      17nov2021       Kurtosis       1.805417

                  positive_covid_test_ever
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun2021      08mar2021
 5%    12aug2021      08mar2021
10%    02sep2021      22mar2021       Obs               6,000
25%    03oct2021      30mar2021       Sum of Wgt.       6,000

50%    26oct2021                      Mean          15oct2021
                        Largest       Std. Dev.      32.77448
75%    08nov2021      17nov2021
90%    14nov2021      17nov2021       Variance       1074.167
95%    16nov2021      17nov2021       Skewness      -1.951195
99%    17nov2021      17nov2021       Kurtosis        8.24102

                  covid_tpp_codes_clinical
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    05jan2021      21dec2020
10%    22jan2021      21dec2020       Obs              15,000
25%    12mar2021      21dec2020       Sum of Wgt.      15,000

50%    03jun2021                      Mean          03jun2021
                        Largest       Std. Dev.      96.18006
75%    26aug2021      17nov2021
90%    15oct2021      17nov2021       Variance       9250.605
95%    01nov2021      17nov2021       Skewness       .0121966
99%    14nov2021      17nov2021       Kurtosis       1.795308

                    covid_tpp_codes_test
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    07jan2021      21dec2020
10%    24jan2021      21dec2020       Obs              15,000
25%    15mar2021      21dec2020       Sum of Wgt.      15,000

50%    05jun2021                      Mean          05jun2021
                        Largest       Std. Dev.      95.60209
75%    28aug2021      17nov2021
90%    14oct2021      17nov2021       Variance       9139.759
95%    01nov2021      17nov2021       Skewness      -.0058272
99%    14nov2021      17nov2021       Kurtosis       1.801986

                     covid_tpp_codes_seq
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    05jan2021      21dec2020
10%    22jan2021      21dec2020       Obs              15,000
25%    14mar2021      21dec2020       Sum of Wgt.      15,000

50%    04jun2021                      Mean          04jun2021
                        Largest       Std. Dev.        95.813
75%    27aug2021      17nov2021
90%    15oct2021      17nov2021       Variance       9180.131
95%    31oct2021      17nov2021       Skewness       -.002864
99%    14nov2021      17nov2021       Kurtosis       1.802886

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    06jan2021      21dec2020
10%    23jan2021      21dec2020       Obs              24,001
25%    14mar2021      21dec2020       Sum of Wgt.      24,001

50%    05jun2021                      Mean          04jun2021
                        Largest       Std. Dev.      95.66742
75%    26aug2021      17nov2021
90%    15oct2021      17nov2021       Variance       9152.255
95%    01nov2021      17nov2021       Skewness       .0043278
99%    14nov2021      17nov2021       Kurtosis       1.807333

                    covid_admission_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      20dec2020
 5%    06jan2021      20dec2020
10%    22jan2021      20dec2020       Obs              13,782
25%    12mar2021      20dec2020       Sum of Wgt.      13,782

50%    01jun2021                      Mean          02jun2021
                        Largest       Std. Dev.      95.44423
75%    23aug2021      17nov2021
90%    14oct2021      17nov2021       Variance       9109.601
95%    01nov2021      17nov2021       Skewness       .0300639
99%    14nov2021      17nov2021       Kurtosis       1.822156

                     covid_tpp_probable
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    06jan2021      21dec2020
10%    23jan2021      21dec2020       Obs              28,798
25%    14mar2021      21dec2020       Sum of Wgt.      28,798

50%    07jun2021                      Mean          06jun2021
                        Largest       Std. Dev.      96.44629
75%    29aug2021      17nov2021
90%    17oct2021      17nov2021       Variance       9301.886
95%    02nov2021      17nov2021       Skewness      -.0133579
99%    15nov2021      17nov2021       Kurtosis        1.78873

                       covid_vacc_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    11dec2020      09dec2020
 5%    20dec2020      09dec2020
10%    31dec2020      09dec2020       Obs              15,000
25%    02feb2021      09dec2020       Sum of Wgt.      15,000

50%    29mar2021                      Mean          28mar2021
                        Largest       Std. Dev.      63.48382
75%    23may2021      16jul2021
90%    24jun2021      16jul2021       Variance       4030.195
95%    06jul2021      16jul2021       Skewness       .0037558
99%    14jul2021      16jul2021       Kurtosis       1.797833

                 covid_vacc_second_dose_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    09dec2020      09dec2020
 5%    12dec2020      09dec2020
10%    16dec2020      09dec2020       Obs               5,990
25%    28dec2020      09dec2020       Sum of Wgt.       5,990

50%    18jan2021                      Mean          18jan2021
                        Largest       Std. Dev.      24.10139
75%    08feb2021      01mar2021
90%    21feb2021      01mar2021       Variance       580.8768
95%    25feb2021      01mar2021       Skewness       .0191917
99%    01mar2021      01mar2021       Kurtosis       1.783382

                covid_admission_primary_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%        22272          22269
 5%        22286          22269
10%        22303          22269       Obs               6,883
25%        22352          22269       Sum of Wgt.       6,883

50%        22432                      Mean           22433.38
                        Largest       Std. Dev.      95.08108
75%        22514          22601
90%        22567          22601       Variance       9040.412
95%        22585          22601       Skewness       .0295205
99%        22598          22601       Kurtosis       1.834755

                covid_primary_care_codes_only
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    06jan2021      21dec2020
10%    23jan2021      21dec2020       Obs              28,500
25%    13mar2021      21dec2020       Sum of Wgt.      28,500

50%    05jun2021                      Mean          04jun2021
                        Largest       Std. Dev.      95.95905
75%    26aug2021      17nov2021
90%    16oct2021      17nov2021       Variance       9208.139
95%    01nov2021      17nov2021       Skewness      -.0018138
99%    14nov2021      17nov2021       Kurtosis       1.796792

. 
. 
. /*Flag earliest date under18s vaccinated*/
. gen under18vacc_temp=covid_vacc_date if age<18
(26,804 missing values generated)

. bysort household_id: egen under18vacc=min(under18vacc_temp)
(1441 missing values generated)

. format under18vacc* %td

. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(15,437 missing values generated)

. replace male = 0 if sex == "F"
(15,437 real changes made)

. 
. * Ethnicity 
. replace ethnicity = .u if ethnicity == .
(2,999 real changes made, 2,999 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(29,990 missing values generated)

. replace stp = sum(stp)
(29,999 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(30,000 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 30000 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age 18/29.9999 = 1 /// 
>                    30/39.9999 = 2 /// 
>            40/49.9999 = 3 ///
>                    50/59.9999 = 4 ///
>                60/69.9999 = 5 ///
>                    70/79.9999 = 6 ///
>                    80/max = 7, gen(agegroup) 
(23590 differences between age and agegroup)

. 
. label define agegroup   1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Create binary age (for age stratification)
. recode age min/65.999999999 = 0 ///
>            66/max = 1, gen(age66)
(29665 differences between age and age66)

. 
. * Check there are no missing ages
. assert age < .

. assert agegroup < .

. assert age66 < .

. 
. 
. /* APPLY HH level INCLUSION/EXCLUIONS========================================
> ==========*/ 
. 
. noi di "DROP if HH ID==0"
DROP if HH ID==0

. count if household_id==0
  0

. drop if household_id==0
(0 observations deleted)

. count
  30,000

. 
. drop if care_home_type!="U"
(929 observations deleted)

. count
  29,071

. 
. noi di "DROP HH>=10 persons:"
DROP HH>=10 persons:

. sum household_size, d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              29,071
25%            2              0       Sum of Wgt.      29,071

50%            3                      Mean           2.504214
                        Largest       Std. Dev.      1.038662
75%            3              6
90%            4              6       Variance       1.078818
95%            4              6       Skewness       .0338061
99%            5              7       Kurtosis       2.938707

. drop if household_size>=10
(0 observations deleted)

. count
  29,071

. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. recode age .=9
(age: 0 changes made)

. recode age .u=9
(age: 0 changes made)

. bysort household_id: egen age_drop=max(age)

. drop if age_drop==9
(0 observations deleted)

. count
  29,071

. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. ***KIDS_CAT5 (5 categories)
. *Identify kids under 5/5-11/12-18
. gen no_of_kids=1 if age<5
(27,355 missing values generated)

. recode no_of_kids .=2 if age<12
(no_of_kids: 2542 changes made)

. recode no_of_kids .=3 if age<18 
(no_of_kids: 1958 changes made)

. 
. *Make seperate files with only kids and household number
. preserve

. keep if age<18
(22,855 observations deleted)

. keep household_id no_of_kids

. *Drop duplicates (i.e. for hh with kids of same age, keep only one)
. duplicates drop

Duplicates in terms of all variables

(3,981 observations deleted)

. *If a hh has >1 record, there must be mixed ages in it: flag these as categor
> y 4
. bysort household_id: replace no_of_kids=4 if _N>1
(2,022 real changes made)

. duplicates drop

Duplicates in terms of all variables

(1,269 observations deleted)

. rename no_of_kids kids_cat5

. save kids_mixed_category, replace
(note: file kids_mixed_category.dta not found)
file kids_mixed_category.dta saved

. restore

. 
. *merge in kids identifier
. merge m:1 household_id using kids_mixed_category, nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                           652
        from master                       652  
        from using                          0  

    matched                            28,419  
    -----------------------------------------

. 
. *label variable
. lab define   kids_cat5 0 none  1 "only <5 years" ///
> 2 "only 5-11" 3 "12-<18" 4 "mixed"

. lab val kids_cat5 kids_cat5

. recode kids_cat5 .=0
(kids_cat5: 652 changes made)

. tab kids_cat5

    kids_cat5 |      Freq.     Percent        Cum.
--------------+-----------------------------------
         none |        652        2.24        2.24
only <5 years |        522        1.80        4.04
    only 5-11 |        558        1.92        5.96
       12-<18 |        304        1.05        7.00
        mixed |     27,035       93.00      100.00
--------------+-----------------------------------
        Total |     29,071      100.00

. drop no_of_kids

. 
. ***KIDS_CAT4 (4 categories)
. *Identify kids under 0-11/12-18
. gen no_of_kids=1 if age<12
(24,813 missing values generated)

. recode no_of_kids .=2 if age<18 
(no_of_kids: 1958 changes made)

. 
. *Make seperate files with only kids and household number
. preserve

. keep if age<18
(22,855 observations deleted)

. keep household_id no_of_kids

. *Drop duplicates (i.e. for hh with kids of same age, keep only one)
. duplicates drop

Duplicates in terms of all variables

(4,574 observations deleted)

. *If a hh has >1 record, there must be mixed ages in it: flag these as categor
> y 4
. bysort household_id: replace no_of_kids=3 if _N>1
(1,352 real changes made)

. duplicates drop

Duplicates in terms of all variables

(676 observations deleted)

. rename no_of_kids kids_cat4

. list in 1/100

     +---------------------+
     | househ~d   kids_c~4 |
     |---------------------|
  1. |      274          1 |
  2. |      319          1 |
  3. |      345          1 |
  4. |      361          2 |
  5. |      374          2 |
     |---------------------|
  6. |      380          2 |
  7. |      394          1 |
  8. |      395          1 |
  9. |      396          1 |
 10. |      399          3 |
     |---------------------|
 11. |      408          1 |
 12. |      412          1 |
 13. |      416          1 |
 14. |      418          2 |
 15. |      423          2 |
     |---------------------|
 16. |      430          1 |
 17. |      433          2 |
 18. |      437          2 |
 19. |      439          2 |
 20. |      445          1 |
     |---------------------|
 21. |      446          2 |
 22. |      448          2 |
 23. |      452          1 |
 24. |      461          1 |
 25. |      462          1 |
     |---------------------|
 26. |      463          1 |
 27. |      466          1 |
 28. |      472          2 |
 29. |      473          1 |
 30. |      474          1 |
     |---------------------|
 31. |      475          1 |
 32. |      476          1 |
 33. |      479          1 |
 34. |      489          1 |
 35. |      496          1 |
     |---------------------|
 36. |      503          1 |
 37. |      507          1 |
 38. |      510          1 |
 39. |      512          3 |
 40. |      513          2 |
     |---------------------|
 41. |      514          2 |
 42. |      515          1 |
 43. |      518          2 |
 44. |      519          1 |
 45. |      520          1 |
     |---------------------|
 46. |      522          1 |
 47. |      523          2 |
 48. |      524          3 |
 49. |      525          1 |
 50. |      526          1 |
     |---------------------|
 51. |      527          1 |
 52. |      529          1 |
 53. |      531          1 |
 54. |      533          2 |
 55. |      535          1 |
     |---------------------|
 56. |      536          1 |
 57. |      539          3 |
 58. |      540          1 |
 59. |      545          2 |
 60. |      546          2 |
     |---------------------|
 61. |      548          1 |
 62. |      549          1 |
 63. |      551          1 |
 64. |      553          3 |
 65. |      555          1 |
     |---------------------|
 66. |      556          1 |
 67. |      557          1 |
 68. |      558          1 |
 69. |      559          3 |
 70. |      560          1 |
     |---------------------|
 71. |      562          1 |
 72. |      563          1 |
 73. |      566          1 |
 74. |      569          1 |
 75. |      570          1 |
     |---------------------|
 76. |      571          1 |
 77. |      572          1 |
 78. |      574          1 |
 79. |      575          3 |
 80. |      577          1 |
     |---------------------|
 81. |      578          1 |
 82. |      579          2 |
 83. |      580          3 |
 84. |      581          2 |
 85. |      582          1 |
     |---------------------|
 86. |      583          3 |
 87. |      585          3 |
 88. |      586          1 |
 89. |      587          1 |
 90. |      588          3 |
     |---------------------|
 91. |      590          3 |
 92. |      591          3 |
 93. |      592          3 |
 94. |      593          1 |
 95. |      594          1 |
     |---------------------|
 96. |      595          1 |
 97. |      598          3 |
 98. |      599          1 |
 99. |      601          1 |
100. |      602          2 |
     +---------------------+

. save kids_mixed_category, replace
file kids_mixed_category.dta saved

. restore

. 
. *merge in kids identifier
. merge m:1 household_id using kids_mixed_category, nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                           652
        from master                       652  
        from using                          0  

    matched                            28,419  
    -----------------------------------------

. 
. *label variable
. lab define   kids_cat4 0 none  1 "only <12 years" ///
> 2 "only 12-18" ///
> 3 "mixed"

. lab val kids_cat4 kids_cat4

. recode kids_cat4 .=0
(kids_cat4: 652 changes made)

. tab kids_cat4

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        652        2.24        2.24
only <12 years |      2,728        9.38       11.63
    only 12-18 |        304        1.05       12.67
         mixed |     25,387       87.33      100.00
---------------+-----------------------------------
         Total |     29,071      100.00

. 
. *Dose-response exposure: identify number of kids in hh where there are ONLY u
> nder 11 yr olds
. bysort household_id: egen number_kids=sum(no_of_kids) if kids_cat4==1
(26343 missing values generated)

. 
. gen gp_number_kids=number_kids
(26,343 missing values generated)

. recode gp_number_kids 4/max=4
(gp_number_kids: 992 changes made)

. 
. lab var gp_number_kids "Number kids under 12 years in hh"

. lab define   gp_number_kids 0 none ///
> 1 "1 child <12" ///
> 2 "2 children <12" ///
> 3 "3 children <12" ///
> 4 "4+ children <12"

. lab val gp_number_kids gp_number_kids

. 
. tab kids_cat4 

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        652        2.24        2.24
only <12 years |      2,728        9.38       11.63
    only 12-18 |        304        1.05       12.67
         mixed |     25,387       87.33      100.00
---------------+-----------------------------------
         Total |     29,071      100.00

. tab kids_cat5

    kids_cat5 |      Freq.     Percent        Cum.
--------------+-----------------------------------
         none |        652        2.24        2.24
only <5 years |        522        1.80        4.04
    only 5-11 |        558        1.92        5.96
       12-<18 |        304        1.05        7.00
        mixed |     27,035       93.00      100.00
--------------+-----------------------------------
        Total |     29,071      100.00

. tab kids_cat*

              |                  kids_cat4
    kids_cat5 |      none  only <12   only 12-1      mixed |     Total
--------------+--------------------------------------------+----------
         none |       652          0          0          0 |       652 
only <5 years |         0        522          0          0 |       522 
    only 5-11 |         0        558          0          0 |       558 
       12-<18 |         0          0        304          0 |       304 
        mixed |         0      1,648          0     25,387 |    27,035 
--------------+--------------------------------------------+----------
        Total |       652      2,728        304     25,387 |    29,071 

. 
. 
. /* DROP ALL KIDS, AS HH COMPOSITION VARS ARE NOW MADE */
. drop if age<18
(6,216 observations deleted)

. 
. *Total number adults in household (to check hh size)
. bysort household_id: gen tot_adults_hh=_N

. recode tot_adults_hh 3/max=3
(tot_adults_hh: 22406 changes made)

. 
. tab kids_cat4

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        652        2.85        2.85
only <12 years |      2,185        9.56       12.41
    only 12-18 |        227        0.99       13.41
         mixed |     19,791       86.59      100.00
---------------+-----------------------------------
         Total |     22,855      100.00

. tab gp_num if kids_cat4==1

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |        494       22.61       22.61
 2 children <12 |        432       19.77       42.38
 3 children <12 |        231       10.57       52.95
4+ children <12 |      1,028       47.05      100.00
----------------+-----------------------------------
          Total |      2,185      100.00

. 
. erase kids_mixed_category.dta

. 
. /* SET FU DATES==============================================================
> =*/ 
. * Censoring dates for each outcome (largely, last date outcome data available
> )
. *****NEEDS UPDATING WHEN INFO AVAILABLE*******************
. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. rename dereg_date_date                                          dereg_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes_date  ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 dialysis                     
>                    ///
>                                                 kidney_transplant            
>            ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         
. }

. 
. 
. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(1,146 real changes made, 1,146 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(3,636 real changes made, 3,636 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(1,146 missing values generated)

. gen bmi_age = age - bmi_time
(1,146 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(364 real changes made, 364 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(4,000 real changes made, 4,000 to missing)

. replace bmi_measured = . if bmi == . 
(5,146 real changes made, 5,146 to missing)

. 
. gen     bmicat = .
(22,855 missing values generated)

. recode  bmicat . = 1 if bmi < 18.5
(bmicat: 2070 changes made)

. recode  bmicat . = 2 if bmi < 25
(bmicat: 5134 changes made)

. recode  bmicat . = 3 if bmi < 30
(bmicat: 4118 changes made)

. recode  bmicat . = 4 if bmi < 35
(bmicat: 3196 changes made)

. recode  bmicat . = 5 if bmi < 40
(bmicat: 1913 changes made)

. recode  bmicat . = 6 if bmi < .
(bmicat: 1278 changes made)

. replace bmicat = .u if bmi >= .
(5,146 real changes made, 5,146 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Create less  granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(20785 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(21,915 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(450 real changes made)

. replace smoke = 3  if smoking_status == "S"
(2,730 real changes made)

. replace smoke = .u if smoking_status == "M"
(451 real changes made, 451 to missing)

. replace smoke = .u if smoking_status == "" 
(18,284 real changes made, 18,284 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(18735 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(cancer_haem_date, d(1/1/1900), d(1/2/2
> 015))
(18,800 missing values generated)

. replace cancer_haem_cat = 3 if inrange(cancer_haem_date, d(1/2/2015), d(1/2/2
> 019))
(349 real changes made)

. replace cancer_haem_cat = 2 if inrange(cancer_haem_date, d(1/2/2019), d(1/2/2
> 020))
(89 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 18362 changes made)

. label values cancer_haem_cat cancer

. 
. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(cancer_nonhaem_date,  d(1/1/1900), d
> (1/2/2015)) 
(18,838 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(cancer_nonhaem_date,  d(1/2/2015), d
> (1/2/2019))
(376 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(cancer_nonhaem_date,  d(1/2/2019), d
> (1/2/2020)) 
(113 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 18349 changes made)

. label values cancer_exhaem_cat cancer

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(18,275 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), 
> date("$indexdate", "DMY"))

. 
. egen other_immuno = rowmax(temp1 temp2)

. drop temp1 temp2 

. order other_immuno, after(temp_immunodef)

. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(16,665 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(3,970 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(9,449 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(3,844 real changes made)

. replace bpcat = .u if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(2,267 real changes made, 2,267 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" .u "Unknown"

. label values bpcat bpcat

. 
. recode bpcat .u=1, gen(bpcat_nomiss)
(2267 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 3793 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(1,230 real changes made, 1,230 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(1,230 missing values generated)

. 
. gen min=.
(22,855 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(11,123 real changes made)

. replace min = SCr_adj/0.9 if male==1
(10,502 real changes made)

. replace min = min^-0.329  if male==0
(11,123 real changes made)

. replace min = min^-0.411  if male==1
(10,502 real changes made)

. replace min = 1 if min<1
(6,078 real changes made)

. 
. gen max=.
(22,855 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(11,123 real changes made)

. replace max=SCr_adj/0.9 if male==1
(10,502 real changes made)

. replace max=max^-1.209
(21,625 real changes made)

. replace max=1 if max>1
(16,777 real changes made)

. 
. gen egfr=min*max*141
(1,230 missing values generated)

. replace egfr=egfr*(0.993^age)
(21,625 real changes made)

. replace egfr=egfr*1.018 if male==0
(11,123 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(1230 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(21625 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. *label var ckd "CKD stage calc without eth"
. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
.         
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(21369 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(1,230 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. lab var  reduced "Reduced kidney function"

. 
. 
. /*ESDR: dialysis or kidney transplant*/
. gen esrd=1 if dialysis==1 | kidney_transplant==1
(14,592 missing values generated)

. recode esrd .=0
(esrd: 14592 changes made)

. 
. 
. 
. ***************************
. /* DM / Hb1AC */
. ***************************
. 
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(1,262 real changes made, 1,262 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(1,618 real changes made, 1,618 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |     21,593    5.030451    1.957254   .0046731   12.88052
hba1c_mmol~l |     21,237    41.18034    18.84409   .0081016   117.7825

. gen     hba1c_pct = hba1c_percentage 
(1,262 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(21,237 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(22,771 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(22,173 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(4,568 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(492 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(17,113 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |    17,113          0          0          0 |    17,113 
         1 |         0        682          0          0 |       682 
         2 |         0          0      4,568          0 |     4,568 
         3 |         0          0          0        492 |       492 
-----------+--------------------------------------------+----------
     Total |    17,113        682      4,568        492 |    22,855 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. /*Open safely diabetes codes with exeter algorithm
> gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
> replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
> replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
> label values  dm_type_exeter_os dm_type*/
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(8,433 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(4,130 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(1,466 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(1,764 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(989 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |     14,422       63.33       63.33
  >=6.5-7.4 |      4,130       18.14       81.47
  >=7.5-7.9 |      1,466        6.44       87.91
    >=8-8.9 |      1,764        7.75       95.66
        >=9 |        989        4.34      100.00
------------+-----------------------------------
      Total |     22,771      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(4,303 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(4,219 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,552       81.17       81.17
          1 |      4,219       18.46       99.63
          . |         84        0.37      100.00
------------+-----------------------------------
      Total |     22,855      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0 | dm_type==.
(5,742 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(567 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(114 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(3,720 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(824 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(25 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     17,113       74.88       74.88
  T1DM, controlled |        567        2.48       77.36
T1DM, uncontrolled |        114        0.50       77.86
  T2DM, controlled |      3,720       16.28       94.13
T2DM, uncontrolled |        824        3.61       97.74
Diabetes, no HbA1c |         25        0.11       97.85
                 . |        492        2.15      100.00
-------------------+-----------------------------------
             Total |     22,855      100.00

. recode diabcat .=1
(diabcat: 492 changes made)

. 
. 
. 
. /*  Asthma  */
. 
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3
(asthmacat: 4547 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. /*  Probable shielding  */
. gen shield=1 if esrd==1 | other_transplant==1 | asthmacat==2 | asthmacat==3 |
>  ///
> chronic_respiratory_disease==1 | cancer_haem==1 | cancer_nonhaem==1 | ///
> asplenia==1 | other_immuno==1
(3,532 missing values generated)

. recode shield .=0
(shield: 3532 changes made)

. 
. /*Any comorbidity*/
. 
. gen anycomorb=1 if chronic_respiratory_disease==1 | ///
>                     asthmacat==2 | asthmacat==3 | ///
>                                         chronic_cardiac_disease==1  | ///
>                                         diabcat==2 | diabcat==3 | diabcat==4 
> | diabcat==5 | diabcat==6 | ///
>                                         cancer_haem==1 | cancer_nonhaem==1 | 
> ///
>                                         esrd==1 | ///
>                                         chronic_liver_disease==1 | ///
>                                         stroke_dementia==1 | ///
>                                         other_neuro==1 | ///
>                                         other_transplant==1 | ///
>                                         asplenia==1 | ///
>                                         ra_sle_psoriasis==1 | ///
>                                         other_immuno==1 
(887 missing values generated)

. recode anycomorb .=0
(anycomorb: 887 changes made)

. tab anyco

  anycomorb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        887        3.88        3.88
          1 |     21,968       96.12      100.00
------------+-----------------------------------
      Total |     22,855      100.00

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma categ
> ory"

. label var egfr_cat                                              "Calculated e
> GFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haem
> atological cancer"

. label var cancer_exhaem_cat                                             "Non-
> haematological cancer"

. label var kidney_transplant                                             "Kidn
> ey transplant"     

. label var other_transplant                                              "Othe
> r solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (co
> mbination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"               
>    

. label var stroke_dementia                           "Stroke or dementia"     
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosupp
> ression"

. lab var temp_immunodef                                  "Temporary immunosupp
> ression"

. lab var esrd                                                    "End-stage re
> nal disease"

. 
. lab var covid_vacc_date                         "First vacc date"

. lab var covid_vacc_second_dose_date "Second vacc date"

. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
. gen enter_date = date("$indexdate", "DMY")

. gen study_end_censor =date("$study_end_censor", "DMY")

. 
. * Format the dates
. format  enter_date                                      ///
>                 study_end_censor  

  variable name     display format
  --------------------------------
  enter_date        %9.0g
  study_end_censor  %9.0g
  --------------------------------

.                 
.                         /****   Outcome definitions   ****/
. 
. * Date of Covid death in ONS
. gen died_date_onscovid = died_date_ons if died_ons_covid_flag_any == 1
(11,812 missing values generated)

. gen died_date_onscovid_part1 = died_date_ons if died_ons_covid_flag_underlyin
> g == 1
(11,899 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen died_date_onsnoncovid = died_date_ons if died_ons_covid_flag_any != 1 
(15,591 missing values generated)

. 
. *Date probable covid in TPP
. rename covid_tpp_probable date_covid_tpp_prob

. 
. format died_date_ons %td

. format died_date_onscovid %td 

. format died_date_onsnoncovid %td

. format covid_icu_date %td 

. format died_date_onscovid_part1 %td

. format covid_admission_primary_date %td

. 
. * Binary indicators (0/1) for outcomes
. gen covid_tpp_prob = (date_covid_tpp_prob < .)

. gen non_covid_death = (died_date_onsnoncovid < .)

. gen covid_death = (died_date_onscovid < .)

. gen covid_icu = (covid_icu_date < .)

. gen covidadmission = (covid_admission_primary_date < .)

. gen covid_death_part1 = (died_date_onscovid_part1 < .)

. 
.                                         /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: end study, death, or that outcom
> e)
. *gen stime_onscoviddeath = min(onscoviddeathcensor_date,                     
>            died_date_ons)
. gen stime_covid_death_part1     = min(study_end_censor   , died_date_onscovid
> _part1, died_date_ons, dereg_date)

. gen stime_covid_tpp_prob = min(study_end_censor   , died_date_ons, date_covid
> _tpp_prob, dereg_date)

. gen stime_non_covid_death = min(study_end_censor   , died_date_ons, died_date
> _onsnoncovid, dereg_date)

. gen stime_covid_death = min(study_end_censor   , died_date_ons, died_date_ons
> covid, dereg_date)

. gen stime_covid_icu = min(study_end_censor, died_date_ons, covid_icu_date, de
> reg_date)

. gen stime_covidadmission        = min(study_end_censor   , covid_admission_pr
> imary_date, died_date_ons, dereg_date)

. 
. * If outcome was after censoring occurred, set to zero
. replace covid_tpp_prob = 0 if (date_covid_tpp_prob > study_end_censor ) 
(2,410 real changes made)

. replace non_covid_death = 0 if (died_date_onsnoncovid > study_end_censor )
(718 real changes made)

. replace covid_death = 0 if (died_date_onscovid > study_end_censor )
(1,199 real changes made)

. replace covid_icu = 0 if (covid_icu_date > study_end_censor)
(1,841 real changes made)

. replace covidadmission  = 0 if (covid_admission_primary_date > study_end_cens
> or  | covid_admission_primary_date > died_date_ons) 
(2,208 real changes made)

. replace covid_death_part1 = 0 if (died_date_onscovid_part1 > study_end_censor
>  )
(1,100 real changes made)

. 
. * If outcome was after censoring occurred, set date to missing
. replace date_covid_tpp_prob = . if (date_covid_tpp_prob > study_end_censor ) 
(2,410 real changes made, 2,410 to missing)

. replace died_date_onsnoncovid = . if (died_date_onsnoncovid > study_end_censo
> r )
(718 real changes made, 718 to missing)

. replace died_date_onscovid = . if (died_date_onscovid > study_end_censor )
(1,199 real changes made, 1,199 to missing)

. replace covid_icu_date = . if (covid_icu_date > study_end_censor)
(1,841 real changes made, 1,841 to missing)

. replace covid_admission_primary_date    = . if (covid_admission_primary_date 
> > study_end_censor  | covid_admission_primary_date > died_date_ons) 
(2,208 real changes made, 2,208 to missing)

. replace died_date_onscovid_part1 = . if (died_date_onscovid_part1 > study_end
> _censor )
(1,100 real changes made, 1,100 to missing)

. 
. 
. * Format date variables
. format  stime* %td  

. gen positive_SGSS = (positive_covid_test_ever < .)

. gen covid_primary_care_codes = (covid_primary_care_codes_only < .)

. rename positive_covid_test_ever date_positive_SGSS

. rename covid_primary_care_codes_only date_covid_primary_care_codes

. replace covid_primary_care_codes = 0 if (date_covid_primary_care_codes > stud
> y_end_censor )
(2,270 real changes made)

. replace positive_SGSS = 0 if (date_positive_SGSS > study_end_censor )
(2,978 real changes made)

. 
. replace date_covid_primary_care_codes = . if (date_covid_primary_care_codes >
>  study_end_censor )
(2,270 real changes made, 2,270 to missing)

. replace date_positive_SGSS = . if (date_positive_SGSS > study_end_censor )
(2,978 real changes made, 2,978 to missing)

. 
. 
. gen reported_infection_source=1 if covid_tpp_prob==1
(3,300 missing values generated)

. recode reported_infection_source 1=2 if date_covid_tpp_prob== covid_tpp_codes
> _test 
(reported_infection_source: 37 changes made)

. recode reported_infection_source 1=3 if date_covid_tpp_prob==covid_tpp_codes_
> seq 
(reported_infection_source: 34 changes made)

. recode reported_infection_source 1=4 if date_covid_tpp_prob==covid_tpp_codes_
> clinical 
(reported_infection_source: 29 changes made)

. lab define reported_infection_source 1 SGSS 2 test_code 3 sequalae_code 4 dia
> gnosis_code

. lab val reported_infection_source reported_infection_source

. 
. 
. 
. 
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  number_kids "Number of children aged 1-<12 years in household"

. label var  household_size "Number people in household"

. label var  household_id "Household ID"

. 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age66                                         "66 years and older"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Evidence of obesity 
> (4 categories)"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var ethnicity                                     "Ethnicity"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. lab var tot_adults_hh                           "Total number adults in hh"

. lab var kids_cat4                                       "Exposure (v2) with 4
> -cats"

. lab var kids_cat5                                        "Exposure (v3) with 
> 5-cats"

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma categ
> ory"

. label var egfr_cat                                              "Calculated e
> GFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haem
> atological cancer"

. label var cancer_exhaem_cat                                             "Non-
> haematological cancer"

. label var kidney_transplant                                             "Kidn
> ey transplant"     

. label var other_transplant                                              "Othe
> r solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (co
> mbination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"               
>    

. label var stroke_dementia                           "Stroke or dementia"     
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosupp
> ression"

. lab var temp_immunodef                                  "Temporary immunosupp
> ression"

. lab var esrd                                                    "End-stage re
> nal disease"

. lab var anycomorb                                               "Any comorbid
> ity"

. 
. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_haem_date                                      "Haem cancer 
> Date"

. label var cancer_nonhaem_date                           "Non-haem cancer Date
> "

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date              "Neurological disease  Date"

. label var stroke_dementia_date                      "Stroke or dementia date"
>                                                    

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var perm_immunodef_date                             "Permanent immunosupp
> ression date"

. lab var temp_immunodef_date                             "Temporary immunosupp
> ression date"

. label var kidney_transplant_date                                             
>    "Kidney transplant"     

. label var other_transplant_date                                         "Othe
> r solid organ transplant"

. label var asplenia_date                                                 "Aspl
> enia date"

. lab var  bphigh "non-missing indicator of known high blood pressure"

. lab var bpcat "Blood pressure four levels, non-missing"

. lab var htdiag_or_highbp "High blood pressure or hypertension diagnosis"

. lab var shield "Probable shielding"

. 
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. label var study_end_censor                      "Date of admin censoring for 
> outcomes"

. 
. label var  covid_tpp_prob                               "Failure/censoring in
> dicator for outcome: covid prob case"

. label var  non_covid_death                              "Failure/censoring in
> dicator for outcome: non-covid death"

. label var  covid_death                              "Failure/censoring indica
> tor for outcome: covid death"

. label var  covid_icu                                "Failure/censoring indica
> tor for outcome: covid icu"

. lab var covidadmission                                  "Failure/censoring in
> dicator for outcome: covid SUS admission"

. lab var covid_death_part1                               "Failure/censoring in
> dicator for outcome: covid death part1"

. lab var  positive_SGSS          "Indicator positive covid test"

. lab var  covid_primary_care_codes               "Indicator positive primary c
> are code COVID infection"

. lab var reported_infection_source               "Reported Infection Source"

. 
. rename died_date_onsnoncovid date_non_covid_death

. rename died_date_onscovid date_covid_death

. rename covid_icu_date date_covid_icu

. rename covid_admission_primary_date date_covidadmission

. label var date_covid_tpp_prob                   "Date of probable COVID-19 cl
> inical infection"

. label var date_non_covid_death                  "Date of ONS non-COVID-19 Dea
> th"

. label var  date_covid_death                     "Date of ONS COVID-19 Death"

. lab var date_covid_icu                                  "Date of admission to
>  ICU for COVID-19" 

. lab var date_covidadmission                     "Date of admission to hospita
> l for COVID-19" 

. label var  died_date_onscovid_part1                     "Date of ONS COVID De
> ath part1"

. lab var  date_positive_SGSS             "Date of positive SGSS test"

. lab var   date_covid_primary_care_codes "Date of COVID-19 primary care code"

. 
. * Survival times
. label var  stime_covid_tpp_prob                         "Survival tme (date);
>  outcome "

. label var  stime_non_covid_death                        "Survival tme (date);
>  outcome non_covid_death   "

. label var  stime_covid_death                            "Survival time (date)
> ; outcome covid death"

. label var  stime_covid_icu                                      "Survival tim
> e (date); outcome covid icu"

. label var  stime_covidadmission                         "Survival time (date)
> ; outcome covid hosp admission"

. label var  stime_covid_death_part1                              "Survival tim
> e (date); outcome covid death part1"

. 
. *Key DATES
. label var   died_date_ons                               "Date death ONS"

. label var  has_12_m_follow_up                   "Has 12 months follow-up"

. lab var  dereg_date                                             "Date deregis
> tration from practice"

. lab var under18vacc                                             "Date first c
> hild in hh vaccinated"

. 
. 
. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
ethnicity_~e  hba1c_mmol~e  sgtf          asthmacat     bmi_age
bmi_measured  hba1c_per~te  lft_pcr       diabetes      SCr_adj
bp_sys_dat~e  cancer_haem   sex           covid_tpp_~l  min
bp_sys_dat~d  cancer_non~m  care_home_~e  covid_tpp_~t  max
bp_dias_da~e  esrf_date     bp_sys        covid_tpp_~q  hba1c_pct
bp_dias_da~d  esrf          bp_dias       covid_admi~e  dm_type
crea~te_date  dialysis_d~e  creatinine    under18vac~p  hba1ccat
crea~ne_date  dialysis      diabetes_t~e  age_drop      hba1c75
smoki~e_date  died_ons_c~y  hba1c_mmol~l  no_of_kids
smoki~s_date  died_ons_c~g  hba1c_per~ge  bmi_time

. drop `r(varlist)'

. drop covid_admission_primary_diagnosi   

. 
.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. *************TEMP DROP TO INVESTIGATE ASSOCIATIONS MORE EASILY***************
> ***
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. count
  22,855

. 
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if died_date_ons <=enter_date
(0 observations deleted)

. count
  22,855

. 
. noi di "DROP IF COVID IN TPP BEFORE INDEX"
DROP IF COVID IN TPP BEFORE INDEX

. drop if date_covid_tpp_prob <=enter_date
(0 observations deleted)

. count
  22,855

. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. recode imd .=9
(imd: 0 changes made)

. recode imd .u=9
(imd: 0 changes made)

. drop if imd==9
(0 observations deleted)

. count
  22,855

. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. recode male .=9
(male: 0 changes made)

. recode male .u=9
(male: 0 changes made)

. drop if male==9
(0 observations deleted)

. count   
  22,855

.         
. ***************
. *  Save data  *
. ***************
. sort patient_id

. save $tempdir/analysis_dataset_with_missing_ethnicity, replace
(note: file tempdata/analysis_dataset_with_missing_ethnicity.dta not found)
file tempdata/analysis_dataset_with_missing_ethnicity.dta saved

. 
. noi di "DROP NO ETHNICITY DATA"
DROP NO ETHNICITY DATA

. keep if ethnicity!=.u   
(2,292 observations deleted)

. 
. save $tempdir/analysis_dataset, replace
(note: file tempdata/analysis_dataset.dta not found)
file tempdata/analysis_dataset.dta saved

. 
. 
. 
. use  $tempdir/analysis_dataset, clear

. keep if age<=65
(4,527 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir/analysis_dataset_ageband_0, replace
(note: file tempdata/analysis_dataset_ageband_0.dta not found)
file tempdata/analysis_dataset_ageband_0.dta saved

. 
. 
. use  $tempdir/analysis_dataset, clear

. keep if age>65
(16,036 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir/analysis_dataset_ageband_1, replace
(note: file tempdata/analysis_dataset_ageband_1.dta not found)
file tempdata/analysis_dataset_ageband_1.dta saved

. 
. 
. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  3. * Save a version set on NON ONS covid death outcome
. stset stime_non_covid_death, fail(non_covid_death)                           
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  4. /*WEIGHTING - TO REDUCE TIME 
> set seed 30459820
> keep if _d==1|uniform()<.03
> gen pw = 1
> replace pw = (1/0.03) if _d==0
> stset stime_non_covid_death [pweight = pw],  fail(non_covid_death)           
>                    ///
>         id(patient_id) enter(enter_date) origin(enter_date)*/
. save "$tempdir/cr_create_analysis_dataset_STSET_non_covid_death_ageband_`x'.d
> ta", replace
  5.         
. /*no longer using composite outcome
> use $tempdir/analysis_dataset_ageband_`x', clear
> * Save a version set on covid death/icu  outcome
> stset stime_covid_death_icu, fail(covid_death_icu)                           
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
> save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_icu_ageband_`x'.d
> ta", replace
> */
. use $tempdir/analysis_dataset_ageband_`x', clear
  6. * Save a version set on covid icu  outcome only
. stset stime_covid_icu, fail(covid_icu)                          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7. save "$tempdir/cr_create_analysis_dataset_STSET_covid_icu_ageband_`x'.dta"
> , replace
  8. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  9. * Save a version set on covid death only
. stset stime_covid_death, fail(covid_death)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 10. save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_`x'.dt
> a", replace
 11. 
. /*this was created for investigation only
> use $tempdir/analysis_dataset_ageband_`x', clear
> * Save a version set on covid death only
> stset stime_covid_death_part1, fail(covid_death_part1)                       
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
> save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_part1_ageband_`x'
> .dta", replace
> */
. use $tempdir/analysis_dataset_ageband_`x', clear
 12. * Save a version set on probable covid
. stset stime_covid_tpp_prob, fail(covid_tpp_prob)                             
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 13. save "$tempdir/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'
> .dta", replace        
 14. 
. use $tempdir/analysis_dataset_ageband_`x', clear
 15. * Save a version set on hosp admission for covid
. stset stime_covidadmission, fail(covidadmission)                             
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 16. save "$tempdir/cr_create_analysis_dataset_STSET_covidadmission_ageband_`x'
> .dta", replace        
 17. 
. }

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,036  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,033  observations remaining, representing
     16,033  subjects
      4,643  failures in single-failure-per-subject data
  3,056,031  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_0
> .dta not found)
file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_0.dta sa
> ved

                id:  patient_id
     failure event:  covid_icu != 0 & covid_icu < .
obs. time interval:  (stime_covid_icu[_n-1], stime_covid_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,036  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,033  observations remaining, representing
     16,033  subjects
     11,496  failures in single-failure-per-subject data
  2,173,738  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_0.dta n
> ot found)
file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,036  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,033  observations remaining, representing
     16,033  subjects
      6,907  failures in single-failure-per-subject data
  3,056,031  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta
>  not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,036  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,033  observations remaining, representing
     16,033  subjects
     13,705  failures in single-failure-per-subject data
  2,005,758  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.dta sav
> ed

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,036  total observations
          9  observations end on or before enter()
------------------------------------------------------------------------------
     16,027  observations remaining, representing
     16,027  subjects
      2,085  failures in single-failure-per-subject data
  2,801,880  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_0.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_0.dta sav
> ed

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,527  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,527  observations remaining, representing
      4,527  subjects
      1,258  failures in single-failure-per-subject data
    873,221  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_1
> .dta not found)
file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_1.dta sa
> ved

                id:  patient_id
     failure event:  covid_icu != 0 & covid_icu < .
obs. time interval:  (stime_covid_icu[_n-1], stime_covid_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,527  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,527  observations remaining, representing
      4,527  subjects
      3,295  failures in single-failure-per-subject data
    609,652  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_1.dta n
> ot found)
file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,527  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,527  observations remaining, representing
      4,527  subjects
      1,949  failures in single-failure-per-subject data
    873,221  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta
>  not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,527  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,527  observations remaining, representing
      4,527  subjects
      3,875  failures in single-failure-per-subject data
    561,202  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.dta sav
> ed

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,527  total observations
          1  observation ends on or before enter()
------------------------------------------------------------------------------
      4,526  observations remaining, representing
      4,526  subjects
        636  failures in single-failure-per-subject data
    794,414  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_1.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_1.dta sav
> ed

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/01_cr_analysis_dataset.log
  log type:  text
 closed on:  17 Nov 2021, 09:51:36
-------------------------------------------------------------------------------
