-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_cr_analysis_dataset.log
  log type:  text
 opened on:  28 Oct 2021, 11:12:37

. 
. 
. *Import dataset into STATA
. import delimited "output/input", clear
(62 vars, 30,000 obs)

. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates and TPP case outcome dates are given with month only, so addi
> ng day 
> 15 to enable  them to be processed as dates                                  
>                                                      */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(29,795 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(1,254 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(124 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 dialysis                     
>                    ///
>                                                 kidney_transplant            
>            ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 dereg_date  ///
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable diabetes was str7 now str10
(30,000 real changes made)
(28,417 real changes made)
(28,417 missing values generated)
variable cancer_haem was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable cancer_nonhaem was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable dialysis was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable kidney_transplant was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable other_transplant was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable asplenia was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable chronic_liver_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable other_neuro was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable stroke_dementia was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable esrf was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable hypertension was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable bmi_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable bp_sys_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable bp_dias_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable creatinine_date was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable smoking_status_date was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable dereg_date was str7 now str10
(30,000 real changes made)
(29,910 real changes made)
(29,910 missing values generated)

. 
. * Recode to dates from the strings 
. foreach var of varlist covid_icu_date positive_covid_test       ///
> covid_tpp_codes_clinical covid_tpp_codes_test covid_tpp_codes_seq ///
> died_date_ons covid_admission_date covid_tpp_probable ///
> covid_vacc_date  covid_vacc_second_dose_date    {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td        
  7. }
(5,999 missing values generated)
(24,000 missing values generated)
(15,000 missing values generated)
(15,000 missing values generated)
(15,000 missing values generated)
(5,999 missing values generated)
(16,292 missing values generated)
(1,500 missing values generated)
(15,000 missing values generated)
(24,000 missing values generated)

. 
. *Amend vaccine dates
. replace covid_vacc_second_dose_date=. if covid_vacc_date==covid_vacc_second_d
> ose_date
(9 real changes made, 9 to missing)

. 
. gen covid_admission_primary_date = covid_admission_date ///
> if (covid_admission_primary_diagnosi == "U071"| covid_admission_primary_diagn
> osi == "U072")
(23,160 missing values generated)

. 
. gen  covid_primary_care_codes_only=covid_tpp_probable
(1,500 missing values generated)

. format covid_primary_care_codes_only %td

. replace covid_tpp_probable=positive_covid_test_ever if covid_tpp_probable==. 
> & covid_tpp_probable>positive_covid_test
(324 real changes made)

. 
. 
. /*Tab all variables in initial extract*/
. sum, d f

                       dereg_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15dec2020      15dec2020
 5%    15dec2020      15dec2020
10%    15dec2020      15dec2020       Obs                  90
25%    15feb2021      15dec2020       Sum of Wgt.          90

50%    15may2021                      Mean          15may2021
                        Largest       Std. Dev.      104.3665
75%    15aug2021      15oct2021
90%    15oct2021      15oct2021       Variance       10892.37
95%    15oct2021      15oct2021       Skewness      -.0106972
99%    15oct2021      15oct2021       Kurtosis       1.585192

                       ethnicity_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%         1970           1970
 5%         1972           1970
10%         1975           1970       Obs              27,001
25%         1982           1970       Sum of Wgt.      27,001

50%         1995                      Mean           1995.402
                        Largest       Std. Dev.      14.96757
75%         2008           2021
90%         2016           2021       Variance       224.0282
95%         2019           2021       Skewness       .0009227
99%         2021           2021       Kurtosis       1.801287

                   bmi_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2015      15feb2015
 5%    15jun2015      15feb2015
10%    15oct2015      15feb2015       Obs              28,500
25%    15oct2016      15feb2015       Sum of Wgt.      28,500

50%    15jun2018                      Mean          10jun2018
                        Largest       Std. Dev.      706.7749
75%    15feb2020      15oct2021
90%    15feb2021      15oct2021       Variance       499530.7
95%    15jun2021      15oct2021       Skewness      -.0006648
99%    15oct2021      15oct2021       Kurtosis       1.799459

                  bp_sys_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jul1972      15jan1970
10%    15feb1975      15jan1970       Obs              28,500
25%    15oct1982      15jan1970       Sum of Wgt.      28,500

50%    15sep1995                      Mean          31jul1995
                        Largest       Std. Dev.      5388.713
75%    15may2008      15dec2020
90%    15jan2016      15dec2020       Variance       2.90e+07
95%    15may2018      15dec2020       Skewness      -.0072535
99%    15jun2020      15dec2020       Kurtosis       1.794456

                 bp_dias_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jul1972      15jan1970
10%    15feb1975      15jan1970       Obs              28,500
25%    15sep1982      15jan1970       Sum of Wgt.      28,500

50%    15may1995                      Mean          14jun1995
                        Largest       Std. Dev.      5367.865
75%    15mar2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.88e+07
95%    15may2018      15dec2020       Skewness       .0003937
99%    15jun2020      15dec2020       Kurtosis       1.799405

                    creatinine_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15mar2019      15mar2019
 5%    15apr2019      15mar2019
10%    15may2019      15mar2019       Obs              28,500
25%    15aug2019      15mar2019       Sum of Wgt.      28,500

50%    15jan2020                      Mean          23jan2020
                        Largest       Std. Dev.      191.0979
75%    15jul2020      15dec2020
90%    15oct2020      15dec2020       Variance       36518.41
95%    15nov2020      15dec2020       Skewness       .0039274
99%    15dec2020      15dec2020       Kurtosis       1.795723

                  smoking_status_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jul1972      15jan1970
10%    15jan1975      15jan1970       Obs              28,500
25%    15oct1982      15jan1970       Sum of Wgt.      28,500

50%    15jul1995                      Mean          17jun1995
                        Largest       Std. Dev.      5359.659
75%    15feb2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.87e+07
95%    15may2018      15dec2020       Skewness      -.0049472
99%    15jun2020      15dec2020       Kurtosis       1.808512

              chronic_respiratory_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jun1972      15jan1970
10%    15mar1975      15jan1970       Obs               6,000
25%    15jan1983      15jan1970       Sum of Wgt.       6,000

50%    15jul1995                      Mean          17aug1995
                        Largest       Std. Dev.      5371.377
75%    15aug2008      15dec2020
90%    15sep2015      15dec2020       Variance       2.89e+07
95%    15may2018      15dec2020       Skewness      -.0115878
99%    15aug2020      15dec2020       Kurtosis       1.800986

                chronic_cardiac_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15may1972      15jan1970
10%    15mar1975      15jan1970       Obs               6,000
25%    15nov1982      15jan1970       Sum of Wgt.       6,000

50%    15oct1995                      Mean          22sep1995
                        Largest       Std. Dev.      5380.313
75%    15jun2008      15dec2020
90%    15jan2016      15dec2020       Variance       2.89e+07
95%    15jun2018      15dec2020       Skewness      -.0224003
99%    15jul2020      15dec2020       Kurtosis       1.809749

                   hba1c_mmol_per_mol_date
-------------------------------------------------------------
no observations

                    hba1c_percentage_date
-------------------------------------------------------------
no observations

                      cancer_haem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15may1972      15jan1970
10%    15nov1974      15jan1970       Obs               6,000
25%    15sep1982      15jan1970       Sum of Wgt.       6,000

50%    15aug1995                      Mean          10may1995
                        Largest       Std. Dev.      5348.452
75%    15oct2007      15dec2020
90%    15sep2015      15dec2020       Variance       2.86e+07
95%    15may2018      15dec2020       Skewness      -.0054577
99%    30may2020      15dec2020       Kurtosis       1.817998

                     cancer_nonhaem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15may1972      15jan1970
10%    15nov1974      15jan1970       Obs               6,000
25%    30apr1982      15jan1970       Sum of Wgt.       6,000

50%    15oct1994                      Mean          12feb1995
                        Largest       Std. Dev.      5387.197
75%    15dec2007      15dec2020
90%    15sep2015      15dec2020       Variance       2.90e+07
95%    15mar2018      15dec2020       Skewness       .0275425
99%    15may2020      15dec2020       Kurtosis       1.779764

               permanent_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15may1972      15jan1970
10%    15nov1974      15jan1970       Obs               6,000
25%    15nov1982      15jan1970       Sum of Wgt.       6,000

50%    15sep1995                      Mean          01jul1995
                        Largest       Std. Dev.      5386.589
75%    15mar2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.90e+07
95%    15apr2018      15dec2020       Skewness      -.0177818
99%    15jun2020      15dec2020       Kurtosis       1.799273

                        asplenia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug1970      15jan1970
 5%    15jul1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    15oct1982      15jan1970       Sum of Wgt.       6,000

50%    15jan1995                      Mean          14mar1995
                        Largest       Std. Dev.      5359.884
75%    15oct2007      15oct2020
90%    15sep2015      15nov2020       Variance       2.87e+07
95%    15apr2018      15nov2020       Skewness       .0274775
99%    15apr2020      15nov2020       Kurtosis       1.811808

               temporary_immunodeficiency_date
-------------------------------------------------------------
no observations

                 chronic_liver_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jul1972      15jan1970
10%    15mar1975      15jan1970       Obs               6,000
25%    15sep1982      15jan1970       Sum of Wgt.       6,000

50%    15jul1995                      Mean          25jun1995
                        Largest       Std. Dev.      5375.421
75%    15apr2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.89e+07
95%    30apr2018      15dec2020       Skewness      -.0077284
99%    15may2020      15dec2020       Kurtosis       1.795795

                    stroke_dementia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15sep1972      15jan1970
10%    15may1975      15jan1970       Obs               6,000
25%    15sep1982      15jan1970       Sum of Wgt.       6,000

50%    30may1995                      Mean          06jun1995
                        Largest       Std. Dev.      5330.988
75%    15jan2008      15dec2020
90%    15sep2015      15dec2020       Variance       2.84e+07
95%    15mar2018      15dec2020       Skewness       .0123643
99%    15may2020      15dec2020       Kurtosis       1.798478

                      other_neuro_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    30jul1972      15jan1970
10%    15mar1975      15jan1970       Obs               6,000
25%    15apr1983      15jan1970       Sum of Wgt.       6,000

50%    15nov1995                      Mean          21oct1995
                        Largest       Std. Dev.      5408.868
75%    15sep2008      15dec2020
90%    15mar2016      15dec2020       Variance       2.93e+07
95%    30jun2018      15dec2020       Skewness      -.0190779
99%    15jun2020      15dec2020       Kurtosis       1.789351

                          esrf_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    30aug1970      15jan1970
 5%    15jun1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    15jun1982      15jan1970       Sum of Wgt.       6,000

50%    15jan1995                      Mean          12apr1995
                        Largest       Std. Dev.      5364.246
75%    15jan2008      15dec2020
90%    15aug2015      15dec2020       Variance       2.88e+07
95%    15mar2018      15dec2020       Skewness        .012123
99%    30jun2020      15dec2020       Kurtosis       1.799123

                        dialysis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    30jun1972      15jan1970
10%    15jan1975      15jan1970       Obs               6,000
25%    15apr1982      15jan1970       Sum of Wgt.       6,000

50%    15jan1995                      Mean          15apr1995
                        Largest       Std. Dev.      5402.332
75%    15jan2008      15dec2020
90%    15feb2016      15dec2020       Variance       2.92e+07
95%    15may2018      15dec2020       Skewness       .0331583
99%    15jun2020      15dec2020       Kurtosis       1.787208

                   kidney_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jun1972      15jan1970
10%    15jan1975      15jan1970       Obs               6,000
25%    15jul1982      15jan1970       Sum of Wgt.       6,000

50%    15nov1994                      Mean          18apr1995
                        Largest       Std. Dev.      5398.789
75%    15may2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.91e+07
95%    30may2018      15dec2020       Skewness        .030195
99%    15jun2020      15dec2020       Kurtosis       1.783916

                    other_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    30may1970      15jan1970
 5%    15jun1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    15aug1982      15jan1970       Sum of Wgt.       6,000

50%    15sep1995                      Mean          27jun1995
                        Largest       Std. Dev.      5351.256
75%    30dec2007      15nov2020
90%    15aug2015      15dec2020       Variance       2.86e+07
95%    15apr2018      15dec2020       Skewness      -.0221623
99%    15may2020      15dec2020       Kurtosis       1.803199

                      hypertension_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15sep1972      15jan1970
10%    15mar1975      15jan1970       Obs               6,000
25%    15jun1983      15jan1970       Sum of Wgt.       6,000

50%    15dec1995                      Mean          28nov1995
                        Largest       Std. Dev.      5386.975
75%    15jun2008      15oct2021
90%    15mar2016      15oct2021       Variance       2.90e+07
95%    15apr2019      15oct2021       Skewness       -.009342
99%    15apr2021      15oct2021       Kurtosis       1.841307

                    ra_sle_psoriasis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15sep1972      15jan1970
10%    15jun1975      15jan1970       Obs               6,000
25%    15jul1983      15jan1970       Sum of Wgt.       6,000

50%    30nov1995                      Mean          01nov1995
                        Largest       Std. Dev.      5318.299
75%    15jul2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.83e+07
95%    15mar2018      15dec2020       Skewness      -.0366121
99%    15jun2020      15dec2020       Kurtosis        1.81264

                     has_12_m_follow_up
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           .5              0
10%            1              0       Obs              30,000
25%            1              0       Sum of Wgt.      30,000

50%            1                      Mean                .95
                        Largest       Std. Dev.      .2179486
75%            1              1
90%            1              1       Variance       .0475016
95%            1              1       Skewness      -4.129483
99%            1              1       Kurtosis       18.05263

                   died_ons_covid_flag_any
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,000
25%            0              0       Sum of Wgt.      30,000

50%            1                      Mean                 .6
                        Largest       Std. Dev.      .4899061
75%            1              1
90%            1              1       Variance        .240008
95%            1              1       Skewness      -.4082483
99%            1              1       Kurtosis       1.166667

               died_ons_covid_flag_underlying
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,000
25%            0              0       Sum of Wgt.      30,000

50%            1                      Mean                 .6
                        Largest       Std. Dev.      .4899061
75%            1              1
90%            1              1       Variance        .240008
95%            1              1       Skewness      -.4082483
99%            1              1       Kurtosis       1.166667

              covid_admission_primary_diagnosis
-------------------------------------------------------------
no observations

                            sgtf
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              26,975
25%            0              0       Sum of Wgt.      26,975

50%            1                      Mean           1.432178
                        Largest       Std. Dev.      2.695542
75%            1              9
90%            9              9       Variance       7.265948
95%            9              9       Skewness       2.355103
99%            9              9       Kurtosis       6.839923

                           lft_pcr
-------------------------------------------------------------
no observations

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              30,000
25%           20              0       Sum of Wgt.      30,000

50%           39                      Mean           40.15473
                        Largest       Std. Dev.      23.66915
75%           59            108
90%           73            109       Variance       560.2285
95%           79            109       Skewness       .1308791
99%           89            109       Kurtosis       2.037713

                             sex
-------------------------------------------------------------
no observations

                             imd
-------------------------------------------------------------
      Percentiles      Smallest
 1%          100            100
 5%          100            100
10%          200            100       Obs              30,000
25%          200            100       Sum of Wgt.      30,000

50%          300                      Mean           260.3967
                        Largest       Std. Dev.      66.08117
75%          300            300
90%          300            300       Variance       4366.722
95%          300            300       Skewness      -1.412353
99%          300            300       Kurtosis       3.656619

                             stp
-------------------------------------------------------------
no observations

                          ethnicity
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              27,001
25%            1              1       Sum of Wgt.      27,001

50%            1                      Mean           1.596719
                        Largest       Std. Dev.      1.280302
75%            1              5
90%            5              5       Variance       1.639173
95%            5              5       Skewness       1.930228
99%            5              5       Kurtosis       5.183228

                        household_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%          539             89
 5%          672            141
10%          744            188       Obs              30,000
25%          864            256       Sum of Wgt.      30,000

50%          999                      Mean           999.8139
                        Largest       Std. Dev.      199.9961
75%         1137           1744
90%         1256           1747       Variance       39998.43
95%         1327           1803       Skewness       -.007989
99%         1467           1867       Kurtosis       3.008019

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1             -1
10%            1             -1       Obs              30,000
25%            2              0       Sum of Wgt.      30,000

50%            2                      Mean           2.498767
                        Largest       Std. Dev.       1.03944
75%            3              6
90%            4              6       Variance       1.080434
95%            4              6       Skewness       .0276843
99%            5              6       Kurtosis       2.893821

                       care_home_type
-------------------------------------------------------------
no observations

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0      -15.72733
 5%            0      -15.19143
10%     8.753472      -11.96924       Obs              30,000
25%     16.86271      -11.19789       Sum of Wgt.      30,000

50%     24.23695                      Mean           23.69684
                        Largest       Std. Dev.      11.18607
75%       31.354       61.20845
90%     37.55025       62.06326       Variance       125.1281
95%     41.05783       65.54218       Skewness      -.2045288
99%      48.3325       66.65298       Kurtosis       2.908195

                           bp_sys
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     41.03975              0
10%     103.8907              0       Obs              30,000
25%     112.0137              0       Sum of Wgt.      30,000

50%      119.409                      Mean           114.0857
                        Largest       Std. Dev.      27.92082
75%     126.4602       158.8617
90%     132.6132       159.0043       Variance       779.5721
95%     136.1737       163.1444       Skewness       -3.32378
99%     142.8983        165.785       Kurtosis       14.01907

                           bp_dias
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     18.32537              0
10%     63.86503              0       Obs              30,000
25%     71.88066              0       Sum of Wgt.      30,000

50%     79.39211                      Mean           76.03428
                        Largest       Std. Dev.      20.00931
75%     86.39746       115.5571
90%      92.6291       117.0538       Variance       400.3726
95%     96.42247       117.4999       Skewness      -2.592868
99%     103.1839       119.3252       Kurtosis       10.66683

                         creatinine
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0      -10.05644
 5%            0              0
10%     35.45991              0       Obs              30,000
25%     48.06189              0       Sum of Wgt.      30,000

50%     58.99944                      Mean           56.97995
                        Largest       Std. Dev.      19.60483
75%     69.51574       114.1978
90%     78.72449       114.9066       Variance       384.3493
95%     84.03049       116.3326       Skewness       -.972521
99%     94.44674       124.6696       Kurtosis       4.624035

                       smoking_status
-------------------------------------------------------------
no observations

                        diabetes_type
-------------------------------------------------------------
no observations

                     hba1c_mmol_per_mol
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -5.478158      -37.67382
 5%            0      -32.89013
10%     7.871652      -30.67862       Obs              30,000
25%     24.29068      -30.58302       Sum of Wgt.      30,000

50%     39.06042                      Mean           38.31562
                        Largest       Std. Dev.      21.33648
75%     53.18441       112.8025
90%     65.04404       112.9757       Variance       455.2455
95%     72.48884       121.0361       Skewness      -.0646903
99%     86.10851       133.1622       Kurtosis       2.736281

                      hba1c_percentage
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0      -3.261094
 5%            0      -2.629759
10%     1.752519      -2.465639       Obs              30,000
25%     3.373424      -2.288688       Sum of Wgt.      30,000

50%     4.869234                      Mean           4.738686
                        Largest       Std. Dev.      2.224462
75%     6.254924       12.29692
90%     7.474047       12.55957       Variance       4.948232
95%     8.190688       12.68357       Skewness      -.2438673
99%     9.525876       13.04147       Kurtosis       2.901454

                           asthma
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               6,000
25%            0              0       Sum of Wgt.       6,000

50%            0                      Mean               .697
                        Largest       Std. Dev.      .9011065
75%            2              2
90%            2              2       Variance        .811993
95%            2              2       Skewness       .6326601
99%            2              2       Kurtosis       1.530743

                         patient_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%       3151.5              0
 5%      15249.5              3
10%      30248.5              7       Obs              30,000
25%      75187.5             13       Sum of Wgt.      30,000

50%       150072                      Mean             150021
                        Largest       Std. Dev.      86653.09
75%     224874.5         299974
90%       270337         299977       Variance       7.51e+09
95%       285546         299993       Skewness       .0028415
99%     297079.5         299998       Kurtosis       1.798837

                        diabetes_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15may1970      15jan1970
 5%    15jul1972      15jan1970
10%    15mar1975      15jan1970       Obs               1,583
25%    15sep1982      15feb1970       Sum of Wgt.       1,583

50%    15jan1995                      Mean          18may1995
                        Largest       Std. Dev.      5372.332
75%    15feb2008      15oct2020
90%    15dec2015      15nov2020       Variance       2.89e+07
95%    15sep2018      15nov2020       Skewness       .0303837
99%    15may2020      15nov2020       Kurtosis       1.813171

                       covid_icu_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    05jan2021      21dec2020
10%    21jan2021      21dec2020       Obs              24,001
25%    09mar2021      21dec2020       Sum of Wgt.      24,001

50%    26may2021                      Mean          25may2021
                        Largest       Std. Dev.      89.55278
75%    10aug2021      28oct2021
90%    26sep2021      28oct2021       Variance       8019.701
95%    12oct2021      28oct2021       Skewness      -.0034919
99%    25oct2021      28oct2021       Kurtosis       1.808307

                  positive_covid_test_ever
-------------------------------------------------------------
      Percentiles      Smallest
 1%    12jun2021      05jan2021
 5%    28jul2021      04feb2021
10%    19aug2021      17feb2021       Obs               6,000
25%    16sep2021      15mar2021       Sum of Wgt.       6,000

50%    07oct2021                      Mean          27sep2021
                        Largest       Std. Dev.      30.65556
75%    19oct2021      28oct2021
90%    25oct2021      28oct2021       Variance       939.7633
95%    27oct2021      28oct2021       Skewness      -1.986121
99%    28oct2021      28oct2021       Kurtosis       8.906325

                  covid_tpp_codes_clinical
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    04jan2021      21dec2020
10%    20jan2021      21dec2020       Obs              15,000
25%    07mar2021      21dec2020       Sum of Wgt.      15,000

50%    24may2021                      Mean          24may2021
                        Largest       Std. Dev.      89.87589
75%    10aug2021      28oct2021
90%    26sep2021      28oct2021       Variance       8077.676
95%    12oct2021      28oct2021       Skewness       .0107779
99%    25oct2021      28oct2021       Kurtosis       1.807668

                    covid_tpp_codes_test
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    05jan2021      21dec2020
10%    21jan2021      21dec2020       Obs              15,000
25%    09mar2021      21dec2020       Sum of Wgt.      15,000

50%    27may2021                      Mean          26may2021
                        Largest       Std. Dev.       90.1041
75%    12aug2021      28oct2021
90%    27sep2021      28oct2021       Variance       8118.749
95%    13oct2021      28oct2021       Skewness      -.0156314
99%    25oct2021      28oct2021       Kurtosis       1.794404

                     covid_tpp_codes_seq
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    05jan2021      21dec2020
10%    21jan2021      21dec2020       Obs              15,000
25%    10mar2021      21dec2020       Sum of Wgt.      15,000

50%    27may2021                      Mean          26may2021
                        Largest       Std. Dev.      89.96185
75%    13aug2021      28oct2021
90%    27sep2021      28oct2021       Variance       8093.135
95%    12oct2021      28oct2021       Skewness      -.0189644
99%    25oct2021      28oct2021       Kurtosis       1.801838

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    05jan2021      21dec2020
10%    21jan2021      21dec2020       Obs              24,001
25%    08mar2021      21dec2020       Sum of Wgt.      24,001

50%    27may2021                      Mean          25may2021
                        Largest       Std. Dev.      90.03631
75%    11aug2021      28oct2021
90%    27sep2021      28oct2021       Variance       8106.538
95%    13oct2021      28oct2021       Skewness      -.0092431
99%    25oct2021      28oct2021       Kurtosis       1.793672

                    covid_admission_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    22dec2020      20dec2020
 5%    04jan2021      20dec2020
10%    19jan2021      20dec2020       Obs              13,708
25%    06mar2021      20dec2020       Sum of Wgt.      13,708

50%    25may2021                      Mean          24may2021
                        Largest       Std. Dev.       90.9912
75%    12aug2021      28oct2021
90%    28sep2021      28oct2021       Variance       8279.399
95%    14oct2021      28oct2021       Skewness       .0067508
99%    26oct2021      28oct2021       Kurtosis       1.788427

                     covid_tpp_probable
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    05jan2021      21dec2020
10%    20jan2021      21dec2020       Obs              28,824
25%    09mar2021      21dec2020       Sum of Wgt.      28,824

50%    27may2021                      Mean          26may2021
                        Largest       Std. Dev.      90.69655
75%    14aug2021      28oct2021
90%    29sep2021      28oct2021       Variance       8225.865
95%    14oct2021      28oct2021       Skewness      -.0177167
99%    25oct2021      28oct2021       Kurtosis       1.788319

                       covid_vacc_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    10dec2020      09dec2020
 5%    19dec2020      09dec2020
10%    30dec2020      09dec2020       Obs              15,000
25%    01feb2021      09dec2020       Sum of Wgt.      15,000

50%    28mar2021                      Mean          28mar2021
                        Largest       Std. Dev.      63.78885
75%    23may2021      16jul2021
90%    25jun2021      16jul2021       Variance       4069.017
95%    06jul2021      16jul2021       Skewness       .0005118
99%    14jul2021      16jul2021       Kurtosis       1.791845

                 covid_vacc_second_dose_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    09dec2020      09dec2020
 5%    13dec2020      09dec2020
10%    17dec2020      09dec2020       Obs               5,991
25%    30dec2020      09dec2020       Sum of Wgt.       5,991

50%    20jan2021                      Mean          19jan2021
                        Largest       Std. Dev.      23.72166
75%    09feb2021      01mar2021
90%    21feb2021      01mar2021       Variance        562.717
95%    25feb2021      01mar2021       Skewness      -.0289239
99%    01mar2021      01mar2021       Kurtosis       1.824471

                covid_admission_primary_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%        22271          22269
 5%        22284          22269
10%        22299          22269       Obs               6,840
25%        22345          22269       Sum of Wgt.       6,840

50%        22426                      Mean           22424.83
                        Largest       Std. Dev.      91.16527
75%        22504          22581
90%        22551          22581       Variance       8311.107
95%        22567          22581       Skewness       .0015832
99%        22579          22581       Kurtosis       1.783101

                covid_primary_care_codes_only
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    04jan2021      21dec2020
10%    20jan2021      21dec2020       Obs              28,500
25%    08mar2021      21dec2020       Sum of Wgt.      28,500

50%    26may2021                      Mean          25may2021
                        Largest       Std. Dev.      90.19759
75%    12aug2021      28oct2021
90%    27sep2021      28oct2021       Variance       8135.605
95%    12oct2021      28oct2021       Skewness      -.0055569
99%    25oct2021      28oct2021       Kurtosis       1.796239

. 
. 
. /*Flag earliest date under18s vaccinated*/
. gen under18vacc_temp=covid_vacc_date if age<18
(26,775 missing values generated)

. bysort household_id: egen under18vacc=min(under18vacc_temp)
(1691 missing values generated)

. format under18vacc* %td

. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(15,248 missing values generated)

. replace male = 0 if sex == "F"
(15,248 real changes made)

. 
. * Ethnicity 
. replace ethnicity = .u if ethnicity == .
(2,999 real changes made, 2,999 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(29,990 missing values generated)

. replace stp = sum(stp)
(29,999 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(30,000 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 30000 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age 18/29.9999 = 1 /// 
>                    30/39.9999 = 2 /// 
>            40/49.9999 = 3 ///
>                    50/59.9999 = 4 ///
>                60/69.9999 = 5 ///
>                    70/79.9999 = 6 ///
>                    80/max = 7, gen(agegroup) 
(23580 differences between age and agegroup)

. 
. label define agegroup   1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Create binary age (for age stratification)
. recode age min/65.999999999 = 0 ///
>            66/max = 1, gen(age66)
(29647 differences between age and age66)

. 
. * Check there are no missing ages
. assert age < .

. assert agegroup < .

. assert age66 < .

. 
. 
. /* APPLY HH level INCLUSION/EXCLUIONS========================================
> ==========*/ 
. 
. noi di "DROP if HH ID==0"
DROP if HH ID==0

. count if household_id==0
  0

. drop if household_id==0
(0 observations deleted)

. count
  30,000

. 
. drop if care_home_type!="U"
(864 observations deleted)

. count
  29,136

. 
. noi di "DROP HH>=10 persons:"
DROP HH>=10 persons:

. sum household_size, d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1             -1
10%            1             -1       Obs              29,136
25%            2              0       Sum of Wgt.      29,136

50%            2                      Mean           2.498112
                        Largest       Std. Dev.       1.03834
75%            3              6
90%            4              6       Variance        1.07815
95%            4              6       Skewness       .0237965
99%            5              6       Kurtosis       2.900237

. drop if household_size>=10
(0 observations deleted)

. count
  29,136

. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. recode age .=9
(age: 0 changes made)

. recode age .u=9
(age: 0 changes made)

. bysort household_id: egen age_drop=max(age)

. drop if age_drop==9
(3 observations deleted)

. count
  29,133

. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. ***KIDS_CAT5 (5 categories)
. *Identify kids under 5/5-11/12-18
. gen no_of_kids=1 if age<5
(27,405 missing values generated)

. recode no_of_kids .=2 if age<12
(no_of_kids: 2407 changes made)

. recode no_of_kids .=3 if age<18 
(no_of_kids: 2098 changes made)

. 
. *Make seperate files with only kids and household number
. preserve

. keep if age<18
(22,900 observations deleted)

. keep household_id no_of_kids

. *Drop duplicates (i.e. for hh with kids of same age, keep only one)
. duplicates drop

Duplicates in terms of all variables

(3,957 observations deleted)

. *If a hh has >1 record, there must be mixed ages in it: flag these as categor
> y 4
. bysort household_id: replace no_of_kids=4 if _N>1
(2,065 real changes made)

. duplicates drop

Duplicates in terms of all variables

(1,302 observations deleted)

. rename no_of_kids kids_cat5

. save kids_mixed_category, replace
(note: file kids_mixed_category.dta not found)
file kids_mixed_category.dta saved

. restore

. 
. *merge in kids identifier
. merge m:1 household_id using kids_mixed_category, nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                           636
        from master                       636  
        from using                          0  

    matched                            28,497  
    -----------------------------------------

. 
. *label variable
. lab define   kids_cat5 0 none  1 "only <5 years" ///
> 2 "only 5-11" 3 "12-<18" 4 "mixed"

. lab val kids_cat5 kids_cat5

. recode kids_cat5 .=0
(kids_cat5: 636 changes made)

. tab kids_cat5

    kids_cat5 |      Freq.     Percent        Cum.
--------------+-----------------------------------
         none |        636        2.18        2.18
only <5 years |        383        1.31        3.50
    only 5-11 |        696        2.39        5.89
       12-<18 |        493        1.69        7.58
        mixed |     26,925       92.42      100.00
--------------+-----------------------------------
        Total |     29,133      100.00

. drop no_of_kids

. 
. ***KIDS_CAT4 (4 categories)
. *Identify kids under 0-11/12-18
. gen no_of_kids=1 if age<12
(24,998 missing values generated)

. recode no_of_kids .=2 if age<18 
(no_of_kids: 2098 changes made)

. 
. *Make seperate files with only kids and household number
. preserve

. keep if age<18
(22,900 observations deleted)

. keep household_id no_of_kids

. *Drop duplicates (i.e. for hh with kids of same age, keep only one)
. duplicates drop

Duplicates in terms of all variables

(4,585 observations deleted)

. *If a hh has >1 record, there must be mixed ages in it: flag these as categor
> y 4
. bysort household_id: replace no_of_kids=3 if _N>1
(1,348 real changes made)

. duplicates drop

Duplicates in terms of all variables

(674 observations deleted)

. rename no_of_kids kids_cat4

. list in 1/100

     +---------------------+
     | househ~d   kids_c~4 |
     |---------------------|
  1. |      256          1 |
  2. |      314          2 |
  3. |      318          1 |
  4. |      342          1 |
  5. |      349          1 |
     |---------------------|
  6. |      357          1 |
  7. |      363          2 |
  8. |      378          1 |
  9. |      380          2 |
 10. |      381          1 |
     |---------------------|
 11. |      403          1 |
 12. |      425          2 |
 13. |      426          1 |
 14. |      433          2 |
 15. |      439          1 |
     |---------------------|
 16. |      445          1 |
 17. |      450          1 |
 18. |      456          2 |
 19. |      457          1 |
 20. |      458          3 |
     |---------------------|
 21. |      462          3 |
 22. |      469          2 |
 23. |      473          3 |
 24. |      474          1 |
 25. |      479          2 |
     |---------------------|
 26. |      482          1 |
 27. |      485          1 |
 28. |      489          2 |
 29. |      491          2 |
 30. |      492          1 |
     |---------------------|
 31. |      495          1 |
 32. |      498          1 |
 33. |      499          1 |
 34. |      503          2 |
 35. |      505          1 |
     |---------------------|
 36. |      507          3 |
 37. |      508          1 |
 38. |      509          2 |
 39. |      510          1 |
 40. |      517          2 |
     |---------------------|
 41. |      518          2 |
 42. |      520          1 |
 43. |      521          3 |
 44. |      526          1 |
 45. |      527          1 |
     |---------------------|
 46. |      528          1 |
 47. |      530          1 |
 48. |      531          2 |
 49. |      534          1 |
 50. |      537          3 |
     |---------------------|
 51. |      539          2 |
 52. |      541          2 |
 53. |      542          1 |
 54. |      543          3 |
 55. |      545          1 |
     |---------------------|
 56. |      546          1 |
 57. |      547          1 |
 58. |      549          3 |
 59. |      550          1 |
 60. |      551          1 |
     |---------------------|
 61. |      553          3 |
 62. |      554          3 |
 63. |      555          2 |
 64. |      556          1 |
 65. |      557          3 |
     |---------------------|
 66. |      558          3 |
 67. |      559          1 |
 68. |      562          2 |
 69. |      563          3 |
 70. |      564          2 |
     |---------------------|
 71. |      565          3 |
 72. |      566          3 |
 73. |      569          1 |
 74. |      571          1 |
 75. |      572          2 |
     |---------------------|
 76. |      573          1 |
 77. |      574          1 |
 78. |      575          1 |
 79. |      576          2 |
 80. |      578          2 |
     |---------------------|
 81. |      579          1 |
 82. |      580          1 |
 83. |      581          1 |
 84. |      582          3 |
 85. |      583          2 |
     |---------------------|
 86. |      585          3 |
 87. |      586          3 |
 88. |      587          1 |
 89. |      588          1 |
 90. |      589          3 |
     |---------------------|
 91. |      590          1 |
 92. |      591          1 |
 93. |      592          1 |
 94. |      593          1 |
 95. |      594          3 |
     |---------------------|
 96. |      595          1 |
 97. |      596          1 |
 98. |      597          3 |
 99. |      598          1 |
100. |      599          1 |
     +---------------------+

. save kids_mixed_category, replace
file kids_mixed_category.dta saved

. restore

. 
. *merge in kids identifier
. merge m:1 household_id using kids_mixed_category, nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                           636
        from master                       636  
        from using                          0  

    matched                            28,497  
    -----------------------------------------

. 
. *label variable
. lab define   kids_cat4 0 none  1 "only <12 years" ///
> 2 "only 12-18" ///
> 3 "mixed"

. lab val kids_cat4 kids_cat4

. recode kids_cat4 .=0
(kids_cat4: 636 changes made)

. tab kids_cat4

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        636        2.18        2.18
only <12 years |      2,942       10.10       12.28
    only 12-18 |        493        1.69       13.97
         mixed |     25,062       86.03      100.00
---------------+-----------------------------------
         Total |     29,133      100.00

. 
. *Dose-response exposure: identify number of kids in hh where there are ONLY u
> nder 11 yr olds
. bysort household_id: egen number_kids=sum(no_of_kids) if kids_cat4==1
(26191 missing values generated)

. 
. gen gp_number_kids=number_kids
(26,191 missing values generated)

. recode gp_number_kids 4/max=4
(gp_number_kids: 1170 changes made)

. 
. lab var gp_number_kids "Number kids under 12 years in hh"

. lab define   gp_number_kids 0 none ///
> 1 "1 child <12" ///
> 2 "2 children <12" ///
> 3 "3 children <12" ///
> 4 "4+ children <12"

. lab val gp_number_kids gp_number_kids

. 
. tab kids_cat4 

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        636        2.18        2.18
only <12 years |      2,942       10.10       12.28
    only 12-18 |        493        1.69       13.97
         mixed |     25,062       86.03      100.00
---------------+-----------------------------------
         Total |     29,133      100.00

. tab kids_cat5

    kids_cat5 |      Freq.     Percent        Cum.
--------------+-----------------------------------
         none |        636        2.18        2.18
only <5 years |        383        1.31        3.50
    only 5-11 |        696        2.39        5.89
       12-<18 |        493        1.69        7.58
        mixed |     26,925       92.42      100.00
--------------+-----------------------------------
        Total |     29,133      100.00

. tab kids_cat*

              |                  kids_cat4
    kids_cat5 |      none  only <12   only 12-1      mixed |     Total
--------------+--------------------------------------------+----------
         none |       636          0          0          0 |       636 
only <5 years |         0        383          0          0 |       383 
    only 5-11 |         0        696          0          0 |       696 
       12-<18 |         0          0        493          0 |       493 
        mixed |         0      1,863          0     25,062 |    26,925 
--------------+--------------------------------------------+----------
        Total |       636      2,942        493     25,062 |    29,133 

. 
. 
. /* DROP ALL KIDS, AS HH COMPOSITION VARS ARE NOW MADE */
. drop if age<18
(6,233 observations deleted)

. 
. *Total number adults in household (to check hh size)
. bysort household_id: gen tot_adults_hh=_N

. recode tot_adults_hh 3/max=3
(tot_adults_hh: 22394 changes made)

. 
. tab kids_cat4

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        636        2.78        2.78
only <12 years |      2,371       10.35       13.13
    only 12-18 |        391        1.71       14.84
         mixed |     19,502       85.16      100.00
---------------+-----------------------------------
         Total |     22,900      100.00

. tab gp_num if kids_cat4==1

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |        410       17.29       17.29
 2 children <12 |        463       19.53       36.82
 3 children <12 |        320       13.50       50.32
4+ children <12 |      1,178       49.68      100.00
----------------+-----------------------------------
          Total |      2,371      100.00

. 
. erase kids_mixed_category.dta

. 
. /* SET FU DATES==============================================================
> =*/ 
. * Censoring dates for each outcome (largely, last date outcome data available
> )
. *****NEEDS UPDATING WHEN INFO AVAILABLE*******************
. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. rename dereg_date_date                                          dereg_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes_date  ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 dialysis                     
>                    ///
>                                                 kidney_transplant            
>            ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         
. }

. 
. 
. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(1,155 real changes made, 1,155 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(3,660 real changes made, 3,660 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(1,155 missing values generated)

. gen bmi_age = age - bmi_time
(1,155 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(399 real changes made, 399 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(4,059 real changes made, 4,059 to missing)

. replace bmi_measured = . if bmi == . 
(5,214 real changes made, 5,214 to missing)

. 
. gen     bmicat = .
(22,900 missing values generated)

. recode  bmicat . = 1 if bmi < 18.5
(bmicat: 2173 changes made)

. recode  bmicat . = 2 if bmi < 25
(bmicat: 5114 changes made)

. recode  bmicat . = 3 if bmi < 30
(bmicat: 3985 changes made)

. recode  bmicat . = 4 if bmi < 35
(bmicat: 3190 changes made)

. recode  bmicat . = 5 if bmi < 40
(bmicat: 1967 changes made)

. recode  bmicat . = 6 if bmi < .
(bmicat: 1257 changes made)

. replace bmicat = .u if bmi >= .
(5,214 real changes made, 5,214 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Create less  granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(20727 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(21,960 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(467 real changes made)

. replace smoke = 3  if smoking_status == "S"
(2,758 real changes made)

. replace smoke = .u if smoking_status == "M"
(439 real changes made, 439 to missing)

. replace smoke = .u if smoking_status == "" 
(18,296 real changes made, 18,296 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(18735 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(cancer_haem_date, d(1/1/1900), d(1/2/2
> 015))
(18,819 missing values generated)

. replace cancer_haem_cat = 3 if inrange(cancer_haem_date, d(1/2/2015), d(1/2/2
> 019))
(355 real changes made)

. replace cancer_haem_cat = 2 if inrange(cancer_haem_date, d(1/2/2019), d(1/2/2
> 020))
(92 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 18372 changes made)

. label values cancer_haem_cat cancer

. 
. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(cancer_nonhaem_date,  d(1/1/1900), d
> (1/2/2015)) 
(18,866 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(cancer_nonhaem_date,  d(1/2/2015), d
> (1/2/2019))
(366 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(cancer_nonhaem_date,  d(1/2/2019), d
> (1/2/2020)) 
(76 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 18424 changes made)

. label values cancer_exhaem_cat cancer

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(18,322 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), 
> date("$indexdate", "DMY"))

. 
. egen other_immuno = rowmax(temp1 temp2)

. drop temp1 temp2 

. order other_immuno, after(temp_immunodef)

. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(16,712 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(3,912 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(9,600 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(3,818 real changes made)

. replace bpcat = .u if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(2,269 real changes made, 2,269 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" .u "Unknown"

. label values bpcat bpcat

. 
. recode bpcat .u=1, gen(bpcat_nomiss)
(2269 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 3894 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(1,247 real changes made, 1,247 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(1,247 missing values generated)

. 
. gen min=.
(22,900 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(11,083 real changes made)

. replace min = SCr_adj/0.9 if male==1
(10,570 real changes made)

. replace min = min^-0.329  if male==0
(11,083 real changes made)

. replace min = min^-0.411  if male==1
(10,570 real changes made)

. replace min = 1 if min<1
(6,050 real changes made)

. 
. gen max=.
(22,900 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(11,083 real changes made)

. replace max=SCr_adj/0.9 if male==1
(10,570 real changes made)

. replace max=max^-1.209
(21,653 real changes made)

. replace max=1 if max>1
(16,850 real changes made)

. 
. gen egfr=min*max*141
(1,247 missing values generated)

. replace egfr=egfr*(0.993^age)
(21,653 real changes made)

. replace egfr=egfr*1.018 if male==0
(11,083 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(1247 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(21653 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. *label var ckd "CKD stage calc without eth"
. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
.         
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(21382 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(1,247 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. lab var  reduced "Reduced kidney function"

. 
. 
. /*ESDR: dialysis or kidney transplant*/
. gen esrd=1 if dialysis==1 | kidney_transplant==1
(14,725 missing values generated)

. recode esrd .=0
(esrd: 14725 changes made)

. 
. 
. 
. ***************************
. /* DM / Hb1AC */
. ***************************
. 
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(1,299 real changes made, 1,299 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(1,626 real changes made, 1,626 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |     21,601    5.013716    1.943436   .0002528   12.68357
hba1c_mmol~l |     21,274    41.43484    18.81421    .005786   133.1622

. gen     hba1c_pct = hba1c_percentage 
(1,299 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(21,274 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(22,808 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(22,186 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(4,657 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(481 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(17,048 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |    17,048          0          0          0 |    17,048 
         1 |         0        714          0          0 |       714 
         2 |         0          0      4,657          0 |     4,657 
         3 |         0          0          0        481 |       481 
-----------+--------------------------------------------+----------
     Total |    17,048        714      4,657        481 |    22,900 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. /*Open safely diabetes codes with exeter algorithm
> gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
> replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
> replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
> label values  dm_type_exeter_os dm_type*/
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(8,599 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(4,207 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(1,504 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(1,802 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(994 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |     14,301       62.70       62.70
  >=6.5-7.4 |      4,207       18.45       81.15
  >=7.5-7.9 |      1,504        6.59       87.74
    >=8-8.9 |      1,802        7.90       95.64
        >=9 |        994        4.36      100.00
------------+-----------------------------------
      Total |     22,808      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(4,392 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(4,300 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,508       80.82       80.82
          1 |      4,300       18.78       99.60
          . |         92        0.40      100.00
------------+-----------------------------------
      Total |     22,900      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0 | dm_type==.
(5,852 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(595 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(117 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(3,775 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(858 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(26 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     17,048       74.45       74.45
  T1DM, controlled |        595        2.60       77.04
T1DM, uncontrolled |        117        0.51       77.55
  T2DM, controlled |      3,775       16.48       94.04
T2DM, uncontrolled |        858        3.75       97.79
Diabetes, no HbA1c |         26        0.11       97.90
                 . |        481        2.10      100.00
-------------------+-----------------------------------
             Total |     22,900      100.00

. recode diabcat .=1
(diabcat: 481 changes made)

. 
. 
. 
. /*  Asthma  */
. 
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3
(asthmacat: 4558 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. /*  Probable shielding  */
. gen shield=1 if esrd==1 | other_transplant==1 | asthmacat==2 | asthmacat==3 |
>  ///
> chronic_respiratory_disease==1 | cancer_haem==1 | cancer_nonhaem==1 | ///
> asplenia==1 | other_immuno==1
(3,550 missing values generated)

. recode shield .=0
(shield: 3550 changes made)

. 
. /*Any comorbidity*/
. 
. gen anycomorb=1 if chronic_respiratory_disease==1 | ///
>                     asthmacat==2 | asthmacat==3 | ///
>                                         chronic_cardiac_disease==1  | ///
>                                         diabcat==2 | diabcat==3 | diabcat==4 
> | diabcat==5 | diabcat==6 | ///
>                                         cancer_haem==1 | cancer_nonhaem==1 | 
> ///
>                                         esrd==1 | ///
>                                         chronic_liver_disease==1 | ///
>                                         stroke_dementia==1 | ///
>                                         other_neuro==1 | ///
>                                         other_transplant==1 | ///
>                                         asplenia==1 | ///
>                                         ra_sle_psoriasis==1 | ///
>                                         other_immuno==1 
(846 missing values generated)

. recode anycomorb .=0
(anycomorb: 846 changes made)

. tab anyco

  anycomorb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        846        3.69        3.69
          1 |     22,054       96.31      100.00
------------+-----------------------------------
      Total |     22,900      100.00

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma categ
> ory"

. label var egfr_cat                                              "Calculated e
> GFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haem
> atological cancer"

. label var cancer_exhaem_cat                                             "Non-
> haematological cancer"

. label var kidney_transplant                                             "Kidn
> ey transplant"     

. label var other_transplant                                              "Othe
> r solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (co
> mbination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"               
>    

. label var stroke_dementia                           "Stroke or dementia"     
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosupp
> ression"

. lab var temp_immunodef                                  "Temporary immunosupp
> ression"

. lab var esrd                                                    "End-stage re
> nal disease"

. 
. lab var covid_vacc_date                         "First vacc date"

. lab var covid_vacc_second_dose_date "Second vacc date"

. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
. gen enter_date = date("$indexdate", "DMY")

. gen study_end_censor =date("$study_end_censor", "DMY")

. 
. * Format the dates
. format  enter_date                                      ///
>                 study_end_censor  

  variable name     display format
  --------------------------------
  enter_date        %9.0g
  study_end_censor  %9.0g
  --------------------------------

.                 
.                         /****   Outcome definitions   ****/
. 
. * Date of Covid death in ONS
. gen died_date_onscovid = died_date_ons if died_ons_covid_flag_any == 1
(11,917 missing values generated)

. gen died_date_onscovid_part1 = died_date_ons if died_ons_covid_flag_underlyin
> g == 1
(11,902 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen died_date_onsnoncovid = died_date_ons if died_ons_covid_flag_any != 1 
(15,561 missing values generated)

. 
. *Date probable covid in TPP
. rename covid_tpp_probable date_covid_tpp_prob

. 
. format died_date_ons %td

. format died_date_onscovid %td 

. format died_date_onsnoncovid %td

. format covid_icu_date %td 

. format died_date_onscovid_part1 %td

. format covid_admission_primary_date %td

. 
. * Binary indicators (0/1) for outcomes
. gen covid_tpp_prob = (date_covid_tpp_prob < .)

. gen non_covid_death = (died_date_onsnoncovid < .)

. gen covid_death = (died_date_onscovid < .)

. gen covid_icu = (covid_icu_date < .)

. gen covidadmission = (covid_admission_primary_date < .)

. gen covid_death_part1 = (died_date_onscovid_part1 < .)

. 
.                                         /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: end study, death, or that outcom
> e)
. *gen stime_onscoviddeath = min(onscoviddeathcensor_date,                     
>            died_date_ons)
. gen stime_covid_death_part1     = min(study_end_censor   , died_date_onscovid
> _part1, died_date_ons, dereg_date)

. gen stime_covid_tpp_prob = min(study_end_censor   , died_date_ons, date_covid
> _tpp_prob, dereg_date)

. gen stime_non_covid_death = min(study_end_censor   , died_date_ons, died_date
> _onsnoncovid, dereg_date)

. gen stime_covid_death = min(study_end_censor   , died_date_ons, died_date_ons
> covid, dereg_date)

. gen stime_covid_icu = min(study_end_censor, died_date_ons, covid_icu_date, de
> reg_date)

. gen stime_covidadmission        = min(study_end_censor   , covid_admission_pr
> imary_date, died_date_ons, dereg_date)

. 
. * If outcome was after censoring occurred, set to zero
. replace covid_tpp_prob = 0 if (date_covid_tpp_prob > study_end_censor ) 
(426 real changes made)

. replace non_covid_death = 0 if (died_date_onsnoncovid > study_end_censor )
(149 real changes made)

. replace covid_death = 0 if (died_date_onscovid > study_end_censor )
(198 real changes made)

. replace covid_icu = 0 if (covid_icu_date > study_end_censor)
(323 real changes made)

. replace covidadmission  = 0 if (covid_admission_primary_date > study_end_cens
> or  | covid_admission_primary_date > died_date_ons) 
(2,121 real changes made)

. replace covid_death_part1 = 0 if (died_date_onscovid_part1 > study_end_censor
>  )
(220 real changes made)

. 
. * If outcome was after censoring occurred, set date to missing
. replace date_covid_tpp_prob = . if (date_covid_tpp_prob > study_end_censor ) 
(426 real changes made, 426 to missing)

. replace died_date_onsnoncovid = . if (died_date_onsnoncovid > study_end_censo
> r )
(149 real changes made, 149 to missing)

. replace died_date_onscovid = . if (died_date_onscovid > study_end_censor )
(198 real changes made, 198 to missing)

. replace covid_icu_date = . if (covid_icu_date > study_end_censor)
(323 real changes made, 323 to missing)

. replace covid_admission_primary_date    = . if (covid_admission_primary_date 
> > study_end_censor  | covid_admission_primary_date > died_date_ons) 
(2,121 real changes made, 2,121 to missing)

. replace died_date_onscovid_part1 = . if (died_date_onscovid_part1 > study_end
> _censor )
(220 real changes made, 220 to missing)

. 
. 
. * Format date variables
. format  stime* %td  

. gen positive_SGSS = (positive_covid_test_ever < .)

. gen covid_primary_care_codes = (covid_primary_care_codes_only < .)

. rename positive_covid_test_ever date_positive_SGSS

. rename covid_primary_care_codes_only date_covid_primary_care_codes

. replace covid_primary_care_codes = 0 if (date_covid_primary_care_codes > stud
> y_end_censor )
(384 real changes made)

. replace positive_SGSS = 0 if (date_positive_SGSS > study_end_censor )
(784 real changes made)

. 
. replace date_covid_primary_care_codes = . if (date_covid_primary_care_codes >
>  study_end_censor )
(384 real changes made, 384 to missing)

. replace date_positive_SGSS = . if (date_positive_SGSS > study_end_censor )
(784 real changes made, 784 to missing)

. 
. 
. gen reported_infection_source=1 if covid_tpp_prob==1
(1,295 missing values generated)

. recode reported_infection_source 1=2 if date_covid_tpp_prob== covid_tpp_codes
> _test 
(reported_infection_source: 38 changes made)

. recode reported_infection_source 1=3 if date_covid_tpp_prob==covid_tpp_codes_
> seq 
(reported_infection_source: 40 changes made)

. recode reported_infection_source 1=4 if date_covid_tpp_prob==covid_tpp_codes_
> clinical 
(reported_infection_source: 42 changes made)

. lab define reported_infection_source 1 SGSS 2 test_code 3 sequalae_code 4 dia
> gnosis_code

. lab val reported_infection_source reported_infection_source

. 
. 
. 
. 
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  number_kids "Number of children aged 1-<12 years in household"

. label var  household_size "Number people in household"

. label var  household_id "Household ID"

. 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age66                                         "66 years and older"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Evidence of obesity 
> (4 categories)"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var ethnicity                                     "Ethnicity"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. lab var tot_adults_hh                           "Total number adults in hh"

. lab var kids_cat4                                       "Exposure (v2) with 4
> -cats"

. lab var kids_cat5                                        "Exposure (v3) with 
> 5-cats"

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma categ
> ory"

. label var egfr_cat                                              "Calculated e
> GFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haem
> atological cancer"

. label var cancer_exhaem_cat                                             "Non-
> haematological cancer"

. label var kidney_transplant                                             "Kidn
> ey transplant"     

. label var other_transplant                                              "Othe
> r solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (co
> mbination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"               
>    

. label var stroke_dementia                           "Stroke or dementia"     
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosupp
> ression"

. lab var temp_immunodef                                  "Temporary immunosupp
> ression"

. lab var esrd                                                    "End-stage re
> nal disease"

. lab var anycomorb                                               "Any comorbid
> ity"

. 
. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_haem_date                                      "Haem cancer 
> Date"

. label var cancer_nonhaem_date                           "Non-haem cancer Date
> "

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date              "Neurological disease  Date"

. label var stroke_dementia_date                      "Stroke or dementia date"
>                                                    

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var perm_immunodef_date                             "Permanent immunosupp
> ression date"

. lab var temp_immunodef_date                             "Temporary immunosupp
> ression date"

. label var kidney_transplant_date                                             
>    "Kidney transplant"     

. label var other_transplant_date                                         "Othe
> r solid organ transplant"

. label var asplenia_date                                                 "Aspl
> enia date"

. lab var  bphigh "non-missing indicator of known high blood pressure"

. lab var bpcat "Blood pressure four levels, non-missing"

. lab var htdiag_or_highbp "High blood pressure or hypertension diagnosis"

. lab var shield "Probable shielding"

. 
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. label var study_end_censor                      "Date of admin censoring for 
> outcomes"

. 
. label var  covid_tpp_prob                               "Failure/censoring in
> dicator for outcome: covid prob case"

. label var  non_covid_death                              "Failure/censoring in
> dicator for outcome: non-covid death"

. label var  covid_death                              "Failure/censoring indica
> tor for outcome: covid death"

. label var  covid_icu                                "Failure/censoring indica
> tor for outcome: covid icu"

. lab var covidadmission                                  "Failure/censoring in
> dicator for outcome: covid SUS admission"

. lab var covid_death_part1                               "Failure/censoring in
> dicator for outcome: covid death part1"

. lab var  positive_SGSS          "Indicator positive covid test"

. lab var  covid_primary_care_codes               "Indicator positive primary c
> are code COVID infection"

. lab var reported_infection_source               "Reported Infection Source"

. 
. rename died_date_onsnoncovid date_non_covid_death

. rename died_date_onscovid date_covid_death

. rename covid_icu_date date_covid_icu

. rename covid_admission_primary_date date_covidadmission

. label var date_covid_tpp_prob                   "Date of probable COVID-19 cl
> inical infection"

. label var date_non_covid_death                  "Date of ONS non-COVID-19 Dea
> th"

. label var  date_covid_death                     "Date of ONS COVID-19 Death"

. lab var date_covid_icu                                  "Date of admission to
>  ICU for COVID-19" 

. lab var date_covidadmission                     "Date of admission to hospita
> l for COVID-19" 

. label var  died_date_onscovid_part1                     "Date of ONS COVID De
> ath part1"

. lab var  date_positive_SGSS             "Date of positive SGSS test"

. lab var   date_covid_primary_care_codes "Date of COVID-19 primary care code"

. 
. * Survival times
. label var  stime_covid_tpp_prob                         "Survival tme (date);
>  outcome "

. label var  stime_non_covid_death                        "Survival tme (date);
>  outcome non_covid_death   "

. label var  stime_covid_death                            "Survival time (date)
> ; outcome covid death"

. label var  stime_covid_icu                                      "Survival tim
> e (date); outcome covid icu"

. label var  stime_covidadmission                         "Survival time (date)
> ; outcome covid hosp admission"

. label var  stime_covid_death_part1                              "Survival tim
> e (date); outcome covid death part1"

. 
. *Key DATES
. label var   died_date_ons                               "Date death ONS"

. label var  has_12_m_follow_up                   "Has 12 months follow-up"

. lab var  dereg_date                                             "Date deregis
> tration from practice"

. lab var under18vacc                                             "Date first c
> hild in hh vaccinated"

. 
. 
. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
ethnicity_~e  hba1c_mmol~e  sgtf          asthmacat     bmi_age
bmi_measured  hba1c_per~te  lft_pcr       diabetes      SCr_adj
bp_sys_dat~e  cancer_haem   sex           covid_tpp_~l  min
bp_sys_dat~d  cancer_non~m  care_home_~e  covid_tpp_~t  max
bp_dias_da~e  esrf_date     bp_sys        covid_tpp_~q  hba1c_pct
bp_dias_da~d  esrf          bp_dias       covid_admi~e  dm_type
crea~te_date  dialysis_d~e  creatinine    under18vac~p  hba1ccat
crea~ne_date  dialysis      diabetes_t~e  age_drop      hba1c75
smoki~e_date  died_ons_c~y  hba1c_mmol~l  no_of_kids
smoki~s_date  died_ons_c~g  hba1c_per~ge  bmi_time

. drop `r(varlist)'

. drop covid_admission_primary_diagnosi   

. 
.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. *************TEMP DROP TO INVESTIGATE ASSOCIATIONS MORE EASILY***************
> ***
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. count
  22,900

. 
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if died_date_ons <=enter_date
(0 observations deleted)

. count
  22,900

. 
. noi di "DROP IF COVID IN TPP BEFORE INDEX"
DROP IF COVID IN TPP BEFORE INDEX

. drop if date_covid_tpp_prob <=enter_date
(0 observations deleted)

. count
  22,900

. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. recode imd .=9
(imd: 0 changes made)

. recode imd .u=9
(imd: 0 changes made)

. drop if imd==9
(0 observations deleted)

. count
  22,900

. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. recode male .=9
(male: 0 changes made)

. recode male .u=9
(male: 0 changes made)

. drop if male==9
(0 observations deleted)

. count   
  22,900

.         
. ***************
. *  Save data  *
. ***************
. sort patient_id

. save $tempdir/analysis_dataset_with_missing_ethnicity, replace
(note: file tempdata/analysis_dataset_with_missing_ethnicity.dta not found)
file tempdata/analysis_dataset_with_missing_ethnicity.dta saved

. 
. noi di "DROP NO ETHNICITY DATA"
DROP NO ETHNICITY DATA

. keep if ethnicity!=.u   
(2,267 observations deleted)

. 
. save $tempdir/analysis_dataset, replace
(note: file tempdata/analysis_dataset.dta not found)
file tempdata/analysis_dataset.dta saved

. 
. 
. 
. use  $tempdir/analysis_dataset, clear

. keep if age<=65
(4,551 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir/analysis_dataset_ageband_0, replace
(note: file tempdata/analysis_dataset_ageband_0.dta not found)
file tempdata/analysis_dataset_ageband_0.dta saved

. 
. 
. use  $tempdir/analysis_dataset, clear

. keep if age>65
(16,082 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir/analysis_dataset_ageband_1, replace
(note: file tempdata/analysis_dataset_ageband_1.dta not found)
file tempdata/analysis_dataset_ageband_1.dta saved

. 
. 
. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  3. * Save a version set on NON ONS covid death outcome
. stset stime_non_covid_death, fail(non_covid_death)                           
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  4. /*WEIGHTING - TO REDUCE TIME 
> set seed 30459820
> keep if _d==1|uniform()<.03
> gen pw = 1
> replace pw = (1/0.03) if _d==0
> stset stime_non_covid_death [pweight = pw],  fail(non_covid_death)           
>                    ///
>         id(patient_id) enter(enter_date) origin(enter_date)*/
. save "$tempdir/cr_create_analysis_dataset_STSET_non_covid_death_ageband_`x'.d
> ta", replace
  5.         
. /*no longer using composite outcome
> use $tempdir/analysis_dataset_ageband_`x', clear
> * Save a version set on covid death/icu  outcome
> stset stime_covid_death_icu, fail(covid_death_icu)                           
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
> save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_icu_ageband_`x'.d
> ta", replace
> */
. use $tempdir/analysis_dataset_ageband_`x', clear
  6. * Save a version set on covid icu  outcome only
. stset stime_covid_icu, fail(covid_icu)                          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7. save "$tempdir/cr_create_analysis_dataset_STSET_covid_icu_ageband_`x'.dta"
> , replace
  8. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  9. * Save a version set on covid death only
. stset stime_covid_death, fail(covid_death)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 10. save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_`x'.dt
> a", replace
 11. 
. /*this was created for investigation only
> use $tempdir/analysis_dataset_ageband_`x', clear
> * Save a version set on covid death only
> stset stime_covid_death_part1, fail(covid_death_part1)                       
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
> save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_part1_ageband_`x'
> .dta", replace
> */
. use $tempdir/analysis_dataset_ageband_`x', clear
 12. * Save a version set on probable covid
. stset stime_covid_tpp_prob, fail(covid_tpp_prob)                             
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 13. save "$tempdir/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'
> .dta", replace        
 14. 
. use $tempdir/analysis_dataset_ageband_`x', clear
 15. * Save a version set on hosp admission for covid
. stset stime_covidadmission, fail(covidadmission)                             
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 16. save "$tempdir/cr_create_analysis_dataset_STSET_covidadmission_ageband_`x'
> .dta", replace        
 17. 
. }

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,079  observations remaining, representing
     16,079  subjects
      5,080  failures in single-failure-per-subject data
  2,999,759  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(note: file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_0
> .dta not found)
file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_0.dta sa
> ved

                id:  patient_id
     failure event:  covid_icu != 0 & covid_icu < .
obs. time interval:  (stime_covid_icu[_n-1], stime_covid_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,079  observations remaining, representing
     16,079  subjects
     12,644  failures in single-failure-per-subject data
  2,078,777  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_0.dta n
> ot found)
file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,079  observations remaining, representing
     16,079  subjects
      7,525  failures in single-failure-per-subject data
  2,999,759  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta
>  not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,079  observations remaining, representing
     16,079  subjects
     15,173  failures in single-failure-per-subject data
  1,909,846  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.dta sav
> ed

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
         17  observations end on or before enter()
------------------------------------------------------------------------------
     16,065  observations remaining, representing
     16,065  subjects
      2,166  failures in single-failure-per-subject data
  2,737,074  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(note: file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_0.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_0.dta sav
> ed

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
          2  observations end on or before enter()
------------------------------------------------------------------------------
      4,549  observations remaining, representing
      4,549  subjects
      1,424  failures in single-failure-per-subject data
    837,412  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(note: file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_1
> .dta not found)
file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_1.dta sa
> ved

                id:  patient_id
     failure event:  covid_icu != 0 & covid_icu < .
obs. time interval:  (stime_covid_icu[_n-1], stime_covid_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
          2  observations end on or before enter()
------------------------------------------------------------------------------
      4,549  observations remaining, representing
      4,549  subjects
      3,545  failures in single-failure-per-subject data
    579,346  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_1.dta n
> ot found)
file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
          2  observations end on or before enter()
------------------------------------------------------------------------------
      4,549  observations remaining, representing
      4,549  subjects
      2,168  failures in single-failure-per-subject data
    837,412  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta
>  not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
          2  observations end on or before enter()
------------------------------------------------------------------------------
      4,549  observations remaining, representing
      4,549  subjects
      4,290  failures in single-failure-per-subject data
    529,019  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.dta sav
> ed

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
          5  observations end on or before enter()
------------------------------------------------------------------------------
      4,546  observations remaining, representing
      4,546  subjects
        618  failures in single-failure-per-subject data
    766,700  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(note: file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_1.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_1.dta sav
> ed

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/01_cr_analysis_dataset.log
  log type:  text
 closed on:  28 Oct 2021, 11:12:58
-------------------------------------------------------------------------------
