-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_cr_analysis_dataset.log
  log type:  text
 opened on:  17 Aug 2021, 07:44:03

. 
. 
. *Import dataset into STATA
. import delimited "output/input", clear
(62 vars, 30,000 obs)

. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates and TPP case outcome dates are given with month only, so addi
> ng day 
> 15 to enable  them to be processed as dates                                  
>                                                      */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(29,816 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(1,210 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(112 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 dialysis                     
>                    ///
>                                                 kidney_transplant            
>            ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 dereg_date  ///
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable diabetes was str7 now str10
(30,000 real changes made)
(28,494 real changes made)
(28,494 missing values generated)
variable cancer_haem was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable cancer_nonhaem was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable dialysis was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable kidney_transplant was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable other_transplant was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable asplenia was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable chronic_liver_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable other_neuro was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable stroke_dementia was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable esrf was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable hypertension was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable bmi_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable bp_sys_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable bp_dias_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable creatinine_date was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable smoking_status_date was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable dereg_date was str7 now str10
(30,000 real changes made)
(29,924 real changes made)
(29,924 missing values generated)

. 
. * Recode to dates from the strings 
. foreach var of varlist covid_icu_date positive_covid_test       ///
> covid_tpp_codes_clinical covid_tpp_codes_test covid_tpp_codes_seq ///
> died_date_ons covid_admission_date covid_tpp_probable ///
> covid_vacc_date  covid_vacc_second_dose_date    {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td        
  7. }
(5,999 missing values generated)
(24,000 missing values generated)
(15,000 missing values generated)
(15,000 missing values generated)
(15,000 missing values generated)
(5,999 missing values generated)
(16,612 missing values generated)
(1,500 missing values generated)
(15,000 missing values generated)
(24,000 missing values generated)

. 
. *Amend vaccine dates
. replace covid_vacc_second_dose_date=. if covid_vacc_date==covid_vacc_second_d
> ose_date
(12 real changes made, 12 to missing)

. 
. gen covid_admission_primary_date = covid_admission_date ///
> if (covid_admission_primary_diagnosi == "U071"| covid_admission_primary_diagn
> osi == "U072")
(23,302 missing values generated)

. 
. gen  covid_primary_care_codes_only=covid_tpp_probable
(1,500 missing values generated)

. format covid_primary_care_codes_only %td

. replace covid_tpp_probable=positive_covid_test_ever if covid_tpp_probable==. 
> & covid_tpp_probable>positive_covid_test
(309 real changes made)

. 
. 
. /*Tab all variables in initial extract*/
. sum, d f

                       dereg_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15dec2020      15dec2020
 5%    15dec2020      15dec2020
10%    15jan2021      15dec2020       Obs                  76
25%    15feb2021      15dec2020       Sum of Wgt.          76

50%    15may2021                      Mean          22apr2021
                        Largest       Std. Dev.      67.40543
75%    15jun2021      15aug2021
90%    15jul2021      15aug2021       Variance       4543.493
95%    15aug2021      15aug2021       Skewness       -.228102
99%    15aug2021      15aug2021       Kurtosis       2.085515

                       ethnicity_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%         1970           1970
 5%         1972           1970
10%         1975           1970       Obs              27,001
25%         1983           1970       Sum of Wgt.      27,001

50%         1995                      Mean           1995.456
                        Largest       Std. Dev.      14.90364
75%         2008           2021
90%         2016           2021       Variance       222.1185
95%         2019           2021       Skewness      -.0029665
99%         2021           2021       Kurtosis       1.801966

                   bmi_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2015      15feb2015
 5%    15may2015      15feb2015
10%    15sep2015      15feb2015       Obs              28,500
25%    15sep2016      15feb2015       Sum of Wgt.      28,500

50%    15apr2018                      Mean          03may2018
                        Largest       Std. Dev.      692.9185
75%    15dec2019      15aug2021
90%    15dec2020      15aug2021       Variance         480136
95%    15apr2021      15aug2021       Skewness       .0123743
99%    15jul2021      15aug2021       Kurtosis       1.793018

                  bp_sys_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15aug1972      15jan1970
10%    15mar1975      15jan1970       Obs              28,500
25%    15oct1982      15jan1970       Sum of Wgt.      28,500

50%    15jun1995                      Mean          26jun1995
                        Largest       Std. Dev.      5365.633
75%    15mar2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.88e+07
95%    15may2018      15dec2020       Skewness       .0016422
99%    15jun2020      15dec2020       Kurtosis       1.797654

                 bp_dias_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jul1972      15jan1970
10%    15apr1975      15jan1970       Obs              28,500
25%    15dec1982      15jan1970       Sum of Wgt.      28,500

50%    15aug1995                      Mean          21jul1995
                        Largest       Std. Dev.      5349.728
75%    15mar2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.86e+07
95%    15may2018      15dec2020       Skewness      -.0062882
99%    15may2020      15dec2020       Kurtosis       1.809086

                    creatinine_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15mar2019      15mar2019
 5%    15apr2019      15mar2019
10%    15may2019      15mar2019       Obs              28,500
25%    15aug2019      15mar2019       Sum of Wgt.      28,500

50%    15jan2020                      Mean          23jan2020
                        Largest       Std. Dev.      190.6945
75%    15jul2020      15dec2020
90%    15oct2020      15dec2020       Variance       36364.38
95%    15nov2020      15dec2020       Skewness       .0043504
99%    15dec2020      15dec2020       Kurtosis       1.802551

                  smoking_status_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jul1972      15jan1970
10%    15jan1975      15jan1970       Obs              28,500
25%    15oct1982      15jan1970       Sum of Wgt.      28,500

50%    15may1995                      Mean          15jun1995
                        Largest       Std. Dev.      5372.367
75%    15mar2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.89e+07
95%    15may2018      15dec2020       Skewness      -.0004658
99%    15jun2020      15dec2020       Kurtosis        1.80013

              chronic_respiratory_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    30jun1970      15jan1970
 5%    15mar1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    15may1982      15jan1970       Sum of Wgt.       6,000

50%    15aug1994                      Mean          13dec1994
                        Largest       Std. Dev.      5363.386
75%    15mar2007      15dec2020
90%    30oct2015      15dec2020       Variance       2.88e+07
95%    15jun2018      15dec2020       Skewness       .0504856
99%    15jun2020      15dec2020       Kurtosis       1.826004

                chronic_cardiac_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15may1970      15jan1970
 5%    15jul1972      15jan1970
10%    15feb1975      15jan1970       Obs               6,000
25%    15oct1982      15jan1970       Sum of Wgt.       6,000

50%    15feb1996                      Mean          16sep1995
                        Largest       Std. Dev.      5431.253
75%    15sep2008      15dec2020
90%    15feb2016      15dec2020       Variance       2.95e+07
95%    15aug2018      15dec2020       Skewness      -.0242037
99%    15jun2020      15dec2020       Kurtosis       1.768789

                   hba1c_mmol_per_mol_date
-------------------------------------------------------------
no observations

                    hba1c_percentage_date
-------------------------------------------------------------
no observations

                      cancer_haem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15may1972      15jan1970
10%    30sep1974      15jan1970       Obs               6,000
25%    15jun1982      15jan1970       Sum of Wgt.       6,000

50%    15nov1994                      Mean          31jan1995
                        Largest       Std. Dev.      5374.838
75%    15dec2007      15dec2020
90%    15sep2015      15dec2020       Variance       2.89e+07
95%    15jun2018      15dec2020       Skewness       .0338345
99%    15jun2020      15dec2020       Kurtosis       1.811165

                     cancer_nonhaem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jun1972      15jan1970
10%    15nov1974      15jan1970       Obs               6,000
25%    15dec1982      15jan1970       Sum of Wgt.       6,000

50%    15aug1995                      Mean          11aug1995
                        Largest       Std. Dev.      5388.215
75%    15may2008      15dec2020
90%    15feb2016      15dec2020       Variance       2.90e+07
95%    15jul2018      15dec2020       Skewness       .0008248
99%    15jul2020      15dec2020       Kurtosis       1.804676

               permanent_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15may1972      15jan1970
10%    15nov1974      15jan1970       Obs               6,000
25%    15jul1982      15jan1970       Sum of Wgt.       6,000

50%    15aug1995                      Mean          30may1995
                        Largest       Std. Dev.      5384.136
75%    15feb2008      15dec2020
90%    15sep2015      15dec2020       Variance       2.90e+07
95%    15apr2018      15dec2020       Skewness      -.0159012
99%    15jun2020      15dec2020       Kurtosis       1.796237

                        asplenia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15may1970      15jan1970
 5%    15apr1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    15aug1982      15jan1970       Sum of Wgt.       6,000

50%    15mar1995                      Mean          04may1995
                        Largest       Std. Dev.       5396.06
75%    15apr2008      15dec2020
90%    30oct2015      15dec2020       Variance       2.91e+07
95%    15may2018      15dec2020       Skewness       .0169863
99%    15jun2020      15dec2020       Kurtosis       1.790036

               temporary_immunodeficiency_date
-------------------------------------------------------------
no observations

                 chronic_liver_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15may1972      15jan1970
10%    15jan1975      15jan1970       Obs               6,000
25%    30jul1982      15jan1970       Sum of Wgt.       6,000

50%    15nov1994                      Mean          04mar1995
                        Largest       Std. Dev.      5382.191
75%    15jan2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.90e+07
95%    15may2018      15dec2020       Skewness       .0302815
99%    15jul2020      15dec2020       Kurtosis       1.799482

                    stroke_dementia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug1970      15jan1970
 5%    15jul1972      15jan1970
10%    30dec1974      15jan1970       Obs               6,000
25%    15jul1982      15jan1970       Sum of Wgt.       6,000

50%    30may1995                      Mean          11jul1995
                        Largest       Std. Dev.       5388.11
75%    15mar2008      15nov2020
90%    15mar2016      15dec2020       Variance       2.90e+07
95%    30aug2018      15dec2020       Skewness       .0118469
99%    30jun2020      15dec2020       Kurtosis       1.804756

                      other_neuro_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15aug1972      15jan1970
10%    15apr1975      15jan1970       Obs               6,000
25%    15nov1982      15jan1970       Sum of Wgt.       6,000

50%    15jun1995                      Mean          31aug1995
                        Largest       Std. Dev.      5402.746
75%    30jul2008      15dec2020
90%    15feb2016      15dec2020       Variance       2.92e+07
95%    15oct2018      15dec2020       Skewness       .0066255
99%    15jul2020      15dec2020       Kurtosis       1.799822

                          esrf_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15may1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    15jun1982      15jan1970       Sum of Wgt.       6,000

50%    15jun1995                      Mean          03jun1995
                        Largest       Std. Dev.       5421.73
75%    15apr2008      15dec2020
90%    15jan2016      15dec2020       Variance       2.94e+07
95%    15jun2018      15dec2020       Skewness       .0057696
99%    15jun2020      15dec2020       Kurtosis       1.787669

                        dialysis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15may1972      15jan1970
10%    15sep1974      15jan1970       Obs               6,000
25%    15aug1982      15jan1970       Sum of Wgt.       6,000

50%    15may1995                      Mean          24apr1995
                        Largest       Std. Dev.      5361.769
75%    15sep2007      15dec2020
90%    15aug2015      15dec2020       Variance       2.87e+07
95%    15mar2018      15dec2020       Skewness      -.0012797
99%    15may2020      15dec2020       Kurtosis       1.808994

                   kidney_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jun1972      15jan1970
10%    15feb1975      15jan1970       Obs               6,000
25%    15mar1983      15jan1970       Sum of Wgt.       6,000

50%    15may1995                      Mean          07jul1995
                        Largest       Std. Dev.      5327.433
75%    29feb2008      15dec2020
90%    15aug2015      15dec2020       Variance       2.84e+07
95%    15mar2018      15dec2020       Skewness      -.0118454
99%    15may2020      15dec2020       Kurtosis       1.828053

                    other_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    30may1970      15jan1970
 5%    15jun1972      15jan1970
10%    15nov1974      15jan1970       Obs               6,000
25%    15may1982      15jan1970       Sum of Wgt.       6,000

50%    15mar1995                      Mean          01may1995
                        Largest       Std. Dev.      5396.197
75%    15dec2007      15dec2020
90%    15jan2016      15dec2020       Variance       2.91e+07
95%    15may2018      15dec2020       Skewness       .0107845
99%    15jun2020      15dec2020       Kurtosis       1.798525

                      hypertension_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jun1972      15jan1970
10%    15jan1975      15jan1970       Obs               6,000
25%    15jun1982      15jan1970       Sum of Wgt.       6,000

50%    15jun1995                      Mean          24apr1995
                        Largest       Std. Dev.      5399.781
75%    15sep2007      15jul2021
90%    15dec2015      15aug2021       Variance       2.92e+07
95%    15oct2018      15aug2021       Skewness       .0319122
99%    30jan2021      15aug2021       Kurtosis       1.819527

                    ra_sle_psoriasis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jun1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    30jun1982      15jan1970       Sum of Wgt.       6,000

50%    15feb1995                      Mean          09apr1995
                        Largest       Std. Dev.      5377.953
75%    15jan2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.89e+07
95%    30may2018      15dec2020       Skewness       .0195227
99%    15may2020      15dec2020       Kurtosis       1.794625

                     has_12_m_follow_up
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           .5              0
10%            1              0       Obs              30,000
25%            1              0       Sum of Wgt.      30,000

50%            1                      Mean                .95
                        Largest       Std. Dev.      .2179486
75%            1              1
90%            1              1       Variance       .0475016
95%            1              1       Skewness      -4.129483
99%            1              1       Kurtosis       18.05263

                   died_ons_covid_flag_any
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,000
25%            0              0       Sum of Wgt.      30,000

50%            1                      Mean                 .6
                        Largest       Std. Dev.      .4899061
75%            1              1
90%            1              1       Variance        .240008
95%            1              1       Skewness      -.4082483
99%            1              1       Kurtosis       1.166667

               died_ons_covid_flag_underlying
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,000
25%            0              0       Sum of Wgt.      30,000

50%            1                      Mean                 .6
                        Largest       Std. Dev.      .4899061
75%            1              1
90%            1              1       Variance        .240008
95%            1              1       Skewness      -.4082483
99%            1              1       Kurtosis       1.166667

              covid_admission_primary_diagnosis
-------------------------------------------------------------
no observations

                            sgtf
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              27,004
25%            0              0       Sum of Wgt.      27,004

50%            1                      Mean           1.443157
                        Largest       Std. Dev.      2.712356
75%            1              9
90%            9              9       Variance       7.356877
95%            9              9       Skewness       2.332879
99%            9              9       Kurtosis       6.727997

                           lft_pcr
-------------------------------------------------------------
no observations

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              30,000
25%           21              0       Sum of Wgt.      30,000

50%           40                      Mean           40.25087
                        Largest       Std. Dev.      23.67912
75%           58            107
90%           73            108       Variance        560.701
95%           79            109       Skewness       .1395696
99%           89            109       Kurtosis       2.068879

                             sex
-------------------------------------------------------------
no observations

                             imd
-------------------------------------------------------------
      Percentiles      Smallest
 1%          100            100
 5%          100            100
10%          100            100       Obs              30,000
25%          200            100       Sum of Wgt.      30,000

50%          300                      Mean           259.7433
                        Largest       Std. Dev.      66.38685
75%          300            300
90%          300            300       Variance       4407.214
95%          300            300       Skewness      -1.386643
99%          300            300       Kurtosis        3.58309

                             stp
-------------------------------------------------------------
no observations

                          ethnicity
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              27,001
25%            1              1       Sum of Wgt.      27,001

50%            1                      Mean           1.597682
                        Largest       Std. Dev.      1.280836
75%            1              5
90%            5              5       Variance       1.640541
95%            5              5       Skewness       1.927427
99%            5              5       Kurtosis       5.172938

                        household_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%          535            200
 5%          670            242
10%          743            253       Obs              30,000
25%          865            264       Sum of Wgt.      30,000

50%         1000                      Mean           1000.822
                        Largest       Std. Dev.      200.9944
75%         1138           1683
90%         1258           1706       Variance       40398.75
95%         1331           1729       Skewness        -.01605
99%         1465           1773       Kurtosis       2.951248

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              30,000
25%            2              0       Sum of Wgt.      30,000

50%            3                      Mean           2.507867
                        Largest       Std. Dev.      1.030165
75%            3              6
90%            4              6       Variance        1.06124
95%            4              7       Skewness        .025084
99%            5              7       Kurtosis       2.908843

                       care_home_type
-------------------------------------------------------------
no observations

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0      -20.24446
 5%            0      -12.96402
10%     8.991643      -11.58281       Obs              30,000
25%     17.02594      -9.534741       Sum of Wgt.      30,000

50%     24.39045                      Mean           23.85306
                        Largest       Std. Dev.      11.17803
75%     31.43117       61.13321
90%     37.77072       61.42428       Variance       124.9484
95%     41.31628        63.4625       Skewness      -.2146461
99%     48.17382       63.86672       Kurtosis       2.908475

                           bp_sys
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     40.10485              0
10%     103.7576              0       Obs              30,000
25%     111.9215              0       Sum of Wgt.      30,000

50%     119.3095                      Mean           113.9522
                        Largest       Std. Dev.      27.89735
75%     126.3137       157.2578
90%     132.4977       157.5588       Variance       778.2623
95%     136.1439       158.7737       Skewness      -3.319755
99%     143.0498       162.0554       Kurtosis       14.00235

                           bp_dias
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     19.81914              0
10%     63.63921              0       Obs              30,000
25%      71.8531              0       Sum of Wgt.      30,000

50%     79.27542                      Mean           75.90936
                        Largest       Std. Dev.      19.96867
75%     86.19983       117.0586
90%     92.39558       117.0665       Variance       398.7476
95%     96.19176       118.5826       Skewness      -2.597096
99%     102.8856        124.308       Kurtosis       10.68157

                         creatinine
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     2.192838              0
10%     35.61899              0       Obs              30,000
25%     48.00334              0       Sum of Wgt.      30,000

50%     59.08484                      Mean           57.10263
                        Largest       Std. Dev.      19.66502
75%     69.52344       114.4279
90%     79.16982       116.9343       Variance       386.7131
95%     84.82762       117.4298       Skewness      -.9528188
99%     95.05157       118.9083       Kurtosis       4.615235

                       smoking_status
-------------------------------------------------------------
no observations

                        diabetes_type
-------------------------------------------------------------
no observations

                     hba1c_mmol_per_mol
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -6.142841      -47.64309
 5%            0      -35.24802
10%     7.719399      -34.92536       Obs              30,000
25%     24.17747      -34.66727       Sum of Wgt.      30,000

50%     38.91639                      Mean           38.10711
                        Largest       Std. Dev.      21.29769
75%     52.63535       116.2295
90%     64.86777       116.9817       Variance       453.5914
95%     72.17897       117.2539       Skewness      -.0515635
99%     86.96921       117.2752       Kurtosis       2.785599

                      hba1c_percentage
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0      -3.078432
 5%            0      -2.926397
10%      1.72929      -2.613364       Obs              30,000
25%     3.355361      -2.202939       Sum of Wgt.      30,000

50%     4.854513                      Mean           4.732922
                        Largest       Std. Dev.      2.239121
75%     6.252478       12.17979
90%     7.498709       12.24448       Variance       5.013661
95%     8.238678       12.27006       Skewness      -.2148899
99%      9.61518       12.57296       Kurtosis       2.885583

                           asthma
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               6,000
25%            0              0       Sum of Wgt.       6,000

50%            0                      Mean               .711
                        Largest       Std. Dev.      .9016362
75%            2              2
90%            2              2       Variance       .8129478
95%            2              2       Skewness       .6002264
99%            2              2       Kurtosis       1.499246

                         patient_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%       2752.5              7
 5%        15151             11
10%      30190.5             17       Obs              30,000
25%      75054.5             26       Sum of Wgt.      30,000

50%     149869.5                      Mean           150179.5
                        Largest       Std. Dev.      86758.26
75%     225427.5         299962
90%     270201.5         299966       Variance       7.53e+09
95%     284925.5         299988       Skewness      -.0013373
99%       296916         299999       Kurtosis       1.791423

                        diabetes_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15sep1970      15jan1970
 5%    15jul1972      15feb1970
10%    15jun1975      15mar1970       Obs               1,506
25%    15nov1982      15mar1970       Sum of Wgt.       1,506

50%    15nov1994                      Mean          29mar1995
                        Largest       Std. Dev.      5338.514
75%    15jul2007      15nov2020
90%    15jan2016      15nov2020       Variance       2.85e+07
95%    15jun2018      15dec2020       Skewness        .047959
99%    15aug2020      15dec2020       Kurtosis       1.834137

                       covid_icu_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    01jan2021      21dec2020
10%    14jan2021      21dec2020       Obs              24,001
25%    18feb2021      21dec2020       Sum of Wgt.      24,001

50%    19apr2021                      Mean          18apr2021
                        Largest       Std. Dev.      69.26175
75%    17jun2021      17aug2021
90%    24jul2021      17aug2021       Variance       4797.191
95%    06aug2021      17aug2021       Skewness       .0153309
99%    15aug2021      17aug2021       Kurtosis       1.800482

                  positive_covid_test_ever
-------------------------------------------------------------
      Percentiles      Smallest
 1%    26apr2021      28jan2021
 5%    07jun2021      31jan2021
10%    25jun2021      02feb2021       Obs               6,000
25%    16jul2021      04feb2021       Sum of Wgt.       6,000

50%    01aug2021                      Mean          24jul2021
                        Largest       Std. Dev.      23.93412
75%    11aug2021      17aug2021
90%    15aug2021      17aug2021       Variance        572.842
95%    16aug2021      17aug2021       Skewness      -2.129121
99%    17aug2021      17aug2021       Kurtosis       9.702122

                  covid_tpp_codes_clinical
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    01jan2021      21dec2020
10%    13jan2021      21dec2020       Obs              15,000
25%    20feb2021      21dec2020       Sum of Wgt.      15,000

50%    20apr2021                      Mean          19apr2021
                        Largest       Std. Dev.      69.00874
75%    17jun2021      17aug2021
90%    25jul2021      17aug2021       Variance       4762.206
95%    05aug2021      17aug2021       Skewness      -.0131939
99%    15aug2021      17aug2021       Kurtosis        1.82338

                    covid_tpp_codes_test
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    01jan2021      21dec2020
10%    13jan2021      21dec2020       Obs              15,000
25%    19feb2021      21dec2020       Sum of Wgt.      15,000

50%    19apr2021                      Mean          19apr2021
                        Largest       Std. Dev.      69.37146
75%    20jun2021      17aug2021
90%    25jul2021      17aug2021       Variance       4812.399
95%    05aug2021      17aug2021       Skewness       -.008185
99%    15aug2021      17aug2021       Kurtosis       1.794816

                     covid_tpp_codes_seq
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    02jan2021      21dec2020
10%    14jan2021      21dec2020       Obs              15,000
25%    20feb2021      21dec2020       Sum of Wgt.      15,000

50%    20apr2021                      Mean          19apr2021
                        Largest       Std. Dev.      68.83714
75%    19jun2021      17aug2021
90%    24jul2021      17aug2021       Variance       4738.552
95%    05aug2021      17aug2021       Skewness      -.0003726
99%    15aug2021      17aug2021       Kurtosis       1.816299

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    01jan2021      21dec2020
10%    13jan2021      21dec2020       Obs              24,001
25%    18feb2021      21dec2020       Sum of Wgt.      24,001

50%    19apr2021                      Mean          18apr2021
                        Largest       Std. Dev.       69.1512
75%    18jun2021      17aug2021
90%    24jul2021      17aug2021       Variance       4781.889
95%    05aug2021      17aug2021       Skewness       .0048504
99%    15aug2021      17aug2021       Kurtosis       1.802202

                    covid_admission_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    22dec2020      20dec2020
 5%    01jan2021      20dec2020
10%    13jan2021      20dec2020       Obs              13,388
25%    18feb2021      20dec2020       Sum of Wgt.      13,388

50%    19apr2021                      Mean          19apr2021
                        Largest       Std. Dev.      69.63813
75%    19jun2021      17aug2021
90%    25jul2021      17aug2021       Variance       4849.469
95%    06aug2021      17aug2021       Skewness       .0060939
99%    15aug2021      17aug2021       Kurtosis       1.797895

                     covid_tpp_probable
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    02jan2021      21dec2020
10%    14jan2021      21dec2020       Obs              28,809
25%    18feb2021      21dec2020       Sum of Wgt.      28,809

50%    20apr2021                      Mean          20apr2021
                        Largest       Std. Dev.      69.53439
75%    20jun2021      17aug2021
90%    25jul2021      17aug2021       Variance       4835.031
95%    06aug2021      17aug2021       Skewness      -.0042116
99%    15aug2021      17aug2021       Kurtosis       1.788364

                       covid_vacc_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    11dec2020      09dec2020
 5%    19dec2020      09dec2020
10%    30dec2020      09dec2020       Obs              15,000
25%    02feb2021      09dec2020       Sum of Wgt.      15,000

50%    28mar2021                      Mean          27mar2021
                        Largest       Std. Dev.      63.32374
75%    22may2021      16jul2021
90%    24jun2021      16jul2021       Variance       4009.896
95%    05jul2021      16jul2021       Skewness       .0097687
99%    14jul2021      16jul2021       Kurtosis       1.810109

                 covid_vacc_second_dose_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    09dec2020      09dec2020
 5%    13dec2020      09dec2020
10%    17dec2020      09dec2020       Obs               5,988
25%    29dec2020      09dec2020       Sum of Wgt.       5,988

50%    19jan2021                      Mean          18jan2021
                        Largest       Std. Dev.      23.84506
75%    08feb2021      01mar2021
90%    21feb2021      01mar2021       Variance       568.5867
95%    25feb2021      01mar2021       Skewness      -.0026832
99%    01mar2021      01mar2021       Kurtosis       1.803398

                covid_admission_primary_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%        22271          22269
 5%        22281          22269
10%        22294          22269       Obs               6,698
25%        22329          22269       Sum of Wgt.       6,698

50%        22389                      Mean           22389.84
                        Largest       Std. Dev.       69.4157
75%        22450          22509
90%        22486          22509       Variance        4818.54
95%        22498          22509       Skewness       .0051009
99%        22508          22509       Kurtosis       1.805458

                covid_primary_care_codes_only
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      21dec2020
 5%    02jan2021      21dec2020
10%    14jan2021      21dec2020       Obs              28,500
25%    17feb2021      21dec2020       Sum of Wgt.      28,500

50%    19apr2021                      Mean          18apr2021
                        Largest       Std. Dev.      69.12576
75%    18jun2021      17aug2021
90%    24jul2021      17aug2021       Variance        4778.37
95%    05aug2021      17aug2021       Skewness       .0074499
99%    15aug2021      17aug2021       Kurtosis       1.797527

. 
. 
. /*Flag earliest date under18s vaccinated*/
. gen under18vacc_temp=covid_vacc_date if age<18
(26,847 missing values generated)

. bysort household_id: egen under18vacc=min(under18vacc_temp)
(1944 missing values generated)

. format under18vacc* %td

. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(15,430 missing values generated)

. replace male = 0 if sex == "F"
(15,430 real changes made)

. 
. * Ethnicity 
. replace ethnicity = .u if ethnicity == .
(2,999 real changes made, 2,999 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(29,990 missing values generated)

. replace stp = sum(stp)
(29,999 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(30,000 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 30000 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age 18/29.9999 = 1 /// 
>                    30/39.9999 = 2 /// 
>            40/49.9999 = 3 ///
>                    50/59.9999 = 4 ///
>                60/69.9999 = 5 ///
>                    70/79.9999 = 6 ///
>                    80/max = 7, gen(agegroup) 
(23648 differences between age and agegroup)

. 
. label define agegroup   1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Create binary age (for age stratification)
. recode age min/65.999999999 = 0 ///
>            66/max = 1, gen(age66)
(29643 differences between age and age66)

. 
. * Check there are no missing ages
. assert age < .

. assert agegroup < .

. assert age66 < .

. 
. 
. /* APPLY HH level INCLUSION/EXCLUIONS========================================
> ==========*/ 
. 
. noi di "DROP if HH ID==0"
DROP if HH ID==0

. count if household_id==0
  0

. drop if household_id==0
(0 observations deleted)

. count
  30,000

. 
. drop if care_home_type!="U"
(926 observations deleted)

. count
  29,074

. 
. noi di "DROP HH>=10 persons:"
DROP HH>=10 persons:

. sum household_size, d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            1              0       Obs              29,074
25%            2              0       Sum of Wgt.      29,074

50%            3                      Mean           2.509871
                        Largest       Std. Dev.      1.030536
75%            3              6
90%            4              6       Variance       1.062005
95%            4              7       Skewness       .0241489
99%            5              7       Kurtosis       2.905175

. drop if household_size>=10
(0 observations deleted)

. count
  29,074

. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. recode age .=9
(age: 0 changes made)

. recode age .u=9
(age: 0 changes made)

. bysort household_id: egen age_drop=max(age)

. drop if age_drop==9
(2 observations deleted)

. count
  29,072

. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. ***KIDS_CAT5 (5 categories)
. *Identify kids under 5/5-11/12-18
. gen no_of_kids=1 if age<5
(27,409 missing values generated)

. recode no_of_kids .=2 if age<12
(no_of_kids: 2498 changes made)

. recode no_of_kids .=3 if age<18 
(no_of_kids: 1996 changes made)

. 
. *Make seperate files with only kids and household number
. preserve

. keep if age<18
(22,915 observations deleted)

. keep household_id no_of_kids

. *Drop duplicates (i.e. for hh with kids of same age, keep only one)
. duplicates drop

Duplicates in terms of all variables

(3,911 observations deleted)

. *If a hh has >1 record, there must be mixed ages in it: flag these as categor
> y 4
. bysort household_id: replace no_of_kids=4 if _N>1
(2,028 real changes made)

. duplicates drop

Duplicates in terms of all variables

(1,269 observations deleted)

. rename no_of_kids kids_cat5

. save kids_mixed_category, replace
(note: file kids_mixed_category.dta not found)
file kids_mixed_category.dta saved

. restore

. 
. *merge in kids identifier
. merge m:1 household_id using kids_mixed_category, nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                           667
        from master                       667  
        from using                          0  

    matched                            28,405  
    -----------------------------------------

. 
. *label variable
. lab define   kids_cat5 0 none  1 "only <5 years" ///
> 2 "only 5-11" 3 "12-<18" 4 "mixed"

. lab val kids_cat5 kids_cat5

. recode kids_cat5 .=0
(kids_cat5: 667 changes made)

. tab kids_cat5

    kids_cat5 |      Freq.     Percent        Cum.
--------------+-----------------------------------
         none |        667        2.29        2.29
only <5 years |        467        1.61        3.90
    only 5-11 |        560        1.93        5.83
       12-<18 |        443        1.52        7.35
        mixed |     26,935       92.65      100.00
--------------+-----------------------------------
        Total |     29,072      100.00

. drop no_of_kids

. 
. ***KIDS_CAT4 (4 categories)
. *Identify kids under 0-11/12-18
. gen no_of_kids=1 if age<12
(24,911 missing values generated)

. recode no_of_kids .=2 if age<18 
(no_of_kids: 1996 changes made)

. 
. *Make seperate files with only kids and household number
. preserve

. keep if age<18
(22,915 observations deleted)

. keep household_id no_of_kids

. *Drop duplicates (i.e. for hh with kids of same age, keep only one)
. duplicates drop

Duplicates in terms of all variables

(4,514 observations deleted)

. *If a hh has >1 record, there must be mixed ages in it: flag these as categor
> y 4
. bysort household_id: replace no_of_kids=3 if _N>1
(1,332 real changes made)

. duplicates drop

Duplicates in terms of all variables

(666 observations deleted)

. rename no_of_kids kids_cat4

. list in 1/100

     +---------------------+
     | househ~d   kids_c~4 |
     |---------------------|
  1. |      332          1 |
  2. |      350          1 |
  3. |      361          2 |
  4. |      375          1 |
  5. |      377          1 |
     |---------------------|
  6. |      382          2 |
  7. |      387          1 |
  8. |      400          1 |
  9. |      402          1 |
 10. |      414          1 |
     |---------------------|
 11. |      415          2 |
 12. |      419          1 |
 13. |      421          2 |
 14. |      426          1 |
 15. |      433          1 |
     |---------------------|
 16. |      441          1 |
 17. |      450          1 |
 18. |      451          1 |
 19. |      453          2 |
 20. |      454          2 |
     |---------------------|
 21. |      457          2 |
 22. |      458          2 |
 23. |      460          2 |
 24. |      463          1 |
 25. |      464          1 |
     |---------------------|
 26. |      468          1 |
 27. |      469          1 |
 28. |      471          1 |
 29. |      472          1 |
 30. |      473          1 |
     |---------------------|
 31. |      474          1 |
 32. |      479          1 |
 33. |      484          2 |
 34. |      487          1 |
 35. |      488          1 |
     |---------------------|
 36. |      489          1 |
 37. |      498          2 |
 38. |      502          1 |
 39. |      504          1 |
 40. |      506          1 |
     |---------------------|
 41. |      508          1 |
 42. |      509          1 |
 43. |      510          2 |
 44. |      517          1 |
 45. |      518          1 |
     |---------------------|
 46. |      520          2 |
 47. |      525          2 |
 48. |      527          1 |
 49. |      530          2 |
 50. |      531          2 |
     |---------------------|
 51. |      532          2 |
 52. |      534          1 |
 53. |      535          1 |
 54. |      537          1 |
 55. |      538          3 |
     |---------------------|
 56. |      539          1 |
 57. |      540          1 |
 58. |      541          1 |
 59. |      543          2 |
 60. |      546          2 |
     |---------------------|
 61. |      547          2 |
 62. |      549          1 |
 63. |      551          1 |
 64. |      552          1 |
 65. |      553          1 |
     |---------------------|
 66. |      554          2 |
 67. |      556          1 |
 68. |      557          3 |
 69. |      558          3 |
 70. |      559          3 |
     |---------------------|
 71. |      561          1 |
 72. |      562          3 |
 73. |      565          2 |
 74. |      568          1 |
 75. |      569          2 |
     |---------------------|
 76. |      570          1 |
 77. |      572          3 |
 78. |      573          2 |
 79. |      575          1 |
 80. |      576          1 |
     |---------------------|
 81. |      577          3 |
 82. |      578          2 |
 83. |      579          3 |
 84. |      580          1 |
 85. |      581          3 |
     |---------------------|
 86. |      582          1 |
 87. |      583          3 |
 88. |      584          3 |
 89. |      585          1 |
 90. |      586          3 |
     |---------------------|
 91. |      587          1 |
 92. |      590          3 |
 93. |      591          3 |
 94. |      592          2 |
 95. |      594          1 |
     |---------------------|
 96. |      595          3 |
 97. |      597          3 |
 98. |      599          1 |
 99. |      601          2 |
100. |      602          3 |
     +---------------------+

. save kids_mixed_category, replace
file kids_mixed_category.dta saved

. restore

. 
. *merge in kids identifier
. merge m:1 household_id using kids_mixed_category, nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                           667
        from master                       667  
        from using                          0  

    matched                            28,405  
    -----------------------------------------

. 
. *label variable
. lab define   kids_cat4 0 none  1 "only <12 years" ///
> 2 "only 12-18" ///
> 3 "mixed"

. lab val kids_cat4 kids_cat4

. recode kids_cat4 .=0
(kids_cat4: 667 changes made)

. tab kids_cat4

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        667        2.29        2.29
only <12 years |      2,946       10.13       12.43
    only 12-18 |        443        1.52       13.95
         mixed |     25,016       86.05      100.00
---------------+-----------------------------------
         Total |     29,072      100.00

. 
. *Dose-response exposure: identify number of kids in hh where there are ONLY u
> nder 11 yr olds
. bysort household_id: egen number_kids=sum(no_of_kids) if kids_cat4==1
(26126 missing values generated)

. 
. gen gp_number_kids=number_kids
(26,126 missing values generated)

. recode gp_number_kids 4/max=4
(gp_number_kids: 1012 changes made)

. 
. lab var gp_number_kids "Number kids under 12 years in hh"

. lab define   gp_number_kids 0 none ///
> 1 "1 child <12" ///
> 2 "2 children <12" ///
> 3 "3 children <12" ///
> 4 "4+ children <12"

. lab val gp_number_kids gp_number_kids

. 
. tab kids_cat4 

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        667        2.29        2.29
only <12 years |      2,946       10.13       12.43
    only 12-18 |        443        1.52       13.95
         mixed |     25,016       86.05      100.00
---------------+-----------------------------------
         Total |     29,072      100.00

. tab kids_cat5

    kids_cat5 |      Freq.     Percent        Cum.
--------------+-----------------------------------
         none |        667        2.29        2.29
only <5 years |        467        1.61        3.90
    only 5-11 |        560        1.93        5.83
       12-<18 |        443        1.52        7.35
        mixed |     26,935       92.65      100.00
--------------+-----------------------------------
        Total |     29,072      100.00

. tab kids_cat*

              |                  kids_cat4
    kids_cat5 |      none  only <12   only 12-1      mixed |     Total
--------------+--------------------------------------------+----------
         none |       667          0          0          0 |       667 
only <5 years |         0        467          0          0 |       467 
    only 5-11 |         0        560          0          0 |       560 
       12-<18 |         0          0        443          0 |       443 
        mixed |         0      1,919          0     25,016 |    26,935 
--------------+--------------------------------------------+----------
        Total |       667      2,946        443     25,016 |    29,072 

. 
. 
. /* DROP ALL KIDS, AS HH COMPOSITION VARS ARE NOW MADE */
. drop if age<18
(6,157 observations deleted)

. 
. *Total number adults in household (to check hh size)
. bysort household_id: gen tot_adults_hh=_N

. recode tot_adults_hh 3/max=3
(tot_adults_hh: 22486 changes made)

. 
. tab kids_cat4

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        667        2.91        2.91
only <12 years |      2,384       10.40       13.31
    only 12-18 |        358        1.56       14.88
         mixed |     19,506       85.12      100.00
---------------+-----------------------------------
         Total |     22,915      100.00

. tab gp_num if kids_cat4==1

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |        567       23.78       23.78
 2 children <12 |        428       17.95       41.74
 3 children <12 |        312       13.09       54.82
4+ children <12 |      1,077       45.18      100.00
----------------+-----------------------------------
          Total |      2,384      100.00

. 
. erase kids_mixed_category.dta

. 
. /* SET FU DATES==============================================================
> =*/ 
. * Censoring dates for each outcome (largely, last date outcome data available
> )
. *****NEEDS UPDATING WHEN INFO AVAILABLE*******************
. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. rename dereg_date_date                                          dereg_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes_date  ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 dialysis                     
>                    ///
>                                                 kidney_transplant            
>            ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         
. }

. 
. 
. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(1,130 real changes made, 1,130 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(3,513 real changes made, 3,513 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(1,130 missing values generated)

. gen bmi_age = age - bmi_time
(1,130 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(371 real changes made, 371 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(3,884 real changes made, 3,884 to missing)

. replace bmi_measured = . if bmi == . 
(5,014 real changes made, 5,014 to missing)

. 
. gen     bmicat = .
(22,915 missing values generated)

. recode  bmicat . = 1 if bmi < 18.5
(bmicat: 2114 changes made)

. recode  bmicat . = 2 if bmi < 25
(bmicat: 5227 changes made)

. recode  bmicat . = 3 if bmi < 30
(bmicat: 4024 changes made)

. recode  bmicat . = 4 if bmi < 35
(bmicat: 3190 changes made)

. recode  bmicat . = 5 if bmi < 40
(bmicat: 2013 changes made)

. recode  bmicat . = 6 if bmi < .
(bmicat: 1333 changes made)

. replace bmicat = .u if bmi >= .
(5,014 real changes made, 5,014 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Create less  granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(20801 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(21,982 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(455 real changes made)

. replace smoke = 3  if smoking_status == "S"
(2,683 real changes made)

. replace smoke = .u if smoking_status == "M"
(465 real changes made, 465 to missing)

. replace smoke = .u if smoking_status == "" 
(18,379 real changes made, 18,379 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(18844 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(cancer_haem_date, d(1/1/1900), d(1/2/2
> 015))
(18,791 missing values generated)

. replace cancer_haem_cat = 3 if inrange(cancer_haem_date, d(1/2/2015), d(1/2/2
> 019))
(347 real changes made)

. replace cancer_haem_cat = 2 if inrange(cancer_haem_date, d(1/2/2019), d(1/2/2
> 020))
(94 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 18350 changes made)

. label values cancer_haem_cat cancer

. 
. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(cancer_nonhaem_date,  d(1/1/1900), d
> (1/2/2015)) 
(18,885 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(cancer_nonhaem_date,  d(1/2/2015), d
> (1/2/2019))
(353 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(cancer_nonhaem_date,  d(1/2/2019), d
> (1/2/2020)) 
(96 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 18436 changes made)

. label values cancer_exhaem_cat cancer

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(18,350 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), 
> date("$indexdate", "DMY"))

. 
. egen other_immuno = rowmax(temp1 temp2)

. drop temp1 temp2 

. order other_immuno, after(temp_immunodef)

. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(16,553 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(3,859 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(9,416 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(3,887 real changes made)

. replace bpcat = .u if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(2,255 real changes made, 2,255 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" .u "Unknown"

. label values bpcat bpcat

. 
. recode bpcat .u=1, gen(bpcat_nomiss)
(2255 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 3868 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(1,207 real changes made, 1,207 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(1,207 missing values generated)

. 
. gen min=.
(22,915 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(11,176 real changes made)

. replace min = SCr_adj/0.9 if male==1
(10,532 real changes made)

. replace min = min^-0.329  if male==0
(11,176 real changes made)

. replace min = min^-0.411  if male==1
(10,532 real changes made)

. replace min = 1 if min<1
(6,140 real changes made)

. 
. gen max=.
(22,915 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(11,176 real changes made)

. replace max=SCr_adj/0.9 if male==1
(10,532 real changes made)

. replace max=max^-1.209
(21,708 real changes made)

. replace max=1 if max>1
(16,775 real changes made)

. 
. gen egfr=min*max*141
(1,207 missing values generated)

. replace egfr=egfr*(0.993^age)
(21,708 real changes made)

. replace egfr=egfr*1.018 if male==0
(11,176 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(1207 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(21708 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. *label var ckd "CKD stage calc without eth"
. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
.         
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(21463 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(1,207 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. lab var  reduced "Reduced kidney function"

. 
. 
. /*ESDR: dialysis or kidney transplant*/
. gen esrd=1 if dialysis==1 | kidney_transplant==1
(14,703 missing values generated)

. recode esrd .=0
(esrd: 14703 changes made)

. 
. 
. 
. ***************************
. /* DM / Hb1AC */
. ***************************
. 
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(1,306 real changes made, 1,306 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(1,627 real changes made, 1,627 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |     21,609    5.019662    1.960869   .0016648   12.57296
hba1c_mmol~l |     21,288    41.27473    18.71156   .0013085   117.2752

. gen     hba1c_pct = hba1c_percentage 
(1,306 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(21,288 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(22,836 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(22,245 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(4,584 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(446 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(17,215 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |    17,215          0          0          0 |    17,215 
         1 |         0        670          0          0 |       670 
         2 |         0          0      4,584          0 |     4,584 
         3 |         0          0          0        446 |       446 
-----------+--------------------------------------------+----------
     Total |    17,215        670      4,584        446 |    22,915 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. /*Open safely diabetes codes with exeter algorithm
> gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
> replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
> replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
> label values  dm_type_exeter_os dm_type*/
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(8,393 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(4,112 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(1,461 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(1,770 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(971 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |     14,522       63.59       63.59
  >=6.5-7.4 |      4,112       18.01       81.60
  >=7.5-7.9 |      1,461        6.40       88.00
    >=8-8.9 |      1,770        7.75       95.75
        >=9 |        971        4.25      100.00
------------+-----------------------------------
      Total |     22,836      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(4,281 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(4,202 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,634       81.32       81.32
          1 |      4,202       18.34       99.66
          . |         79        0.34      100.00
------------+-----------------------------------
      Total |     22,915      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0 | dm_type==.
(5,700 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(546 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(123 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(3,738 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(827 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(20 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     17,215       75.13       75.13
  T1DM, controlled |        546        2.38       77.51
T1DM, uncontrolled |        123        0.54       78.04
  T2DM, controlled |      3,738       16.31       94.36
T2DM, uncontrolled |        827        3.61       97.97
Diabetes, no HbA1c |         20        0.09       98.05
                 . |        446        1.95      100.00
-------------------+-----------------------------------
             Total |     22,915      100.00

. recode diabcat .=1
(diabcat: 446 changes made)

. 
. 
. 
. /*  Asthma  */
. 
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3
(asthmacat: 4586 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. /*  Probable shielding  */
. gen shield=1 if esrd==1 | other_transplant==1 | asthmacat==2 | asthmacat==3 |
>  ///
> chronic_respiratory_disease==1 | cancer_haem==1 | cancer_nonhaem==1 | ///
> asplenia==1 | other_immuno==1
(3,497 missing values generated)

. recode shield .=0
(shield: 3497 changes made)

. 
. /*Any comorbidity*/
. 
. gen anycomorb=1 if chronic_respiratory_disease==1 | ///
>                     asthmacat==2 | asthmacat==3 | ///
>                                         chronic_cardiac_disease==1  | ///
>                                         diabcat==2 | diabcat==3 | diabcat==4 
> | diabcat==5 | diabcat==6 | ///
>                                         cancer_haem==1 | cancer_nonhaem==1 | 
> ///
>                                         esrd==1 | ///
>                                         chronic_liver_disease==1 | ///
>                                         stroke_dementia==1 | ///
>                                         other_neuro==1 | ///
>                                         other_transplant==1 | ///
>                                         asplenia==1 | ///
>                                         ra_sle_psoriasis==1 | ///
>                                         other_immuno==1 
(896 missing values generated)

. recode anycomorb .=0
(anycomorb: 896 changes made)

. tab anyco

  anycomorb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        896        3.91        3.91
          1 |     22,019       96.09      100.00
------------+-----------------------------------
      Total |     22,915      100.00

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma categ
> ory"

. label var egfr_cat                                              "Calculated e
> GFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haem
> atological cancer"

. label var cancer_exhaem_cat                                             "Non-
> haematological cancer"

. label var kidney_transplant                                             "Kidn
> ey transplant"     

. label var other_transplant                                              "Othe
> r solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (co
> mbination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"               
>    

. label var stroke_dementia                           "Stroke or dementia"     
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosupp
> ression"

. lab var temp_immunodef                                  "Temporary immunosupp
> ression"

. lab var esrd                                                    "End-stage re
> nal disease"

. 
. lab var covid_vacc_date                         "First vacc date"

. lab var covid_vacc_second_dose_date "Second vacc date"

. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
. gen enter_date = date("$indexdate", "DMY")

. gen study_end_censor =date("$study_end_censor", "DMY")

. gen SUS_study_end_censor =date("$SUS_study_end_censor", "DMY")

. 
. * Format the dates
. format  enter_date                                      ///
>                 study_end_censor  

  variable name     display format
  --------------------------------
  enter_date        %9.0g
  study_end_censor  %9.0g
  --------------------------------

.                 
.                         /****   Outcome definitions   ****/
. 
. * Date of Covid death in ONS
. gen died_date_onscovid = died_date_ons if died_ons_covid_flag_any == 1
(11,903 missing values generated)

. gen died_date_onscovid_part1 = died_date_ons if died_ons_covid_flag_underlyin
> g == 1
(11,859 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen died_date_onsnoncovid = died_date_ons if died_ons_covid_flag_any != 1 
(15,610 missing values generated)

. 
. *Date probable covid in TPP
. rename covid_tpp_probable date_covid_tpp_prob

. 
. format died_date_ons %td

. format died_date_onscovid %td 

. format died_date_onsnoncovid %td

. format covid_icu_date %td 

. format died_date_onscovid_part1 %td

. format covid_admission_primary_date %td

. 
. * Binary indicators (0/1) for outcomes
. gen covid_tpp_prob = (date_covid_tpp_prob < .)

. gen non_covid_death = (died_date_onsnoncovid < .)

. gen covid_death = (died_date_onscovid < .)

. gen covid_icu = (covid_icu_date < .)

. gen covidadmission = (covid_admission_primary_date < .)

. gen covid_death_part1 = (died_date_onscovid_part1 < .)

. 
.                                         /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: end study, death, or that outcom
> e)
. *gen stime_onscoviddeath = min(onscoviddeathcensor_date,                     
>            died_date_ons)
. gen stime_covid_death_part1     = min(study_end_censor   , died_date_onscovid
> _part1, died_date_ons, dereg_date)

. gen stime_covid_tpp_prob = min(study_end_censor   , died_date_ons, date_covid
> _tpp_prob, dereg_date)

. gen stime_non_covid_death = min(study_end_censor   , died_date_ons, died_date
> _onsnoncovid, dereg_date)

. gen stime_covid_death = min(study_end_censor   , died_date_ons, died_date_ons
> covid, dereg_date)

. gen stime_covid_icu = min(study_end_censor, died_date_ons, covid_icu_date, de
> reg_date)

. gen stime_covidadmission        = min(SUS_study_end_censor   , covid_admissio
> n_primary_date, died_date_ons, dereg_date)

. 
. * If outcome was after censoring occurred, set to zero
. replace covid_tpp_prob = 0 if (date_covid_tpp_prob > study_end_censor ) 
(2,989 real changes made)

. replace non_covid_death = 0 if (died_date_onsnoncovid > study_end_censor )
(927 real changes made)

. replace covid_death = 0 if (died_date_onscovid > study_end_censor )
(1,444 real changes made)

. replace covid_icu = 0 if (covid_icu_date > study_end_censor)
(2,429 real changes made)

. replace covidadmission  = 0 if (covid_admission_primary_date > SUS_study_end_
> censor  | covid_admission_primary_date > died_date_ons) 
(2,396 real changes made)

. replace covid_death_part1 = 0 if (died_date_onscovid_part1 > study_end_censor
>  )
(1,410 real changes made)

. 
. * If outcome was after censoring occurred, set date to missing
. replace date_covid_tpp_prob = . if (date_covid_tpp_prob > study_end_censor ) 
(2,989 real changes made, 2,989 to missing)

. replace died_date_onsnoncovid = . if (died_date_onsnoncovid > study_end_censo
> r )
(927 real changes made, 927 to missing)

. replace died_date_onscovid = . if (died_date_onscovid > study_end_censor )
(1,444 real changes made, 1,444 to missing)

. replace covid_icu_date = . if (covid_icu_date > study_end_censor)
(2,429 real changes made, 2,429 to missing)

. replace covid_admission_primary_date    = . if (covid_admission_primary_date 
> > SUS_study_end_censor  | covid_admission_primary_date > died_date_ons) 
(2,396 real changes made, 2,396 to missing)

. replace died_date_onscovid_part1 = . if (died_date_onscovid_part1 > study_end
> _censor )
(1,410 real changes made, 1,410 to missing)

. 
. 
. * Format date variables
. format  stime* %td  

. gen positive_SGSS = (positive_covid_test_ever < .)

. gen covid_primary_care_codes = (covid_primary_care_codes_only < .)

. rename positive_covid_test_ever date_positive_SGSS

. rename covid_primary_care_codes_only date_covid_primary_care_codes

. replace covid_primary_care_codes = 0 if (date_covid_primary_care_codes > stud
> y_end_censor )
(2,807 real changes made)

. replace positive_SGSS = 0 if (date_positive_SGSS > study_end_censor )
(3,420 real changes made)

. 
. replace date_covid_primary_care_codes = . if (date_covid_primary_care_codes >
>  study_end_censor )
(2,807 real changes made, 2,807 to missing)

. replace date_positive_SGSS = . if (date_positive_SGSS > study_end_censor )
(3,420 real changes made, 3,420 to missing)

. 
. 
. gen reported_infection_source=1 if covid_tpp_prob==1
(3,915 missing values generated)

. recode reported_infection_source 1=2 if date_covid_tpp_prob== covid_tpp_codes
> _test 
(reported_infection_source: 39 changes made)

. recode reported_infection_source 1=3 if date_covid_tpp_prob==covid_tpp_codes_
> seq 
(reported_infection_source: 27 changes made)

. recode reported_infection_source 1=4 if date_covid_tpp_prob==covid_tpp_codes_
> clinical 
(reported_infection_source: 39 changes made)

. lab define reported_infection_source 1 SGSS 2 test_code 3 sequalae_code 4 dia
> gnosis_code

. lab val reported_infection_source reported_infection_source

. 
. 
. 
. 
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  number_kids "Number of children aged 1-<12 years in household"

. label var  household_size "Number people in household"

. label var  household_id "Household ID"

. 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age66                                         "66 years and older"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Evidence of obesity 
> (4 categories)"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var ethnicity                                     "Ethnicity"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. lab var tot_adults_hh                           "Total number adults in hh"

. lab var kids_cat4                                       "Exposure (v2) with 4
> -cats"

. lab var kids_cat5                                        "Exposure (v3) with 
> 5-cats"

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma categ
> ory"

. label var egfr_cat                                              "Calculated e
> GFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haem
> atological cancer"

. label var cancer_exhaem_cat                                             "Non-
> haematological cancer"

. label var kidney_transplant                                             "Kidn
> ey transplant"     

. label var other_transplant                                              "Othe
> r solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (co
> mbination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"               
>    

. label var stroke_dementia                           "Stroke or dementia"     
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosupp
> ression"

. lab var temp_immunodef                                  "Temporary immunosupp
> ression"

. lab var esrd                                                    "End-stage re
> nal disease"

. lab var anycomorb                                               "Any comorbid
> ity"

. 
. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_haem_date                                      "Haem cancer 
> Date"

. label var cancer_nonhaem_date                           "Non-haem cancer Date
> "

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date              "Neurological disease  Date"

. label var stroke_dementia_date                      "Stroke or dementia date"
>                                                    

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var perm_immunodef_date                             "Permanent immunosupp
> ression date"

. lab var temp_immunodef_date                             "Temporary immunosupp
> ression date"

. label var kidney_transplant_date                                             
>    "Kidney transplant"     

. label var other_transplant_date                                         "Othe
> r solid organ transplant"

. label var asplenia_date                                                 "Aspl
> enia date"

. lab var  bphigh "non-missing indicator of known high blood pressure"

. lab var bpcat "Blood pressure four levels, non-missing"

. lab var htdiag_or_highbp "High blood pressure or hypertension diagnosis"

. lab var shield "Probable shielding"

. 
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. label var study_end_censor                      "Date of admin censoring for 
> outcomes"

. lab var SUS_study_end_censor                    "Date censoring for SUS"

. 
. label var  covid_tpp_prob                               "Failure/censoring in
> dicator for outcome: covid prob case"

. label var  non_covid_death                              "Failure/censoring in
> dicator for outcome: non-covid death"

. label var  covid_death                              "Failure/censoring indica
> tor for outcome: covid death"

. label var  covid_icu                                "Failure/censoring indica
> tor for outcome: covid icu"

. lab var covidadmission                                  "Failure/censoring in
> dicator for outcome: covid SUS admission"

. lab var covid_death_part1                               "Failure/censoring in
> dicator for outcome: covid death part1"

. lab var  positive_SGSS          "Indicator positive covid test"

. lab var  covid_primary_care_codes               "Indicator positive primary c
> are code COVID infection"

. lab var reported_infection_source               "Reported Infection Source"

. 
. rename died_date_onsnoncovid date_non_covid_death

. rename died_date_onscovid date_covid_death

. rename covid_icu_date date_covid_icu

. rename covid_admission_primary_date date_covidadmission

. label var date_covid_tpp_prob                   "Date of probable COVID-19 cl
> inical infection"

. label var date_non_covid_death                  "Date of ONS non-COVID-19 Dea
> th"

. label var  date_covid_death                     "Date of ONS COVID-19 Death"

. lab var date_covid_icu                                  "Date of admission to
>  ICU for COVID-19" 

. lab var date_covidadmission                     "Date of admission to hospita
> l for COVID-19" 

. label var  died_date_onscovid_part1                     "Date of ONS COVID De
> ath part1"

. lab var  date_positive_SGSS             "Date of positive SGSS test"

. lab var   date_covid_primary_care_codes "Date of COVID-19 primary care code"

. 
. * Survival times
. label var  stime_covid_tpp_prob                         "Survival tme (date);
>  outcome "

. label var  stime_non_covid_death                        "Survival tme (date);
>  outcome non_covid_death   "

. label var  stime_covid_death                            "Survival time (date)
> ; outcome covid death"

. label var  stime_covid_icu                                      "Survival tim
> e (date); outcome covid icu"

. label var  stime_covidadmission                         "Survival time (date)
> ; outcome covid hosp admission"

. label var  stime_covid_death_part1                              "Survival tim
> e (date); outcome covid death part1"

. 
. *Key DATES
. label var   died_date_ons                               "Date death ONS"

. label var  has_12_m_follow_up                   "Has 12 months follow-up"

. lab var  dereg_date                                             "Date deregis
> tration from practice"

. lab var under18vacc                                             "Date first c
> hild in hh vaccinated"

. 
. 
. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
ethnicity_~e  hba1c_mmol~e  sgtf          asthmacat     bmi_age
bmi_measured  hba1c_per~te  lft_pcr       diabetes      SCr_adj
bp_sys_dat~e  cancer_haem   sex           covid_tpp_~l  min
bp_sys_dat~d  cancer_non~m  care_home_~e  covid_tpp_~t  max
bp_dias_da~e  esrf_date     bp_sys        covid_tpp_~q  hba1c_pct
bp_dias_da~d  esrf          bp_dias       covid_admi~e  dm_type
crea~te_date  dialysis_d~e  creatinine    under18vac~p  hba1ccat
crea~ne_date  dialysis      diabetes_t~e  age_drop      hba1c75
smoki~e_date  died_ons_c~y  hba1c_mmol~l  no_of_kids
smoki~s_date  died_ons_c~g  hba1c_per~ge  bmi_time

. drop `r(varlist)'

. drop covid_admission_primary_diagnosi   

. 
.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. *************TEMP DROP TO INVESTIGATE ASSOCIATIONS MORE EASILY***************
> ***
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. count
  22,915

. 
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if died_date_ons <=enter_date
(0 observations deleted)

. count
  22,915

. 
. noi di "DROP IF COVID IN TPP BEFORE INDEX"
DROP IF COVID IN TPP BEFORE INDEX

. drop if date_covid_tpp_prob <=enter_date
(0 observations deleted)

. count
  22,915

. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. recode imd .=9
(imd: 0 changes made)

. recode imd .u=9
(imd: 0 changes made)

. drop if imd==9
(0 observations deleted)

. count
  22,915

. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. recode male .=9
(male: 0 changes made)

. recode male .u=9
(male: 0 changes made)

. drop if male==9
(0 observations deleted)

. count   
  22,915

.         
. ***************
. *  Save data  *
. ***************
. sort patient_id

. save $tempdir/analysis_dataset_with_missing_ethnicity, replace
(note: file tempdata/analysis_dataset_with_missing_ethnicity.dta not found)
file tempdata/analysis_dataset_with_missing_ethnicity.dta saved

. 
. noi di "DROP NO ETHNICITY DATA"
DROP NO ETHNICITY DATA

. keep if ethnicity!=.u   
(2,261 observations deleted)

. 
. save $tempdir/analysis_dataset, replace
(note: file tempdata/analysis_dataset.dta not found)
file tempdata/analysis_dataset.dta saved

. 
. 
. 
. use  $tempdir/analysis_dataset, clear

. keep if age<=65
(4,505 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir/analysis_dataset_ageband_0, replace
(note: file tempdata/analysis_dataset_ageband_0.dta not found)
file tempdata/analysis_dataset_ageband_0.dta saved

. 
. 
. use  $tempdir/analysis_dataset, clear

. keep if age>65
(16,149 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir/analysis_dataset_ageband_1, replace
(note: file tempdata/analysis_dataset_ageband_1.dta not found)
file tempdata/analysis_dataset_ageband_1.dta saved

. 
. 
. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  3. * Save a version set on NON ONS covid death outcome
. stset stime_non_covid_death, fail(non_covid_death)                           
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  4. /*WEIGHTING - TO REDUCE TIME 
> set seed 30459820
> keep if _d==1|uniform()<.03
> gen pw = 1
> replace pw = (1/0.03) if _d==0
> stset stime_non_covid_death [pweight = pw],  fail(non_covid_death)           
>                    ///
>         id(patient_id) enter(enter_date) origin(enter_date)*/
. save "$tempdir/cr_create_analysis_dataset_STSET_non_covid_death_ageband_`x'.d
> ta", replace
  5.         
. /*no longer using composite outcome
> use $tempdir/analysis_dataset_ageband_`x', clear
> * Save a version set on covid death/icu  outcome
> stset stime_covid_death_icu, fail(covid_death_icu)                           
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
> save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_icu_ageband_`x'.d
> ta", replace
> */
. use $tempdir/analysis_dataset_ageband_`x', clear
  6. * Save a version set on covid icu  outcome only
. stset stime_covid_icu, fail(covid_icu)                          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7. save "$tempdir/cr_create_analysis_dataset_STSET_covid_icu_ageband_`x'.dta"
> , replace
  8. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  9. * Save a version set on covid death only
. stset stime_covid_death, fail(covid_death)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 10. save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_`x'.dt
> a", replace
 11. 
. /*this was created for investigation only
> use $tempdir/analysis_dataset_ageband_`x', clear
> * Save a version set on covid death only
> stset stime_covid_death_part1, fail(covid_death_part1)                       
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
> save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_part1_ageband_`x'
> .dta", replace
> */
. use $tempdir/analysis_dataset_ageband_`x', clear
 12. * Save a version set on probable covid
. stset stime_covid_tpp_prob, fail(covid_tpp_prob)                             
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 13. save "$tempdir/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'
> .dta", replace        
 14. 
. use $tempdir/analysis_dataset_ageband_`x', clear
 15. * Save a version set on hosp admission for covid
. stset stime_covidadmission, fail(covidadmission)                             
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 16. save "$tempdir/cr_create_analysis_dataset_STSET_covidadmission_ageband_`x'
> .dta", replace        
 17. 
. }

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,149  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,146  observations remaining, representing
     16,146  subjects
      4,501  failures in single-failure-per-subject data
  2,189,574  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(note: file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_0
> .dta not found)
file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_0.dta sa
> ved

                id:  patient_id
     failure event:  covid_icu != 0 & covid_icu < .
obs. time interval:  (stime_covid_icu[_n-1], stime_covid_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,149  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,146  observations remaining, representing
     16,146  subjects
     11,289  failures in single-failure-per-subject data
  1,561,991  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_0.dta n
> ot found)
file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,149  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,146  observations remaining, representing
     16,146  subjects
      6,763  failures in single-failure-per-subject data
  2,189,574  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta
>  not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,149  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,146  observations remaining, representing
     16,146  subjects
     13,393  failures in single-failure-per-subject data
  1,442,632  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.dta sav
> ed

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,149  total observations
         20  observations end on or before enter()
------------------------------------------------------------------------------
     16,129  observations remaining, representing
     16,129  subjects
      1,882  failures in single-failure-per-subject data
  1,878,694  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       178
(note: file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_0.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_0.dta sav
> ed

                id:  patient_id
     failure event:  non_covid_death != 0 & non_covid_death < .
obs. time interval:  (stime_non_covid_death[_n-1], stime_non_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,505  total observations
          1  observation ends on or before enter()
------------------------------------------------------------------------------
      4,504  observations remaining, representing
      4,504  subjects
      1,235  failures in single-failure-per-subject data
    612,198  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(note: file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_1
> .dta not found)
file tempdata/cr_create_analysis_dataset_STSET_non_covid_death_ageband_1.dta sa
> ved

                id:  patient_id
     failure event:  covid_icu != 0 & covid_icu < .
obs. time interval:  (stime_covid_icu[_n-1], stime_covid_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,505  total observations
          1  observation ends on or before enter()
------------------------------------------------------------------------------
      4,504  observations remaining, representing
      4,504  subjects
      3,090  failures in single-failure-per-subject data
    442,011  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_1.dta n
> ot found)
file tempdata/cr_create_analysis_dataset_STSET_covid_icu_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,505  total observations
          1  observation ends on or before enter()
------------------------------------------------------------------------------
      4,504  observations remaining, representing
      4,504  subjects
      1,872  failures in single-failure-per-subject data
    612,198  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta
>  not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,505  total observations
          1  observation ends on or before enter()
------------------------------------------------------------------------------
      4,504  observations remaining, representing
      4,504  subjects
      3,736  failures in single-failure-per-subject data
    406,708  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.dta sav
> ed

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,505  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
      4,502  observations remaining, representing
      4,502  subjects
        506  failures in single-failure-per-subject data
    524,614  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       178
(note: file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_1.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_1.dta sav
> ed

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/01_cr_analysis_dataset.log
  log type:  text
 closed on:  17 Aug 2021, 07:44:08
-------------------------------------------------------------------------------
