-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_cr_analysis_dataset.log
  log type:  text
 opened on:  17 Nov 2021, 20:22:09

. 
. 
. *Import dataset into STATA
. import delimited "output/input", clear
(63 vars, 30,000 obs)

. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates and TPP case outcome dates are given with month only, so addi
> ng day 
> 15 to enable  them to be processed as dates                                  
>                                                      */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(29,812 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(1,214 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(132 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 dialysis                     
>                    ///
>                                                 kidney_transplant            
>            ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 dereg_date  ///
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable diabetes was str7 now str10
(30,000 real changes made)
(28,466 real changes made)
(28,466 missing values generated)
variable cancer_haem was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable cancer_nonhaem was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable dialysis was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable kidney_transplant was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable other_transplant was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable asplenia was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable chronic_liver_disease was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable other_neuro was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable stroke_dementia was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable esrf was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable hypertension was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(30,000 real changes made)
(24,000 real changes made)
(24,000 missing values generated)
variable bmi_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable bp_sys_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable bp_dias_date_measured was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable creatinine_date was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable smoking_status_date was str7 now str10
(30,000 real changes made)
(1,500 real changes made)
(1,500 missing values generated)
variable dereg_date was str7 now str10
(30,000 real changes made)
(29,894 real changes made)
(29,894 missing values generated)

. 
. * Recode to dates from the strings 
. foreach var of varlist covid_icu_date positive_covid_test covid_test_ever    
>    ///
> covid_tpp_codes_clinical covid_tpp_codes_test covid_tpp_codes_seq ///
> died_date_ons covid_admission_date covid_tpp_probable ///
> covid_vacc_date  covid_vacc_second_dose_date    {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td        
  7. }
(5,999 missing values generated)
(24,000 missing values generated)
(24,000 missing values generated)
(15,000 missing values generated)
(15,000 missing values generated)
(15,000 missing values generated)
(5,999 missing values generated)
(16,215 missing values generated)
(1,500 missing values generated)
(15,000 missing values generated)
(24,000 missing values generated)

. 
. *Amend vaccine dates
. replace covid_vacc_second_dose_date=. if covid_vacc_date==covid_vacc_second_d
> ose_date
(18 real changes made, 18 to missing)

. 
. gen covid_admission_primary_date = covid_admission_date ///
> if (covid_admission_primary_diagnosi == "U071"| covid_admission_primary_diagn
> osi == "U072")
(23,111 missing values generated)

. 
. gen  covid_primary_care_codes_only=covid_tpp_probable
(1,500 missing values generated)

. format covid_primary_care_codes_only %td

. replace covid_tpp_probable=positive_covid_test_ever if covid_tpp_probable==. 
> & covid_tpp_probable>positive_covid_test
(303 real changes made)

. 
. 
. /*Tab all variables in initial extract*/
. sum, d f

                       dereg_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15dec2020      15dec2020
 5%    15jan2021      15dec2020
10%    15jan2021      15dec2020       Obs                 106
25%    15mar2021      15jan2021       Sum of Wgt.         106

50%    15may2021                      Mean          27may2021
                        Largest       Std. Dev.      89.03068
75%    15aug2021      15oct2021
90%    15oct2021      15nov2021       Variance       7926.462
95%    15oct2021      15nov2021       Skewness       .0860652
99%    15nov2021      15nov2021       Kurtosis       2.058463

                       ethnicity_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%         1970           1970
 5%         1972           1970
10%         1974           1970       Obs              27,001
25%         1982           1970       Sum of Wgt.      27,001

50%         1996                      Mean            1995.47
                        Largest       Std. Dev.       14.9959
75%         2008           2021
90%         2016           2021       Variance        224.877
95%         2019           2021       Skewness      -.0123927
99%         2021           2021       Kurtosis       1.802413

                   bmi_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15feb2015      15feb2015
 5%    15jun2015      15feb2015
10%    15oct2015      15feb2015       Obs              28,500
25%    15oct2016      15feb2015       Sum of Wgt.      28,500

50%    15jun2018                      Mean          25jun2018
                        Largest       Std. Dev.      713.2266
75%    15mar2020      15nov2021
90%    15mar2021      15nov2021       Variance       508692.2
95%    15jul2021      15nov2021       Skewness      -.0083529
99%    15oct2021      15nov2021       Kurtosis       1.810492

                  bp_sys_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15aug1972      15jan1970
10%    15mar1975      15jan1970       Obs              28,500
25%    15oct1982      15jan1970       Sum of Wgt.      28,500

50%    15sep1995                      Mean          02aug1995
                        Largest       Std. Dev.      5375.243
75%    15apr2008      15dec2020
90%    15jan2016      15dec2020       Variance       2.89e+07
95%    15jun2018      15dec2020       Skewness      -.0072652
99%    15jun2020      15dec2020       Kurtosis       1.800271

                 bp_dias_date_measured_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15aug1972      15jan1970
10%    15feb1975      15jan1970       Obs              28,500
25%    15sep1982      15jan1970       Sum of Wgt.      28,500

50%    15may1995                      Mean          09jun1995
                        Largest       Std. Dev.      5362.615
75%    15mar2008      15dec2020
90%    15dec2015      15dec2020       Variance       2.88e+07
95%    15jun2018      15dec2020       Skewness       .0098071
99%    15jun2020      15dec2020       Kurtosis       1.808591

                    creatinine_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15mar2019      15mar2019
 5%    15apr2019      15mar2019
10%    15may2019      15mar2019       Obs              28,500
25%    15aug2019      15mar2019       Sum of Wgt.      28,500

50%    15jan2020                      Mean          21jan2020
                        Largest       Std. Dev.      190.9848
75%    15jul2020      15dec2020
90%    15oct2020      15dec2020       Variance       36475.19
95%    15nov2020      15dec2020       Skewness       .0156762
99%    15dec2020      15dec2020       Kurtosis       1.801786

                  smoking_status_date_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15aug1972      15jan1970
10%    15mar1975      15jan1970       Obs              28,500
25%    15oct1982      15jan1970       Sum of Wgt.      28,500

50%    15sep1995                      Mean          13aug1995
                        Largest       Std. Dev.      5377.386
75%    15may2008      15dec2020
90%    15dec2015      15dec2020       Variance       2.89e+07
95%    15jun2018      15dec2020       Skewness      -.0131981
99%    15jun2020      15dec2020       Kurtosis       1.795249

              chronic_respiratory_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    30jul1972      15jan1970
10%    15jan1975      15jan1970       Obs               6,000
25%    15mar1983      15jan1970       Sum of Wgt.       6,000

50%    15feb1996                      Mean          03nov1995
                        Largest       Std. Dev.       5398.73
75%    15aug2008      15dec2020
90%    15apr2016      15dec2020       Variance       2.91e+07
95%    15jul2018      15dec2020       Skewness      -.0294944
99%    15jun2020      15dec2020       Kurtosis       1.796424

                chronic_cardiac_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jul1972      15jan1970
10%    15apr1975      15jan1970       Obs               6,000
25%    15jul1982      15jan1970       Sum of Wgt.       6,000

50%    15jun1995                      Mean          07jun1995
                        Largest       Std. Dev.      5384.463
75%    15oct2007      15dec2020
90%    15feb2016      15dec2020       Variance       2.90e+07
95%    30jun2018      15dec2020       Skewness       .0185166
99%    15jul2020      15dec2020       Kurtosis       1.797443

                   hba1c_mmol_per_mol_date
-------------------------------------------------------------
no observations

                    hba1c_percentage_date
-------------------------------------------------------------
no observations

                      cancer_haem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15aug1972      15jan1970
10%    15feb1975      15jan1970       Obs               6,000
25%    15feb1983      15jan1970       Sum of Wgt.       6,000

50%    15oct1995                      Mean          15sep1995
                        Largest       Std. Dev.      5376.589
75%    15sep2008      15dec2020
90%    15jan2016      15dec2020       Variance       2.89e+07
95%    15may2018      15dec2020       Skewness         -.0237
99%    15jun2020      15dec2020       Kurtosis       1.807517

                     cancer_nonhaem_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15aug1972      15jan1970
10%    15jan1975      15jan1970       Obs               6,000
25%    15jun1982      15jan1970       Sum of Wgt.       6,000

50%    15jul1995                      Mean          27may1995
                        Largest       Std. Dev.      5363.894
75%    15feb2008      15dec2020
90%    15sep2015      15dec2020       Variance       2.88e+07
95%    15mar2018      15dec2020       Skewness      -.0074619
99%    15jun2020      15dec2020       Kurtosis       1.790584

               permanent_immunodeficiency_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jun1972      15jan1970
10%    15nov1974      15jan1970       Obs               6,000
25%    15sep1982      15jan1970       Sum of Wgt.       6,000

50%    15jun1995                      Mean          26apr1995
                        Largest       Std. Dev.      5365.039
75%    15dec2007      15nov2020
90%    15aug2015      15nov2020       Variance       2.88e+07
95%    15may2018      15dec2020       Skewness       .0004261
99%    15jun2020      15dec2020       Kurtosis       1.813635

                        asplenia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jul1972      15jan1970
10%    15feb1975      15jan1970       Obs               6,000
25%    15sep1982      15jan1970       Sum of Wgt.       6,000

50%    15oct1995                      Mean          26aug1995
                        Largest       Std. Dev.      5378.901
75%    15apr2008      15dec2020
90%    15jan2016      15dec2020       Variance       2.89e+07
95%    15jul2018      15dec2020       Skewness       -.017075
99%    30may2020      15dec2020       Kurtosis       1.800234

               temporary_immunodeficiency_date
-------------------------------------------------------------
no observations

                 chronic_liver_disease_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug1970      15jan1970
 5%    15jul1972      15jan1970
10%    15feb1975      15jan1970       Obs               6,000
25%    15aug1982      15jan1970       Sum of Wgt.       6,000

50%    15feb1995                      Mean          21mar1995
                        Largest       Std. Dev.      5369.367
75%    15mar2008      15nov2020
90%    15jul2015      15nov2020       Variance       2.88e+07
95%    15apr2018      15dec2020       Skewness        .028646
99%    15may2020      15dec2020       Kurtosis        1.78535

                    stroke_dementia_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jun1972      15jan1970
10%    15feb1975      15jan1970       Obs               6,000
25%    15may1982      15jan1970       Sum of Wgt.       6,000

50%    15jan1995                      Mean          22mar1995
                        Largest       Std. Dev.       5365.76
75%    15dec2007      15dec2020
90%    15dec2015      15dec2020       Variance       2.88e+07
95%    15jun2018      15dec2020       Skewness       .0296199
99%    15jun2020      15dec2020       Kurtosis       1.807871

                      other_neuro_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug1970      15jan1970
 5%    15aug1972      15jan1970
10%    15nov1974      15jan1970       Obs               6,000
25%    15aug1982      15jan1970       Sum of Wgt.       6,000

50%    15oct1995                      Mean          11sep1995
                        Largest       Std. Dev.      5414.494
75%    15nov2008      15dec2020
90%    15dec2015      15dec2020       Variance       2.93e+07
95%    15jul2018      15dec2020       Skewness      -.0218174
99%    15jul2020      15dec2020       Kurtosis       1.777215

                          esrf_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15aug1972      15jan1970
10%    30dec1974      15jan1970       Obs               6,000
25%    15may1982      15jan1970       Sum of Wgt.       6,000

50%    15dec1994                      Mean          02apr1995
                        Largest       Std. Dev.      5403.462
75%    15feb2008      15dec2020
90%    15dec2015      15dec2020       Variance       2.92e+07
95%    15may2018      15dec2020       Skewness       .0325518
99%    15jul2020      15dec2020       Kurtosis       1.784227

                        dialysis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15aug1970      15jan1970
 5%    15sep1972      15jan1970
10%    30jun1975      15jan1970       Obs               6,000
25%    15jan1983      15jan1970       Sum of Wgt.       6,000

50%    15may1995                      Mean          16jul1995
                        Largest       Std. Dev.      5310.127
75%    30jan2008      15dec2020
90%    15oct2015      15dec2020       Variance       2.82e+07
95%    15jul2018      15dec2020       Skewness       .0143938
99%    30may2020      15dec2020       Kurtosis       1.826109

                   kidney_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jun1972      15jan1970
10%    15jan1975      15jan1970       Obs               6,000
25%    15jun1982      15jan1970       Sum of Wgt.       6,000

50%    15may1995                      Mean          16may1995
                        Largest       Std. Dev.      5404.468
75%    15mar2008      15dec2020
90%    15dec2015      15dec2020       Variance       2.92e+07
95%    15jun2018      15dec2020       Skewness       .0179167
99%    15jul2020      15dec2020       Kurtosis       1.787583

                    other_transplant_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15jul1972      15jan1970
10%    30nov1974      15jan1970       Obs               6,000
25%    15mar1982      15jan1970       Sum of Wgt.       6,000

50%    15apr1995                      Mean          14may1995
                        Largest       Std. Dev.      5429.941
75%    30mar2008      15dec2020
90%    15nov2015      15dec2020       Variance       2.95e+07
95%    15jul2018      15dec2020       Skewness       .0159979
99%    15may2020      15dec2020       Kurtosis       1.765865

                      hypertension_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jul1970      15jan1970
 5%    15oct1972      15jan1970
10%    15may1975      15jan1970       Obs               6,000
25%    15may1983      15jan1970       Sum of Wgt.       6,000

50%    15may1996                      Mean          04mar1996
                        Largest       Std. Dev.      5417.606
75%    15jan2009      15nov2021
90%    15aug2016      15nov2021       Variance       2.94e+07
95%    15apr2019      15nov2021       Skewness       -.021326
99%    30may2021      15nov2021       Kurtosis       1.824631

                    ra_sle_psoriasis_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15jun1970      15jan1970
 5%    15jun1972      15jan1970
10%    15dec1974      15jan1970       Obs               6,000
25%    15aug1982      15jan1970       Sum of Wgt.       6,000

50%    15dec1994                      Mean          10apr1995
                        Largest       Std. Dev.      5381.516
75%    15jan2008      15dec2020
90%    15sep2015      15dec2020       Variance       2.90e+07
95%    30jun2018      15dec2020       Skewness       .0241527
99%    15jun2020      15dec2020       Kurtosis       1.815356

                     has_12_m_follow_up
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           .5              0
10%            1              0       Obs              30,000
25%            1              0       Sum of Wgt.      30,000

50%            1                      Mean                .95
                        Largest       Std. Dev.      .2179486
75%            1              1
90%            1              1       Variance       .0475016
95%            1              1       Skewness      -4.129483
99%            1              1       Kurtosis       18.05263

                   died_ons_covid_flag_any
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,000
25%            0              0       Sum of Wgt.      30,000

50%            1                      Mean                 .6
                        Largest       Std. Dev.      .4899061
75%            1              1
90%            1              1       Variance        .240008
95%            1              1       Skewness      -.4082483
99%            1              1       Kurtosis       1.166667

               died_ons_covid_flag_underlying
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              30,000
25%            0              0       Sum of Wgt.      30,000

50%            1                      Mean                 .6
                        Largest       Std. Dev.      .4899061
75%            1              1
90%            1              1       Variance        .240008
95%            1              1       Skewness      -.4082483
99%            1              1       Kurtosis       1.166667

              covid_admission_primary_diagnosis
-------------------------------------------------------------
no observations

                            sgtf
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              26,990
25%            0              0       Sum of Wgt.      26,990

50%            1                      Mean           1.439089
                        Largest       Std. Dev.      2.704193
75%            1              9
90%            9              9       Variance       7.312659
95%            9              9       Skewness       2.343108
99%            9              9       Kurtosis       6.779618

                           lft_pcr
-------------------------------------------------------------
no observations

                             age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%            8              0       Obs              30,000
25%           21              0       Sum of Wgt.      30,000

50%           40                      Mean           40.29773
                        Largest       Std. Dev.      23.72019
75%           59            105
90%           73            105       Variance       562.6476
95%           79            107       Skewness       .1269266
99%           89            108       Kurtosis       2.046166

                             sex
-------------------------------------------------------------
no observations

                             imd
-------------------------------------------------------------
      Percentiles      Smallest
 1%          100            100
 5%          100            100
10%          100            100       Obs              30,000
25%          200            100       Sum of Wgt.      30,000

50%          300                      Mean             259.93
                        Largest       Std. Dev.      66.44453
75%          300            300
90%          300            300       Variance       4414.876
95%          300            300       Skewness      -1.396616
99%          300            300       Kurtosis       3.603612

                             stp
-------------------------------------------------------------
no observations

                          ethnicity
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs              27,001
25%            1              1       Sum of Wgt.      27,001

50%            1                      Mean           1.593682
                        Largest       Std. Dev.       1.27086
75%            1              5
90%            3              5       Variance       1.615085
95%            5              5       Skewness       1.934175
99%            5              5       Kurtosis       5.224119

                        household_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%          525            192
 5%        665.5            230
10%        741.5            252       Obs              30,000
25%          864            280       Sum of Wgt.      30,000

50%         1000                      Mean           998.9848
                        Largest       Std. Dev.      200.9678
75%         1135           1761
90%         1255           1764       Variance       40388.08
95%         1329           1786       Skewness      -.0135726
99%         1462           1793       Kurtosis       3.024188

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs              30,000
25%            2              0       Sum of Wgt.      30,000

50%            2                      Mean           2.498767
                        Largest       Std. Dev.      1.037835
75%            3              6
90%            4              6       Variance       1.077101
95%            4              6       Skewness       .0312014
99%            5              6       Kurtosis       2.898386

                       care_home_type
-------------------------------------------------------------
no observations

                             bmi
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0      -20.08128
 5%            0      -17.46939
10%     8.583911      -15.88899       Obs              30,000
25%     16.93642      -15.21124       Sum of Wgt.      30,000

50%     24.23723                      Mean           23.65643
                        Largest       Std. Dev.      11.18368
75%     31.25584       59.02884
90%     37.48844       60.01421       Variance       125.0747
95%     41.09603       60.83588       Skewness      -.2273827
99%     48.02474       61.49296       Kurtosis       2.929117

                           bp_sys
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%      38.8574              0
10%     103.8491              0       Obs              30,000
25%      111.897              0       Sum of Wgt.      30,000

50%     119.2555                      Mean           113.9294
                        Largest       Std. Dev.      27.88773
75%     126.2688       157.8733
90%     132.4791       159.1241       Variance       777.7257
95%     136.0072       159.4538       Skewness      -3.321326
99%     142.9841       159.4816       Kurtosis       14.01088

                           bp_dias
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     16.95331              0
10%     63.79058              0       Obs              30,000
25%     71.99517              0       Sum of Wgt.      30,000

50%     79.45118                      Mean           76.06369
                        Largest       Std. Dev.      19.99935
75%     86.49395       114.6145
90%     92.51247       117.0501       Variance       399.9738
95%     96.20484        119.287       Skewness      -2.602499
99%     103.2439       119.4569       Kurtosis       10.69936

                         creatinine
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%     .8554847              0
10%     35.68446              0       Obs              30,000
25%      47.9165              0       Sum of Wgt.      30,000

50%     59.13035                      Mean            57.0538
                        Largest       Std. Dev.      19.63746
75%     69.64245       116.9816
90%     78.75239       117.6418       Variance       385.6297
95%     84.26029       118.9538       Skewness      -.9746629
99%     94.23911       119.1308       Kurtosis       4.624325

                       smoking_status
-------------------------------------------------------------
no observations

                        diabetes_type
-------------------------------------------------------------
no observations

                     hba1c_mmol_per_mol
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -6.198965      -37.13163
 5%            0      -34.82577
10%     7.789459      -34.60438       Obs              30,000
25%     24.06117      -29.68494       Sum of Wgt.      30,000

50%     38.71649                      Mean           38.18022
                        Largest       Std. Dev.      21.45204
75%     52.86637       121.0126
90%     65.45575       121.0144       Variance       460.1902
95%     72.72268       126.7294       Skewness      -.0250547
99%     86.68031       129.5372       Kurtosis       2.780514

                      hba1c_percentage
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0      -2.605966
 5%            0       -2.37938
10%      1.73327       -2.33351       Obs              30,000
25%     3.371639      -2.282854       Sum of Wgt.      30,000

50%     4.854789                      Mean           4.737294
                        Largest       Std. Dev.      2.231007
75%     6.257804       12.45355
90%     7.493324       12.55914       Variance       4.977392
95%     8.202637       12.59245       Skewness      -.2290963
99%     9.551215       14.10008       Kurtosis       2.892154

                           asthma
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               6,000
25%            0              0       Sum of Wgt.       6,000

50%            0                      Mean           .6866667
                        Largest       Std. Dev.      .8984932
75%            2              2
90%            2              2       Variance       .8072901
95%            2              2       Skewness       .6566179
99%            2              2       Kurtosis       1.561024

                         patient_id
-------------------------------------------------------------
      Percentiles      Smallest
 1%       3258.5             14
 5%        14897             18
10%      29973.5             23       Obs              30,000
25%      75051.5             37       Sum of Wgt.      30,000

50%       150342                      Mean           150178.9
                        Largest       Std. Dev.      86583.68
75%     225302.5         299973
90%     269653.5         299980       Variance       7.50e+09
95%     284911.5         299995       Skewness      -.0047165
99%       296776         299996       Kurtosis       1.795939

                        diabetes_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    15sep1970      15jan1970
 5%    15dec1972      15feb1970
10%    15jan1975      15feb1970       Obs               1,534
25%    15jul1982      15feb1970       Sum of Wgt.       1,534

50%    30nov1994                      Mean          28feb1995
                        Largest       Std. Dev.      5285.455
75%    15feb2007      15nov2020
90%    15may2015      15nov2020       Variance       2.79e+07
95%    15may2018      15nov2020       Skewness       .0282204
99%    15jun2020      15dec2020       Kurtosis       1.845813

                       covid_icu_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    06jan2021      21dec2020
10%    23jan2021      21dec2020       Obs              24,001
25%    14mar2021      21dec2020       Sum of Wgt.      24,001

50%    06jun2021                      Mean          04jun2021
                        Largest       Std. Dev.      95.90438
75%    27aug2021      17nov2021
90%    16oct2021      17nov2021       Variance       9197.651
95%    01nov2021      17nov2021       Skewness      -.0047935
99%    14nov2021      17nov2021       Kurtosis        1.80206

                  positive_covid_test_ever
-------------------------------------------------------------
      Percentiles      Smallest
 1%    18jun2021      10feb2021
 5%    09aug2021      24feb2021
10%    02sep2021      28feb2021       Obs               6,000
25%    03oct2021      28mar2021       Sum of Wgt.       6,000

50%    26oct2021                      Mean          15oct2021
                        Largest       Std. Dev.      33.35446
75%    08nov2021      17nov2021
90%    14nov2021      17nov2021       Variance        1112.52
95%    16nov2021      17nov2021       Skewness      -1.958603
99%    17nov2021      17nov2021       Kurtosis       8.375623

                       covid_test_ever
-------------------------------------------------------------
      Percentiles      Smallest
 1%    12jun2021      11mar2021
 5%    09aug2021      21mar2021
10%    01sep2021      23mar2021       Obs               6,000
25%    02oct2021      02apr2021       Sum of Wgt.       6,000

50%    25oct2021                      Mean          14oct2021
                        Largest       Std. Dev.      33.67078
75%    08nov2021      17nov2021
90%    14nov2021      17nov2021       Variance       1133.721
95%    16nov2021      17nov2021       Skewness      -1.932203
99%    17nov2021      17nov2021       Kurtosis       7.961312

                  covid_tpp_codes_clinical
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    07jan2021      21dec2020
10%    23jan2021      21dec2020       Obs              15,000
25%    14mar2021      21dec2020       Sum of Wgt.      15,000

50%    03jun2021                      Mean          04jun2021
                        Largest       Std. Dev.      95.45047
75%    26aug2021      17nov2021
90%    15oct2021      17nov2021       Variance       9110.792
95%    31oct2021      17nov2021       Skewness       .0142005
99%    14nov2021      17nov2021       Kurtosis       1.807947

                    covid_tpp_codes_test
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    07jan2021      21dec2020
10%    23jan2021      21dec2020       Obs              15,000
25%    13mar2021      21dec2020       Sum of Wgt.      15,000

50%    06jun2021                      Mean          05jun2021
                        Largest       Std. Dev.      96.25426
75%    30aug2021      17nov2021
90%    16oct2021      17nov2021       Variance       9264.883
95%    02nov2021      17nov2021       Skewness      -.0084694
99%    15nov2021      17nov2021       Kurtosis       1.783858

                     covid_tpp_codes_seq
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    06jan2021      21dec2020
10%    23jan2021      21dec2020       Obs              15,000
25%    15mar2021      21dec2020       Sum of Wgt.      15,000

50%    05jun2021                      Mean          05jun2021
                        Largest       Std. Dev.      96.01104
75%    28aug2021      17nov2021
90%    16oct2021      17nov2021       Variance       9218.121
95%    01nov2021      17nov2021       Skewness      -.0113369
99%    14nov2021      17nov2021       Kurtosis       1.798764

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    06jan2021      21dec2020
10%    23jan2021      21dec2020       Obs              24,001
25%    15mar2021      21dec2020       Sum of Wgt.      24,001

50%    06jun2021                      Mean          05jun2021
                        Largest       Std. Dev.      95.71878
75%    27aug2021      17nov2021
90%    16oct2021      17nov2021       Variance       9162.085
95%    02nov2021      17nov2021       Skewness      -.0044058
99%    14nov2021      17nov2021       Kurtosis       1.810501

                    covid_admission_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23dec2020      20dec2020
 5%    06jan2021      20dec2020
10%    23jan2021      20dec2020       Obs              13,785
25%    15mar2021      20dec2020       Sum of Wgt.      13,785

50%    06jun2021                      Mean          05jun2021
                        Largest       Std. Dev.      95.79749
75%    27aug2021      17nov2021
90%    15oct2021      17nov2021       Variance       9177.159
95%    31oct2021      17nov2021       Skewness      -.0157464
99%    14nov2021      17nov2021       Kurtosis       1.806508

                     covid_tpp_probable
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    06jan2021      21dec2020
10%    22jan2021      21dec2020       Obs              28,803
25%    13mar2021      21dec2020       Sum of Wgt.      28,803

50%    06jun2021                      Mean          04jun2021
                        Largest       Std. Dev.      96.20909
75%    27aug2021      17nov2021
90%    16oct2021      17nov2021       Variance        9256.19
95%    01nov2021      17nov2021       Skewness      -.0073164
99%    15nov2021      17nov2021       Kurtosis       1.791649

                       covid_vacc_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    11dec2020      09dec2020
 5%    20dec2020      09dec2020
10%    31dec2020      09dec2020       Obs              15,000
25%    02feb2021      09dec2020       Sum of Wgt.      15,000

50%    29mar2021                      Mean          28mar2021
                        Largest       Std. Dev.      63.25984
75%    23may2021      16jul2021
90%    25jun2021      16jul2021       Variance       4001.807
95%    05jul2021      16jul2021       Skewness      -.0027825
99%    14jul2021      16jul2021       Kurtosis       1.801576

                 covid_vacc_second_dose_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    09dec2020      09dec2020
 5%    13dec2020      09dec2020
10%    17dec2020      09dec2020       Obs               5,982
25%    30dec2020      09dec2020       Sum of Wgt.       5,982

50%    20jan2021                      Mean          19jan2021
                        Largest       Std. Dev.      23.83629
75%    09feb2021      01mar2021
90%    21feb2021      01mar2021       Variance       568.1686
95%    25feb2021      01mar2021       Skewness       -.033513
99%    01mar2021      01mar2021       Kurtosis       1.823006

                covid_admission_primary_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%        22271          22269
 5%        22286          22269
10%        22303          22269       Obs               6,889
25%        22354          22269       Sum of Wgt.       6,889

50%        22437                      Mean           22435.22
                        Largest       Std. Dev.      95.24832
75%        22517          22601
90%        22566          22601       Variance       9072.242
95%        22583          22601       Skewness      -.0169029
99%        22598          22601       Kurtosis       1.810196

                covid_primary_care_codes_only
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24dec2020      21dec2020
 5%    06jan2021      21dec2020
10%    22jan2021      21dec2020       Obs              28,500
25%    13mar2021      21dec2020       Sum of Wgt.      28,500

50%    04jun2021                      Mean          03jun2021
                        Largest       Std. Dev.      95.69046
75%    25aug2021      17nov2021
90%    14oct2021      17nov2021       Variance       9156.664
95%    31oct2021      17nov2021       Skewness       .0039025
99%    14nov2021      17nov2021       Kurtosis       1.799451

. 
. 
. /*Flag earliest date under18s vaccinated*/
. gen under18vacc_temp=covid_vacc_date if age<18
(26,793 missing values generated)

. bysort household_id: egen under18vacc=min(under18vacc_temp)
(1765 missing values generated)

. format under18vacc* %td

. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Sex
. gen male = 1 if sex == "M"
(15,353 missing values generated)

. replace male = 0 if sex == "F"
(15,353 real changes made)

. 
. * Ethnicity 
. replace ethnicity = .u if ethnicity == .
(2,999 real changes made, 2,999 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(29,990 missing values generated)

. replace stp = sum(stp)
(29,999 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(30,000 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 30000 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age 18/29.9999 = 1 /// 
>                    30/39.9999 = 2 /// 
>            40/49.9999 = 3 ///
>                    50/59.9999 = 4 ///
>                60/69.9999 = 5 ///
>                    70/79.9999 = 6 ///
>                    80/max = 7, gen(agegroup) 
(23638 differences between age and agegroup)

. 
. label define agegroup   1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Create binary age (for age stratification)
. recode age min/65.999999999 = 0 ///
>            66/max = 1, gen(age66)
(29623 differences between age and age66)

. 
. * Check there are no missing ages
. assert age < .

. assert agegroup < .

. assert age66 < .

. 
. 
. /* APPLY HH level INCLUSION/EXCLUIONS========================================
> ==========*/ 
. 
. noi di "DROP if HH ID==0"
DROP if HH ID==0

. count if household_id==0
  0

. drop if household_id==0
(0 observations deleted)

. count
  30,000

. 
. drop if care_home_type!="U"
(936 observations deleted)

. count
  29,064

. 
. noi di "DROP HH>=10 persons:"
DROP HH>=10 persons:

. sum household_size, d

                       household_size
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            1              0
10%            1              0       Obs              29,064
25%            2              0       Sum of Wgt.      29,064

50%            2                      Mean           2.499381
                        Largest       Std. Dev.      1.037739
75%            3              6
90%            4              6       Variance       1.076902
95%            4              6       Skewness        .032503
99%            5              6       Kurtosis       2.903986

. drop if household_size>=10
(0 observations deleted)

. count
  29,064

. 
. noi di "DROP AGE MISSING:"
DROP AGE MISSING:

. recode age .=9
(age: 0 changes made)

. recode age .u=9
(age: 0 changes made)

. bysort household_id: egen age_drop=max(age)

. drop if age_drop==9
(2 observations deleted)

. count
  29,062

. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. ***KIDS_CAT5 (5 categories)
. *Identify kids under 5/5-11/12-18
. gen no_of_kids=1 if age<5
(27,321 missing values generated)

. recode no_of_kids .=2 if age<12
(no_of_kids: 2413 changes made)

. recode no_of_kids .=3 if age<18 
(no_of_kids: 2008 changes made)

. 
. *Make seperate files with only kids and household number
. preserve

. keep if age<18
(22,900 observations deleted)

. keep household_id no_of_kids

. *Drop duplicates (i.e. for hh with kids of same age, keep only one)
. duplicates drop

Duplicates in terms of all variables

(3,942 observations deleted)

. *If a hh has >1 record, there must be mixed ages in it: flag these as categor
> y 4
. bysort household_id: replace no_of_kids=4 if _N>1
(2,014 real changes made)

. duplicates drop

Duplicates in terms of all variables

(1,259 observations deleted)

. rename no_of_kids kids_cat5

. save kids_mixed_category, replace
(note: file kids_mixed_category.dta not found)
file kids_mixed_category.dta saved

. restore

. 
. *merge in kids identifier
. merge m:1 household_id using kids_mixed_category, nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                           740
        from master                       740  
        from using                          0  

    matched                            28,322  
    -----------------------------------------

. 
. *label variable
. lab define   kids_cat5 0 none  1 "only <5 years" ///
> 2 "only 5-11" 3 "12-<18" 4 "mixed"

. lab val kids_cat5 kids_cat5

. recode kids_cat5 .=0
(kids_cat5: 740 changes made)

. tab kids_cat5

    kids_cat5 |      Freq.     Percent        Cum.
--------------+-----------------------------------
         none |        740        2.55        2.55
only <5 years |        330        1.14        3.68
    only 5-11 |        831        2.86        6.54
       12-<18 |        337        1.16        7.70
        mixed |     26,824       92.30      100.00
--------------+-----------------------------------
        Total |     29,062      100.00

. drop no_of_kids

. 
. ***KIDS_CAT4 (4 categories)
. *Identify kids under 0-11/12-18
. gen no_of_kids=1 if age<12
(24,908 missing values generated)

. recode no_of_kids .=2 if age<18 
(no_of_kids: 2008 changes made)

. 
. *Make seperate files with only kids and household number
. preserve

. keep if age<18
(22,900 observations deleted)

. keep household_id no_of_kids

. *Drop duplicates (i.e. for hh with kids of same age, keep only one)
. duplicates drop

Duplicates in terms of all variables

(4,538 observations deleted)

. *If a hh has >1 record, there must be mixed ages in it: flag these as categor
> y 4
. bysort household_id: replace no_of_kids=3 if _N>1
(1,326 real changes made)

. duplicates drop

Duplicates in terms of all variables

(663 observations deleted)

. rename no_of_kids kids_cat4

. list in 1/100

     +---------------------+
     | househ~d   kids_c~4 |
     |---------------------|
  1. |      318          1 |
  2. |      352          2 |
  3. |      371          1 |
  4. |      373          2 |
  5. |      382          1 |
     |---------------------|
  6. |      385          2 |
  7. |      386          1 |
  8. |      396          1 |
  9. |      398          1 |
 10. |      421          2 |
     |---------------------|
 11. |      425          3 |
 12. |      436          2 |
 13. |      440          1 |
 14. |      442          2 |
 15. |      443          1 |
     |---------------------|
 16. |      451          1 |
 17. |      452          2 |
 18. |      454          2 |
 19. |      455          3 |
 20. |      464          1 |
     |---------------------|
 21. |      465          1 |
 22. |      467          1 |
 23. |      468          2 |
 24. |      472          1 |
 25. |      473          2 |
     |---------------------|
 26. |      474          3 |
 27. |      478          1 |
 28. |      481          1 |
 29. |      483          1 |
 30. |      486          2 |
     |---------------------|
 31. |      488          1 |
 32. |      489          1 |
 33. |      494          3 |
 34. |      496          1 |
 35. |      497          1 |
     |---------------------|
 36. |      499          2 |
 37. |      502          2 |
 38. |      503          1 |
 39. |      506          2 |
 40. |      510          1 |
     |---------------------|
 41. |      514          2 |
 42. |      515          1 |
 43. |      516          1 |
 44. |      517          2 |
 45. |      518          2 |
     |---------------------|
 46. |      520          1 |
 47. |      522          1 |
 48. |      524          1 |
 49. |      525          1 |
 50. |      526          1 |
     |---------------------|
 51. |      534          1 |
 52. |      535          1 |
 53. |      536          1 |
 54. |      538          1 |
 55. |      541          2 |
     |---------------------|
 56. |      544          3 |
 57. |      545          1 |
 58. |      546          2 |
 59. |      547          3 |
 60. |      549          1 |
     |---------------------|
 61. |      550          1 |
 62. |      552          3 |
 63. |      553          2 |
 64. |      554          1 |
 65. |      555          1 |
     |---------------------|
 66. |      557          3 |
 67. |      558          1 |
 68. |      559          1 |
 69. |      560          3 |
 70. |      561          2 |
     |---------------------|
 71. |      563          1 |
 72. |      564          1 |
 73. |      566          1 |
 74. |      569          1 |
 75. |      570          2 |
     |---------------------|
 76. |      572          1 |
 77. |      573          1 |
 78. |      575          1 |
 79. |      577          2 |
 80. |      578          3 |
     |---------------------|
 81. |      581          3 |
 82. |      584          1 |
 83. |      585          3 |
 84. |      586          3 |
 85. |      587          2 |
     |---------------------|
 86. |      589          2 |
 87. |      592          3 |
 88. |      593          3 |
 89. |      594          1 |
 90. |      595          1 |
     |---------------------|
 91. |      596          3 |
 92. |      597          3 |
 93. |      598          1 |
 94. |      599          3 |
 95. |      600          2 |
     |---------------------|
 96. |      601          3 |
 97. |      602          1 |
 98. |      603          3 |
 99. |      606          1 |
100. |      607          1 |
     +---------------------+

. save kids_mixed_category, replace
file kids_mixed_category.dta saved

. restore

. 
. *merge in kids identifier
. merge m:1 household_id using kids_mixed_category, nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                           740
        from master                       740  
        from using                          0  

    matched                            28,322  
    -----------------------------------------

. 
. *label variable
. lab define   kids_cat4 0 none  1 "only <12 years" ///
> 2 "only 12-18" ///
> 3 "mixed"

. lab val kids_cat4 kids_cat4

. recode kids_cat4 .=0
(kids_cat4: 740 changes made)

. tab kids_cat4

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        740        2.55        2.55
only <12 years |      3,295       11.34       13.88
    only 12-18 |        337        1.16       15.04
         mixed |     24,690       84.96      100.00
---------------+-----------------------------------
         Total |     29,062      100.00

. 
. *Dose-response exposure: identify number of kids in hh where there are ONLY u
> nder 11 yr olds
. bysort household_id: egen number_kids=sum(no_of_kids) if kids_cat4==1
(25767 missing values generated)

. 
. gen gp_number_kids=number_kids
(25,767 missing values generated)

. recode gp_number_kids 4/max=4
(gp_number_kids: 1219 changes made)

. 
. lab var gp_number_kids "Number kids under 12 years in hh"

. lab define   gp_number_kids 0 none ///
> 1 "1 child <12" ///
> 2 "2 children <12" ///
> 3 "3 children <12" ///
> 4 "4+ children <12"

. lab val gp_number_kids gp_number_kids

. 
. tab kids_cat4 

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        740        2.55        2.55
only <12 years |      3,295       11.34       13.88
    only 12-18 |        337        1.16       15.04
         mixed |     24,690       84.96      100.00
---------------+-----------------------------------
         Total |     29,062      100.00

. tab kids_cat5

    kids_cat5 |      Freq.     Percent        Cum.
--------------+-----------------------------------
         none |        740        2.55        2.55
only <5 years |        330        1.14        3.68
    only 5-11 |        831        2.86        6.54
       12-<18 |        337        1.16        7.70
        mixed |     26,824       92.30      100.00
--------------+-----------------------------------
        Total |     29,062      100.00

. tab kids_cat*

              |                  kids_cat4
    kids_cat5 |      none  only <12   only 12-1      mixed |     Total
--------------+--------------------------------------------+----------
         none |       740          0          0          0 |       740 
only <5 years |         0        330          0          0 |       330 
    only 5-11 |         0        831          0          0 |       831 
       12-<18 |         0          0        337          0 |       337 
        mixed |         0      2,134          0     24,690 |    26,824 
--------------+--------------------------------------------+----------
        Total |       740      3,295        337     24,690 |    29,062 

. 
. 
. /* DROP ALL KIDS, AS HH COMPOSITION VARS ARE NOW MADE */
. drop if age<18
(6,162 observations deleted)

. 
. *Total number adults in household (to check hh size)
. bysort household_id: gen tot_adults_hh=_N

. recode tot_adults_hh 3/max=3
(tot_adults_hh: 22417 changes made)

. 
. tab kids_cat4

     kids_cat4 |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        740        3.23        3.23
only <12 years |      2,699       11.79       15.02
    only 12-18 |        260        1.14       16.15
         mixed |     19,201       83.85      100.00
---------------+-----------------------------------
         Total |     22,900      100.00

. tab gp_num if kids_cat4==1

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |        501       18.56       18.56
 2 children <12 |        429       15.89       34.46
 3 children <12 |        413       15.30       49.76
4+ children <12 |      1,356       50.24      100.00
----------------+-----------------------------------
          Total |      2,699      100.00

. 
. erase kids_mixed_category.dta

. 
. /* SET FU DATES==============================================================
> =*/ 
. * Censoring dates for each outcome (largely, last date outcome data available
> )
. *****NEEDS UPDATING WHEN INFO AVAILABLE*******************
. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. rename dereg_date_date                                          dereg_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabetes_date  ///
>                                                 cancer_haem  ///
>                                                 cancer_nonhaem  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 dialysis                     
>                    ///
>                                                 kidney_transplant            
>            ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 smoking_status_date ///
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         
. }

. 
. 
. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(1,156 real changes made, 1,156 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(3,586 real changes made, 3,586 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(1,156 missing values generated)

. gen bmi_age = age - bmi_time
(1,156 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(356 real changes made, 356 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(3,942 real changes made, 3,942 to missing)

. replace bmi_measured = . if bmi == . 
(5,098 real changes made, 5,098 to missing)

. 
. gen     bmicat = .
(22,900 missing values generated)

. recode  bmicat . = 1 if bmi < 18.5
(bmicat: 2136 changes made)

. recode  bmicat . = 2 if bmi < 25
(bmicat: 5234 changes made)

. recode  bmicat . = 3 if bmi < 30
(bmicat: 4071 changes made)

. recode  bmicat . = 4 if bmi < 35
(bmicat: 3091 changes made)

. recode  bmicat . = 5 if bmi < 40
(bmicat: 1991 changes made)

. recode  bmicat . = 6 if bmi < .
(bmicat: 1279 changes made)

. replace bmicat = .u if bmi >= .
(5,098 real changes made, 5,098 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Create less  granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(20764 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(21,949 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(445 real changes made)

. replace smoke = 3  if smoking_status == "S"
(2,790 real changes made)

. replace smoke = .u if smoking_status == "M"
(439 real changes made, 439 to missing)

. replace smoke = .u if smoking_status == "" 
(18,275 real changes made, 18,275 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(18714 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * Haematological malignancies
. gen     cancer_haem_cat = 4 if inrange(cancer_haem_date, d(1/1/1900), d(1/2/2
> 015))
(18,770 missing values generated)

. replace cancer_haem_cat = 3 if inrange(cancer_haem_date, d(1/2/2015), d(1/2/2
> 019))
(398 real changes made)

. replace cancer_haem_cat = 2 if inrange(cancer_haem_date, d(1/2/2019), d(1/2/2
> 020))
(80 real changes made)

. recode  cancer_haem_cat . = 1
(cancer_haem_cat: 18292 changes made)

. label values cancer_haem_cat cancer

. 
. 
. * All other cancers
. gen     cancer_exhaem_cat = 4 if inrange(cancer_nonhaem_date,  d(1/1/1900), d
> (1/2/2015)) 
(18,831 missing values generated)

. replace cancer_exhaem_cat = 3 if inrange(cancer_nonhaem_date,  d(1/2/2015), d
> (1/2/2019))
(362 real changes made)

. replace cancer_exhaem_cat = 2 if inrange(cancer_nonhaem_date,  d(1/2/2019), d
> (1/2/2020)) 
(85 real changes made)

. recode  cancer_exhaem_cat . = 1
(cancer_exhaem_cat: 18384 changes made)

. label values cancer_exhaem_cat cancer

. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(18,321 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), 
> date("$indexdate", "DMY"))

. 
. egen other_immuno = rowmax(temp1 temp2)

. drop temp1 temp2 

. order other_immuno, after(temp_immunodef)

. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(16,517 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(3,737 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(9,509 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(3,853 real changes made)

. replace bpcat = .u if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(2,252 real changes made, 2,252 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" .u "Unknown"

. label values bpcat bpcat

. 
. recode bpcat .u=1, gen(bpcat_nomiss)
(2252 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 3786 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(1,268 real changes made, 1,268 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(1,268 missing values generated)

. 
. gen min=.
(22,900 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(11,025 real changes made)

. replace min = SCr_adj/0.9 if male==1
(10,607 real changes made)

. replace min = min^-0.329  if male==0
(11,025 real changes made)

. replace min = min^-0.411  if male==1
(10,607 real changes made)

. replace min = 1 if min<1
(6,068 real changes made)

. 
. gen max=.
(22,900 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(11,025 real changes made)

. replace max=SCr_adj/0.9 if male==1
(10,607 real changes made)

. replace max=max^-1.209
(21,632 real changes made)

. replace max=1 if max>1
(16,832 real changes made)

. 
. gen egfr=min*max*141
(1,268 missing values generated)

. replace egfr=egfr*(0.993^age)
(21,632 real changes made)

. replace egfr=egfr*1.018 if male==0
(11,025 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(1268 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(21632 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. *label var ckd "CKD stage calc without eth"
. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
.         
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(21371 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(1,268 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. lab var  reduced "Reduced kidney function"

. 
. 
. /*ESDR: dialysis or kidney transplant*/
. gen esrd=1 if dialysis==1 | kidney_transplant==1
(14,630 missing values generated)

. recode esrd .=0
(esrd: 14630 changes made)

. 
. 
. 
. ***************************
. /* DM / Hb1AC */
. ***************************
. 
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(1,258 real changes made, 1,258 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(1,619 real changes made, 1,619 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |     21,642    5.026613    1.953979   .0038121   14.10008
hba1c_mmol~l |     21,281    41.28243    18.90893   .0665781   129.5372

. gen     hba1c_pct = hba1c_percentage 
(1,258 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(21,281 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(22,822 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(22,221 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(4,644 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(450 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(17,127 real changes made)

. 
. safetab dm_type diabetes_type
0

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |    17,127          0          0          0 |    17,127 
         1 |         0        679          0          0 |       679 
         2 |         0          0      4,644          0 |     4,644 
         3 |         0          0          0        450 |       450 
-----------+--------------------------------------------+----------
     Total |    17,127        679      4,644        450 |    22,900 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. /*Open safely diabetes codes with exeter algorithm
> gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
> replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
> replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
> label values  dm_type_exeter_os dm_type*/
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(8,398 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(4,024 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(1,496 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(1,798 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(1,002 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. safetab hba1ccat
0

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |     14,502       63.54       63.54
  >=6.5-7.4 |      4,024       17.63       81.18
  >=7.5-7.9 |      1,496        6.56       87.73
    >=8-8.9 |      1,798        7.88       95.61
        >=9 |      1,002        4.39      100.00
------------+-----------------------------------
      Total |     22,822      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(4,374 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(4,296 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. safetab hba1c75, m
8

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,526       80.90       80.90
          1 |      4,296       18.76       99.66
          . |         78        0.34      100.00
------------+-----------------------------------
      Total |     22,900      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0 | dm_type==.
(5,773 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(547 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(131 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(3,772 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(858 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(15 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. safetab diabcat, m
8

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     17,127       74.79       74.79
  T1DM, controlled |        547        2.39       77.18
T1DM, uncontrolled |        131        0.57       77.75
  T2DM, controlled |      3,772       16.47       94.22
T2DM, uncontrolled |        858        3.75       97.97
Diabetes, no HbA1c |         15        0.07       98.03
                 . |        450        1.97      100.00
-------------------+-----------------------------------
             Total |     22,900      100.00

. recode diabcat .=1
(diabcat: 450 changes made)

. 
. 
. 
. /*  Asthma  */
. 
. 
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3
(asthmacat: 4589 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. /*  Probable shielding  */
. gen shield=1 if esrd==1 | other_transplant==1 | asthmacat==2 | asthmacat==3 |
>  ///
> chronic_respiratory_disease==1 | cancer_haem==1 | cancer_nonhaem==1 | ///
> asplenia==1 | other_immuno==1
(3,540 missing values generated)

. recode shield .=0
(shield: 3540 changes made)

. 
. /*Any comorbidity*/
. 
. gen anycomorb=1 if chronic_respiratory_disease==1 | ///
>                     asthmacat==2 | asthmacat==3 | ///
>                                         chronic_cardiac_disease==1  | ///
>                                         diabcat==2 | diabcat==3 | diabcat==4 
> | diabcat==5 | diabcat==6 | ///
>                                         cancer_haem==1 | cancer_nonhaem==1 | 
> ///
>                                         esrd==1 | ///
>                                         chronic_liver_disease==1 | ///
>                                         stroke_dementia==1 | ///
>                                         other_neuro==1 | ///
>                                         other_transplant==1 | ///
>                                         asplenia==1 | ///
>                                         ra_sle_psoriasis==1 | ///
>                                         other_immuno==1 
(895 missing values generated)

. recode anycomorb .=0
(anycomorb: 895 changes made)

. tab anyco

  anycomorb |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        895        3.91        3.91
          1 |     22,005       96.09      100.00
------------+-----------------------------------
      Total |     22,900      100.00

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma categ
> ory"

. label var egfr_cat                                              "Calculated e
> GFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haem
> atological cancer"

. label var cancer_exhaem_cat                                             "Non-
> haematological cancer"

. label var kidney_transplant                                             "Kidn
> ey transplant"     

. label var other_transplant                                              "Othe
> r solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (co
> mbination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"               
>    

. label var stroke_dementia                           "Stroke or dementia"     
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosupp
> ression"

. lab var temp_immunodef                                  "Temporary immunosupp
> ression"

. lab var esrd                                                    "End-stage re
> nal disease"

. 
. lab var covid_vacc_date                         "First vacc date"

. lab var covid_vacc_second_dose_date "Second vacc date"

. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
. gen enter_date = date("$indexdate", "DMY")

. gen study_end_censor =date("$study_end_censor", "DMY")

. 
. * Format the dates
. format  enter_date                                      ///
>                 study_end_censor  

  variable name     display format
  --------------------------------
  enter_date        %9.0g
  study_end_censor  %9.0g
  --------------------------------

.                 
.                         /****   Outcome definitions   ****/
. 
. * Date of Covid death in ONS
. gen died_date_onscovid = died_date_ons if died_ons_covid_flag_any == 1
(11,986 missing values generated)

. gen died_date_onscovid_part1 = died_date_ons if died_ons_covid_flag_underlyin
> g == 1
(11,860 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen died_date_onsnoncovid = died_date_ons if died_ons_covid_flag_any != 1 
(15,508 missing values generated)

. 
. *Date probable covid in TPP
. rename covid_tpp_probable date_covid_tpp_prob

. rename covid_test_ever date_covid_test_ever

. 
. format died_date_ons %td

. format died_date_onscovid %td 

. format died_date_onsnoncovid %td

. format covid_icu_date %td 

. format died_date_onscovid_part1 %td

. format covid_admission_primary_date %td

. format date_covid_test_ever %td

. 
. * Binary indicators (0/1) for outcomes
. gen covid_tpp_prob = (date_covid_tpp_prob < .)

. gen non_covid_death = (died_date_onsnoncovid < .)

. gen covid_death = (died_date_onscovid < .)

. gen covid_icu = (covid_icu_date < .)

. gen covidadmission = (covid_admission_primary_date < .)

. gen covid_death_part1 = (died_date_onscovid_part1 < .)

. gen covid_test_ever = (date_covid_test_ever < .)

. 
.                                         /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: end study, death, or that outcom
> e)
. *gen stime_onscoviddeath = min(onscoviddeathcensor_date,                     
>            died_date_ons)
. gen stime_covid_death_part1     = min(study_end_censor   , died_date_onscovid
> _part1, died_date_ons, dereg_date)

. gen stime_covid_tpp_prob = min(study_end_censor   , died_date_ons, date_covid
> _tpp_prob, dereg_date)

. gen stime_non_covid_death = min(study_end_censor   , died_date_ons, died_date
> _onsnoncovid, dereg_date)

. gen stime_covid_death = min(study_end_censor   , died_date_ons, died_date_ons
> covid, dereg_date)

. gen stime_covid_icu = min(study_end_censor, died_date_ons, covid_icu_date, de
> reg_date)

. gen stime_covidadmission        = min(study_end_censor   , covid_admission_pr
> imary_date, died_date_ons, dereg_date)

. gen stime_covid_test_ever = min(study_end_censor, died_date_ons, date_covid_t
> est_ever, dereg_date)

. 
. 
. * If outcome was after censoring occurred, set to zero
. replace covid_tpp_prob = 0 if (date_covid_tpp_prob > study_end_censor ) 
(2,325 real changes made)

. replace non_covid_death = 0 if (died_date_onsnoncovid > study_end_censor )
(755 real changes made)

. replace covid_death = 0 if (died_date_onscovid > study_end_censor )
(1,140 real changes made)

. replace covid_icu = 0 if (covid_icu_date > study_end_censor)
(1,886 real changes made)

. replace covidadmission  = 0 if (covid_admission_primary_date > study_end_cens
> or  | covid_admission_primary_date > died_date_ons) 
(2,201 real changes made)

. replace covid_death_part1 = 0 if (died_date_onscovid_part1 > study_end_censor
>  )
(1,151 real changes made)

. replace covid_test_ever = 0 if (date_covid_test_ever > study_end_censor )
(2,933 real changes made)

. 
. 
. * If outcome was after censoring occurred, set date to missing
. replace date_covid_tpp_prob = . if (date_covid_tpp_prob > study_end_censor ) 
(2,325 real changes made, 2,325 to missing)

. replace died_date_onsnoncovid = . if (died_date_onsnoncovid > study_end_censo
> r )
(755 real changes made, 755 to missing)

. replace died_date_onscovid = . if (died_date_onscovid > study_end_censor )
(1,140 real changes made, 1,140 to missing)

. replace covid_icu_date = . if (covid_icu_date > study_end_censor)
(1,886 real changes made, 1,886 to missing)

. replace covid_admission_primary_date    = . if (covid_admission_primary_date 
> > study_end_censor  | covid_admission_primary_date > died_date_ons) 
(2,201 real changes made, 2,201 to missing)

. replace died_date_onscovid_part1 = . if (died_date_onscovid_part1 > study_end
> _censor )
(1,151 real changes made, 1,151 to missing)

. replace date_covid_test_ever = . if (date_covid_test_ever > study_end_censor 
> ) 
(2,933 real changes made, 2,933 to missing)

. 
. 
. * Format date variables
. format  stime* %td  

. gen positive_SGSS = (positive_covid_test_ever < .)

. gen covid_primary_care_codes = (covid_primary_care_codes_only < .)

. rename positive_covid_test_ever date_positive_SGSS

. rename covid_primary_care_codes_only date_covid_primary_care_codes

. replace covid_primary_care_codes = 0 if (date_covid_primary_care_codes > stud
> y_end_censor )
(2,165 real changes made)

. replace positive_SGSS = 0 if (date_positive_SGSS > study_end_censor )
(2,974 real changes made)

. 
. replace date_covid_primary_care_codes = . if (date_covid_primary_care_codes >
>  study_end_censor )
(2,165 real changes made, 2,165 to missing)

. replace date_positive_SGSS = . if (date_positive_SGSS > study_end_censor )
(2,974 real changes made, 2,974 to missing)

. 
. 
. gen reported_infection_source=1 if covid_tpp_prob==1
(3,227 missing values generated)

. recode reported_infection_source 1=2 if date_covid_tpp_prob== covid_tpp_codes
> _test 
(reported_infection_source: 28 changes made)

. recode reported_infection_source 1=3 if date_covid_tpp_prob==covid_tpp_codes_
> seq 
(reported_infection_source: 29 changes made)

. recode reported_infection_source 1=4 if date_covid_tpp_prob==covid_tpp_codes_
> clinical 
(reported_infection_source: 21 changes made)

. lab define reported_infection_source 1 SGSS 2 test_code 3 sequalae_code 4 dia
> gnosis_code

. lab val reported_infection_source reported_infection_source

. 
. 
. 
. 
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  number_kids "Number of children aged 1-<12 years in household"

. label var  household_size "Number people in household"

. label var  household_id "Household ID"

. 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age66                                         "66 years and older"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Evidence of obesity 
> (4 categories)"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var ethnicity                                     "Ethnicity"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. lab var tot_adults_hh                           "Total number adults in hh"

. lab var kids_cat4                                       "Exposure (v2) with 4
> -cats"

. lab var kids_cat5                                        "Exposure (v3) with 
> 5-cats"

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma categ
> ory"

. label var egfr_cat                                              "Calculated e
> GFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabcat                                               "Diabetes"

. label var cancer_haem_cat                                               "Haem
> atological cancer"

. label var cancer_exhaem_cat                                             "Non-
> haematological cancer"

. label var kidney_transplant                                             "Kidn
> ey transplant"     

. label var other_transplant                                              "Othe
> r solid organ transplant"

. label var asplenia                                              "Asplenia"

. label var other_immuno                                  "Immunosuppressed (co
> mbination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                   "Neurological disease"               
>    

. label var stroke_dementia                           "Stroke or dementia"     
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    eGFR

. lab var perm_immunodef                                  "Permanent immunosupp
> ression"

. lab var temp_immunodef                                  "Temporary immunosupp
> ression"

. lab var esrd                                                    "End-stage re
> nal disease"

. lab var anycomorb                                               "Any comorbid
> ity"

. 
. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_haem_date                                      "Haem cancer 
> Date"

. label var cancer_nonhaem_date                           "Non-haem cancer Date
> "

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date              "Neurological disease  Date"

. label var stroke_dementia_date                      "Stroke or dementia date"
>                                                    

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var perm_immunodef_date                             "Permanent immunosupp
> ression date"

. lab var temp_immunodef_date                             "Temporary immunosupp
> ression date"

. label var kidney_transplant_date                                             
>    "Kidney transplant"     

. label var other_transplant_date                                         "Othe
> r solid organ transplant"

. label var asplenia_date                                                 "Aspl
> enia date"

. lab var  bphigh "non-missing indicator of known high blood pressure"

. lab var bpcat "Blood pressure four levels, non-missing"

. lab var htdiag_or_highbp "High blood pressure or hypertension diagnosis"

. lab var shield "Probable shielding"

. 
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. label var study_end_censor                      "Date of admin censoring for 
> outcomes"

. 
. label var  covid_tpp_prob                               "Failure/censoring in
> dicator for outcome: covid prob case"

. label var  non_covid_death                              "Failure/censoring in
> dicator for outcome: non-covid death"

. label var  covid_death                              "Failure/censoring indica
> tor for outcome: covid death"

. label var  covid_icu                                "Failure/censoring indica
> tor for outcome: covid icu"

. label var  covid_test_ever                                  "Failure/censorin
> g indicator for outcome: covid test ever"

. lab var covidadmission                                  "Failure/censoring in
> dicator for outcome: covid SUS admission"

. lab var covid_death_part1                               "Failure/censoring in
> dicator for outcome: covid death part1"

. lab var  positive_SGSS          "Indicator positive covid test"

. lab var  covid_primary_care_codes               "Indicator positive primary c
> are code COVID infection"

. lab var reported_infection_source               "Reported Infection Source"

. 
. rename died_date_onsnoncovid date_non_covid_death

. rename died_date_onscovid date_covid_death

. rename covid_icu_date date_covid_icu

. rename covid_admission_primary_date date_covidadmission

. label var date_covid_tpp_prob                   "Date of probable COVID-19 cl
> inical infection"

. label var date_non_covid_death                  "Date of ONS non-COVID-19 Dea
> th"

. label var  date_covid_death                     "Date of ONS COVID-19 Death"

. lab var date_covid_icu                                  "Date of admission to
>  ICU for COVID-19" 

. lab var date_covidadmission                     "Date of admission to hospita
> l for COVID-19" 

. label var  died_date_onscovid_part1                     "Date of ONS COVID De
> ath part1"

. lab var  date_positive_SGSS             "Date of positive SGSS test"

. lab var   date_covid_primary_care_codes "Date of COVID-19 primary care code"

. lab var   date_covid_test_ever  "Date of COVID-19 test"

. 
. * Survival times
. label var  stime_covid_tpp_prob                         "Survival tme (date);
>  outcome "

. label var  stime_non_covid_death                        "Survival tme (date);
>  outcome non_covid_death   "

. label var  stime_covid_death                            "Survival time (date)
> ; outcome covid death"

. label var  stime_covid_icu                                      "Survival tim
> e (date); outcome covid icu"

. label var  stime_covidadmission                         "Survival time (date)
> ; outcome covid hosp admission"

. label var  stime_covid_death_part1                              "Survival tim
> e (date); outcome covid death part1"

. label var  stime_covid_test_ever                                "Survival tim
> e (date); outcome covid test"

. 
. *Key DATES
. label var   died_date_ons                               "Date death ONS"

. label var  has_12_m_follow_up                   "Has 12 months follow-up"

. lab var  dereg_date                                             "Date deregis
> tration from practice"

. lab var under18vacc                                             "Date first c
> hild in hh vaccinated"

. 
. 
. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
ethnicity_~e  hba1c_mmol~e  sgtf          asthmacat     bmi_age
bmi_measured  hba1c_per~te  lft_pcr       diabetes      SCr_adj
bp_sys_dat~e  cancer_haem   sex           covid_tpp_~l  min
bp_sys_dat~d  cancer_non~m  care_home_~e  covid_tpp_~t  max
bp_dias_da~e  esrf_date     bp_sys        covid_tpp_~q  hba1c_pct
bp_dias_da~d  esrf          bp_dias       covid_admi~e  dm_type
crea~te_date  dialysis_d~e  creatinine    under18vac~p  hba1ccat
crea~ne_date  dialysis      diabetes_t~e  age_drop      hba1c75
smoki~e_date  died_ons_c~y  hba1c_mmol~l  no_of_kids
smoki~s_date  died_ons_c~g  hba1c_per~ge  bmi_time

. drop `r(varlist)'

. drop covid_admission_primary_diagnosi   

. 
.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. *************TEMP DROP TO INVESTIGATE ASSOCIATIONS MORE EASILY***************
> ***
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. count
  22,900

. 
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if died_date_ons <=enter_date
(0 observations deleted)

. count
  22,900

. 
. noi di "DROP IF COVID IN TPP BEFORE INDEX"
DROP IF COVID IN TPP BEFORE INDEX

. drop if date_covid_tpp_prob <=enter_date
(0 observations deleted)

. count
  22,900

. 
. noi di "DROP IMD MISSING"
DROP IMD MISSING

. recode imd .=9
(imd: 0 changes made)

. recode imd .u=9
(imd: 0 changes made)

. drop if imd==9
(0 observations deleted)

. count
  22,900

. 
. noi di "DROP MISSING GENDER:"
DROP MISSING GENDER:

. recode male .=9
(male: 0 changes made)

. recode male .u=9
(male: 0 changes made)

. drop if male==9
(0 observations deleted)

. count   
  22,900

.         
. ***************
. *  Save data  *
. ***************
. sort patient_id

. save $tempdir/analysis_dataset_with_missing_ethnicity, replace
(note: file tempdata/analysis_dataset_with_missing_ethnicity.dta not found)
file tempdata/analysis_dataset_with_missing_ethnicity.dta saved

. 
. noi di "DROP NO ETHNICITY DATA"
DROP NO ETHNICITY DATA

. keep if ethnicity!=.u   
(2,269 observations deleted)

. 
. save $tempdir/analysis_dataset, replace
(note: file tempdata/analysis_dataset.dta not found)
file tempdata/analysis_dataset.dta saved

. 
. 
. 
. use  $tempdir/analysis_dataset, clear

. keep if age<=65
(4,508 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir/analysis_dataset_ageband_0, replace
(note: file tempdata/analysis_dataset_ageband_0.dta not found)
file tempdata/analysis_dataset_ageband_0.dta saved

. 
. 
. use  $tempdir/analysis_dataset, clear

. keep if age>65
(16,123 observations deleted)

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. save $tempdir/analysis_dataset_ageband_1, replace
(note: file tempdata/analysis_dataset_ageband_1.dta not found)
file tempdata/analysis_dataset_ageband_1.dta saved

. 
. 
. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  3.         
. /*no longer using composite outcome
> use $tempdir/analysis_dataset_ageband_`x', clear
> * Save a version set on covid death/icu  outcome
> stset stime_covid_death_icu, fail(covid_death_icu)                           
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
> save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_icu_ageband_`x'.d
> ta", replace
> */
. use $tempdir/analysis_dataset_ageband_`x', clear
  4. * Save a version set on covid test ever  outcome only
. stset stime_covid_test_ever, fail(covid_test_ever)                           
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  5. save "$tempdir/cr_create_analysis_dataset_STSET_covid_test_ever_ageband_`x
> '.dta", replace
  6. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  7. * Save a version set on covid death only
. stset stime_covid_death, fail(covid_death)                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  8. save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_ageband_`x'.dt
> a", replace
  9. 
. /*this was created for investigation only
> use $tempdir/analysis_dataset_ageband_`x', clear
> * Save a version set on covid death only
> stset stime_covid_death_part1, fail(covid_death_part1)                       
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
> save "$tempdir/cr_create_analysis_dataset_STSET_covid_death_part1_ageband_`x'
> .dta", replace
> */
. use $tempdir/analysis_dataset_ageband_`x', clear
 10. * Save a version set on probable covid
. stset stime_covid_tpp_prob, fail(covid_tpp_prob)                             
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 11. save "$tempdir/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_`x'
> .dta", replace        
 12. 
. use $tempdir/analysis_dataset_ageband_`x', clear
 13. * Save a version set on hosp admission for covid
. stset stime_covidadmission, fail(covidadmission)                             
>    ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 14. save "$tempdir/cr_create_analysis_dataset_STSET_covidadmission_ageband_`x'
> .dta", replace        
 15. 
. }

                id:  patient_id
     failure event:  covid_test_ever != 0 & covid_test_ever < .
obs. time interval:  (stime_covid_test_ever[_n-1], stime_covid_test_ever]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,123  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,120  observations remaining, representing
     16,120  subjects
      1,175  failures in single-failure-per-subject data
  3,077,517  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_test_ever_ageband_0
> .dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_test_ever_ageband_0.dta sa
> ved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,123  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,120  observations remaining, representing
     16,120  subjects
      6,954  failures in single-failure-per-subject data
  3,093,026  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta
>  not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_0.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,123  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
     16,120  observations remaining, representing
     16,120  subjects
     13,884  failures in single-failure-per-subject data
  2,022,459  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_0.dta sav
> ed

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,123  total observations
         13  observations end on or before enter()
------------------------------------------------------------------------------
     16,110  observations remaining, representing
     16,110  subjects
      2,134  failures in single-failure-per-subject data
  2,841,364  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_0.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_0.dta sav
> ed

                id:  patient_id
     failure event:  covid_test_ever != 0 & covid_test_ever < .
obs. time interval:  (stime_covid_test_ever[_n-1], stime_covid_test_ever]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,508  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,508  observations remaining, representing
      4,508  subjects
        318  failures in single-failure-per-subject data
    860,318  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_test_ever_ageband_1
> .dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_test_ever_ageband_1.dta sa
> ved

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,508  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,508  observations remaining, representing
      4,508  subjects
      1,897  failures in single-failure-per-subject data
    864,350  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta
>  not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_death_ageband_1.dta saved

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,508  total observations
          0  exclusions
------------------------------------------------------------------------------
      4,508  observations remaining, representing
      4,508  subjects
      3,859  failures in single-failure-per-subject data
    552,634  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covid_tpp_prob_ageband_1.dta sav
> ed

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,508  total observations
          2  observations end on or before enter()
------------------------------------------------------------------------------
      4,506  observations remaining, representing
      4,506  subjects
        588  failures in single-failure-per-subject data
    790,894  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(note: file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_1.
> dta not found)
file tempdata/cr_create_analysis_dataset_STSET_covidadmission_ageband_1.dta sav
> ed

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/01_cr_analysis_dataset.log
  log type:  text
 closed on:  17 Nov 2021, 20:22:20
-------------------------------------------------------------------------------
