-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/02_an_data_checks.log
  log type:  text
 opened on:  24 Jul 2021, 23:00:39

. 
. * Open Stata dataset
. use $tempdir/`inputfile', clear

. 
. *run ssc install if not on local machine - server needs datacheck.ado file
. *ssc install datacheck 
. 
. *Duplicate patient check
. datacheck _n==1, by(patient_id) nol

. 
. 
. /* CHECK INCLUSION AND EXCLUSION CRITERIA====================================
> =*/ 
. 
. * DATA STRUCTURE: Confirm one row per patient 
. duplicates tag patient_id, generate(dup_check)

Duplicates in terms of patient_id

. assert dup_check == 0 

. drop dup_check

. 
. * INCLUSION 1: >=18 and <=110 at 1 March 2020 
. assert age < .

. assert age >= 18 

. assert age <= 110

. 
. 
. * EXCLUDE 1:  MISSING IMD
. assert inlist(imd, 1, 2, 3, 4, 5)

. 
. * EXCLUDE 2:  HH with more than 10 people
. datacheck inlist(household_size, 1, 2, 3, 4, 5,6, 7, 8, 9, 10), nol

 (441 contradictions)

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. *HH
. datacheck kids_cat4<., nol

. datacheck inlist(kids_cat4, 0,1, 2), nol

 (17690 contradictions)

. 
. datacheck number_kids<., nol

 (18596 contradictions)

. datacheck inlist(number_kids, 0,1,2,3,4,5,6,7,8,9), nol

 (18795 contradictions)

. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6,7), nol

. datacheck inlist(age66, 0, 1), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. 
. * Check date ranges for all comorbidities 
. 
. foreach var of varlist  chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         perm_immunodef  ///
>                                         temp_immunodef  ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         hypertension                         
>    ///
>                                         {
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_r~te |      4,120   19aug1995    5450.949  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_c~te |      4,050   01jul1995    5410.569  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_l~te |      4,090   27jun1995    5278.578  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_neur~e |      4,121   23apr1995    5397.468  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stroke_dem~e |      4,085   14may1995    5391.247  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ra_sle_pso~e |      4,082   19may1995    5295.064  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
perm_immun~e |      4,121   21oct1995    5322.506  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
temp_immun~e |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_tran~e |      4,103   09sep1995     5354.48  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
asplenia_d~e |      4,101   17jan1995    5371.252  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |      4,119   26dec1995    5388.743  15jan1970  15jul2021

. 
. foreach comorb in $varlist { 
  2.         local comorb: subinstr local comorb "i." ""
  3.         safetab `comorb', m
  4. }

. 
. *summarise end dates for each outcome
. foreach outcome in date_covid_tpp_prob  date_non_covid_death    date_covid_de
> ath        date_covid_icu  date_covidadmission     died_date_onscovid_part1  
>        {
  2. sum `outcome', format
  3. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~b |     19,180   03apr2021    60.22604  21dec2020  16jul2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_non_c~h |      6,411   03apr2021    60.57358  21dec2020  16jul2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~h |      9,660   03apr2021    59.68459  21dec2020  16jul2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |     16,008   03apr2021    59.83673  21dec2020  16jul2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~n |      9,255   04mar2021    49.52812  20dec2020  16jun2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~1 |      9,617   03apr2021    60.49337  21dec2020  16jul2021

. 
. foreach outcome in date_covid_tpp_prob  date_non_covid_death    date_covid_de
> ath        date_covid_icu  date_covidadmission     died_date_onscovid_part1  
>        {
  2. gen `outcome'_month=mofd(`outcome') 
  3.  lab define `outcome'_month 731 "Dec 2020" 734 "March 2020"  738 "July 202
> 0"
  4. lab val `outcome'_month `outcome'_month
  5. tab `outcome'_month
  6. drop `outcome'_month
  7. }
(1,432 missing values generated)

date_covid_ |
tpp_prob_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |      1,013        5.28        5.28
        732 |      2,842       14.82       20.10
        733 |      2,564       13.37       33.47
 March 2020 |      2,772       14.45       47.92
        735 |      2,840       14.81       62.73
        736 |      2,834       14.78       77.50
        737 |      2,793       14.56       92.06
  July 2020 |      1,522        7.94      100.00
------------+-----------------------------------
      Total |     19,180      100.00
(14,201 missing values generated)

date_non_co |
vid_death_m |
       onth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        341        5.32        5.32
        732 |        996       15.54       20.85
        733 |        856       13.35       34.21
 March 2020 |        931       14.52       48.73
        735 |        880       13.73       62.46
        736 |        964       15.04       77.49
        737 |        956       14.91       92.40
  July 2020 |        487        7.60      100.00
------------+-----------------------------------
      Total |      6,411      100.00
(10,952 missing values generated)

date_covid_ |
death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        460        4.76        4.76
        732 |      1,474       15.26       20.02
        733 |      1,315       13.61       33.63
 March 2020 |      1,441       14.92       48.55
        735 |      1,441       14.92       63.47
        736 |      1,431       14.81       78.28
        737 |      1,349       13.96       92.25
  July 2020 |        749        7.75      100.00
------------+-----------------------------------
      Total |      9,660      100.00
(4,604 missing values generated)

date_covid_ |
  icu_month |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        854        5.33        5.33
        732 |      2,324       14.52       19.85
        733 |      2,113       13.20       33.05
 March 2020 |      2,400       14.99       48.04
        735 |      2,371       14.81       62.86
        736 |      2,411       15.06       77.92
        737 |      2,302       14.38       92.30
  July 2020 |      1,233        7.70      100.00
------------+-----------------------------------
      Total |     16,008      100.00
(11,357 missing values generated)

date_covida |
dmission_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        895        9.67        9.67
        732 |      2,203       23.80       33.47
        733 |      1,678       18.13       51.60
 March 2020 |      1,611       17.41       69.01
        735 |      1,370       14.80       83.81
        736 |      1,027       11.10       94.91
        737 |        471        5.09      100.00
------------+-----------------------------------
      Total |      9,255      100.00
(10,995 missing values generated)

died_date_o |
nscovid_par |
   t1_month |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        509        5.29        5.29
        732 |      1,515       15.75       21.05
        733 |      1,286       13.37       34.42
 March 2020 |      1,390       14.45       48.87
        735 |      1,357       14.11       62.98
        736 |      1,417       14.73       77.72
        737 |      1,424       14.81       92.52
  July 2020 |        719        7.48      100.00
------------+-----------------------------------
      Total |      9,617      100.00

. 
. *Outcome dates
. di d(1jan2021) /*study start*/
22281

. *22281
. di d(01mar2021) /*school opening*/
22340

. *22340
. di d(01may2021)
22401

. *22401
. di d(01july2021)
22462

. *22462
. 
. 
. 
. foreach outcome of any covid_primary_care_codes positive_SGSS non_covid_death
>   covid_tpp_prob covidadmission covid_icu covid_death    {
  2. summ  `outcome', format d 
  3. summ patient_id if `outcome'==1 & date_`outcome'<=22500
  4. local total_`outcome'=`r(N)'
  5. hist date_`outcome' if date_`outcome'<=22500, saving(`outcome', replace) /
> //
> xlabel(22281 22340 22401 22462,labsize(tiny))  xtitle(, size(vsmall)) ///
> graphregion(color(white))  legend(off) freq  ///
> yscale(range(0 3000)) ylab(0 (10000) 30000, labsize(vsmall)) ytitle("Number",
>  size(vsmall))  ///
> title("N=`total_`outcome''", size(vsmall)) 
  6. }

         Indicator positive primary care code COVID
                          infection
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              20,612
25%            1              0       Sum of Wgt.      20,612

50%            1                      Mean           .9236852
                        Largest       Std. Dev.      .2655075
75%            1              1
90%            1              1       Variance       .0704942
95%            1              1       Skewness      -3.191589
99%            1              1       Kurtosis       11.18624

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     19,039    149536.9    86969.38         29     299949
(bin=42, start=22270, width=4.9285714)
(note: file covid_primary_care_codes.gph not found)
(file covid_primary_care_codes.gph saved)

                Indicator positive covid test
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              20,612
25%            0              0       Sum of Wgt.      20,612

50%            0                      Mean           .1498156
                        Largest       Std. Dev.      .3568993
75%            0              1
90%            1              1       Variance       .1273771
95%            1              1       Skewness       1.962418
99%            1              1       Kurtosis       4.851086

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      3,088    151180.9    86820.37         71     299912
(bin=34, start=22274, width=5.9705882)
(note: file positive_SGSS.gph not found)
(file positive_SGSS.gph saved)

     Failure/censoring indicator for outcome: non-covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              20,612
25%            0              0       Sum of Wgt.      20,612

50%            0                      Mean           .3110324
                        Largest       Std. Dev.      .4629273
75%            1              1
90%            1              1       Variance       .2143016
95%            1              1       Skewness       .8164228
99%            1              1       Kurtosis       1.666546

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      6,411    150304.5     87326.2         83     299949
(bin=38, start=22270, width=5.4473684)
(note: file non_covid_death.gph not found)
(file non_covid_death.gph saved)

       Failure/censoring indicator for outcome: covid
                          prob case
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              20,612
25%            1              0       Sum of Wgt.      20,612

50%            1                      Mean           .9305259
                        Largest       Std. Dev.      .2542648
75%            1              1
90%            1              1       Variance       .0646506
95%            1              1       Skewness       -3.38652
99%            1              1       Kurtosis       12.46852

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     19,180    149595.5    86962.18         29     299949
(bin=42, start=22270, width=4.9285714)
(note: file covid_tpp_prob.gph not found)
(file covid_tpp_prob.gph saved)

     Failure/censoring indicator for outcome: covid SUS
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              20,612
25%            0              0       Sum of Wgt.      20,612

50%            0                      Mean           .4490103
                        Largest       Std. Dev.      .4974053
75%            1              1
90%            1              1       Variance       .2474121
95%            1              1       Skewness       .2050278
99%            1              1       Kurtosis       1.042036

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      9,255    149403.1    87244.68         29     299899
(bin=39, start=22269, width=4.5641026)
(note: file covidadmission.gph not found)
(file covidadmission.gph saved)

     Failure/censoring indicator for outcome: covid icu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              20,612
25%            1              0       Sum of Wgt.      20,612

50%            1                      Mean            .776635
                        Largest       Std. Dev.      .4165111
75%            1              1
90%            1              1       Variance       .1734815
95%            1              1       Skewness      -1.328376
99%            1              1       Kurtosis       2.764583

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     16,008    150499.6    86707.03         36     299949
(bin=42, start=22270, width=4.9285714)
(note: file covid_icu.gph not found)
(file covid_icu.gph saved)

       Failure/censoring indicator for outcome: covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              20,612
25%            0              0       Sum of Wgt.      20,612

50%            0                      Mean            .468659
                        Largest       Std. Dev.      .4990289
75%            1              1
90%            1              1       Variance       .2490298
95%            1              1       Skewness       .1256109
99%            1              1       Kurtosis       1.015778

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      9,660    149190.5    86431.32         36     299912
(bin=39, start=22270, width=5.3076923)
(note: file covid_death.gph not found)
(file covid_death.gph saved)

. 
. * Combine histograms
. graph combine covid_tpp_prob.gph covidadmission.gph covid_icu.gph covid_death
> .gph non_covid_death.gph  , graphregion(color(white))

. graph export "output/01_histogram_outcomes.svg", as(svg) replace 
(note: file output/01_histogram_outcomes.svg not found)
(file output/01_histogram_outcomes.svg written in SVG format)

. 
. * Combine infection histograms
. graph combine covid_primary_care_codes.gph positive_SGSS.gph, graphregion(col
> or(white))

. graph export "output/01_histogram_infection_outcomes.svg", as(svg) replace 
(note: file output/01_histogram_infection_outcomes.svg not found)
(file output/01_histogram_infection_outcomes.svg written in SVG format)

. 
. *censor dates
. summ dereg_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dereg_date |         43   28mar2021    65.79304  15dec2020  15jul2021

. summ has_12_m

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
has_12_m_f~p |     20,612    .9508054    .2162794          0          1

. 
. *Vacc data
. foreach vacc of any covid_vacc_date covid_vacc_second_dose_date   {
  2. summ  `vacc', format d 
  3. summ patient_id if `vacc'!=. 
  4. hist `vacc' if `vacc'<=22500, saving(`vacc', replace) ///
> xlabel(22281 22340 22401 22462,labsize(tiny))  xtitle(, size(vsmall)) ///
> graphregion(color(white))  legend(off) freq  ///
> yscale(range(0 3000)) ylab(0 (1000) 3000, labsize(vsmall)) ytitle("Number", s
> ize(vsmall))  ///
> title("N=`total_`outcome''", size(vsmall)) 
  5. }

                       First vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    11dec2020      09dec2020
 5%    20dec2020      09dec2020
10%    31dec2020      09dec2020       Obs              10,290
25%    02feb2021      09dec2020       Sum of Wgt.      10,290

50%    29mar2021                      Mean          28mar2021
                        Largest       Std. Dev.      63.04526
75%    22may2021      16jul2021
90%    24jun2021      16jul2021       Variance       3974.705
95%    05jul2021      16jul2021       Skewness      -.0106077
99%    14jul2021      16jul2021       Kurtosis       1.800638

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     10,290    148424.2    86328.13         29     299912
(bin=40, start=22258, width=5.475)
(note: file covid_vacc_date.gph not found)
(file covid_vacc_date.gph saved)

                      Second vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    31dec2020      30dec2020
 5%    08jan2021      30dec2020
10%    17jan2021      30dec2020       Obs               6,074
25%    16feb2021      30dec2020       Sum of Wgt.       6,074

50%    07apr2021                      Mean          07apr2021
                        Largest       Std. Dev.      57.49978
75%    27may2021      16jul2021
90%    26jun2021      16jul2021       Variance       3306.225
95%    06jul2021      16jul2021       Skewness       .0045914
99%    14jul2021      16jul2021       Kurtosis       1.801555

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      6,074    150190.3    87133.36         29     299894
(bin=37, start=22279, width=5.3513514)
(note: file covid_vacc_second_dose_date.gph not found)
(file covid_vacc_second_dose_date.gph saved)

. *Combine histograms
. graph combine covid_vacc_date.gph covid_vacc_second_dose_date.gph , graphregi
> on(color(white))

. graph export "output/01_histogram_vaccinations.svg", as(svg) replace 
(note: file output/01_histogram_vaccinations.svg not found)
(file output/01_histogram_vaccinations.svg written in SVG format)

. 
. 
. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. *HH variables
. safetab kids_cat4 tot_adults_hh
0

**TABLE OF kids_cat4 tot_adults_hh REDACTED DUE TO SMALL N**


. safetab number_kids tot_adults_hh
0

**TABLE OF number_kids tot_adults_hh REDACTED DUE TO SMALL N**


. safetab household_size tot_adults_hh
0

**TABLE OF household_size tot_adults_hh REDACTED DUE TO SMALL N**


. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,898    16.84135    1.011025   15.00473   18.49996

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      4,578    21.87897      1.8566   18.50051   24.99889

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      3,665    27.42732    1.449349   25.00087   29.99972

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      2,871    32.34973     1.44878   30.00058    34.9992

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,792    37.29686    1.419644   35.00166   39.99993

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,166    43.31915    2.470278    40.0014   49.98875

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |     1,898          0          0          0 |     1,898 
  Normal (18.5-24.9) |     4,578          0          0          0 |     4,578 
Overweight (25-29.9) |     3,665          0          0          0 |     3,665 
   Obese I (30-34.9) |         0      2,871          0          0 |     2,871 
  Obese II (35-39.9) |         0          0      1,792          0 |     1,792 
     Obese III (40+) |         0          0          0      1,166 |     1,166 
        Unknown (.u) |     4,642          0          0          0 |     4,642 
---------------------+--------------------------------------------+----------
               Total |    14,783      2,871      1,792      1,166 |    20,612 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,965     23.6686      3.4309         18         29

-------------------------------------------------------------------------------
-> agegroup = 30-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,520    34.48892    2.877709         30         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,287    44.63553    2.832264         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,568     54.4602    2.864296         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      2,772    64.48088    2.872233         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      2,193    73.97401    2.855996         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      1,307    85.77506    4.857847         80        108


. safetab agegroup age66, m
15

   Grouped |  66 years and older
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,965          0 |     3,965 
    30-<40 |     3,520          0 |     3,520 
    40-<50 |     3,287          0 |     3,287 
    50-<60 |     3,568          0 |     3,568 
    60-<70 |     1,965        807 |     2,772 
    70-<80 |         0      2,193 |     2,193 
       80+ |         0      1,307 |     1,307 
-----------+----------------------+----------
     Total |    16,305      4,307 |    20,612 

. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never |       816          0          0 |       816 
      Former |         0        402          0 |       402 
     Current |         0          0      2,479 |     2,479 
Unknown (.u) |    16,915          0          0 |    16,915 
-------------+---------------------------------+----------
       Total |    17,731        402      2,479 |    20,612 

. 
. * Diabetes
. *safetab diabcat diabetes, m
. 
. * CKD
. safetab reduced egfr_cat, m
17

       Reduced kidney |               Calculated eGFR
             function |        30         45         60          . |     Total
----------------------+--------------------------------------------+----------
                 None |         0          0     19,247      1,100 |    20,347 
Stage 3a/3b egfr 30-6 |         6        259          0          0 |       265 
----------------------+--------------------------------------------+----------
                Total |         6        259     19,247      1,100 |    20,612 

. * CKD
. safetab reduced esrd, m
13

                      |    End-stage renal
       Reduced kidney |        disease
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    12,982      7,365 |    20,347 
Stage 3a/3b egfr 30-6 |       179         86 |       265 
----------------------+----------------------+----------
                Total |    13,161      7,451 |    20,612 

. 
. /* EXPECTED RELATIONSHIPS====================================================
> =*/ 
. 
. /*  Relationships between demographic/lifestyle variables  */
. safetab agegroup bmicat,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                      Grouped BMI
       age | Underweig  Normal (1  Overweigh  Obese I (  Obese II  |     Total
-----------+-------------------------------------------------------+----------
    18-<30 |       325        797        664        502        304 |     2,778 
           |     11.70      28.69      23.90      18.07      10.94 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 |       323        839        631        507        308 |     2,798 
           |     11.54      29.99      22.55      18.12      11.01 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 |       312        738        601        479        288 |     2,612 
           |     11.94      28.25      23.01      18.34      11.03 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 |       326        803        663        507        320 |     2,817 
           |     11.57      28.51      23.54      18.00      11.36 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 |       260        642        484        376        264 |     2,202 
           |     11.81      29.16      21.98      17.08      11.99 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 |       221        469        390        314        179 |     1,726 
           |     12.80      27.17      22.60      18.19      10.37 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |       131        290        232        186        129 |     1,037 
           |     12.63      27.97      22.37      17.94      12.44 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |     1,898      4,578      3,665      2,871      1,792 |    15,970 
           |     11.88      28.67      22.95      17.98      11.22 |    100.00 


           |  Grouped
   Grouped |    BMI
       age | Obese III |     Total
-----------+-----------+----------
    18-<30 |       186 |     2,778 
           |      6.70 |    100.00 
-----------+-----------+----------
    30-<40 |       190 |     2,798 
           |      6.79 |    100.00 
-----------+-----------+----------
    40-<50 |       194 |     2,612 
           |      7.43 |    100.00 
-----------+-----------+----------
    50-<60 |       198 |     2,817 
           |      7.03 |    100.00 
-----------+-----------+----------
    60-<70 |       176 |     2,202 
           |      7.99 |    100.00 
-----------+-----------+----------
    70-<80 |       153 |     1,726 
           |      8.86 |    100.00 
-----------+-----------+----------
       80+ |        69 |     1,037 
           |      6.65 |    100.00 
-----------+-----------+----------
     Total |     1,166 |    15,970 
           |      7.30 |    100.00 

. safetab agegroup smoke,         row  
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Smoking status
       age |     Never     Former    Current |     Total
-----------+---------------------------------+----------
    18-<30 |       150         82        490 |       722 
           |     20.78      11.36      67.87 |    100.00 
-----------+---------------------------------+----------
    30-<40 |       143         64        417 |       624 
           |     22.92      10.26      66.83 |    100.00 
-----------+---------------------------------+----------
    40-<50 |       118         52        400 |       570 
           |     20.70       9.12      70.18 |    100.00 
-----------+---------------------------------+----------
    50-<60 |       157         71        459 |       687 
           |     22.85      10.33      66.81 |    100.00 
-----------+---------------------------------+----------
    60-<70 |       110         59        320 |       489 
           |     22.49      12.07      65.44 |    100.00 
-----------+---------------------------------+----------
    70-<80 |        89         42        243 |       374 
           |     23.80      11.23      64.97 |    100.00 
-----------+---------------------------------+----------
       80+ |        49         32        150 |       231 
           |     21.21      13.85      64.94 |    100.00 
-----------+---------------------------------+----------
     Total |       816        402      2,479 |     3,697 
           |     22.07      10.87      67.05 |    100.00 

. safetab agegroup ethnicity, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |            Ethnicity
       age |     White  Asian or       Other |     Total
-----------+---------------------------------+----------
    18-<30 |     3,207        388        370 |     3,965 
           |     80.88       9.79       9.33 |    100.00 
-----------+---------------------------------+----------
    30-<40 |     2,794        364        362 |     3,520 
           |     79.38      10.34      10.28 |    100.00 
-----------+---------------------------------+----------
    40-<50 |     2,656        324        307 |     3,287 
           |     80.80       9.86       9.34 |    100.00 
-----------+---------------------------------+----------
    50-<60 |     2,888        308        372 |     3,568 
           |     80.94       8.63      10.43 |    100.00 
-----------+---------------------------------+----------
    60-<70 |     2,200        290        282 |     2,772 
           |     79.37      10.46      10.17 |    100.00 
-----------+---------------------------------+----------
    70-<80 |     1,737        229        227 |     2,193 
           |     79.21      10.44      10.35 |    100.00 
-----------+---------------------------------+----------
       80+ |     1,008        146        153 |     1,307 
           |     77.12      11.17      11.71 |    100.00 
-----------+---------------------------------+----------
     Total |    16,490      2,049      2,073 |    20,612 
           |     80.00       9.94      10.06 |    100.00 

. safetab agegroup imd,           row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Index of Multiple Deprivation
   Grouped |              (IMD)
       age | 1 least d          4  5 most de |     Total
-----------+---------------------------------+----------
    18-<30 |     2,738        809        418 |     3,965 
           |     69.05      20.40      10.54 |    100.00 
-----------+---------------------------------+----------
    30-<40 |     2,460        696        364 |     3,520 
           |     69.89      19.77      10.34 |    100.00 
-----------+---------------------------------+----------
    40-<50 |     2,331        679        277 |     3,287 
           |     70.92      20.66       8.43 |    100.00 
-----------+---------------------------------+----------
    50-<60 |     2,504        701        363 |     3,568 
           |     70.18      19.65      10.17 |    100.00 
-----------+---------------------------------+----------
    60-<70 |     1,902        584        286 |     2,772 
           |     68.61      21.07      10.32 |    100.00 
-----------+---------------------------------+----------
    70-<80 |     1,539        434        220 |     2,193 
           |     70.18      19.79      10.03 |    100.00 
-----------+---------------------------------+----------
       80+ |       921        256        130 |     1,307 
           |     70.47      19.59       9.95 |    100.00 
-----------+---------------------------------+----------
     Total |    14,395      4,159      2,058 |    20,612 
           |     69.84      20.18       9.98 |    100.00 

. safetab agegroup shield,    row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Probable shielding
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       609      3,356 |     3,965 
           |     15.36      84.64 |    100.00 
-----------+----------------------+----------
    30-<40 |       567      2,953 |     3,520 
           |     16.11      83.89 |    100.00 
-----------+----------------------+----------
    40-<50 |       505      2,782 |     3,287 
           |     15.36      84.64 |    100.00 
-----------+----------------------+----------
    50-<60 |       555      3,013 |     3,568 
           |     15.55      84.45 |    100.00 
-----------+----------------------+----------
    60-<70 |       436      2,336 |     2,772 
           |     15.73      84.27 |    100.00 
-----------+----------------------+----------
    70-<80 |       334      1,859 |     2,193 
           |     15.23      84.77 |    100.00 
-----------+----------------------+----------
       80+ |       206      1,101 |     1,307 
           |     15.76      84.24 |    100.00 
-----------+----------------------+----------
     Total |     3,212     17,400 |    20,612 
           |     15.58      84.42 |    100.00 

. 
. safetab bmicat smoke,            row   
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |          Smoking status
         Grouped BMI |     Never     Former    Current |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |        75         41        234 |       350 
                     |     21.43      11.71      66.86 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |       190         89        534 |       813 
                     |     23.37      10.95      65.68 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |       134         72        448 |       654 
                     |     20.49      11.01      68.50 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |       126         50        349 |       525 
                     |     24.00       9.52      66.48 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |        70         26        232 |       328 
                     |     21.34       7.93      70.73 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |        37         26        155 |       218 
                     |     16.97      11.93      71.10 |    100.00 
---------------------+---------------------------------+----------
               Total |       632        304      1,952 |     2,888 
                     |     21.88      10.53      67.59 |    100.00 

. safetab bmicat ethnicity,        row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |            Ethnicity
         Grouped BMI |     White  Asian or       Other |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |     1,513        204        181 |     1,898 
                     |     79.72      10.75       9.54 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |     3,638        456        484 |     4,578 
                     |     79.47       9.96      10.57 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |     2,899        398        368 |     3,665 
                     |     79.10      10.86      10.04 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |     2,317        267        287 |     2,871 
                     |     80.70       9.30      10.00 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |     1,459        171        162 |     1,792 
                     |     81.42       9.54       9.04 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |       930        113        123 |     1,166 
                     |     79.76       9.69      10.55 |    100.00 
---------------------+---------------------------------+----------
               Total |    12,756      1,609      1,605 |    15,970 
                     |     79.87      10.08      10.05 |    100.00 

. safetab bmicat imd,              row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Index of Multiple Deprivation
                     |              (IMD)
         Grouped BMI | 1 least d          4  5 most de |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |     1,359        369        170 |     1,898 
                     |     71.60      19.44       8.96 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |     3,201        924        453 |     4,578 
                     |     69.92      20.18       9.90 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |     2,528        752        385 |     3,665 
                     |     68.98      20.52      10.50 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |     2,026        560        285 |     2,871 
                     |     70.57      19.51       9.93 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |     1,239        377        176 |     1,792 
                     |     69.14      21.04       9.82 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |       815        240        111 |     1,166 
                     |     69.90      20.58       9.52 |    100.00 
---------------------+---------------------------------+----------
               Total |    11,168      3,222      1,580 |    15,970 
                     |     69.93      20.18       9.89 |    100.00 

. safetab bmicat hypertension, row 
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |       Diagnosed
                     |     hypertension
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     1,521        377 |     1,898 
                     |     80.14      19.86 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     3,615        963 |     4,578 
                     |     78.96      21.04 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     2,952        713 |     3,665 
                     |     80.55      19.45 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |     2,270        601 |     2,871 
                     |     79.07      20.93 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,439        353 |     1,792 
                     |     80.30      19.70 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |       948        218 |     1,166 
                     |     81.30      18.70 |    100.00 
---------------------+----------------------+----------
               Total |    12,745      3,225 |    15,970 
                     |     79.81      20.19 |    100.00 

. safetab bmicat shield,    row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Probable shielding
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       269      1,629 |     1,898 
                     |     14.17      85.83 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       760      3,818 |     4,578 
                     |     16.60      83.40 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |       575      3,090 |     3,665 
                     |     15.69      84.31 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |       438      2,433 |     2,871 
                     |     15.26      84.74 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |       288      1,504 |     1,792 
                     |     16.07      83.93 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |       182        984 |     1,166 
                     |     15.61      84.39 |    100.00 
---------------------+----------------------+----------
               Total |     2,512     13,458 |    15,970 
                     |     15.73      84.27 |    100.00 

. 
.                             
. safetab smoke ethnicity,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |            Ethnicity
      status |     White  Asian or       Other |     Total
-------------+---------------------------------+----------
       Never |       662         71         83 |       816 
             |     81.13       8.70      10.17 |    100.00 
-------------+---------------------------------+----------
      Former |       331         29         42 |       402 
             |     82.34       7.21      10.45 |    100.00 
-------------+---------------------------------+----------
     Current |     1,998        236        245 |     2,479 
             |     80.60       9.52       9.88 |    100.00 
-------------+---------------------------------+----------
       Total |     2,991        336        370 |     3,697 
             |     80.90       9.09      10.01 |    100.00 

. safetab smoke imd,                      row 
10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Index of Multiple Deprivation
     Smoking |              (IMD)
      status | 1 least d          4  5 most de |     Total
-------------+---------------------------------+----------
       Never |       571        150         95 |       816 
             |     69.98      18.38      11.64 |    100.00 
-------------+---------------------------------+----------
      Former |       278         89         35 |       402 
             |     69.15      22.14       8.71 |    100.00 
-------------+---------------------------------+----------
     Current |     1,763        496        220 |     2,479 
             |     71.12      20.01       8.87 |    100.00 
-------------+---------------------------------+----------
       Total |     2,612        735        350 |     3,697 
             |     70.65      19.88       9.47 |    100.00 

. safetab smoke hypertension, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       657        159 |       816 
             |     80.51      19.49 |    100.00 
-------------+----------------------+----------
      Former |       318         84 |       402 
             |     79.10      20.90 |    100.00 
-------------+----------------------+----------
     Current |     1,977        502 |     2,479 
             |     79.75      20.25 |    100.00 
-------------+----------------------+----------
       Total |     2,952        745 |     3,697 
             |     79.85      20.15 |    100.00 

. safetab smoke shield,    row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Probable shielding
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       115        701 |       816 
             |     14.09      85.91 |    100.00 
-------------+----------------------+----------
      Former |        74        328 |       402 
             |     18.41      81.59 |    100.00 
-------------+----------------------+----------
     Current |       374      2,105 |     2,479 
             |     15.09      84.91 |    100.00 
-------------+----------------------+----------
       Total |       563      3,134 |     3,697 
             |     15.23      84.77 |    100.00 

.                       
. safetab ethnicity imd,          row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |  Index of Multiple Deprivation
                      |              (IMD)
            Ethnicity | 1 least d          4  5 most de |     Total
----------------------+---------------------------------+----------
                White |    11,539      3,328      1,623 |    16,490 
                      |     69.98      20.18       9.84 |    100.00 
----------------------+---------------------------------+----------
Asian or Asian Britis |     1,421        418        210 |     2,049 
                      |     69.35      20.40      10.25 |    100.00 
----------------------+---------------------------------+----------
                Other |     1,435        413        225 |     2,073 
                      |     69.22      19.92      10.85 |    100.00 
----------------------+---------------------------------+----------
                Total |    14,395      4,159      2,058 |    20,612 
                      |     69.84      20.18       9.98 |    100.00 

. safetab shield imd,             row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Index of Multiple Deprivation
  Probable |              (IMD)
 shielding | 1 least d          4  5 most de |     Total
-----------+---------------------------------+----------
         0 |     2,251        643        318 |     3,212 
           |     70.08      20.02       9.90 |    100.00 
-----------+---------------------------------+----------
         1 |    12,144      3,516      1,740 |    17,400 
           |     69.79      20.21      10.00 |    100.00 
-----------+---------------------------------+----------
     Total |    14,395      4,159      2,058 |    20,612 
           |     69.84      20.18       9.98 |    100.00 

. 
. safetab shield ethnicity,               row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Probable |            Ethnicity
 shielding |     White  Asian or       Other |     Total
-----------+---------------------------------+----------
         0 |     2,521        352        339 |     3,212 
           |     78.49      10.96      10.55 |    100.00 
-----------+---------------------------------+----------
         1 |    13,969      1,697      1,734 |    17,400 
           |     80.28       9.75       9.97 |    100.00 
-----------+---------------------------------+----------
     Total |    16,490      2,049      2,073 |    20,612 
           |     80.00       9.94      10.06 |    100.00 

. 
. 
. 
. * Relationships with age
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>                    ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension            ///          
>    
>                                                                              
>    {
  2. 
.                 
.         safetab agegroup `var', row 
  3.  }
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |    Asthma category
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,643        322 |     3,965 
           |     91.88       8.12 |    100.00 
-----------+----------------------+----------
    30-<40 |     3,227        293 |     3,520 
           |     91.68       8.32 |    100.00 
-----------+----------------------+----------
    40-<50 |     3,033        254 |     3,287 
           |     92.27       7.73 |    100.00 
-----------+----------------------+----------
    50-<60 |     3,275        293 |     3,568 
           |     91.79       8.21 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,562        210 |     2,772 
           |     92.42       7.58 |    100.00 
-----------+----------------------+----------
    70-<80 |     2,010        183 |     2,193 
           |     91.66       8.34 |    100.00 
-----------+----------------------+----------
       80+ |     1,201        106 |     1,307 
           |     91.89       8.11 |    100.00 
-----------+----------------------+----------
     Total |    18,951      1,661 |    20,612 
           |     91.94       8.06 |    100.00 
37

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,180        785 |     3,965 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,827        693 |     3,520 
           |     80.31      19.69 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,624        663 |     3,287 
           |     79.83      20.17 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,852        716 |     3,568 
           |     79.93      20.07 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,224        548 |     2,772 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,748        445 |     2,193 
           |     79.71      20.29 |    100.00 
-----------+----------------------+----------
       80+ |     1,037        270 |     1,307 
           |     79.34      20.66 |    100.00 
-----------+----------------------+----------
     Total |    16,492      4,120 |    20,612 
           |     80.01      19.99 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,198        767 |     3,965 
           |     80.66      19.34 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,817        703 |     3,520 
           |     80.03      19.97 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,647        640 |     3,287 
           |     80.53      19.47 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,868        700 |     3,568 
           |     80.38      19.62 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,214        558 |     2,772 
           |     79.87      20.13 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,786        407 |     2,193 
           |     81.44      18.56 |    100.00 
-----------+----------------------+----------
       80+ |     1,032        275 |     1,307 
           |     78.96      21.04 |    100.00 
-----------+----------------------+----------
     Total |    16,562      4,050 |    20,612 
           |     80.35      19.65 |    100.00 
17

**TABLE OF agegroup diabcat REDACTED DUE TO SMALL N**

31

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Chronic liver disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,172        793 |     3,965 
           |     80.00      20.00 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,799        721 |     3,520 
           |     79.52      20.48 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,642        645 |     3,287 
           |     80.38      19.62 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,852        716 |     3,568 
           |     79.93      20.07 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,256        516 |     2,772 
           |     81.39      18.61 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,744        449 |     2,193 
           |     79.53      20.47 |    100.00 
-----------+----------------------+----------
       80+ |     1,057        250 |     1,307 
           |     80.87      19.13 |    100.00 
-----------+----------------------+----------
     Total |    16,522      4,090 |    20,612 
           |     80.16      19.84 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Neurological disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,207        758 |     3,965 
           |     80.88      19.12 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,799        721 |     3,520 
           |     79.52      20.48 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,624        663 |     3,287 
           |     79.83      20.17 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,870        698 |     3,568 
           |     80.44      19.56 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,201        571 |     2,772 
           |     79.40      20.60 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,754        439 |     2,193 
           |     79.98      20.02 |    100.00 
-----------+----------------------+----------
       80+ |     1,036        271 |     1,307 
           |     79.27      20.73 |    100.00 
-----------+----------------------+----------
     Total |    16,491      4,121 |    20,612 
           |     80.01      19.99 |    100.00 
25

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Stroke or dementia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,206        759 |     3,965 
           |     80.86      19.14 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,810        710 |     3,520 
           |     79.83      20.17 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,625        662 |     3,287 
           |     79.86      20.14 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,864        704 |     3,568 
           |     80.27      19.73 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,232        540 |     2,772 
           |     80.52      19.48 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,749        444 |     2,193 
           |     79.75      20.25 |    100.00 
-----------+----------------------+----------
       80+ |     1,041        266 |     1,307 
           |     79.65      20.35 |    100.00 
-----------+----------------------+----------
     Total |    16,527      4,085 |    20,612 
           |     80.18      19.82 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Autoimmune disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,181        784 |     3,965 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,824        696 |     3,520 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,616        671 |     3,287 
           |     79.59      20.41 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,909        659 |     3,568 
           |     81.53      18.47 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,209        563 |     2,772 
           |     79.69      20.31 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,748        445 |     2,193 
           |     79.71      20.29 |    100.00 
-----------+----------------------+----------
       80+ |     1,043        264 |     1,307 
           |     79.80      20.20 |    100.00 
-----------+----------------------+----------
     Total |    16,530      4,082 |    20,612 
           |     80.20      19.80 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
   Grouped |      algorithm)
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,188        777 |     3,965 
           |     80.40      19.60 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,848        672 |     3,520 
           |     80.91      19.09 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,589        698 |     3,287 
           |     78.76      21.24 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,842        726 |     3,568 
           |     79.65      20.35 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,223        549 |     2,772 
           |     80.19      19.81 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,760        433 |     2,193 
           |     80.26      19.74 |    100.00 
-----------+----------------------+----------
       80+ |     1,041        266 |     1,307 
           |     79.65      20.35 |    100.00 
-----------+----------------------+----------
     Total |    16,491      4,121 |    20,612 
           |     80.01      19.99 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
   Grouped |      transplant
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,157        808 |     3,965 
           |     79.62      20.38 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,848        672 |     3,520 
           |     80.91      19.09 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,621        666 |     3,287 
           |     79.74      20.26 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,885        683 |     3,568 
           |     80.86      19.14 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,209        563 |     2,772 
           |     79.69      20.31 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,756        437 |     2,193 
           |     80.07      19.93 |    100.00 
-----------+----------------------+----------
       80+ |     1,033        274 |     1,307 
           |     79.04      20.96 |    100.00 
-----------+----------------------+----------
     Total |    16,509      4,103 |    20,612 
           |     80.09      19.91 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |       Asplenia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,188        777 |     3,965 
           |     80.40      19.60 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,802        718 |     3,520 
           |     79.60      20.40 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,625        662 |     3,287 
           |     79.86      20.14 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,825        743 |     3,568 
           |     79.18      20.82 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,270        502 |     2,772 
           |     81.89      18.11 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,763        430 |     2,193 
           |     80.39      19.61 |    100.00 
-----------+----------------------+----------
       80+ |     1,038        269 |     1,307 
           |     79.42      20.58 |    100.00 
-----------+----------------------+----------
     Total |    16,511      4,101 |    20,612 
           |     80.10      19.90 |    100.00 
27

**TABLE OF agegroup cancer_exhaem_cat REDACTED DUE TO SMALL N**

25

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |            Haematological cancer
       age |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
    18-<30 |     3,184         15         63        703 |     3,965 
           |     80.30       0.38       1.59      17.73 |    100.00 
-----------+--------------------------------------------+----------
    30-<40 |     2,836         12         59        613 |     3,520 
           |     80.57       0.34       1.68      17.41 |    100.00 
-----------+--------------------------------------------+----------
    40-<50 |     2,686          9         40        552 |     3,287 
           |     81.72       0.27       1.22      16.79 |    100.00 
-----------+--------------------------------------------+----------
    50-<60 |     2,868         15         51        634 |     3,568 
           |     80.38       0.42       1.43      17.77 |    100.00 
-----------+--------------------------------------------+----------
    60-<70 |     2,224          6         34        508 |     2,772 
           |     80.23       0.22       1.23      18.33 |    100.00 
-----------+--------------------------------------------+----------
    70-<80 |     1,757         16         32        388 |     2,193 
           |     80.12       0.73       1.46      17.69 |    100.00 
-----------+--------------------------------------------+----------
       80+ |     1,032         11         25        239 |     1,307 
           |     78.96       0.84       1.91      18.29 |    100.00 
-----------+--------------------------------------------+----------
     Total |    16,587         84        304      3,637 |    20,612 
           |     80.47       0.41       1.47      17.65 |    100.00 
37

**TABLE OF agegroup reduced_kidney_function_cat REDACTED DUE TO SMALL N**

14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
   Grouped |        disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     2,491      1,474 |     3,965 
           |     62.82      37.18 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,283      1,237 |     3,520 
           |     64.86      35.14 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,070      1,217 |     3,287 
           |     62.98      37.02 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,275      1,293 |     3,568 
           |     63.76      36.24 |    100.00 
-----------+----------------------+----------
    60-<70 |     1,774        998 |     2,772 
           |     64.00      36.00 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,393        800 |     2,193 
           |     63.52      36.48 |    100.00 
-----------+----------------------+----------
       80+ |       875        432 |     1,307 
           |     66.95      33.05 |    100.00 
-----------+----------------------+----------
     Total |    13,161      7,451 |    20,612 
           |     63.85      36.15 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
   Grouped |     hypertension
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,231        734 |     3,965 
           |     81.49      18.51 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,793        727 |     3,520 
           |     79.35      20.65 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,607        680 |     3,287 
           |     79.31      20.69 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,863        705 |     3,568 
           |     80.24      19.76 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,217        555 |     2,772 
           |     79.98      20.02 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,726        467 |     2,193 
           |     78.70      21.30 |    100.00 
-----------+----------------------+----------
       80+ |     1,056        251 |     1,307 
           |     80.80      19.20 |    100.00 
-----------+----------------------+----------
     Total |    16,493      4,119 |    20,612 
           |     80.02      19.98 |    100.00 

. 
. 
. *Relationships with sex
. foreach var of varlist asthma                                           ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                     /// 
>    
>                                                                              
>    {
  2.                                                 
.         safetab male `var', row 
  3. }
12

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Asthma category
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,615        841 |    10,456 
           |     91.96       8.04 |    100.00 
-----------+----------------------+----------
         1 |     9,336        820 |    10,156 
           |     91.93       8.07 |    100.00 
-----------+----------------------+----------
     Total |    18,951      1,661 |    20,612 
           |     91.94       8.06 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,373      2,083 |    10,456 
           |     80.08      19.92 |    100.00 
-----------+----------------------+----------
         1 |     8,119      2,037 |    10,156 
           |     79.94      20.06 |    100.00 
-----------+----------------------+----------
     Total |    16,492      4,120 |    20,612 
           |     80.01      19.99 |    100.00 
29

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,410      2,046 |    10,456 
           |     80.43      19.57 |    100.00 
-----------+----------------------+----------
         1 |     8,152      2,004 |    10,156 
           |     80.27      19.73 |    100.00 
-----------+----------------------+----------
     Total |    16,562      4,050 |    20,612 
           |     80.35      19.65 |    100.00 
13

**TABLE OF male diabcat REDACTED DUE TO SMALL N**

27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Chronic liver disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,454      2,002 |    10,456 
           |     80.85      19.15 |    100.00 
-----------+----------------------+----------
         1 |     8,068      2,088 |    10,156 
           |     79.44      20.56 |    100.00 
-----------+----------------------+----------
     Total |    16,522      4,090 |    20,612 
           |     80.16      19.84 |    100.00 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Neurological disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,407      2,049 |    10,456 
           |     80.40      19.60 |    100.00 
-----------+----------------------+----------
         1 |     8,084      2,072 |    10,156 
           |     79.60      20.40 |    100.00 
-----------+----------------------+----------
     Total |    16,491      4,121 |    20,612 
           |     80.01      19.99 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Stroke or dementia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,400      2,056 |    10,456 
           |     80.34      19.66 |    100.00 
-----------+----------------------+----------
         1 |     8,127      2,029 |    10,156 
           |     80.02      19.98 |    100.00 
-----------+----------------------+----------
     Total |    16,527      4,085 |    20,612 
           |     80.18      19.82 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Autoimmune disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,423      2,033 |    10,456 
           |     80.56      19.44 |    100.00 
-----------+----------------------+----------
         1 |     8,107      2,049 |    10,156 
           |     79.82      20.18 |    100.00 
-----------+----------------------+----------
     Total |    16,530      4,082 |    20,612 
           |     80.20      19.80 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
           |      algorithm)
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,434      2,022 |    10,456 
           |     80.66      19.34 |    100.00 
-----------+----------------------+----------
         1 |     8,057      2,099 |    10,156 
           |     79.33      20.67 |    100.00 
-----------+----------------------+----------
     Total |    16,491      4,121 |    20,612 
           |     80.01      19.99 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
           |      transplant
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,371      2,085 |    10,456 
           |     80.06      19.94 |    100.00 
-----------+----------------------+----------
         1 |     8,138      2,018 |    10,156 
           |     80.13      19.87 |    100.00 
-----------+----------------------+----------
     Total |    16,509      4,103 |    20,612 
           |     80.09      19.91 |    100.00 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Asplenia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,368      2,088 |    10,456 
           |     80.03      19.97 |    100.00 
-----------+----------------------+----------
         1 |     8,143      2,013 |    10,156 
           |     80.18      19.82 |    100.00 
-----------+----------------------+----------
     Total |    16,511      4,101 |    20,612 
           |     80.10      19.90 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |          Non-haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 |     8,419         36        174      1,827 |    10,456 
           |     80.52       0.34       1.66      17.47 |    100.00 
-----------+--------------------------------------------+----------
         1 |     8,170         43        174      1,769 |    10,156 
           |     80.45       0.42       1.71      17.42 |    100.00 
-----------+--------------------------------------------+----------
     Total |    16,589         79        348      3,596 |    20,612 
           |     80.48       0.38       1.69      17.45 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |            Haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 |     8,457         39        151      1,809 |    10,456 
           |     80.88       0.37       1.44      17.30 |    100.00 
-----------+--------------------------------------------+----------
         1 |     8,130         45        153      1,828 |    10,156 
           |     80.05       0.44       1.51      18.00 |    100.00 
-----------+--------------------------------------------+----------
     Total |    16,587         84        304      3,637 |    20,612 
           |     80.47       0.41       1.47      17.65 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Reduced kidney
           |       function
      Male |      None  Stage 3a/ |     Total
-----------+----------------------+----------
         0 |    10,199        257 |    10,456 
           |     97.54       2.46 |    100.00 
-----------+----------------------+----------
         1 |    10,148          8 |    10,156 
           |     99.92       0.08 |    100.00 
-----------+----------------------+----------
     Total |    20,347        265 |    20,612 
           |     98.71       1.29 |    100.00 
10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
           |        disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,691      3,765 |    10,456 
           |     63.99      36.01 |    100.00 
-----------+----------------------+----------
         1 |     6,470      3,686 |    10,156 
           |     63.71      36.29 |    100.00 
-----------+----------------------+----------
     Total |    13,161      7,451 |    20,612 
           |     63.85      36.15 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
           |     hypertension
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,346      2,110 |    10,456 
           |     79.82      20.18 |    100.00 
-----------+----------------------+----------
         1 |     8,147      2,009 |    10,156 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
     Total |    16,493      4,119 |    20,612 
           |     80.02      19.98 |    100.00 

. 
. *Relationships with smoking
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                         
>    ///
>                                         {
  2.         
.         safetab smoke `var', row 
  3. }
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |    Asthma category
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       747         69 |       816 
             |     91.54       8.46 |    100.00 
-------------+----------------------+----------
      Former |       366         36 |       402 
             |     91.04       8.96 |    100.00 
-------------+----------------------+----------
     Current |     2,286        193 |     2,479 
             |     92.21       7.79 |    100.00 
-------------+----------------------+----------
       Total |     3,399        298 |     3,697 
             |     91.94       8.06 |    100.00 
34

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Chronic Respiratory
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       641        175 |       816 
             |     78.55      21.45 |    100.00 
-------------+----------------------+----------
      Former |       328         74 |       402 
             |     81.59      18.41 |    100.00 
-------------+----------------------+----------
     Current |     1,986        493 |     2,479 
             |     80.11      19.89 |    100.00 
-------------+----------------------+----------
       Total |     2,955        742 |     3,697 
             |     79.93      20.07 |    100.00 
30

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    Chronic Cardiac
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       664        152 |       816 
             |     81.37      18.63 |    100.00 
-------------+----------------------+----------
      Former |       323         79 |       402 
             |     80.35      19.65 |    100.00 
-------------+----------------------+----------
     Current |     1,993        486 |     2,479 
             |     80.40      19.60 |    100.00 
-------------+----------------------+----------
       Total |     2,980        717 |     3,697 
             |     80.61      19.39 |    100.00 
14

**TABLE OF smoke diabcat REDACTED DUE TO SMALL N**

28

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Chronic liver disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       658        158 |       816 
             |     80.64      19.36 |    100.00 
-------------+----------------------+----------
      Former |       313         89 |       402 
             |     77.86      22.14 |    100.00 
-------------+----------------------+----------
     Current |     1,970        509 |     2,479 
             |     79.47      20.53 |    100.00 
-------------+----------------------+----------
       Total |     2,941        756 |     3,697 
             |     79.55      20.45 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Neurological disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       661        155 |       816 
             |     81.00      19.00 |    100.00 
-------------+----------------------+----------
      Former |       318         84 |       402 
             |     79.10      20.90 |    100.00 
-------------+----------------------+----------
     Current |     1,981        498 |     2,479 
             |     79.91      20.09 |    100.00 
-------------+----------------------+----------
       Total |     2,960        737 |     3,697 
             |     80.06      19.94 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Stroke or dementia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       666        150 |       816 
             |     81.62      18.38 |    100.00 
-------------+----------------------+----------
      Former |       324         78 |       402 
             |     80.60      19.40 |    100.00 
-------------+----------------------+----------
     Current |     1,999        480 |     2,479 
             |     80.64      19.36 |    100.00 
-------------+----------------------+----------
       Total |     2,989        708 |     3,697 
             |     80.85      19.15 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Autoimmune disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       668        148 |       816 
             |     81.86      18.14 |    100.00 
-------------+----------------------+----------
      Former |       307         95 |       402 
             |     76.37      23.63 |    100.00 
-------------+----------------------+----------
     Current |     1,974        505 |     2,479 
             |     79.63      20.37 |    100.00 
-------------+----------------------+----------
       Total |     2,949        748 |     3,697 
             |     79.77      20.23 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Immunosuppressed
             |     (combination
     Smoking |      algorithm)
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       656        160 |       816 
             |     80.39      19.61 |    100.00 
-------------+----------------------+----------
      Former |       322         80 |       402 
             |     80.10      19.90 |    100.00 
-------------+----------------------+----------
     Current |     1,976        503 |     2,479 
             |     79.71      20.29 |    100.00 
-------------+----------------------+----------
       Total |     2,954        743 |     3,697 
             |     79.90      20.10 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Other solid organ
     Smoking |      transplant
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       649        167 |       816 
             |     79.53      20.47 |    100.00 
-------------+----------------------+----------
      Former |       328         74 |       402 
             |     81.59      18.41 |    100.00 
-------------+----------------------+----------
     Current |     1,979        500 |     2,479 
             |     79.83      20.17 |    100.00 
-------------+----------------------+----------
       Total |     2,956        741 |     3,697 
             |     79.96      20.04 |    100.00 
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |       Asplenia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       655        161 |       816 
             |     80.27      19.73 |    100.00 
-------------+----------------------+----------
      Former |       328         74 |       402 
             |     81.59      18.41 |    100.00 
-------------+----------------------+----------
     Current |     2,037        442 |     2,479 
             |     82.17      17.83 |    100.00 
-------------+----------------------+----------
       Total |     3,020        677 |     3,697 
             |     81.69      18.31 |    100.00 
24

**TABLE OF smoke cancer_exhaem_cat REDACTED DUE TO SMALL N**

22

**TABLE OF smoke cancer_haem_cat REDACTED DUE TO SMALL N**

34

**TABLE OF smoke reduced_kidney_function_cat REDACTED DUE TO SMALL N**

11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    End-stage renal
     Smoking |        disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       505        311 |       816 
             |     61.89      38.11 |    100.00 
-------------+----------------------+----------
      Former |       259        143 |       402 
             |     64.43      35.57 |    100.00 
-------------+----------------------+----------
     Current |     1,559        920 |     2,479 
             |     62.89      37.11 |    100.00 
-------------+----------------------+----------
       Total |     2,323      1,374 |     3,697 
             |     62.83      37.17 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       657        159 |       816 
             |     80.51      19.49 |    100.00 
-------------+----------------------+----------
      Former |       318         84 |       402 
             |     79.10      20.90 |    100.00 
-------------+----------------------+----------
     Current |     1,977        502 |     2,479 
             |     79.75      20.25 |    100.00 
-------------+----------------------+----------
       Total |     2,952        745 |     3,697 
             |     79.85      20.15 |    100.00 

. 
. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. safetab covid_death covid_icu  , row col
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |   Failure/censoring
  outcome: |     indicator for
     covid |  outcome: covid icu
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,447      8,505 |    10,952 
           |     22.34      77.66 |    100.00 
           |     53.15      53.13 |     53.13 
-----------+----------------------+----------
         1 |     2,157      7,503 |     9,660 
           |     22.33      77.67 |    100.00 
           |     46.85      46.87 |     46.87 
-----------+----------------------+----------
     Total |     4,604     16,008 |    20,612 
           |     22.34      77.66 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. safecount if covid_icu==1 & covid_death==1
  7,503

. safecount if covidadmission==1 & covid_death==1
  3,759

. 
. sum positive_SGSS

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S |     20,612    .1498156    .3568993          0          1

. sum positive_SGSS if date_positive_SGSS<=22267

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S |          0

. 
. safetab positive_SGSS covid_primary_care_codes, row col miss
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |  Indicator positive
 Indicator |   primary care code
  positive |    COVID infection
covid test |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,349     16,175 |    17,524 
           |      7.70      92.30 |    100.00 
           |     85.76      84.96 |     85.02 
-----------+----------------------+----------
         1 |       224      2,864 |     3,088 
           |      7.25      92.75 |    100.00 
           |     14.24      15.04 |     14.98 
-----------+----------------------+----------
     Total |     1,573     19,039 |    20,612 
           |      7.63      92.37 |    100.00 
           |    100.00     100.00 |    100.00 

. safetab positive_SGSS covid_primary_care_codes if date_positive_SGSS<=22267 &
>  date_covid_primary_care_codes<=22267, row col miss
107
no observations

. gen diff=date_positive_SGSS-date_covid_primary_care_codes 
(17,748 missing values generated)

. sum diff, d

                            diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -43           -150
 5%          -14           -139
10%            0           -127       Obs               2,864
25%         32.5            -90       Sum of Wgt.       2,864

50%         85.5                      Mean           84.99337
                        Largest       Std. Dev.      63.54756
75%          139            202
90%          170            202       Variance       4038.292
95%          183            202       Skewness      -.1122342
99%          196            206       Kurtosis        2.10776

. 
. tab reported if kids_cat4!=0 & age<=65

      Reported |
     Infection |
        Source |      Freq.     Percent        Cum.
---------------+-----------------------------------
          SGSS |     14,339       98.62       98.62
     test_code |         71        0.49       99.11
 sequalae_code |         71        0.49       99.59
diagnosis_code |         59        0.41      100.00
---------------+-----------------------------------
         Total |     14,540      100.00

. tab reported if kids_cat4==0 & age<=65

      Reported |
     Infection |
        Source |      Freq.     Percent        Cum.
---------------+-----------------------------------
          SGSS |        364       98.64       98.64
     test_code |          1        0.27       98.92
 sequalae_code |          2        0.54       99.46
diagnosis_code |          2        0.54      100.00
---------------+-----------------------------------
         Total |        369      100.00

. 
. 
. /* DEATHS by STP=======================================================*/
. tab  stp covid_death, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,127        973 |     2,100 
           |     10.29      10.07 |     10.19 
-----------+----------------------+----------
         2 |     1,046        979 |     2,025 
           |      9.55      10.13 |      9.82 
-----------+----------------------+----------
         3 |     1,115        927 |     2,042 
           |     10.18       9.60 |      9.91 
-----------+----------------------+----------
         4 |     1,058      1,007 |     2,065 
           |      9.66      10.42 |     10.02 
-----------+----------------------+----------
         5 |     1,076        982 |     2,058 
           |      9.82      10.17 |      9.98 
-----------+----------------------+----------
         6 |     1,150        943 |     2,093 
           |     10.50       9.76 |     10.15 
-----------+----------------------+----------
         7 |     1,063        977 |     2,040 
           |      9.71      10.11 |      9.90 
-----------+----------------------+----------
         8 |     1,109        947 |     2,056 
           |     10.13       9.80 |      9.97 
-----------+----------------------+----------
         9 |     1,109        966 |     2,075 
           |     10.13      10.00 |     10.07 
-----------+----------------------+----------
        10 |     1,099        959 |     2,058 
           |     10.03       9.93 |      9.98 
-----------+----------------------+----------
     Total |    10,952      9,660 |    20,612 
           |    100.00     100.00 |    100.00 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/02_an_data_checks.log
  log type:  text
 closed on:  24 Jul 2021, 23:01:00
-------------------------------------------------------------------------------
