-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/02_an_data_checks.log
  log type:  text
 opened on:  17 Aug 2021, 07:44:23

. 
. * Open Stata dataset
. use $tempdir/`inputfile', clear

. 
. *run ssc install if not on local machine - server needs datacheck.ado file
. *ssc install datacheck 
. 
. *Duplicate patient check
. datacheck _n==1, by(patient_id) nol

. 
. 
. /* CHECK INCLUSION AND EXCLUSION CRITERIA====================================
> =*/ 
. 
. * DATA STRUCTURE: Confirm one row per patient 
. duplicates tag patient_id, generate(dup_check)

Duplicates in terms of patient_id

. assert dup_check == 0 

. drop dup_check

. 
. * INCLUSION 1: >=18 and <=110 at 1 March 2020 
. assert age < .

. assert age >= 18 

. assert age <= 110

. 
. 
. * EXCLUDE 1:  MISSING IMD
. assert inlist(imd, 1, 2, 3, 4, 5)

. 
. * EXCLUDE 2:  HH with more than 10 people
. datacheck inlist(household_size, 1, 2, 3, 4, 5,6, 7, 8, 9, 10), nol

 (462 contradictions)

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. *HH
. datacheck kids_cat4<., nol

. datacheck inlist(kids_cat4, 0,1, 2), nol

 (17570 contradictions)

. 
. datacheck number_kids<., nol

 (18500 contradictions)

. datacheck inlist(number_kids, 0,1,2,3,4,5,6,7,8,9), nol

 (18620 contradictions)

. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6,7), nol

. datacheck inlist(age66, 0, 1), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. 
. * Check date ranges for all comorbidities 
. 
. foreach var of varlist  chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         perm_immunodef  ///
>                                         temp_immunodef  ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         hypertension                         
>    ///
>                                         {
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_r~te |      4,141   02dec1994    5392.643  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_c~te |      4,086   06sep1995    5450.619  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_l~te |      4,122   02may1995    5388.001  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_neur~e |      4,113   04dec1995    5414.863  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stroke_dem~e |      4,135   10aug1995    5378.052  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ra_sle_pso~e |      4,117   21apr1995    5367.161  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
perm_immun~e |      4,107   07may1995    5383.358  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
temp_immun~e |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_tran~e |      4,139   11mar1995    5389.184  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
asplenia_d~e |      4,174   07apr1995    5370.567  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |      4,147   20apr1995    5417.303  15jan1970  15aug2021

. 
. foreach comorb in $varlist { 
  2.         local comorb: subinstr local comorb "i." ""
  3.         safetab `comorb', m
  4. }

. 
. *summarise end dates for each outcome
. foreach outcome in date_covid_tpp_prob  date_non_covid_death    date_covid_de
> ath        date_covid_icu  date_covidadmission     died_date_onscovid_part1  
>        {
  2. sum `outcome', format
  3. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~b |     17,133   03apr2021    60.16461  21dec2020  16jul2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_non_c~h |      5,738   03apr2021    59.89284  21dec2020  16jul2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~h |      8,636   03apr2021    60.07375  21dec2020  16jul2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |     14,383   02apr2021    59.79596  21dec2020  16jul2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~n |      2,408   07mar2021    49.15249  20dec2020  16jun2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~1 |      8,714   03apr2021    60.50529  21dec2020  16jul2021

. 
. foreach outcome in date_covid_tpp_prob  date_non_covid_death    date_covid_de
> ath        date_covid_icu  date_covidadmission     died_date_onscovid_part1  
>        {
  2. gen `outcome'_month=mofd(`outcome') 
  3.  lab define `outcome'_month 731 "Dec 2020" 734 "March 2020"  738 "July 202
> 0"
  4. lab val `outcome'_month `outcome'_month
  5. tab `outcome'_month
  6. drop `outcome'_month
  7. }
(3,521 missing values generated)

date_covid_ |
tpp_prob_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        898        5.24        5.24
        732 |      2,565       14.97       20.21
        733 |      2,360       13.77       33.99
 March 2020 |      2,527       14.75       48.74
        735 |      2,483       14.49       63.23
        736 |      2,504       14.62       77.84
        737 |      2,470       14.42       92.26
  July 2020 |      1,326        7.74      100.00
------------+-----------------------------------
      Total |     17,133      100.00
(14,916 missing values generated)

date_non_co |
vid_death_m |
       onth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        295        5.14        5.14
        732 |        875       15.25       20.39
        733 |        777       13.54       33.93
 March 2020 |        847       14.76       48.69
        735 |        813       14.17       62.86
        736 |        878       15.30       78.16
        737 |        815       14.20       92.37
  July 2020 |        438        7.63      100.00
------------+-----------------------------------
      Total |      5,738      100.00
(12,018 missing values generated)

date_covid_ |
death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        505        5.85        5.85
        732 |      1,253       14.51       20.36
        733 |      1,137       13.17       33.52
 March 2020 |      1,290       14.94       48.46
        735 |      1,286       14.89       63.35
        736 |      1,263       14.62       77.98
        737 |      1,268       14.68       92.66
  July 2020 |        634        7.34      100.00
------------+-----------------------------------
      Total |      8,636      100.00
(6,271 missing values generated)

date_covid_ |
  icu_month |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        761        5.29        5.29
        732 |      2,165       15.05       20.34
        733 |      2,010       13.97       34.32
 March 2020 |      2,107       14.65       48.97
        735 |      2,148       14.93       63.90
        736 |      2,088       14.52       78.42
        737 |      2,039       14.18       92.60
  July 2020 |      1,065        7.40      100.00
------------+-----------------------------------
      Total |     14,383      100.00
(18,246 missing values generated)

date_covida |
dmission_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        209        8.68        8.68
        732 |        498       20.68       29.36
        733 |        462       19.19       48.55
 March 2020 |        437       18.15       66.69
        735 |        363       15.07       81.77
        736 |        329       13.66       95.43
        737 |        110        4.57      100.00
------------+-----------------------------------
      Total |      2,408      100.00
(11,940 missing values generated)

died_date_o |
nscovid_par |
   t1_month |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        505        5.80        5.80
        732 |      1,315       15.09       20.89
        733 |      1,129       12.96       33.84
 March 2020 |      1,260       14.46       48.30
        735 |      1,233       14.15       62.45
        736 |      1,344       15.42       77.87
        737 |      1,261       14.47       92.35
  July 2020 |        667        7.65      100.00
------------+-----------------------------------
      Total |      8,714      100.00

. 
. *Outcome dates
. di d(1jan2021) /*study start*/
22281

. *22281
. di d(01mar2021) 
22340

. *22340
. di d(01may2021)
22401

. *22401
. di d(01july2021)
22462

. *22462
. di d(08mar2021) /*school opening*/
22347

. *22347
. di d(16may2021)
22416

. *22416
. 
. gen agegp=0 if age<=65
(4,505 missing values generated)

. replace agegp=1 if age>65
(4,505 real changes made)

. tab agegp, miss

      agegp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,149       78.19       78.19
          1 |      4,505       21.81      100.00
------------+-----------------------------------
      Total |     20,654      100.00

. 
. foreach age in 0 1 {
  2. foreach outcome of any covid_primary_care_codes positive_SGSS  covid_tpp_p
> rob covidadmission covid_icu covid_death    {
  3. summ  `outcome' if agegp==`age', format d 
  4. summ patient_id if `outcome'==1 & date_`outcome'<=22500 & agegp==`age'
  5. local total_`outcome'=`r(N)'
  6. hist date_`outcome' if date_`outcome'<=22500 & agegp==`age', saving(output
> /`outcome'_age`age', replace) ///
> xlabel(22281 22340 22401 22462,labsize(tiny))  xtitle(, size(vsmall)) ///
> graphregion(color(white))  legend(off) freq  ///
> ylabel(0 5000,labsize(tiny))  ytitle("Number", size(vsmall)) xline(22347 2241
> 6) ///
> title("N=`total_`outcome''", size(vsmall)) 
  7. }
  8. }

         Indicator positive primary care code COVID
                          infection
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              16,149
25%            1              0       Sum of Wgt.      16,149

50%            1                      Mean            .827172
                        Largest       Std. Dev.      .3781102
75%            1              1
90%            1              1       Variance       .1429674
95%            1              1       Skewness      -1.730617
99%            1              1       Kurtosis       3.995037

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     13,358    151433.5    86974.44         17     299999
(bin=41, start=22270, width=5.0487805)
(note: file output/covid_primary_care_codes_age0.gph not found)
(file output/covid_primary_care_codes_age0.gph saved)

                Indicator positive covid test
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              16,149
25%            0              0       Sum of Wgt.      16,149

50%            0                      Mean           .0507152
                        Largest       Std. Dev.      .2194223
75%            0              1
90%            0              1       Variance       .0481462
95%            1              1       Skewness       4.095287
99%            1              1       Kurtosis       17.77137

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |        819    148345.7    86533.69        164     299562
(bin=28, start=22311, width=5.9285714)
(note: file output/positive_SGSS_age0.gph not found)
(file output/positive_SGSS_age0.gph saved)

       Failure/censoring indicator for outcome: covid
                          prob case
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              16,149
25%            1              0       Sum of Wgt.      16,149

50%            1                      Mean            .829525
                        Largest       Std. Dev.      .3760612
75%            1              1
90%            1              1       Variance        .141422
95%            1              1       Skewness      -1.752562
99%            1              1       Kurtosis       4.071474

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     13,396    151428.6    86966.07         17     299999
(bin=41, start=22270, width=5.0487805)
(note: file output/covid_tpp_prob_age0.gph not found)
(file output/covid_tpp_prob_age0.gph saved)

     Failure/censoring indicator for outcome: covid SUS
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              16,149
25%            0              0       Sum of Wgt.      16,149

50%            0                      Mean           .1176543
                        Largest       Std. Dev.      .3222084
75%            0              1
90%            1              1       Variance       .1038182
95%            1              1       Skewness       2.373356
99%            1              1       Kurtosis       6.632816

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      1,900    151200.3    86505.75         73     299937
(bin=32, start=22269, width=5.5625)
(note: file output/covidadmission_age0.gph not found)
(file output/covidadmission_age0.gph saved)

     Failure/censoring indicator for outcome: covid icu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              16,149
25%            0              0       Sum of Wgt.      16,149

50%            1                      Mean           .6992383
                        Largest       Std. Dev.      .4586034
75%            1              1
90%            1              1       Variance       .2103171
95%            1              1       Skewness      -.8689185
99%            1              1       Kurtosis       1.755019

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     11,292    150782.9    86839.92         73     299999
(bin=40, start=22270, width=5.175)
(note: file output/covid_icu_age0.gph not found)
(file output/covid_icu_age0.gph saved)

       Failure/censoring indicator for outcome: covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              16,149
25%            0              0       Sum of Wgt.      16,149

50%            0                      Mean           .4188495
                        Largest       Std. Dev.      .4933859
75%            1              1
90%            1              1       Variance       .2434297
95%            1              1       Skewness       .3289638
99%            1              1       Kurtosis       1.108217

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      6,764    151824.7    86851.83         17     299999
(bin=38, start=22270, width=5.4473684)
(note: file output/covid_death_age0.gph not found)
(file output/covid_death_age0.gph saved)

         Indicator positive primary care code COVID
                          infection
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,505
25%            1              0       Sum of Wgt.       4,505

50%            1                      Mean           .8277469
                        Largest       Std. Dev.      .3776422
75%            1              1
90%            1              1       Variance       .1426136
95%            1              1       Skewness      -1.735947
99%            1              1       Kurtosis       4.013511

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      3,729    151333.2    86729.28         26     299931
(bin=35, start=22270, width=5.9142857)
(note: file output/covid_primary_care_codes_age1.gph not found)
(file output/covid_primary_care_codes_age1.gph saved)

                Indicator positive covid test
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,505
25%            0              0       Sum of Wgt.       4,505

50%            0                      Mean           .0512764
                        Largest       Std. Dev.      .2205853
75%            0              1
90%            0              1       Variance       .0486579
95%            1              1       Skewness       4.068933
99%            1              1       Kurtosis       17.55621

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |        231    146554.6     86217.9        192     299747
(bin=15, start=22358, width=7.9333333)
(note: file output/positive_SGSS_age1.gph not found)
(file output/positive_SGSS_age1.gph saved)

       Failure/censoring indicator for outcome: covid
                          prob case
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,505
25%            1              0       Sum of Wgt.       4,505

50%            1                      Mean           .8295228
                        Largest       Std. Dev.      .3760933
75%            1              1
90%            1              1       Variance       .1414462
95%            1              1       Skewness       -1.75254
99%            1              1       Kurtosis       4.071398

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      3,737    151343.8     86719.4         26     299931
(bin=35, start=22270, width=5.9142857)
(note: file output/covid_tpp_prob_age1.gph not found)
(file output/covid_tpp_prob_age1.gph saved)

     Failure/censoring indicator for outcome: covid SUS
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,505
25%            0              0       Sum of Wgt.       4,505

50%            0                      Mean           .1127636
                        Largest       Std. Dev.      .3163387
75%            0              1
90%            1              1       Variance       .1000702
95%            1              1       Skewness       2.448511
99%            1              1       Kurtosis       6.995206

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |        508    145493.7     85980.1        158     299760
(bin=22, start=22269, width=8.0454545)
(note: file output/covidadmission_age1.gph not found)
(file output/covidadmission_age1.gph saved)

     Failure/censoring indicator for outcome: covid icu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,505
25%            0              0       Sum of Wgt.       4,505

50%            1                      Mean           .6861265
                        Largest       Std. Dev.      .4641172
75%            1              1
90%            1              1       Variance       .2154047
95%            1              1       Skewness       -.802156
99%            1              1       Kurtosis       1.643454

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      3,091    150974.9     87766.6         93     299931
(bin=34, start=22270, width=6.0882353)
(note: file output/covid_icu_age1.gph not found)
(file output/covid_icu_age1.gph saved)

       Failure/censoring indicator for outcome: covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,505
25%            0              0       Sum of Wgt.       4,505

50%            0                      Mean           .4155383
                        Largest       Std. Dev.      .4928693
75%            1              1
90%            1              1       Variance       .2429201
95%            1              1       Skewness       .3427728
99%            1              1       Kurtosis       1.117493

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      1,872    153149.5    85643.68         93     299866
(bin=32, start=22270, width=6.46875)
(note: file output/covid_death_age1.gph not found)
(file output/covid_death_age1.gph saved)

. * Combine histograms
. graph combine output/covid_tpp_prob_age0.gph output/covid_tpp_prob_age1.gph /
> //
> output/covidadmission_age0.gph output/covidadmission_age1.gph ///
> output/covid_icu_age0.gph output/covid_icu_age1.gph ///
> output/covid_death_age0.gph output/covid_death_age1.gph, graphregion(color(wh
> ite)) col(2) ysize(10)

. graph export "output/01_histogram_outcomes.svg", as(svg) replace 
(note: file output/01_histogram_outcomes.svg not found)
(file output/01_histogram_outcomes.svg written in SVG format)

. 
. *censor dates
. summ dereg_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dereg_date |         51   12apr2021    69.03797  15dec2020  15aug2021

. summ has_12_m

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
has_12_m_f~p |     20,654    .9498886      .21818          0          1

. 
. *Vacc data
. foreach age in 0 1 {
  2. foreach vacc of any covid_vacc_date covid_vacc_second_dose_date   {
  3. summ  `vacc'  if agegp==`age', format d 
  4. summ patient_id if `vacc'!=. & `vacc'<=22500 & agegp==`age'
  5. local total=`r(N)' 
  6. hist `vacc' if `vacc'<=22500  & agegp==`age', saving(output/`vacc'_age`age
> ', replace) ///
> xlabel(22281 22340 22401 22462,labsize(tiny))  xtitle(, size(vsmall)) ///
> graphregion(color(white))  legend(off) freq ylabel(0 500000,labsize(tiny)) //
> /
> ytitle("Number", size(vsmall))  ///
> title("N=`total'", size(vsmall)) 
  7. }
  8. }

                       First vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    11dec2020      09dec2020
 5%    19dec2020      09dec2020
10%    30dec2020      09dec2020       Obs               8,074
25%    02feb2021      09dec2020       Sum of Wgt.       8,074

50%    27mar2021                      Mean          27mar2021
                        Largest       Std. Dev.      63.31816
75%    22may2021      16jul2021
90%    24jun2021      16jul2021       Variance        4009.19
95%    05jul2021      16jul2021       Skewness       .0146381
99%    14jul2021      16jul2021       Kurtosis       1.805379

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      8,074    151841.2    86878.29         54     299999
(bin=39, start=22258, width=5.6153846)
(note: file output/covid_vacc_date_age0.gph not found)
(file output/covid_vacc_date_age0.gph saved)

                      Second vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    09dec2020      09dec2020
 5%    13dec2020      09dec2020
10%    17dec2020      09dec2020       Obs               3,237
25%    29dec2020      09dec2020       Sum of Wgt.       3,237

50%    19jan2021                      Mean          19jan2021
                        Largest       Std. Dev.      23.82443
75%    08feb2021      01mar2021
90%    21feb2021      01mar2021       Variance       567.6034
95%    25feb2021      01mar2021       Skewness      -.0059344
99%    01mar2021      01mar2021       Kurtosis       1.805232

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      3,237    152274.9     86872.2        126     299890
(bin=35, start=22258, width=2.3428571)
(note: file output/covid_vacc_second_dose_date_age0.gph not found)
(file output/covid_vacc_second_dose_date_age0.gph saved)

                       First vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    11dec2020      09dec2020
 5%    19dec2020      09dec2020
10%    30dec2020      09dec2020       Obs               2,297
25%    01feb2021      09dec2020       Sum of Wgt.       2,297

50%    28mar2021                      Mean          27mar2021
                        Largest       Std. Dev.      63.57532
75%    23may2021      16jul2021
90%    25jun2021      16jul2021       Variance       4041.822
95%    06jul2021      16jul2021       Skewness       .0103148
99%    15jul2021      16jul2021       Kurtosis       1.801339

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      2,297    151505.2    86766.15         26     299931
(bin=33, start=22258, width=6.6363636)
(note: file output/covid_vacc_date_age1.gph not found)
(file output/covid_vacc_date_age1.gph saved)

                      Second vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    10dec2020      09dec2020
 5%    14dec2020      09dec2020
10%    17dec2020      09dec2020       Obs                 875
25%    30dec2020      09dec2020       Sum of Wgt.         875

50%    17jan2021                      Mean          18jan2021
                        Largest       Std. Dev.      23.34153
75%    07feb2021      01mar2021
90%    20feb2021      01mar2021       Variance       544.8271
95%    25feb2021      01mar2021       Skewness       .0847666
99%    01mar2021      01mar2021       Kurtosis       1.839261

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |        875    152018.4    87738.29        478     299760
(bin=29, start=22258, width=2.8275862)
(note: file output/covid_vacc_second_dose_date_age1.gph not found)
(file output/covid_vacc_second_dose_date_age1.gph saved)

. *Combine histograms
. graph combine output/covid_vacc_date_age0.gph output/covid_vacc_date_age1.gph
>   output/covid_vacc_second_dose_date_age0.gph output/covid_vacc_second_dose_d
> ate_age1.gph, ///
>  graphregion(color(white)) col(2)

. graph export "output/01_histogram_vaccinations.svg", as(svg) replace 
(note: file output/01_histogram_vaccinations.svg not found)
(file output/01_histogram_vaccinations.svg written in SVG format)

. 
. 
. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. *HH variables
. safetab kids_cat4 tot_adults_hh
0

**TABLE OF kids_cat4 tot_adults_hh REDACTED DUE TO SMALL N**


. safetab number_kids tot_adults_hh
0

**TABLE OF number_kids tot_adults_hh REDACTED DUE TO SMALL N**


. safetab household_size tot_adults_hh
0

**TABLE OF household_size tot_adults_hh REDACTED DUE TO SMALL N**


. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,895    16.80936    1.004492    15.0008   18.49997

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      4,700    21.84176    1.854596    18.5015   24.99595

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      3,633    27.48923    1.446149    25.0001   29.99756

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      2,893    32.34231    1.429942   30.00029   34.99461

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,827    37.29277    1.435269   35.00051   39.99864

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,209    43.60107    2.630688   40.00415   49.99461

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |     1,895          0          0          0 |     1,895 
  Normal (18.5-24.9) |     4,700          0          0          0 |     4,700 
Overweight (25-29.9) |     3,633          0          0          0 |     3,633 
   Obese I (30-34.9) |         0      2,893          0          0 |     2,893 
  Obese II (35-39.9) |         0          0      1,827          0 |     1,827 
     Obese III (40+) |         0          0          0      1,209 |     1,209 
        Unknown (.u) |     4,497          0          0          0 |     4,497 
---------------------+--------------------------------------------+----------
               Total |    14,725      2,893      1,827      1,209 |    20,654 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      4,031    23.74026    3.426834         18         29

-------------------------------------------------------------------------------
-> agegroup = 30-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,419    34.43024    2.876231         30         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,488    44.74513    2.847043         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,539    54.38768    2.868816         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      2,710    64.41919    2.847535         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      2,160    73.99907    2.811839         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      1,307    85.69931    4.851771         80        109


. safetab agegroup age66, m
15

   Grouped |  66 years and older
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     4,031          0 |     4,031 
    30-<40 |     3,419          0 |     3,419 
    40-<50 |     3,488          0 |     3,488 
    50-<60 |     3,539          0 |     3,539 
    60-<70 |     1,947        763 |     2,710 
    70-<80 |         0      2,160 |     2,160 
       80+ |         0      1,307 |     1,307 
-----------+----------------------+----------
     Total |    16,424      4,230 |    20,654 

. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never |       841          0          0 |       841 
      Former |         0        398          0 |       398 
     Current |         0          0      2,407 |     2,407 
Unknown (.u) |    17,008          0          0 |    17,008 
-------------+---------------------------------+----------
       Total |    17,849        398      2,407 |    20,654 

. 
. * Diabetes
. *safetab diabcat diabetes, m
. 
. * CKD
. safetab reduced egfr_cat, m
17

       Reduced kidney |               Calculated eGFR
             function |        30         45         60          . |     Total
----------------------+--------------------------------------------+----------
                 None |         0          0     19,346      1,079 |    20,425 
Stage 3a/3b egfr 30-6 |         6        223          0          0 |       229 
----------------------+--------------------------------------------+----------
                Total |         6        223     19,346      1,079 |    20,654 

. * CKD
. safetab reduced esrd, m
13

                      |    End-stage renal
       Reduced kidney |        disease
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    13,106      7,319 |    20,425 
Stage 3a/3b egfr 30-6 |       150         79 |       229 
----------------------+----------------------+----------
                Total |    13,256      7,398 |    20,654 

. 
. /* EXPECTED RELATIONSHIPS====================================================
> =*/ 
. 
. /*  Relationships between demographic/lifestyle variables  */
. safetab agegroup bmicat,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                      Grouped BMI
       age | Underweig  Normal (1  Overweigh  Obese I (  Obese II  |     Total
-----------+-------------------------------------------------------+----------
    18-<30 |       329        828        634        536        329 |     2,879 
           |     11.43      28.76      22.02      18.62      11.43 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 |       325        809        670        465        295 |     2,777 
           |     11.70      29.13      24.13      16.74      10.62 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 |       297        768        640        501        333 |     2,740 
           |     10.84      28.03      23.36      18.28      12.15 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 |       322        836        612        496        336 |     2,837 
           |     11.35      29.47      21.57      17.48      11.84 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 |       274        639        467        405        238 |     2,164 
           |     12.66      29.53      21.58      18.72      11.00 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 |       209        522        374        317        170 |     1,719 
           |     12.16      30.37      21.76      18.44       9.89 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |       139        298        236        173        126 |     1,041 
           |     13.35      28.63      22.67      16.62      12.10 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |     1,895      4,700      3,633      2,893      1,827 |    16,157 
           |     11.73      29.09      22.49      17.91      11.31 |    100.00 


           |  Grouped
   Grouped |    BMI
       age | Obese III |     Total
-----------+-----------+----------
    18-<30 |       223 |     2,879 
           |      7.75 |    100.00 
-----------+-----------+----------
    30-<40 |       213 |     2,777 
           |      7.67 |    100.00 
-----------+-----------+----------
    40-<50 |       201 |     2,740 
           |      7.34 |    100.00 
-----------+-----------+----------
    50-<60 |       235 |     2,837 
           |      8.28 |    100.00 
-----------+-----------+----------
    60-<70 |       141 |     2,164 
           |      6.52 |    100.00 
-----------+-----------+----------
    70-<80 |       127 |     1,719 
           |      7.39 |    100.00 
-----------+-----------+----------
       80+ |        69 |     1,041 
           |      6.63 |    100.00 
-----------+-----------+----------
     Total |     1,209 |    16,157 
           |      7.48 |    100.00 

. safetab agegroup smoke,         row  
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Smoking status
       age |     Never     Former    Current |     Total
-----------+---------------------------------+----------
    18-<30 |       148         90        474 |       712 
           |     20.79      12.64      66.57 |    100.00 
-----------+---------------------------------+----------
    30-<40 |       147         75        400 |       622 
           |     23.63      12.06      64.31 |    100.00 
-----------+---------------------------------+----------
    40-<50 |       133         59        413 |       605 
           |     21.98       9.75      68.26 |    100.00 
-----------+---------------------------------+----------
    50-<60 |       136         56        424 |       616 
           |     22.08       9.09      68.83 |    100.00 
-----------+---------------------------------+----------
    60-<70 |       126         53        326 |       505 
           |     24.95      10.50      64.55 |    100.00 
-----------+---------------------------------+----------
    70-<80 |        93         48        230 |       371 
           |     25.07      12.94      61.99 |    100.00 
-----------+---------------------------------+----------
       80+ |        58         17        140 |       215 
           |     26.98       7.91      65.12 |    100.00 
-----------+---------------------------------+----------
     Total |       841        398      2,407 |     3,646 
           |     23.07      10.92      66.02 |    100.00 

. safetab agegroup ethnicity, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |            Ethnicity
       age |     White  Asian or       Other |     Total
-----------+---------------------------------+----------
    18-<30 |     3,228        372        431 |     4,031 
           |     80.08       9.23      10.69 |    100.00 
-----------+---------------------------------+----------
    30-<40 |     2,728        332        359 |     3,419 
           |     79.79       9.71      10.50 |    100.00 
-----------+---------------------------------+----------
    40-<50 |     2,816        346        326 |     3,488 
           |     80.73       9.92       9.35 |    100.00 
-----------+---------------------------------+----------
    50-<60 |     2,823        348        368 |     3,539 
           |     79.77       9.83      10.40 |    100.00 
-----------+---------------------------------+----------
    60-<70 |     2,159        258        293 |     2,710 
           |     79.67       9.52      10.81 |    100.00 
-----------+---------------------------------+----------
    70-<80 |     1,720        231        209 |     2,160 
           |     79.63      10.69       9.68 |    100.00 
-----------+---------------------------------+----------
       80+ |     1,062        134        111 |     1,307 
           |     81.25      10.25       8.49 |    100.00 
-----------+---------------------------------+----------
     Total |    16,536      2,021      2,097 |    20,654 
           |     80.06       9.79      10.15 |    100.00 

. safetab agegroup imd,           row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Index of Multiple Deprivation
   Grouped |              (IMD)
       age | 1 least d          4  5 most de |     Total
-----------+---------------------------------+----------
    18-<30 |     2,793        804        434 |     4,031 
           |     69.29      19.95      10.77 |    100.00 
-----------+---------------------------------+----------
    30-<40 |     2,388        711        320 |     3,419 
           |     69.84      20.80       9.36 |    100.00 
-----------+---------------------------------+----------
    40-<50 |     2,438        729        321 |     3,488 
           |     69.90      20.90       9.20 |    100.00 
-----------+---------------------------------+----------
    50-<60 |     2,463        716        360 |     3,539 
           |     69.60      20.23      10.17 |    100.00 
-----------+---------------------------------+----------
    60-<70 |     1,878        573        259 |     2,710 
           |     69.30      21.14       9.56 |    100.00 
-----------+---------------------------------+----------
    70-<80 |     1,507        446        207 |     2,160 
           |     69.77      20.65       9.58 |    100.00 
-----------+---------------------------------+----------
       80+ |       906        262        139 |     1,307 
           |     69.32      20.05      10.64 |    100.00 
-----------+---------------------------------+----------
     Total |    14,373      4,241      2,040 |    20,654 
           |     69.59      20.53       9.88 |    100.00 

. safetab agegroup shield,    row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Probable shielding
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       635      3,396 |     4,031 
           |     15.75      84.25 |    100.00 
-----------+----------------------+----------
    30-<40 |       508      2,911 |     3,419 
           |     14.86      85.14 |    100.00 
-----------+----------------------+----------
    40-<50 |       518      2,970 |     3,488 
           |     14.85      85.15 |    100.00 
-----------+----------------------+----------
    50-<60 |       557      2,982 |     3,539 
           |     15.74      84.26 |    100.00 
-----------+----------------------+----------
    60-<70 |       420      2,290 |     2,710 
           |     15.50      84.50 |    100.00 
-----------+----------------------+----------
    70-<80 |       309      1,851 |     2,160 
           |     14.31      85.69 |    100.00 
-----------+----------------------+----------
       80+ |       205      1,102 |     1,307 
           |     15.68      84.32 |    100.00 
-----------+----------------------+----------
     Total |     3,152     17,502 |    20,654 
           |     15.26      84.74 |    100.00 

. 
. safetab bmicat smoke,            row   
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |          Smoking status
         Grouped BMI |     Never     Former    Current |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |        89         29        227 |       345 
                     |     25.80       8.41      65.80 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |       186         79        533 |       798 
                     |     23.31       9.90      66.79 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |       144         86        416 |       646 
                     |     22.29      13.31      64.40 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |       109         53        359 |       521 
                     |     20.92      10.17      68.91 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |        77         36        223 |       336 
                     |     22.92      10.71      66.37 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |        51         23        130 |       204 
                     |     25.00      11.27      63.73 |    100.00 
---------------------+---------------------------------+----------
               Total |       656        306      1,888 |     2,850 
                     |     23.02      10.74      66.25 |    100.00 

. safetab bmicat ethnicity,        row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |            Ethnicity
         Grouped BMI |     White  Asian or       Other |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |     1,516        203        176 |     1,895 
                     |     80.00      10.71       9.29 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |     3,774        451        475 |     4,700 
                     |     80.30       9.60      10.11 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |     2,900        368        365 |     3,633 
                     |     79.82      10.13      10.05 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |     2,345        265        283 |     2,893 
                     |     81.06       9.16       9.78 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |     1,449        188        190 |     1,827 
                     |     79.31      10.29      10.40 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |       971        114        124 |     1,209 
                     |     80.31       9.43      10.26 |    100.00 
---------------------+---------------------------------+----------
               Total |    12,955      1,589      1,613 |    16,157 
                     |     80.18       9.83       9.98 |    100.00 

. safetab bmicat imd,              row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Index of Multiple Deprivation
                     |              (IMD)
         Grouped BMI | 1 least d          4  5 most de |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |     1,275        407        213 |     1,895 
                     |     67.28      21.48      11.24 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |     3,263        915        522 |     4,700 
                     |     69.43      19.47      11.11 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |     2,538        772        323 |     3,633 
                     |     69.86      21.25       8.89 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |     2,055        560        278 |     2,893 
                     |     71.03      19.36       9.61 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |     1,295        366        166 |     1,827 
                     |     70.88      20.03       9.09 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |       858        246        105 |     1,209 
                     |     70.97      20.35       8.68 |    100.00 
---------------------+---------------------------------+----------
               Total |    11,284      3,266      1,607 |    16,157 
                     |     69.84      20.21       9.95 |    100.00 

. safetab bmicat hypertension, row 
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |       Diagnosed
                     |     hypertension
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     1,471        424 |     1,895 
                     |     77.63      22.37 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     3,732        968 |     4,700 
                     |     79.40      20.60 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     2,905        728 |     3,633 
                     |     79.96      20.04 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |     2,328        565 |     2,893 
                     |     80.47      19.53 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,486        341 |     1,827 
                     |     81.34      18.66 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |       980        229 |     1,209 
                     |     81.06      18.94 |    100.00 
---------------------+----------------------+----------
               Total |    12,902      3,255 |    16,157 
                     |     79.85      20.15 |    100.00 

. safetab bmicat shield,    row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Probable shielding
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       281      1,614 |     1,895 
                     |     14.83      85.17 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       698      4,002 |     4,700 
                     |     14.85      85.15 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |       537      3,096 |     3,633 
                     |     14.78      85.22 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |       442      2,451 |     2,893 
                     |     15.28      84.72 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |       291      1,536 |     1,827 
                     |     15.93      84.07 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |       192      1,017 |     1,209 
                     |     15.88      84.12 |    100.00 
---------------------+----------------------+----------
               Total |     2,441     13,716 |    16,157 
                     |     15.11      84.89 |    100.00 

. 
.                             
. safetab smoke ethnicity,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |            Ethnicity
      status |     White  Asian or       Other |     Total
-------------+---------------------------------+----------
       Never |       683         80         78 |       841 
             |     81.21       9.51       9.27 |    100.00 
-------------+---------------------------------+----------
      Former |       306         47         45 |       398 
             |     76.88      11.81      11.31 |    100.00 
-------------+---------------------------------+----------
     Current |     1,920        243        244 |     2,407 
             |     79.77      10.10      10.14 |    100.00 
-------------+---------------------------------+----------
       Total |     2,909        370        367 |     3,646 
             |     79.79      10.15      10.07 |    100.00 

. safetab smoke imd,                      row 
10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Index of Multiple Deprivation
     Smoking |              (IMD)
      status | 1 least d          4  5 most de |     Total
-------------+---------------------------------+----------
       Never |       578        189         74 |       841 
             |     68.73      22.47       8.80 |    100.00 
-------------+---------------------------------+----------
      Former |       292         74         32 |       398 
             |     73.37      18.59       8.04 |    100.00 
-------------+---------------------------------+----------
     Current |     1,689        458        260 |     2,407 
             |     70.17      19.03      10.80 |    100.00 
-------------+---------------------------------+----------
       Total |     2,559        721        366 |     3,646 
             |     70.19      19.78      10.04 |    100.00 

. safetab smoke hypertension, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       672        169 |       841 
             |     79.90      20.10 |    100.00 
-------------+----------------------+----------
      Former |       315         83 |       398 
             |     79.15      20.85 |    100.00 
-------------+----------------------+----------
     Current |     1,902        505 |     2,407 
             |     79.02      20.98 |    100.00 
-------------+----------------------+----------
       Total |     2,889        757 |     3,646 
             |     79.24      20.76 |    100.00 

. safetab smoke shield,    row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Probable shielding
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       134        707 |       841 
             |     15.93      84.07 |    100.00 
-------------+----------------------+----------
      Former |        66        332 |       398 
             |     16.58      83.42 |    100.00 
-------------+----------------------+----------
     Current |       339      2,068 |     2,407 
             |     14.08      85.92 |    100.00 
-------------+----------------------+----------
       Total |       539      3,107 |     3,646 
             |     14.78      85.22 |    100.00 

.                       
. safetab ethnicity imd,          row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |  Index of Multiple Deprivation
                      |              (IMD)
            Ethnicity | 1 least d          4  5 most de |     Total
----------------------+---------------------------------+----------
                White |    11,499      3,427      1,610 |    16,536 
                      |     69.54      20.72       9.74 |    100.00 
----------------------+---------------------------------+----------
Asian or Asian Britis |     1,426        388        207 |     2,021 
                      |     70.56      19.20      10.24 |    100.00 
----------------------+---------------------------------+----------
                Other |     1,448        426        223 |     2,097 
                      |     69.05      20.31      10.63 |    100.00 
----------------------+---------------------------------+----------
                Total |    14,373      4,241      2,040 |    20,654 
                      |     69.59      20.53       9.88 |    100.00 

. safetab shield imd,             row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Index of Multiple Deprivation
  Probable |              (IMD)
 shielding | 1 least d          4  5 most de |     Total
-----------+---------------------------------+----------
         0 |     2,205        630        317 |     3,152 
           |     69.96      19.99      10.06 |    100.00 
-----------+---------------------------------+----------
         1 |    12,168      3,611      1,723 |    17,502 
           |     69.52      20.63       9.84 |    100.00 
-----------+---------------------------------+----------
     Total |    14,373      4,241      2,040 |    20,654 
           |     69.59      20.53       9.88 |    100.00 

. 
. safetab shield ethnicity,               row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Probable |            Ethnicity
 shielding |     White  Asian or       Other |     Total
-----------+---------------------------------+----------
         0 |     2,502        313        337 |     3,152 
           |     79.38       9.93      10.69 |    100.00 
-----------+---------------------------------+----------
         1 |    14,034      1,708      1,760 |    17,502 
           |     80.19       9.76      10.06 |    100.00 
-----------+---------------------------------+----------
     Total |    16,536      2,021      2,097 |    20,654 
           |     80.06       9.79      10.15 |    100.00 

. 
. 
. 
. * Relationships with age
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>                    ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension            ///          
>    
>                                                                              
>    {
  2. 
.                 
.         safetab agegroup `var', row 
  3.  }
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |    Asthma category
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,710        321 |     4,031 
           |     92.04       7.96 |    100.00 
-----------+----------------------+----------
    30-<40 |     3,123        296 |     3,419 
           |     91.34       8.66 |    100.00 
-----------+----------------------+----------
    40-<50 |     3,209        279 |     3,488 
           |     92.00       8.00 |    100.00 
-----------+----------------------+----------
    50-<60 |     3,250        289 |     3,539 
           |     91.83       8.17 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,465        245 |     2,710 
           |     90.96       9.04 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,999        161 |     2,160 
           |     92.55       7.45 |    100.00 
-----------+----------------------+----------
       80+ |     1,189        118 |     1,307 
           |     90.97       9.03 |    100.00 
-----------+----------------------+----------
     Total |    18,945      1,709 |    20,654 
           |     91.73       8.27 |    100.00 
37

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,250        781 |     4,031 
           |     80.63      19.37 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,695        724 |     3,419 
           |     78.82      21.18 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,785        703 |     3,488 
           |     79.85      20.15 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,839        700 |     3,539 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,189        521 |     2,710 
           |     80.77      19.23 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,726        434 |     2,160 
           |     79.91      20.09 |    100.00 
-----------+----------------------+----------
       80+ |     1,029        278 |     1,307 
           |     78.73      21.27 |    100.00 
-----------+----------------------+----------
     Total |    16,513      4,141 |    20,654 
           |     79.95      20.05 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,269        762 |     4,031 
           |     81.10      18.90 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,735        684 |     3,419 
           |     79.99      20.01 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,794        694 |     3,488 
           |     80.10      19.90 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,836        703 |     3,539 
           |     80.14      19.86 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,179        531 |     2,710 
           |     80.41      19.59 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,701        459 |     2,160 
           |     78.75      21.25 |    100.00 
-----------+----------------------+----------
       80+ |     1,054        253 |     1,307 
           |     80.64      19.36 |    100.00 
-----------+----------------------+----------
     Total |    16,568      4,086 |    20,654 
           |     80.22      19.78 |    100.00 
17

**TABLE OF agegroup diabcat REDACTED DUE TO SMALL N**

31

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Chronic liver disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,219        812 |     4,031 
           |     79.86      20.14 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,752        667 |     3,419 
           |     80.49      19.51 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,824        664 |     3,488 
           |     80.96      19.04 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,830        709 |     3,539 
           |     79.97      20.03 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,154        556 |     2,710 
           |     79.48      20.52 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,712        448 |     2,160 
           |     79.26      20.74 |    100.00 
-----------+----------------------+----------
       80+ |     1,041        266 |     1,307 
           |     79.65      20.35 |    100.00 
-----------+----------------------+----------
     Total |    16,532      4,122 |    20,654 
           |     80.04      19.96 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Neurological disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,202        829 |     4,031 
           |     79.43      20.57 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,743        676 |     3,419 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,816        672 |     3,488 
           |     80.73      19.27 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,880        659 |     3,539 
           |     81.38      18.62 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,174        536 |     2,710 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,708        452 |     2,160 
           |     79.07      20.93 |    100.00 
-----------+----------------------+----------
       80+ |     1,018        289 |     1,307 
           |     77.89      22.11 |    100.00 
-----------+----------------------+----------
     Total |    16,541      4,113 |    20,654 
           |     80.09      19.91 |    100.00 
25

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Stroke or dementia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,194        837 |     4,031 
           |     79.24      20.76 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,743        676 |     3,419 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,817        671 |     3,488 
           |     80.76      19.24 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,796        743 |     3,539 
           |     79.01      20.99 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,174        536 |     2,710 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,740        420 |     2,160 
           |     80.56      19.44 |    100.00 
-----------+----------------------+----------
       80+ |     1,055        252 |     1,307 
           |     80.72      19.28 |    100.00 
-----------+----------------------+----------
     Total |    16,519      4,135 |    20,654 
           |     79.98      20.02 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Autoimmune disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,229        802 |     4,031 
           |     80.10      19.90 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,719        700 |     3,419 
           |     79.53      20.47 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,837        651 |     3,488 
           |     81.34      18.66 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,842        697 |     3,539 
           |     80.31      19.69 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,175        535 |     2,710 
           |     80.26      19.74 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,699        461 |     2,160 
           |     78.66      21.34 |    100.00 
-----------+----------------------+----------
       80+ |     1,036        271 |     1,307 
           |     79.27      20.73 |    100.00 
-----------+----------------------+----------
     Total |    16,537      4,117 |    20,654 
           |     80.07      19.93 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
   Grouped |      algorithm)
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,212        819 |     4,031 
           |     79.68      20.32 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,748        671 |     3,419 
           |     80.37      19.63 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,810        678 |     3,488 
           |     80.56      19.44 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,829        710 |     3,539 
           |     79.94      20.06 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,206        504 |     2,710 
           |     81.40      18.60 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,713        447 |     2,160 
           |     79.31      20.69 |    100.00 
-----------+----------------------+----------
       80+ |     1,029        278 |     1,307 
           |     78.73      21.27 |    100.00 
-----------+----------------------+----------
     Total |    16,547      4,107 |    20,654 
           |     80.12      19.88 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
   Grouped |      transplant
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,228        803 |     4,031 
           |     80.08      19.92 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,731        688 |     3,419 
           |     79.88      20.12 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,786        702 |     3,488 
           |     79.87      20.13 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,782        757 |     3,539 
           |     78.61      21.39 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,181        529 |     2,710 
           |     80.48      19.52 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,751        409 |     2,160 
           |     81.06      18.94 |    100.00 
-----------+----------------------+----------
       80+ |     1,056        251 |     1,307 
           |     80.80      19.20 |    100.00 
-----------+----------------------+----------
     Total |    16,515      4,139 |    20,654 
           |     79.96      20.04 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |       Asplenia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,198        833 |     4,031 
           |     79.34      20.66 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,745        674 |     3,419 
           |     80.29      19.71 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,792        696 |     3,488 
           |     80.05      19.95 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,820        719 |     3,539 
           |     79.68      20.32 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,178        532 |     2,710 
           |     80.37      19.63 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,709        451 |     2,160 
           |     79.12      20.88 |    100.00 
-----------+----------------------+----------
       80+ |     1,038        269 |     1,307 
           |     79.42      20.58 |    100.00 
-----------+----------------------+----------
     Total |    16,480      4,174 |    20,654 
           |     79.79      20.21 |    100.00 
27

**TABLE OF agegroup cancer_exhaem_cat REDACTED DUE TO SMALL N**

25

**TABLE OF agegroup cancer_haem_cat REDACTED DUE TO SMALL N**

37

**TABLE OF agegroup reduced_kidney_function_cat REDACTED DUE TO SMALL N**

14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
   Grouped |        disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     2,600      1,431 |     4,031 
           |     64.50      35.50 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,186      1,233 |     3,419 
           |     63.94      36.06 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,206      1,282 |     3,488 
           |     63.25      36.75 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,282      1,257 |     3,539 
           |     64.48      35.52 |    100.00 
-----------+----------------------+----------
    60-<70 |     1,753        957 |     2,710 
           |     64.69      35.31 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,386        774 |     2,160 
           |     64.17      35.83 |    100.00 
-----------+----------------------+----------
       80+ |       843        464 |     1,307 
           |     64.50      35.50 |    100.00 
-----------+----------------------+----------
     Total |    13,256      7,398 |    20,654 
           |     64.18      35.82 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
   Grouped |     hypertension
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,231        800 |     4,031 
           |     80.15      19.85 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,731        688 |     3,419 
           |     79.88      20.12 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,771        717 |     3,488 
           |     79.44      20.56 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,819        720 |     3,539 
           |     79.66      20.34 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,172        538 |     2,710 
           |     80.15      19.85 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,725        435 |     2,160 
           |     79.86      20.14 |    100.00 
-----------+----------------------+----------
       80+ |     1,058        249 |     1,307 
           |     80.95      19.05 |    100.00 
-----------+----------------------+----------
     Total |    16,507      4,147 |    20,654 
           |     79.92      20.08 |    100.00 

. 
. 
. *Relationships with sex
. foreach var of varlist asthma                                           ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                     /// 
>    
>                                                                              
>    {
  2.                                                 
.         safetab male `var', row 
  3. }
12

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Asthma category
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,746        853 |    10,599 
           |     91.95       8.05 |    100.00 
-----------+----------------------+----------
         1 |     9,199        856 |    10,055 
           |     91.49       8.51 |    100.00 
-----------+----------------------+----------
     Total |    18,945      1,709 |    20,654 
           |     91.73       8.27 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,497      2,102 |    10,599 
           |     80.17      19.83 |    100.00 
-----------+----------------------+----------
         1 |     8,016      2,039 |    10,055 
           |     79.72      20.28 |    100.00 
-----------+----------------------+----------
     Total |    16,513      4,141 |    20,654 
           |     79.95      20.05 |    100.00 
29

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,445      2,154 |    10,599 
           |     79.68      20.32 |    100.00 
-----------+----------------------+----------
         1 |     8,123      1,932 |    10,055 
           |     80.79      19.21 |    100.00 
-----------+----------------------+----------
     Total |    16,568      4,086 |    20,654 
           |     80.22      19.78 |    100.00 
13

**TABLE OF male diabcat REDACTED DUE TO SMALL N**

27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Chronic liver disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,471      2,128 |    10,599 
           |     79.92      20.08 |    100.00 
-----------+----------------------+----------
         1 |     8,061      1,994 |    10,055 
           |     80.17      19.83 |    100.00 
-----------+----------------------+----------
     Total |    16,532      4,122 |    20,654 
           |     80.04      19.96 |    100.00 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Neurological disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,467      2,132 |    10,599 
           |     79.88      20.12 |    100.00 
-----------+----------------------+----------
         1 |     8,074      1,981 |    10,055 
           |     80.30      19.70 |    100.00 
-----------+----------------------+----------
     Total |    16,541      4,113 |    20,654 
           |     80.09      19.91 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Stroke or dementia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,489      2,110 |    10,599 
           |     80.09      19.91 |    100.00 
-----------+----------------------+----------
         1 |     8,030      2,025 |    10,055 
           |     79.86      20.14 |    100.00 
-----------+----------------------+----------
     Total |    16,519      4,135 |    20,654 
           |     79.98      20.02 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Autoimmune disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,464      2,135 |    10,599 
           |     79.86      20.14 |    100.00 
-----------+----------------------+----------
         1 |     8,073      1,982 |    10,055 
           |     80.29      19.71 |    100.00 
-----------+----------------------+----------
     Total |    16,537      4,117 |    20,654 
           |     80.07      19.93 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
           |      algorithm)
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,516      2,083 |    10,599 
           |     80.35      19.65 |    100.00 
-----------+----------------------+----------
         1 |     8,031      2,024 |    10,055 
           |     79.87      20.13 |    100.00 
-----------+----------------------+----------
     Total |    16,547      4,107 |    20,654 
           |     80.12      19.88 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
           |      transplant
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,491      2,108 |    10,599 
           |     80.11      19.89 |    100.00 
-----------+----------------------+----------
         1 |     8,024      2,031 |    10,055 
           |     79.80      20.20 |    100.00 
-----------+----------------------+----------
     Total |    16,515      4,139 |    20,654 
           |     79.96      20.04 |    100.00 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Asplenia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,401      2,198 |    10,599 
           |     79.26      20.74 |    100.00 
-----------+----------------------+----------
         1 |     8,079      1,976 |    10,055 
           |     80.35      19.65 |    100.00 
-----------+----------------------+----------
     Total |    16,480      4,174 |    20,654 
           |     79.79      20.21 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |          Non-haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 |     8,542         53        156      1,848 |    10,599 
           |     80.59       0.50       1.47      17.44 |    100.00 
-----------+--------------------------------------------+----------
         1 |     8,090         37        166      1,762 |    10,055 
           |     80.46       0.37       1.65      17.52 |    100.00 
-----------+--------------------------------------------+----------
     Total |    16,632         90        322      3,610 |    20,654 
           |     80.53       0.44       1.56      17.48 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |            Haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 |     8,504         42        165      1,888 |    10,599 
           |     80.23       0.40       1.56      17.81 |    100.00 
-----------+--------------------------------------------+----------
         1 |     8,052         43        156      1,804 |    10,055 
           |     80.08       0.43       1.55      17.94 |    100.00 
-----------+--------------------------------------------+----------
     Total |    16,556         85        321      3,692 |    20,654 
           |     80.16       0.41       1.55      17.88 |    100.00 
33

**TABLE OF male reduced_kidney_function_cat REDACTED DUE TO SMALL N**

10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
           |        disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,819      3,780 |    10,599 
           |     64.34      35.66 |    100.00 
-----------+----------------------+----------
         1 |     6,437      3,618 |    10,055 
           |     64.02      35.98 |    100.00 
-----------+----------------------+----------
     Total |    13,256      7,398 |    20,654 
           |     64.18      35.82 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
           |     hypertension
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,469      2,130 |    10,599 
           |     79.90      20.10 |    100.00 
-----------+----------------------+----------
         1 |     8,038      2,017 |    10,055 
           |     79.94      20.06 |    100.00 
-----------+----------------------+----------
     Total |    16,507      4,147 |    20,654 
           |     79.92      20.08 |    100.00 

. 
. *Relationships with smoking
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                         
>    ///
>                                         {
  2.         
.         safetab smoke `var', row 
  3. }
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |    Asthma category
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       774         67 |       841 
             |     92.03       7.97 |    100.00 
-------------+----------------------+----------
      Former |       366         32 |       398 
             |     91.96       8.04 |    100.00 
-------------+----------------------+----------
     Current |     2,203        204 |     2,407 
             |     91.52       8.48 |    100.00 
-------------+----------------------+----------
       Total |     3,343        303 |     3,646 
             |     91.69       8.31 |    100.00 
34

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Chronic Respiratory
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       645        196 |       841 
             |     76.69      23.31 |    100.00 
-------------+----------------------+----------
      Former |       316         82 |       398 
             |     79.40      20.60 |    100.00 
-------------+----------------------+----------
     Current |     1,930        477 |     2,407 
             |     80.18      19.82 |    100.00 
-------------+----------------------+----------
       Total |     2,891        755 |     3,646 
             |     79.29      20.71 |    100.00 
30

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    Chronic Cardiac
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       682        159 |       841 
             |     81.09      18.91 |    100.00 
-------------+----------------------+----------
      Former |       325         73 |       398 
             |     81.66      18.34 |    100.00 
-------------+----------------------+----------
     Current |     1,935        472 |     2,407 
             |     80.39      19.61 |    100.00 
-------------+----------------------+----------
       Total |     2,942        704 |     3,646 
             |     80.69      19.31 |    100.00 
14

**TABLE OF smoke diabcat REDACTED DUE TO SMALL N**

28

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Chronic liver disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       684        157 |       841 
             |     81.33      18.67 |    100.00 
-------------+----------------------+----------
      Former |       319         79 |       398 
             |     80.15      19.85 |    100.00 
-------------+----------------------+----------
     Current |     1,913        494 |     2,407 
             |     79.48      20.52 |    100.00 
-------------+----------------------+----------
       Total |     2,916        730 |     3,646 
             |     79.98      20.02 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Neurological disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       659        182 |       841 
             |     78.36      21.64 |    100.00 
-------------+----------------------+----------
      Former |       317         81 |       398 
             |     79.65      20.35 |    100.00 
-------------+----------------------+----------
     Current |     1,937        470 |     2,407 
             |     80.47      19.53 |    100.00 
-------------+----------------------+----------
       Total |     2,913        733 |     3,646 
             |     79.90      20.10 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Stroke or dementia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       656        185 |       841 
             |     78.00      22.00 |    100.00 
-------------+----------------------+----------
      Former |       320         78 |       398 
             |     80.40      19.60 |    100.00 
-------------+----------------------+----------
     Current |     1,932        475 |     2,407 
             |     80.27      19.73 |    100.00 
-------------+----------------------+----------
       Total |     2,908        738 |     3,646 
             |     79.76      20.24 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Autoimmune disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       667        174 |       841 
             |     79.31      20.69 |    100.00 
-------------+----------------------+----------
      Former |       320         78 |       398 
             |     80.40      19.60 |    100.00 
-------------+----------------------+----------
     Current |     1,949        458 |     2,407 
             |     80.97      19.03 |    100.00 
-------------+----------------------+----------
       Total |     2,936        710 |     3,646 
             |     80.53      19.47 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Immunosuppressed
             |     (combination
     Smoking |      algorithm)
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       664        177 |       841 
             |     78.95      21.05 |    100.00 
-------------+----------------------+----------
      Former |       316         82 |       398 
             |     79.40      20.60 |    100.00 
-------------+----------------------+----------
     Current |     1,907        500 |     2,407 
             |     79.23      20.77 |    100.00 
-------------+----------------------+----------
       Total |     2,887        759 |     3,646 
             |     79.18      20.82 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Other solid organ
     Smoking |      transplant
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       670        171 |       841 
             |     79.67      20.33 |    100.00 
-------------+----------------------+----------
      Former |       316         82 |       398 
             |     79.40      20.60 |    100.00 
-------------+----------------------+----------
     Current |     1,932        475 |     2,407 
             |     80.27      19.73 |    100.00 
-------------+----------------------+----------
       Total |     2,918        728 |     3,646 
             |     80.03      19.97 |    100.00 
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |       Asplenia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       676        165 |       841 
             |     80.38      19.62 |    100.00 
-------------+----------------------+----------
      Former |       321         77 |       398 
             |     80.65      19.35 |    100.00 
-------------+----------------------+----------
     Current |     1,927        480 |     2,407 
             |     80.06      19.94 |    100.00 
-------------+----------------------+----------
       Total |     2,924        722 |     3,646 
             |     80.20      19.80 |    100.00 
24

**TABLE OF smoke cancer_exhaem_cat REDACTED DUE TO SMALL N**

22

**TABLE OF smoke cancer_haem_cat REDACTED DUE TO SMALL N**

34

**TABLE OF smoke reduced_kidney_function_cat REDACTED DUE TO SMALL N**

11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    End-stage renal
     Smoking |        disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       535        306 |       841 
             |     63.61      36.39 |    100.00 
-------------+----------------------+----------
      Former |       259        139 |       398 
             |     65.08      34.92 |    100.00 
-------------+----------------------+----------
     Current |     1,495        912 |     2,407 
             |     62.11      37.89 |    100.00 
-------------+----------------------+----------
       Total |     2,289      1,357 |     3,646 
             |     62.78      37.22 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       672        169 |       841 
             |     79.90      20.10 |    100.00 
-------------+----------------------+----------
      Former |       315         83 |       398 
             |     79.15      20.85 |    100.00 
-------------+----------------------+----------
     Current |     1,902        505 |     2,407 
             |     79.02      20.98 |    100.00 
-------------+----------------------+----------
       Total |     2,889        757 |     3,646 
             |     79.24      20.76 |    100.00 

. 
. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. safetab covid_death covid_icu  , row col
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |   Failure/censoring
  outcome: |     indicator for
     covid |  outcome: covid icu
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,650      8,368 |    12,018 
           |     30.37      69.63 |    100.00 
           |     58.20      58.18 |     58.19 
-----------+----------------------+----------
         1 |     2,621      6,015 |     8,636 
           |     30.35      69.65 |    100.00 
           |     41.80      41.82 |     41.81 
-----------+----------------------+----------
     Total |     6,271     14,383 |    20,654 
           |     30.36      69.64 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. safecount if covid_icu==1 & covid_death==1
  6,015

. safecount if covidadmission==1 & covid_death==1
  814

. 
. sum positive_SGSS

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S |     20,654    .0508376    .2196713          0          1

. sum positive_SGSS if date_positive_SGSS<=22267

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S |          0

. 
. safetab positive_SGSS covid_primary_care_codes, row col miss
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |  Indicator positive
 Indicator |   primary care code
  positive |    COVID infection
covid test |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,399     16,205 |    19,604 
           |     17.34      82.66 |    100.00 
           |     95.29      94.84 |     94.92 
-----------+----------------------+----------
         1 |       168        882 |     1,050 
           |     16.00      84.00 |    100.00 
           |      4.71       5.16 |      5.08 
-----------+----------------------+----------
     Total |     3,567     17,087 |    20,654 
           |     17.27      82.73 |    100.00 
           |    100.00     100.00 |    100.00 

. safetab positive_SGSS covid_primary_care_codes if date_positive_SGSS<=22267 &
>  date_covid_primary_care_codes<=22267, row col miss
107
no observations

. gen diff=date_positive_SGSS-date_covid_primary_care_codes 
(19,772 missing values generated)

. sum diff, d

                            diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -55           -135
 5%          -20           -112
10%           -3           -100       Obs                 882
25%           30            -65       Sum of Wgt.         882

50%         79.5                      Mean           80.54422
                        Largest       Std. Dev.      64.32735
75%          133            203
90%          165            204       Variance       4138.008
95%          182            204       Skewness        -.09565
99%          199            205       Kurtosis       2.219155

. 
. tab reported if kids_cat4!=0 & age<=65

      Reported |
     Infection |
        Source |      Freq.     Percent        Cum.
---------------+-----------------------------------
          SGSS |     12,956       99.52       99.52
     test_code |         25        0.19       99.71
 sequalae_code |         16        0.12       99.83
diagnosis_code |         22        0.17      100.00
---------------+-----------------------------------
         Total |     13,019      100.00

. tab reported if kids_cat4==0 & age<=65

      Reported |
     Infection |
        Source |      Freq.     Percent        Cum.
---------------+-----------------------------------
          SGSS |        375       99.47       99.47
     test_code |          1        0.27       99.73
 sequalae_code |          1        0.27      100.00
---------------+-----------------------------------
         Total |        377      100.00

. 
. 
. /* DEATHS by STP=======================================================*/
. tab  stp covid_death, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,248        884 |     2,132 
           |     10.38      10.24 |     10.32 
-----------+----------------------+----------
         2 |     1,155        868 |     2,023 
           |      9.61      10.05 |      9.79 
-----------+----------------------+----------
         3 |     1,191        830 |     2,021 
           |      9.91       9.61 |      9.79 
-----------+----------------------+----------
         4 |     1,168        922 |     2,090 
           |      9.72      10.68 |     10.12 
-----------+----------------------+----------
         5 |     1,121        858 |     1,979 
           |      9.33       9.94 |      9.58 
-----------+----------------------+----------
         6 |     1,252        829 |     2,081 
           |     10.42       9.60 |     10.08 
-----------+----------------------+----------
         7 |     1,230        824 |     2,054 
           |     10.23       9.54 |      9.94 
-----------+----------------------+----------
         8 |     1,189        925 |     2,114 
           |      9.89      10.71 |     10.24 
-----------+----------------------+----------
         9 |     1,255        852 |     2,107 
           |     10.44       9.87 |     10.20 
-----------+----------------------+----------
        10 |     1,209        844 |     2,053 
           |     10.06       9.77 |      9.94 
-----------+----------------------+----------
     Total |    12,018      8,636 |    20,654 
           |    100.00     100.00 |    100.00 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/02_an_data_checks.log
  log type:  text
 closed on:  17 Aug 2021, 07:44:40
-------------------------------------------------------------------------------
