-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/02_an_data_checks.log
  log type:  text
 opened on:  28 Oct 2021, 11:14:11

. 
. * Open Stata dataset
. use $tempdir/`inputfile', clear

. 
. *run ssc install if not on local machine - server needs datacheck.ado file
. *ssc install datacheck 
. 
. *Duplicate patient check
. datacheck _n==1, by(patient_id) nol

. 
. 
. /* CHECK INCLUSION AND EXCLUSION CRITERIA====================================
> =*/ 
. 
. * DATA STRUCTURE: Confirm one row per patient 
. duplicates tag patient_id, generate(dup_check)

Duplicates in terms of patient_id

. assert dup_check == 0 

. drop dup_check

. 
. * INCLUSION 1: >=18 and <=110 at 1 March 2020 
. assert age < .

. assert age >= 18 

. assert age <= 110

. 
. 
. * EXCLUDE 1:  MISSING IMD
. assert inlist(imd, 1, 2, 3, 4, 5)

. 
. * EXCLUDE 2:  HH with more than 10 people
. datacheck inlist(household_size, 1, 2, 3, 4, 5,6, 7, 8, 9, 10), nol

 (488 contradictions)

. 
. /* EXPECTED VALUES===========================================================
> =*/ 
. 
. *HH
. datacheck kids_cat4<., nol

. datacheck inlist(kids_cat4, 0,1, 2), nol

 (17582 contradictions)

. 
. datacheck number_kids<., nol

 (18506 contradictions)

. datacheck inlist(number_kids, 0,1,2,3,4,5,6,7,8,9), nol

 (18709 contradictions)

. 
. * Age
. datacheck age<., nol

. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6,7), nol

. datacheck inlist(age66, 0, 1), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. datacheck inlist(obese4cat, 1, 2, 3, 4), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

. datacheck inlist(smoke_nomiss, 1, 2, 3), nol 

. 
. 
. * Check date ranges for all comorbidities 
. 
. foreach var of varlist  chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         perm_immunodef  ///
>                                         temp_immunodef  ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         hypertension                         
>    ///
>                                         {
  2.                                                 
.         summ `var'_date, format
  3. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_r~te |      4,152   26jun1995    5403.514  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_c~te |      4,126   04oct1995    5350.101  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
chronic_l~te |      4,116   25apr1995    5361.728  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_neur~e |      4,143   16nov1995    5365.228  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stroke_dem~e |      4,104   14jul1995    5370.587  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
ra_sle_pso~e |      4,148   26nov1995    5336.197  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
perm_immun~e |      4,111   24apr1995    5378.519  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
temp_immun~e |          0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
other_tran~e |      4,202   13jul1995    5315.434  15jan1970  15dec2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
asplenia_d~e |      4,182   14mar1995    5412.449  15jan1970  15nov2020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hypertensi~e |      4,115   31dec1995     5417.02  15jan1970  15oct2021

. 
. foreach comorb in $varlist { 
  2.         local comorb: subinstr local comorb "i." ""
  3.         safetab `comorb', m
  4. }

. 
. *summarise end dates for each outcome
. foreach outcome in date_covid_tpp_prob  date_non_covid_death    date_covid_de
> ath        date_covid_icu  date_covidadmission     died_date_onscovid_part1  
>        {
  2. sum `outcome', format
  3. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~b |     19,468   23may2021    88.98986  21dec2020  22oct2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_non_c~h |      6,505   22may2021    88.26045  21dec2020  22oct2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~h |      9,695   22may2021    88.55364  21dec2020  22oct2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |     16,193   21may2021    87.90554  21dec2020  22oct2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~n |      2,801   18apr2021    82.49223  20dec2020  21oct2021

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~1 |      9,681   21may2021    88.28133  21dec2020  22oct2021

. 
. foreach outcome in date_covid_tpp_prob  date_non_covid_death    date_covid_de
> ath        date_covid_icu  date_covidadmission     died_date_onscovid_part1  
>        {
  2. gen `outcome'_month=mofd(`outcome') 
  3.  lab define `outcome'_month 731 "Dec 2020" 734 "March 2020"  738 "July 202
> 0"
  4. lab val `outcome'_month `outcome'_month
  5. tab `outcome'_month
  6. drop `outcome'_month
  7. }
(1,165 missing values generated)

date_covid_ |
tpp_prob_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        720        3.70        3.70
        732 |      1,985       10.20       13.89
        733 |      1,738        8.93       22.82
 March 2020 |      1,869        9.60       32.42
        735 |      1,893        9.72       42.15
        736 |      1,937        9.95       52.10
        737 |      1,893        9.72       61.82
  July 2020 |      1,943        9.98       71.80
        739 |      2,009       10.32       82.12
        740 |      2,001       10.28       92.40
        741 |      1,480        7.60      100.00
------------+-----------------------------------
      Total |     19,468      100.00
(14,128 missing values generated)

date_non_co |
vid_death_m |
       onth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        208        3.20        3.20
        732 |        693       10.65       13.85
        733 |        597        9.18       23.03
 March 2020 |        662       10.18       33.21
        735 |        639        9.82       43.03
        736 |        641        9.85       52.88
        737 |        638        9.81       62.69
  July 2020 |        683       10.50       73.19
        739 |        652       10.02       83.21
        740 |        642        9.87       93.08
        741 |        450        6.92      100.00
------------+-----------------------------------
      Total |      6,505      100.00
(10,938 missing values generated)

date_covid_ |
death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        352        3.63        3.63
        732 |      1,018       10.50       14.13
        733 |        880        9.08       23.21
 March 2020 |        965        9.95       33.16
        735 |        902        9.30       42.47
        736 |        934        9.63       52.10
        737 |        969        9.99       62.09
  July 2020 |      1,043       10.76       72.85
        739 |        990       10.21       83.06
        740 |        985       10.16       93.22
        741 |        657        6.78      100.00
------------+-----------------------------------
      Total |      9,695      100.00
(4,440 missing values generated)

date_covid_ |
  icu_month |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        609        3.76        3.76
        732 |      1,572        9.71       13.47
        733 |      1,475        9.11       22.58
 March 2020 |      1,723       10.64       33.22
        735 |      1,586        9.79       43.01
        736 |      1,644       10.15       53.16
        737 |      1,605        9.91       63.08
  July 2020 |      1,626       10.04       73.12
        739 |      1,683       10.39       83.51
        740 |      1,551        9.58       93.09
        741 |      1,119        6.91      100.00
------------+-----------------------------------
      Total |     16,193      100.00
(17,832 missing values generated)

date_covida |
dmission_mo |
        nth |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        177        6.32        6.32
        732 |        436       15.57       21.89
        733 |        372       13.28       35.17
 March 2020 |        357       12.75       47.91
        735 |        298       10.64       58.55
        736 |        280       10.00       68.55
        737 |        257        9.18       77.72
  July 2020 |        218        7.78       85.51
        739 |        187        6.68       92.18
        740 |        136        4.86       97.04
        741 |         83        2.96      100.00
------------+-----------------------------------
      Total |      2,801      100.00
(10,952 missing values generated)

died_date_o |
nscovid_par |
   t1_month |      Freq.     Percent        Cum.
------------+-----------------------------------
   Dec 2020 |        358        3.70        3.70
        732 |      1,040       10.74       14.44
        733 |        856        8.84       23.28
 March 2020 |        974       10.06       33.34
        735 |        933        9.64       42.98
        736 |        913        9.43       52.41
        737 |        954        9.85       62.27
  July 2020 |      1,069       11.04       73.31
        739 |        983       10.15       83.46
        740 |        995       10.28       93.74
        741 |        606        6.26      100.00
------------+-----------------------------------
      Total |      9,681      100.00

. 
. *Outcome dates
. di d(1jan2021) /*study start*/
22281

. *22281
. di d(01mar2021) 
22340

. *22340
. di d(01may2021)
22401

. *22401
. di d(01july2021)
22462

. *22462
. di d(01sept2021) 
22524

. *22524
. di d(22oct2021) 
22575

. *22575
. 
. gen agegp=0 if age<=65
(4,551 missing values generated)

. replace agegp=1 if age>65
(4,551 real changes made)

. tab agegp, miss

      agegp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,082       77.94       77.94
          1 |      4,551       22.06      100.00
------------+-----------------------------------
      Total |     20,633      100.00

. 
. foreach age in 0 1 {
  2. foreach outcome of any covid_tpp_prob covidadmission covid_death    {
  3. summ  `outcome' if agegp==`age', format d 
  4. summ patient_id if `outcome'==1 & date_`outcome'<=22576 & agegp==`age'
  5. local total_`outcome'=`r(N)'
  6. hist date_`outcome' if date_`outcome'<=22576 & agegp==`age', saving(output
> /`outcome'_age`age', replace) ///
> xlabel(22281 22340 22401 22462 22524,labsize(tiny))  xtitle(, size(vsmall)) /
> //
> graphregion(color(white))  legend(off) freq  ///
> ylabel(0 5000,labsize(tiny))  ytitle("Number", size(vsmall)) ///
> title("N=`total_`outcome''", size(vsmall)) width(5) yline(5, lcolor(black%100
> )  lwidth(thick)) color(black%100)
  7. }
  8. }

       Failure/censoring indicator for outcome: covid
                          prob case
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              16,082
25%            1              0       Sum of Wgt.      16,082

50%            1                      Mean           .9436637
                        Largest       Std. Dev.      .2305771
75%            1              1
90%            1              1       Variance       .0531658
95%            1              1       Skewness      -3.848409
99%            1              1       Kurtosis       15.81025

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |     15,176    150034.3    86670.47          3     299998
(bin=61, start=22270, width=5)
(note: file output/covid_tpp_prob_age0.gph not found)
(file output/covid_tpp_prob_age0.gph saved)

     Failure/censoring indicator for outcome: covid SUS
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              16,082
25%            0              0       Sum of Wgt.      16,082

50%            0                      Mean           .1355553
                        Largest       Std. Dev.      .3423264
75%            0              1
90%            1              1       Variance       .1171873
95%            1              1       Skewness        2.12929
99%            1              1       Kurtosis       5.533876

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      2,180    150191.1    86697.76          3     299998
(bin=61, start=22269, width=5)
(note: file output/covidadmission_age0.gph not found)
(file output/covidadmission_age0.gph saved)

       Failure/censoring indicator for outcome: covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              16,082
25%            0              0       Sum of Wgt.      16,082

50%            0                      Mean           .4680388
                        Largest       Std. Dev.       .498993
75%            1              1
90%            1              1       Variance        .248994
95%            1              1       Skewness       .1281068
99%            1              1       Kurtosis       1.016411

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      7,527    150174.4     86508.4         43     299932
(bin=61, start=22270, width=5)
(note: file output/covid_death_age0.gph not found)
(file output/covid_death_age0.gph saved)

       Failure/censoring indicator for outcome: covid
                          prob case
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs               4,551
25%            1              0       Sum of Wgt.       4,551

50%            1                      Mean           .9430894
                        Largest       Std. Dev.      .2316971
75%            1              1
90%            1              1       Variance       .0536836
95%            1              1       Skewness       -3.82515
99%            1              1       Kurtosis       15.63177

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      4,292    149695.5    86575.78          0     299900
(bin=61, start=22270, width=5)
(note: file output/covid_tpp_prob_age1.gph not found)
(file output/covid_tpp_prob_age1.gph saved)

     Failure/censoring indicator for outcome: covid SUS
                          admission
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,551
25%            0              0       Sum of Wgt.       4,551

50%            0                      Mean           .1364535
                        Largest       Std. Dev.      .3433072
75%            0              1
90%            1              1       Variance       .1178599
95%            1              1       Skewness        2.11814
99%            1              1       Kurtosis       5.486518

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |        621    143361.4     86499.8        960     298924
(bin=61, start=22269, width=5)
(note: file output/covidadmission_age1.gph not found)
(file output/covidadmission_age1.gph saved)

       Failure/censoring indicator for outcome: covid
                            death
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,551
25%            0              0       Sum of Wgt.       4,551

50%            0                      Mean           .4763788
                        Largest       Std. Dev.      .4994966
75%            1              1
90%            1              1       Variance       .2494969
95%            1              1       Skewness       .0945903
99%            1              1       Kurtosis       1.008947

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      2,168    149404.5    86944.84          0     299857
(bin=61, start=22270, width=5)
(note: file output/covid_death_age1.gph not found)
(file output/covid_death_age1.gph saved)

. 
. 
. di (5/4000)*100
.125

. *addplot(pci 0 20 .1 20): With the 2 supplied coordinates, we are just 
. *connecting the line from the point (y=0,x=20) to (y=.1,x=20) -- a 
. *vertical line at x=20. 
. 
. * Combine histograms
. graph combine output/covid_tpp_prob_age0.gph output/covid_tpp_prob_age1.gph /
> //
> output/covidadmission_age0.gph output/covidadmission_age1.gph ///
> output/covid_death_age0.gph output/covid_death_age1.gph, graphregion(color(wh
> ite)) col(2) ysize(10)

. graph export "output/01_histogram_outcomes.svg", as(svg) replace 
(note: file output/01_histogram_outcomes.svg not found)
(file output/01_histogram_outcomes.svg written in SVG format)

. 
. *censor dates
. summ dereg_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dereg_date |         65   21may2021    102.6071  15dec2020  15oct2021

. summ has_12_m

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
has_12_m_f~p |     20,633    .9496438    .2186842          0          1

. 
. *Vacc data
. foreach age in 0 1 {
  2. foreach vacc of any covid_vacc_date covid_vacc_second_dose_date   {
  3. summ  `vacc'  if agegp==`age', format d 
  4. summ patient_id if `vacc'!=. & `vacc'<=22576 & agegp==`age'
  5. local total=`r(N)' 
  6. hist `vacc' if `vacc'<=22576  & agegp==`age', saving(output/`vacc'_age`age
> ', replace) ///
> xlabel(22281 22340 22401 22462 22524,labsize(tiny))  xtitle(, size(vsmall)) /
> //
> graphregion(color(white))  legend(off) freq ylabel(0 500000,labsize(tiny)) //
> /
> ytitle("Number", size(vsmall))   ///
> title("N=`total'", size(vsmall))  yline(5, lcolor(black%100)  lwidth(thick)) 
> color(black%100)
  7. }
  8. }

                       First vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    10dec2020      09dec2020
 5%    19dec2020      09dec2020
10%    30dec2020      09dec2020       Obs               8,039
25%    01feb2021      09dec2020       Sum of Wgt.       8,039

50%    29mar2021                      Mean          28mar2021
                        Largest       Std. Dev.      63.70392
75%    23may2021      16jul2021
90%    25jun2021      16jul2021       Variance       4058.189
95%    06jul2021      16jul2021       Skewness      -.0034417
99%    14jul2021      16jul2021       Kurtosis       1.799848

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      8,039    150450.9    86954.32          3     299998
(bin=39, start=22258, width=5.6153846)
(note: file output/covid_vacc_date_age0.gph not found)
(file output/covid_vacc_date_age0.gph saved)

                      Second vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    09dec2020      09dec2020
 5%    13dec2020      09dec2020
10%    17dec2020      09dec2020       Obs               3,202
25%    30dec2020      09dec2020       Sum of Wgt.       3,202

50%    19jan2021                      Mean          19jan2021
                        Largest       Std. Dev.      23.56622
75%    08feb2021      01mar2021
90%    20feb2021      01mar2021       Variance       555.3665
95%    25feb2021      01mar2021       Skewness      -.0187113
99%    01mar2021      01mar2021       Kurtosis        1.83609

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      3,202    148873.5    86420.62         70     299977
(bin=35, start=22258, width=2.3428571)
(note: file output/covid_vacc_second_dose_date_age0.gph not found)
(file output/covid_vacc_second_dose_date_age0.gph saved)

                       First vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    11dec2020      09dec2020
 5%    20dec2020      09dec2020
10%    29dec2020      09dec2020       Obs               2,249
25%    01feb2021      09dec2020       Sum of Wgt.       2,249

50%    28mar2021                      Mean          28mar2021
                        Largest       Std. Dev.      63.81575
75%    24may2021      16jul2021
90%    25jun2021      16jul2021       Variance        4072.45
95%    06jul2021      16jul2021       Skewness       .0020117
99%    14jul2021      16jul2021       Kurtosis       1.780039

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |      2,249    148808.6    86716.75         33     299900
(bin=33, start=22258, width=6.6363636)
(note: file output/covid_vacc_date_age1.gph not found)
(file output/covid_vacc_date_age1.gph saved)

                      Second vacc date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    09dec2020      09dec2020
 5%    12dec2020      09dec2020
10%    16dec2020      09dec2020       Obs                 923
25%    29dec2020      09dec2020       Sum of Wgt.         923

50%    19jan2021                      Mean          18jan2021
                        Largest       Std. Dev.      24.13294
75%    08feb2021      01mar2021
90%    21feb2021      01mar2021       Variance       582.3986
95%    25feb2021      01mar2021       Skewness       .0030408
99%    01mar2021      01mar2021       Kurtosis       1.806641

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  patient_id |        923    145270.4    88606.48        275     299857
(bin=29, start=22258, width=2.8275862)
(note: file output/covid_vacc_second_dose_date_age1.gph not found)
(file output/covid_vacc_second_dose_date_age1.gph saved)

. *Combine histograms
. graph combine output/covid_vacc_date_age0.gph output/covid_vacc_date_age1.gph
>   output/covid_vacc_second_dose_date_age0.gph output/covid_vacc_second_dose_d
> ate_age1.gph, ///
>  graphregion(color(white)) col(2)

. graph export "output/01_histogram_vaccinations.svg", as(svg) replace 
(note: file output/01_histogram_vaccinations.svg not found)
(file output/01_histogram_vaccinations.svg written in SVG format)

. 
. 
. 
. /* LOGICAL RELATIONSHIPS=====================================================
> =*/ 
. 
. *HH variables
. safetab kids_cat4 tot_adults_hh
0

**TABLE OF kids_cat4 tot_adults_hh REDACTED DUE TO SMALL N**


. safetab number_kids tot_adults_hh
0

**TABLE OF number_kids tot_adults_hh REDACTED DUE TO SMALL N**


. safetab household_size tot_adults_hh
0

**TABLE OF household_size tot_adults_hh REDACTED DUE TO SMALL N**


. 
. * BMI
. bysort bmicat: summ bmi

-------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,950    16.84831    .9796425    15.0037   18.49992

-------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      4,601    21.84021     1.86099    18.5038   24.99913

-------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      3,590    27.42296    1.419138   25.00367   29.99906

-------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      2,868    32.39447     1.42891   30.00024   34.99802

-------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,768     37.2924    1.437308   35.00039   39.99929

-------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,133    43.59556     2.68767   40.00325   49.97549

-------------------------------------------------------------------------------
-> bmicat = Unknown (.u)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |          0


. safetab bmicat obese4cat, m
17

                     |     Evidence of obesity (4 categories)
         Grouped BMI | No record  Obese I (  Obese II   Obese III |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |     1,950          0          0          0 |     1,950 
  Normal (18.5-24.9) |     4,601          0          0          0 |     4,601 
Overweight (25-29.9) |     3,590          0          0          0 |     3,590 
   Obese I (30-34.9) |         0      2,868          0          0 |     2,868 
  Obese II (35-39.9) |         0          0      1,768          0 |     1,768 
     Obese III (40+) |         0          0          0      1,133 |     1,133 
        Unknown (.u) |     4,723          0          0          0 |     4,723 
---------------------+--------------------------------------------+----------
               Total |    14,864      2,868      1,768      1,133 |    20,633 

. 
. * Age
. bysort agegroup: summ age

-------------------------------------------------------------------------------
-> agegroup = 18-<30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      4,017    23.67862    3.458062         18         29

-------------------------------------------------------------------------------
-> agegroup = 30-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,506    34.40531    2.835935         30         39

-------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,312    44.69112    2.821211         40         49

-------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,449    54.42273    2.879827         50         59

-------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      2,890    64.35571    2.879868         60         69

-------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      2,249    73.95242    2.826532         70         79

-------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      1,210    85.51157    4.677555         80        109


. safetab agegroup age66, m
15

   Grouped |  66 years and older
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     4,017          0 |     4,017 
    30-<40 |     3,506          0 |     3,506 
    40-<50 |     3,312          0 |     3,312 
    50-<60 |     3,449          0 |     3,449 
    60-<70 |     2,075        815 |     2,890 
    70-<80 |         0      2,249 |     2,249 
       80+ |         0      1,210 |     1,210 
-----------+----------------------+----------
     Total |    16,359      4,274 |    20,633 

. 
. * Smoking
. safetab smoke smoke_nomiss, m
19

             |  Smoking status (missing set to
     Smoking |               non)
      status |     Never     Former    Current |     Total
-------------+---------------------------------+----------
       Never |       836          0          0 |       836 
      Former |         0        426          0 |       426 
     Current |         0          0      2,498 |     2,498 
Unknown (.u) |    16,873          0          0 |    16,873 
-------------+---------------------------------+----------
       Total |    17,709        426      2,498 |    20,633 

. 
. * Diabetes
. *safetab diabcat diabetes, m
. 
. * CKD
. safetab reduced egfr_cat, m
17

       Reduced kidney |               Calculated eGFR
             function |        30         45         60          . |     Total
----------------------+--------------------------------------------+----------
                 None |         0          0     19,270      1,115 |    20,385 
Stage 3a/3b egfr 30-6 |         6        242          0          0 |       248 
----------------------+--------------------------------------------+----------
                Total |         6        242     19,270      1,115 |    20,633 

. * CKD
. safetab reduced esrd, m
13

                      |    End-stage renal
       Reduced kidney |        disease
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    13,120      7,265 |    20,385 
Stage 3a/3b egfr 30-6 |       152         96 |       248 
----------------------+----------------------+----------
                Total |    13,272      7,361 |    20,633 

. 
. /* EXPECTED RELATIONSHIPS====================================================
> =*/ 
. 
. /*  Relationships between demographic/lifestyle variables  */
. safetab agegroup bmicat,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |                      Grouped BMI
       age | Underweig  Normal (1  Overweigh  Obese I (  Obese II  |     Total
-----------+-------------------------------------------------------+----------
    18-<30 |       365        803        619        509        315 |     2,816 
           |     12.96      28.52      21.98      18.08      11.19 |    100.00 
-----------+-------------------------------------------------------+----------
    30-<40 |       309        795        639        471        334 |     2,747 
           |     11.25      28.94      23.26      17.15      12.16 |    100.00 
-----------+-------------------------------------------------------+----------
    40-<50 |       301        774        585        454        274 |     2,581 
           |     11.66      29.99      22.67      17.59      10.62 |    100.00 
-----------+-------------------------------------------------------+----------
    50-<60 |       332        765        619        509        307 |     2,749 
           |     12.08      27.83      22.52      18.52      11.17 |    100.00 
-----------+-------------------------------------------------------+----------
    60-<70 |       310        667        501        403        241 |     2,264 
           |     13.69      29.46      22.13      17.80      10.64 |    100.00 
-----------+-------------------------------------------------------+----------
    70-<80 |       221        516        406        348        180 |     1,786 
           |     12.37      28.89      22.73      19.48      10.08 |    100.00 
-----------+-------------------------------------------------------+----------
       80+ |       112        281        221        174        117 |       967 
           |     11.58      29.06      22.85      17.99      12.10 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |     1,950      4,601      3,590      2,868      1,768 |    15,910 
           |     12.26      28.92      22.56      18.03      11.11 |    100.00 


           |  Grouped
   Grouped |    BMI
       age | Obese III |     Total
-----------+-----------+----------
    18-<30 |       205 |     2,816 
           |      7.28 |    100.00 
-----------+-----------+----------
    30-<40 |       199 |     2,747 
           |      7.24 |    100.00 
-----------+-----------+----------
    40-<50 |       193 |     2,581 
           |      7.48 |    100.00 
-----------+-----------+----------
    50-<60 |       217 |     2,749 
           |      7.89 |    100.00 
-----------+-----------+----------
    60-<70 |       142 |     2,264 
           |      6.27 |    100.00 
-----------+-----------+----------
    70-<80 |       115 |     1,786 
           |      6.44 |    100.00 
-----------+-----------+----------
       80+ |        62 |       967 
           |      6.41 |    100.00 
-----------+-----------+----------
     Total |     1,133 |    15,910 
           |      7.12 |    100.00 

. safetab agegroup smoke,         row  
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |          Smoking status
       age |     Never     Former    Current |     Total
-----------+---------------------------------+----------
    18-<30 |       156         73        490 |       719 
           |     21.70      10.15      68.15 |    100.00 
-----------+---------------------------------+----------
    30-<40 |       152         81        425 |       658 
           |     23.10      12.31      64.59 |    100.00 
-----------+---------------------------------+----------
    40-<50 |       136         74        386 |       596 
           |     22.82      12.42      64.77 |    100.00 
-----------+---------------------------------+----------
    50-<60 |       129         66        437 |       632 
           |     20.41      10.44      69.15 |    100.00 
-----------+---------------------------------+----------
    60-<70 |       122         73        355 |       550 
           |     22.18      13.27      64.55 |    100.00 
-----------+---------------------------------+----------
    70-<80 |        93         41        262 |       396 
           |     23.48      10.35      66.16 |    100.00 
-----------+---------------------------------+----------
       80+ |        48         18        143 |       209 
           |     22.97       8.61      68.42 |    100.00 
-----------+---------------------------------+----------
     Total |       836        426      2,498 |     3,760 
           |     22.23      11.33      66.44 |    100.00 

. safetab agegroup ethnicity, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |            Ethnicity
       age |     White  Asian or       Other |     Total
-----------+---------------------------------+----------
    18-<30 |     3,237        401        379 |     4,017 
           |     80.58       9.98       9.43 |    100.00 
-----------+---------------------------------+----------
    30-<40 |     2,817        349        340 |     3,506 
           |     80.35       9.95       9.70 |    100.00 
-----------+---------------------------------+----------
    40-<50 |     2,678        289        345 |     3,312 
           |     80.86       8.73      10.42 |    100.00 
-----------+---------------------------------+----------
    50-<60 |     2,777        336        336 |     3,449 
           |     80.52       9.74       9.74 |    100.00 
-----------+---------------------------------+----------
    60-<70 |     2,317        289        284 |     2,890 
           |     80.17      10.00       9.83 |    100.00 
-----------+---------------------------------+----------
    70-<80 |     1,779        215        255 |     2,249 
           |     79.10       9.56      11.34 |    100.00 
-----------+---------------------------------+----------
       80+ |       959        126        125 |     1,210 
           |     79.26      10.41      10.33 |    100.00 
-----------+---------------------------------+----------
     Total |    16,564      2,005      2,064 |    20,633 
           |     80.28       9.72      10.00 |    100.00 

. safetab agegroup imd,           row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Index of Multiple Deprivation
   Grouped |              (IMD)
       age | 1 least d          4  5 most de |     Total
-----------+---------------------------------+----------
    18-<30 |     2,837        789        391 |     4,017 
           |     70.62      19.64       9.73 |    100.00 
-----------+---------------------------------+----------
    30-<40 |     2,448        686        372 |     3,506 
           |     69.82      19.57      10.61 |    100.00 
-----------+---------------------------------+----------
    40-<50 |     2,328        634        350 |     3,312 
           |     70.29      19.14      10.57 |    100.00 
-----------+---------------------------------+----------
    50-<60 |     2,400        700        349 |     3,449 
           |     69.59      20.30      10.12 |    100.00 
-----------+---------------------------------+----------
    60-<70 |     2,045        574        271 |     2,890 
           |     70.76      19.86       9.38 |    100.00 
-----------+---------------------------------+----------
    70-<80 |     1,582        455        212 |     2,249 
           |     70.34      20.23       9.43 |    100.00 
-----------+---------------------------------+----------
       80+ |       867        237        106 |     1,210 
           |     71.65      19.59       8.76 |    100.00 
-----------+---------------------------------+----------
     Total |    14,507      4,075      2,051 |    20,633 
           |     70.31      19.75       9.94 |    100.00 

. safetab agegroup shield,    row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Probable shielding
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       643      3,374 |     4,017 
           |     16.01      83.99 |    100.00 
-----------+----------------------+----------
    30-<40 |       550      2,956 |     3,506 
           |     15.69      84.31 |    100.00 
-----------+----------------------+----------
    40-<50 |       474      2,838 |     3,312 
           |     14.31      85.69 |    100.00 
-----------+----------------------+----------
    50-<60 |       522      2,927 |     3,449 
           |     15.13      84.87 |    100.00 
-----------+----------------------+----------
    60-<70 |       480      2,410 |     2,890 
           |     16.61      83.39 |    100.00 
-----------+----------------------+----------
    70-<80 |       348      1,901 |     2,249 
           |     15.47      84.53 |    100.00 
-----------+----------------------+----------
       80+ |       177      1,033 |     1,210 
           |     14.63      85.37 |    100.00 
-----------+----------------------+----------
     Total |     3,194     17,439 |    20,633 
           |     15.48      84.52 |    100.00 

. 
. safetab bmicat smoke,            row   
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |          Smoking status
         Grouped BMI |     Never     Former    Current |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |        84         36        223 |       343 
                     |     24.49      10.50      65.01 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |       186         93        556 |       835 
                     |     22.28      11.14      66.59 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |       142         88        462 |       692 
                     |     20.52      12.72      66.76 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |       129         68        344 |       541 
                     |     23.84      12.57      63.59 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |        77         33        194 |       304 
                     |     25.33      10.86      63.82 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |        36         18        142 |       196 
                     |     18.37       9.18      72.45 |    100.00 
---------------------+---------------------------------+----------
               Total |       654        336      1,921 |     2,911 
                     |     22.47      11.54      65.99 |    100.00 

. safetab bmicat ethnicity,        row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |            Ethnicity
         Grouped BMI |     White  Asian or       Other |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |     1,537        193        220 |     1,950 
                     |     78.82       9.90      11.28 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |     3,672        445        484 |     4,601 
                     |     79.81       9.67      10.52 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |     2,871        349        370 |     3,590 
                     |     79.97       9.72      10.31 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |     2,343        260        265 |     2,868 
                     |     81.69       9.07       9.24 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |     1,422        171        175 |     1,768 
                     |     80.43       9.67       9.90 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |       907        115        111 |     1,133 
                     |     80.05      10.15       9.80 |    100.00 
---------------------+---------------------------------+----------
               Total |    12,752      1,533      1,625 |    15,910 
                     |     80.15       9.64      10.21 |    100.00 

. safetab bmicat imd,              row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Index of Multiple Deprivation
                     |              (IMD)
         Grouped BMI | 1 least d          4  5 most de |     Total
---------------------+---------------------------------+----------
 Underweight (<18.5) |     1,370        394        186 |     1,950 
                     |     70.26      20.21       9.54 |    100.00 
---------------------+---------------------------------+----------
  Normal (18.5-24.9) |     3,245        887        469 |     4,601 
                     |     70.53      19.28      10.19 |    100.00 
---------------------+---------------------------------+----------
Overweight (25-29.9) |     2,536        707        347 |     3,590 
                     |     70.64      19.69       9.67 |    100.00 
---------------------+---------------------------------+----------
   Obese I (30-34.9) |     1,991        584        293 |     2,868 
                     |     69.42      20.36      10.22 |    100.00 
---------------------+---------------------------------+----------
  Obese II (35-39.9) |     1,212        371        185 |     1,768 
                     |     68.55      20.98      10.46 |    100.00 
---------------------+---------------------------------+----------
     Obese III (40+) |       810        222        101 |     1,133 
                     |     71.49      19.59       8.91 |    100.00 
---------------------+---------------------------------+----------
               Total |    11,164      3,165      1,581 |    15,910 
                     |     70.17      19.89       9.94 |    100.00 

. safetab bmicat hypertension, row 
20

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |       Diagnosed
                     |     hypertension
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     1,562        388 |     1,950 
                     |     80.10      19.90 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     3,635        966 |     4,601 
                     |     79.00      21.00 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     2,915        675 |     3,590 
                     |     81.20      18.80 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |     2,286        582 |     2,868 
                     |     79.71      20.29 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,422        346 |     1,768 
                     |     80.43      19.57 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |       891        242 |     1,133 
                     |     78.64      21.36 |    100.00 
---------------------+----------------------+----------
               Total |    12,711      3,199 |    15,910 
                     |     79.89      20.11 |    100.00 

. safetab bmicat shield,    row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Probable shielding
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       312      1,638 |     1,950 
                     |     16.00      84.00 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       724      3,877 |     4,601 
                     |     15.74      84.26 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |       543      3,047 |     3,590 
                     |     15.13      84.87 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |       470      2,398 |     2,868 
                     |     16.39      83.61 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |       261      1,507 |     1,768 
                     |     14.76      85.24 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |       145        988 |     1,133 
                     |     12.80      87.20 |    100.00 
---------------------+----------------------+----------
               Total |     2,455     13,455 |    15,910 
                     |     15.43      84.57 |    100.00 

. 
.                             
. safetab smoke ethnicity,        row 
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |            Ethnicity
      status |     White  Asian or       Other |     Total
-------------+---------------------------------+----------
       Never |       676         80         80 |       836 
             |     80.86       9.57       9.57 |    100.00 
-------------+---------------------------------+----------
      Former |       348         41         37 |       426 
             |     81.69       9.62       8.69 |    100.00 
-------------+---------------------------------+----------
     Current |     2,018        238        242 |     2,498 
             |     80.78       9.53       9.69 |    100.00 
-------------+---------------------------------+----------
       Total |     3,042        359        359 |     3,760 
             |     80.90       9.55       9.55 |    100.00 

. safetab smoke imd,                      row 
10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Index of Multiple Deprivation
     Smoking |              (IMD)
      status | 1 least d          4  5 most de |     Total
-------------+---------------------------------+----------
       Never |       584        162         90 |       836 
             |     69.86      19.38      10.77 |    100.00 
-------------+---------------------------------+----------
      Former |       304         84         38 |       426 
             |     71.36      19.72       8.92 |    100.00 
-------------+---------------------------------+----------
     Current |     1,777        462        259 |     2,498 
             |     71.14      18.49      10.37 |    100.00 
-------------+---------------------------------+----------
       Total |     2,665        708        387 |     3,760 
             |     70.88      18.83      10.29 |    100.00 

. safetab smoke hypertension, row 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       677        159 |       836 
             |     80.98      19.02 |    100.00 
-------------+----------------------+----------
      Former |       349         77 |       426 
             |     81.92      18.08 |    100.00 
-------------+----------------------+----------
     Current |     1,985        513 |     2,498 
             |     79.46      20.54 |    100.00 
-------------+----------------------+----------
       Total |     3,011        749 |     3,760 
             |     80.08      19.92 |    100.00 

. safetab smoke shield,    row 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Probable shielding
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       123        713 |       836 
             |     14.71      85.29 |    100.00 
-------------+----------------------+----------
      Former |        55        371 |       426 
             |     12.91      87.09 |    100.00 
-------------+----------------------+----------
     Current |       374      2,124 |     2,498 
             |     14.97      85.03 |    100.00 
-------------+----------------------+----------
       Total |       552      3,208 |     3,760 
             |     14.68      85.32 |    100.00 

.                       
. safetab ethnicity imd,          row 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                      |  Index of Multiple Deprivation
                      |              (IMD)
            Ethnicity | 1 least d          4  5 most de |     Total
----------------------+---------------------------------+----------
                White |    11,628      3,276      1,660 |    16,564 
                      |     70.20      19.78      10.02 |    100.00 
----------------------+---------------------------------+----------
Asian or Asian Britis |     1,401        402        202 |     2,005 
                      |     69.88      20.05      10.07 |    100.00 
----------------------+---------------------------------+----------
                Other |     1,478        397        189 |     2,064 
                      |     71.61      19.23       9.16 |    100.00 
----------------------+---------------------------------+----------
                Total |    14,507      4,075      2,051 |    20,633 
                      |     70.31      19.75       9.94 |    100.00 

. safetab shield imd,             row 
11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Index of Multiple Deprivation
  Probable |              (IMD)
 shielding | 1 least d          4  5 most de |     Total
-----------+---------------------------------+----------
         0 |     2,243        627        324 |     3,194 
           |     70.23      19.63      10.14 |    100.00 
-----------+---------------------------------+----------
         1 |    12,264      3,448      1,727 |    17,439 
           |     70.33      19.77       9.90 |    100.00 
-----------+---------------------------------+----------
     Total |    14,507      4,075      2,051 |    20,633 
           |     70.31      19.75       9.94 |    100.00 

. 
. safetab shield ethnicity,               row 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Probable |            Ethnicity
 shielding |     White  Asian or       Other |     Total
-----------+---------------------------------+----------
         0 |     2,566        342        286 |     3,194 
           |     80.34      10.71       8.95 |    100.00 
-----------+---------------------------------+----------
         1 |    13,998      1,663      1,778 |    17,439 
           |     80.27       9.54      10.20 |    100.00 
-----------+---------------------------------+----------
     Total |    16,564      2,005      2,064 |    20,633 
           |     80.28       9.72      10.00 |    100.00 

. 
. 
. 
. * Relationships with age
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>                    ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension            ///          
>    
>                                                                              
>    {
  2. 
.                 
.         safetab agegroup `var', row 
  3.  }
16

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |    Asthma category
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,689        328 |     4,017 
           |     91.83       8.17 |    100.00 
-----------+----------------------+----------
    30-<40 |     3,241        265 |     3,506 
           |     92.44       7.56 |    100.00 
-----------+----------------------+----------
    40-<50 |     3,077        235 |     3,312 
           |     92.90       7.10 |    100.00 
-----------+----------------------+----------
    50-<60 |     3,185        264 |     3,449 
           |     92.35       7.65 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,653        237 |     2,890 
           |     91.80       8.20 |    100.00 
-----------+----------------------+----------
    70-<80 |     2,049        200 |     2,249 
           |     91.11       8.89 |    100.00 
-----------+----------------------+----------
       80+ |     1,119         91 |     1,210 
           |     92.48       7.52 |    100.00 
-----------+----------------------+----------
     Total |    19,013      1,620 |    20,633 
           |     92.15       7.85 |    100.00 
37

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,280        737 |     4,017 
           |     81.65      18.35 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,781        725 |     3,506 
           |     79.32      20.68 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,623        689 |     3,312 
           |     79.20      20.80 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,753        696 |     3,449 
           |     79.82      20.18 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,282        608 |     2,890 
           |     78.96      21.04 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,800        449 |     2,249 
           |     80.04      19.96 |    100.00 
-----------+----------------------+----------
       80+ |       962        248 |     1,210 
           |     79.50      20.50 |    100.00 
-----------+----------------------+----------
     Total |    16,481      4,152 |    20,633 
           |     79.88      20.12 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
   Grouped |       Diseases
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,232        785 |     4,017 
           |     80.46      19.54 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,778        728 |     3,506 
           |     79.24      20.76 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,674        638 |     3,312 
           |     80.74      19.26 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,792        657 |     3,449 
           |     80.95      19.05 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,294        596 |     2,890 
           |     79.38      20.62 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,774        475 |     2,249 
           |     78.88      21.12 |    100.00 
-----------+----------------------+----------
       80+ |       963        247 |     1,210 
           |     79.59      20.41 |    100.00 
-----------+----------------------+----------
     Total |    16,507      4,126 |    20,633 
           |     80.00      20.00 |    100.00 
17

**TABLE OF agegroup diabcat REDACTED DUE TO SMALL N**

31

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Chronic liver disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,198        819 |     4,017 
           |     79.61      20.39 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,777        729 |     3,506 
           |     79.21      20.79 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,711        601 |     3,312 
           |     81.85      18.15 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,780        669 |     3,449 
           |     80.60      19.40 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,281        609 |     2,890 
           |     78.93      21.07 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,804        445 |     2,249 
           |     80.21      19.79 |    100.00 
-----------+----------------------+----------
       80+ |       966        244 |     1,210 
           |     79.83      20.17 |    100.00 
-----------+----------------------+----------
     Total |    16,517      4,116 |    20,633 
           |     80.05      19.95 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped | Neurological disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,189        828 |     4,017 
           |     79.39      20.61 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,791        715 |     3,506 
           |     79.61      20.39 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,665        647 |     3,312 
           |     80.46      19.54 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,767        682 |     3,449 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,314        576 |     2,890 
           |     80.07      19.93 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,778        471 |     2,249 
           |     79.06      20.94 |    100.00 
-----------+----------------------+----------
       80+ |       986        224 |     1,210 
           |     81.49      18.51 |    100.00 
-----------+----------------------+----------
     Total |    16,490      4,143 |    20,633 
           |     79.92      20.08 |    100.00 
25

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Stroke or dementia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,200        817 |     4,017 
           |     79.66      20.34 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,802        704 |     3,506 
           |     79.92      20.08 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,707        605 |     3,312 
           |     81.73      18.27 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,746        703 |     3,449 
           |     79.62      20.38 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,323        567 |     2,890 
           |     80.38      19.62 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,799        450 |     2,249 
           |     79.99      20.01 |    100.00 
-----------+----------------------+----------
       80+ |       952        258 |     1,210 
           |     78.68      21.32 |    100.00 
-----------+----------------------+----------
     Total |    16,529      4,104 |    20,633 
           |     80.11      19.89 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Autoimmune disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,195        822 |     4,017 
           |     79.54      20.46 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,817        689 |     3,506 
           |     80.35      19.65 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,647        665 |     3,312 
           |     79.92      20.08 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,737        712 |     3,449 
           |     79.36      20.64 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,311        579 |     2,890 
           |     79.97      20.03 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,800        449 |     2,249 
           |     80.04      19.96 |    100.00 
-----------+----------------------+----------
       80+ |       978        232 |     1,210 
           |     80.83      19.17 |    100.00 
-----------+----------------------+----------
     Total |    16,485      4,148 |    20,633 
           |     79.90      20.10 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
   Grouped |      algorithm)
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,235        782 |     4,017 
           |     80.53      19.47 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,807        699 |     3,506 
           |     80.06      19.94 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,646        666 |     3,312 
           |     79.89      20.11 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,776        673 |     3,449 
           |     80.49      19.51 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,309        581 |     2,890 
           |     79.90      20.10 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,783        466 |     2,249 
           |     79.28      20.72 |    100.00 
-----------+----------------------+----------
       80+ |       966        244 |     1,210 
           |     79.83      20.17 |    100.00 
-----------+----------------------+----------
     Total |    16,522      4,111 |    20,633 
           |     80.08      19.92 |    100.00 
26

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
   Grouped |      transplant
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,168        849 |     4,017 
           |     78.86      21.14 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,819        687 |     3,506 
           |     80.41      19.59 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,634        678 |     3,312 
           |     79.53      20.47 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,752        697 |     3,449 
           |     79.79      20.21 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,292        598 |     2,890 
           |     79.31      20.69 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,789        460 |     2,249 
           |     79.55      20.45 |    100.00 
-----------+----------------------+----------
       80+ |       977        233 |     1,210 
           |     80.74      19.26 |    100.00 
-----------+----------------------+----------
     Total |    16,431      4,202 |    20,633 
           |     79.63      20.37 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |       Asplenia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,197        820 |     4,017 
           |     79.59      20.41 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,762        744 |     3,506 
           |     78.78      21.22 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,650        662 |     3,312 
           |     80.01      19.99 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,767        682 |     3,449 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,301        589 |     2,890 
           |     79.62      20.38 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,835        414 |     2,249 
           |     81.59      18.41 |    100.00 
-----------+----------------------+----------
       80+ |       939        271 |     1,210 
           |     77.60      22.40 |    100.00 
-----------+----------------------+----------
     Total |    16,451      4,182 |    20,633 
           |     79.73      20.27 |    100.00 
27

**TABLE OF agegroup cancer_exhaem_cat REDACTED DUE TO SMALL N**

25

**TABLE OF agegroup cancer_haem_cat REDACTED DUE TO SMALL N**

37

**TABLE OF agegroup reduced_kidney_function_cat REDACTED DUE TO SMALL N**

14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
   Grouped |        disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     2,575      1,442 |     4,017 
           |     64.10      35.90 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,266      1,240 |     3,506 
           |     64.63      35.37 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,106      1,206 |     3,312 
           |     63.59      36.41 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,218      1,231 |     3,449 
           |     64.31      35.69 |    100.00 
-----------+----------------------+----------
    60-<70 |     1,892        998 |     2,890 
           |     65.47      34.53 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,426        823 |     2,249 
           |     63.41      36.59 |    100.00 
-----------+----------------------+----------
       80+ |       789        421 |     1,210 
           |     65.21      34.79 |    100.00 
-----------+----------------------+----------
     Total |    13,272      7,361 |    20,633 
           |     64.32      35.68 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
   Grouped |     hypertension
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     3,242        775 |     4,017 
           |     80.71      19.29 |    100.00 
-----------+----------------------+----------
    30-<40 |     2,768        738 |     3,506 
           |     78.95      21.05 |    100.00 
-----------+----------------------+----------
    40-<50 |     2,666        646 |     3,312 
           |     80.50      19.50 |    100.00 
-----------+----------------------+----------
    50-<60 |     2,747        702 |     3,449 
           |     79.65      20.35 |    100.00 
-----------+----------------------+----------
    60-<70 |     2,282        608 |     2,890 
           |     78.96      21.04 |    100.00 
-----------+----------------------+----------
    70-<80 |     1,834        415 |     2,249 
           |     81.55      18.45 |    100.00 
-----------+----------------------+----------
       80+ |       979        231 |     1,210 
           |     80.91      19.09 |    100.00 
-----------+----------------------+----------
     Total |    16,518      4,115 |    20,633 
           |     80.06      19.94 |    100.00 

. 
. 
. *Relationships with sex
. foreach var of varlist asthma                                           ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                     /// 
>    
>                                                                              
>    {
  2.                                                 
.         safetab male `var', row 
  3. }
12

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Asthma category
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,727        840 |    10,567 
           |     92.05       7.95 |    100.00 
-----------+----------------------+----------
         1 |     9,286        780 |    10,066 
           |     92.25       7.75 |    100.00 
-----------+----------------------+----------
     Total |    19,013      1,620 |    20,633 
           |     92.15       7.85 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Chronic Respiratory
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,467      2,100 |    10,567 
           |     80.13      19.87 |    100.00 
-----------+----------------------+----------
         1 |     8,014      2,052 |    10,066 
           |     79.61      20.39 |    100.00 
-----------+----------------------+----------
     Total |    16,481      4,152 |    20,633 
           |     79.88      20.12 |    100.00 
29

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Chronic Cardiac
           |       Diseases
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,476      2,091 |    10,567 
           |     80.21      19.79 |    100.00 
-----------+----------------------+----------
         1 |     8,031      2,035 |    10,066 
           |     79.78      20.22 |    100.00 
-----------+----------------------+----------
     Total |    16,507      4,126 |    20,633 
           |     80.00      20.00 |    100.00 
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |                        Diabetes
      Male | No diabet  T1DM, con  T1DM, unc  T2DM, con  T2DM, unc |     Total
-----------+-------------------------------------------------------+----------
         0 |     8,070        281         64      1,747        393 |    10,567 
           |     76.37       2.66       0.61      16.53       3.72 |    100.00 
-----------+-------------------------------------------------------+----------
         1 |     7,727        260         44      1,628        395 |    10,066 
           |     76.76       2.58       0.44      16.17       3.92 |    100.00 
-----------+-------------------------------------------------------+----------
     Total |    15,797        541        108      3,375        788 |    20,633 
           |     76.56       2.62       0.52      16.36       3.82 |    100.00 


           |  Diabetes
      Male | Diabetes, |     Total
-----------+-----------+----------
         0 |        12 |    10,567 
           |      0.11 |    100.00 
-----------+-----------+----------
         1 |        12 |    10,066 
           |      0.12 |    100.00 
-----------+-----------+----------
     Total |        24 |    20,633 
           |      0.12 |    100.00 
27

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Chronic liver disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,496      2,071 |    10,567 
           |     80.40      19.60 |    100.00 
-----------+----------------------+----------
         1 |     8,021      2,045 |    10,066 
           |     79.68      20.32 |    100.00 
-----------+----------------------+----------
     Total |    16,517      4,116 |    20,633 
           |     80.05      19.95 |    100.00 
17

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Neurological disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,410      2,157 |    10,567 
           |     79.59      20.41 |    100.00 
-----------+----------------------+----------
         1 |     8,080      1,986 |    10,066 
           |     80.27      19.73 |    100.00 
-----------+----------------------+----------
     Total |    16,490      4,143 |    20,633 
           |     79.92      20.08 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Stroke or dementia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,476      2,091 |    10,567 
           |     80.21      19.79 |    100.00 
-----------+----------------------+----------
         1 |     8,053      2,013 |    10,066 
           |     80.00      20.00 |    100.00 
-----------+----------------------+----------
     Total |    16,529      4,104 |    20,633 
           |     80.11      19.89 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Autoimmune disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,446      2,121 |    10,567 
           |     79.93      20.07 |    100.00 
-----------+----------------------+----------
         1 |     8,039      2,027 |    10,066 
           |     79.86      20.14 |    100.00 
-----------+----------------------+----------
     Total |    16,485      4,148 |    20,633 
           |     79.90      20.10 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Immunosuppressed
           |     (combination
           |      algorithm)
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,440      2,127 |    10,567 
           |     79.87      20.13 |    100.00 
-----------+----------------------+----------
         1 |     8,082      1,984 |    10,066 
           |     80.29      19.71 |    100.00 
-----------+----------------------+----------
     Total |    16,522      4,111 |    20,633 
           |     80.08      19.92 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Other solid organ
           |      transplant
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,436      2,131 |    10,567 
           |     79.83      20.17 |    100.00 
-----------+----------------------+----------
         1 |     7,995      2,071 |    10,066 
           |     79.43      20.57 |    100.00 
-----------+----------------------+----------
     Total |    16,431      4,202 |    20,633 
           |     79.63      20.37 |    100.00 
14

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Asplenia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,431      2,136 |    10,567 
           |     79.79      20.21 |    100.00 
-----------+----------------------+----------
         1 |     8,020      2,046 |    10,066 
           |     79.67      20.33 |    100.00 
-----------+----------------------+----------
     Total |    16,451      4,182 |    20,633 
           |     79.73      20.27 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |          Non-haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 |     8,501         29        166      1,871 |    10,567 
           |     80.45       0.27       1.57      17.71 |    100.00 
-----------+--------------------------------------------+----------
         1 |     8,098         37        166      1,765 |    10,066 
           |     80.45       0.37       1.65      17.53 |    100.00 
-----------+--------------------------------------------+----------
     Total |    16,599         66        332      3,636 |    20,633 
           |     80.45       0.32       1.61      17.62 |    100.00 
21

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |            Haematological cancer
      Male |     Never  Last year  2-5 years   5+ years |     Total
-----------+--------------------------------------------+----------
         0 |     8,525         34        156      1,852 |    10,567 
           |     80.68       0.32       1.48      17.53 |    100.00 
-----------+--------------------------------------------+----------
         1 |     8,040         48        167      1,811 |    10,066 
           |     79.87       0.48       1.66      17.99 |    100.00 
-----------+--------------------------------------------+----------
     Total |    16,565         82        323      3,663 |    20,633 
           |     80.28       0.40       1.57      17.75 |    100.00 
33

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Reduced kidney
           |       function
      Male |      None  Stage 3a/ |     Total
-----------+----------------------+----------
         0 |    10,327        240 |    10,567 
           |     97.73       2.27 |    100.00 
-----------+----------------------+----------
         1 |    10,058          8 |    10,066 
           |     99.92       0.08 |    100.00 
-----------+----------------------+----------
     Total |    20,385        248 |    20,633 
           |     98.80       1.20 |    100.00 
10

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    End-stage renal
           |        disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,787      3,780 |    10,567 
           |     64.23      35.77 |    100.00 
-----------+----------------------+----------
         1 |     6,485      3,581 |    10,066 
           |     64.42      35.58 |    100.00 
-----------+----------------------+----------
     Total |    13,272      7,361 |    20,633 
           |     64.32      35.68 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diagnosed
           |     hypertension
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,427      2,140 |    10,567 
           |     79.75      20.25 |    100.00 
-----------+----------------------+----------
         1 |     8,091      1,975 |    10,066 
           |     80.38      19.62 |    100.00 
-----------+----------------------+----------
     Total |    16,518      4,115 |    20,633 
           |     80.06      19.94 |    100.00 

. 
. *Relationships with smoking
. foreach var of varlist  asthma                                          ///
>                                         chronic_respiratory_disease     ///
>                                         chronic_cardiac_disease         ///
>                                         diabcat                              
>            ///
>                                         chronic_liver_disease           ///
>                                         other_neuro                     ///
>                                         stroke_dementia ///
>                                         ra_sle_psoriasis                     
>            ///
>                                         other_immuno                         
>    ///
>                                         other_transplant                     
>    /// 
>                                         asplenia                        /// 
>                                         cancer_exhaem_cat                    
>                            ///
>                                         cancer_haem_cat                      
>                            ///
>                                         reduced_kidney_function_cat ///
>                                         esrd                                 
>    ///
>                                         hypertension                         
>    ///
>                                         {
  2.         
.         safetab smoke `var', row 
  3. }
13

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |    Asthma category
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       773         63 |       836 
             |     92.46       7.54 |    100.00 
-------------+----------------------+----------
      Former |       399         27 |       426 
             |     93.66       6.34 |    100.00 
-------------+----------------------+----------
     Current |     2,293        205 |     2,498 
             |     91.79       8.21 |    100.00 
-------------+----------------------+----------
       Total |     3,465        295 |     3,760 
             |     92.15       7.85 |    100.00 
34

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Chronic Respiratory
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       658        178 |       836 
             |     78.71      21.29 |    100.00 
-------------+----------------------+----------
      Former |       333         93 |       426 
             |     78.17      21.83 |    100.00 
-------------+----------------------+----------
     Current |     1,999        499 |     2,498 
             |     80.02      19.98 |    100.00 
-------------+----------------------+----------
       Total |     2,990        770 |     3,760 
             |     79.52      20.48 |    100.00 
30

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    Chronic Cardiac
     Smoking |       Diseases
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       664        172 |       836 
             |     79.43      20.57 |    100.00 
-------------+----------------------+----------
      Former |       347         79 |       426 
             |     81.46      18.54 |    100.00 
-------------+----------------------+----------
     Current |     1,965        533 |     2,498 
             |     78.66      21.34 |    100.00 
-------------+----------------------+----------
       Total |     2,976        784 |     3,760 
             |     79.15      20.85 |    100.00 
14

**TABLE OF smoke diabcat REDACTED DUE TO SMALL N**

28

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Chronic liver disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       640        196 |       836 
             |     76.56      23.44 |    100.00 
-------------+----------------------+----------
      Former |       338         88 |       426 
             |     79.34      20.66 |    100.00 
-------------+----------------------+----------
     Current |     2,019        479 |     2,498 
             |     80.82      19.18 |    100.00 
-------------+----------------------+----------
       Total |     2,997        763 |     3,760 
             |     79.71      20.29 |    100.00 
18

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking | Neurological disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       682        154 |       836 
             |     81.58      18.42 |    100.00 
-------------+----------------------+----------
      Former |       346         80 |       426 
             |     81.22      18.78 |    100.00 
-------------+----------------------+----------
     Current |     1,976        522 |     2,498 
             |     79.10      20.90 |    100.00 
-------------+----------------------+----------
       Total |     3,004        756 |     3,760 
             |     79.89      20.11 |    100.00 
22

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Stroke or dementia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       684        152 |       836 
             |     81.82      18.18 |    100.00 
-------------+----------------------+----------
      Former |       343         83 |       426 
             |     80.52      19.48 |    100.00 
-------------+----------------------+----------
     Current |     1,990        508 |     2,498 
             |     79.66      20.34 |    100.00 
-------------+----------------------+----------
       Total |     3,017        743 |     3,760 
             |     80.24      19.76 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Autoimmune disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       655        181 |       836 
             |     78.35      21.65 |    100.00 
-------------+----------------------+----------
      Former |       341         85 |       426 
             |     80.05      19.95 |    100.00 
-------------+----------------------+----------
     Current |     1,969        529 |     2,498 
             |     78.82      21.18 |    100.00 
-------------+----------------------+----------
       Total |     2,965        795 |     3,760 
             |     78.86      21.14 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Immunosuppressed
             |     (combination
     Smoking |      algorithm)
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       669        167 |       836 
             |     80.02      19.98 |    100.00 
-------------+----------------------+----------
      Former |       319        107 |       426 
             |     74.88      25.12 |    100.00 
-------------+----------------------+----------
     Current |     1,998        500 |     2,498 
             |     79.98      20.02 |    100.00 
-------------+----------------------+----------
       Total |     2,986        774 |     3,760 
             |     79.41      20.59 |    100.00 
23

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Other solid organ
     Smoking |      transplant
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       658        178 |       836 
             |     78.71      21.29 |    100.00 
-------------+----------------------+----------
      Former |       330         96 |       426 
             |     77.46      22.54 |    100.00 
-------------+----------------------+----------
     Current |     2,018        480 |     2,498 
             |     80.78      19.22 |    100.00 
-------------+----------------------+----------
       Total |     3,006        754 |     3,760 
             |     79.95      20.05 |    100.00 
15

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |       Asplenia
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       656        180 |       836 
             |     78.47      21.53 |    100.00 
-------------+----------------------+----------
      Former |       360         66 |       426 
             |     84.51      15.49 |    100.00 
-------------+----------------------+----------
     Current |     1,980        518 |     2,498 
             |     79.26      20.74 |    100.00 
-------------+----------------------+----------
       Total |     2,996        764 |     3,760 
             |     79.68      20.32 |    100.00 
24

**TABLE OF smoke cancer_exhaem_cat REDACTED DUE TO SMALL N**

22

**TABLE OF smoke cancer_haem_cat REDACTED DUE TO SMALL N**

34

**TABLE OF smoke reduced_kidney_function_cat REDACTED DUE TO SMALL N**

11

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |    End-stage renal
     Smoking |        disease
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       548        288 |       836 
             |     65.55      34.45 |    100.00 
-------------+----------------------+----------
      Former |       276        150 |       426 
             |     64.79      35.21 |    100.00 
-------------+----------------------+----------
     Current |     1,627        871 |     2,498 
             |     65.13      34.87 |    100.00 
-------------+----------------------+----------
       Total |     2,451      1,309 |     3,760 
             |     65.19      34.81 |    100.00 
19

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |       Diagnosed
     Smoking |     hypertension
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       677        159 |       836 
             |     80.98      19.02 |    100.00 
-------------+----------------------+----------
      Former |       349         77 |       426 
             |     81.92      18.08 |    100.00 
-------------+----------------------+----------
     Current |     1,985        513 |     2,498 
             |     79.46      20.54 |    100.00 
-------------+----------------------+----------
       Total |     3,011        749 |     3,760 
             |     80.08      19.92 |    100.00 

. 
. 
. /* SENSE CHECK OUTCOMES======================================================
> =*/
. 
. safetab covid_death covid_icu  , row col
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |   Failure/censoring
  outcome: |     indicator for
     covid |  outcome: covid icu
     death |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,325      8,613 |    10,938 
           |     21.26      78.74 |    100.00 
           |     52.36      53.19 |     53.01 
-----------+----------------------+----------
         1 |     2,115      7,580 |     9,695 
           |     21.82      78.18 |    100.00 
           |     47.64      46.81 |     46.99 
-----------+----------------------+----------
     Total |     4,440     16,193 |    20,633 
           |     21.52      78.48 |    100.00 
           |    100.00     100.00 |    100.00 

. 
. safecount if covid_icu==1 & covid_death==1
  7,580

. safecount if covidadmission==1 & covid_death==1
  1,059

. 
. sum positive_SGSS

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S |     20,633    .1657539    .3718686          0          1

. sum positive_SGSS if date_positive_SGSS<=22267

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
positive_S~S |          0

. 
. safetab positive_SGSS covid_primary_care_codes, row col miss
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |  Indicator positive
 Indicator |   primary care code
  positive |    COVID infection
covid test |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,106     16,107 |    17,213 
           |      6.43      93.57 |    100.00 
           |     81.68      83.55 |     83.42 
-----------+----------------------+----------
         1 |       248      3,172 |     3,420 
           |      7.25      92.75 |    100.00 
           |     18.32      16.45 |     16.58 
-----------+----------------------+----------
     Total |     1,354     19,279 |    20,633 
           |      6.56      93.44 |    100.00 
           |    100.00     100.00 |    100.00 

. safetab positive_SGSS covid_primary_care_codes if date_positive_SGSS<=22267 &
>  date_covid_primary_care_codes<=22267, row col miss
107
no observations

. gen diff=date_positive_SGSS-date_covid_primary_care_codes 
(17,461 missing values generated)

. sum diff, d

                            diff
-------------------------------------------------------------
      Percentiles      Smallest
 1%          -67           -198
 5%          -22           -143
10%           -1           -139       Obs               3,172
25%           44           -130       Sum of Wgt.       3,172

50%          122                      Mean           121.3376
                        Largest       Std. Dev.      93.57084
75%          199            300
90%          248            300       Variance       8755.502
95%          267            301       Skewness      -.0582934
99%          290            303       Kurtosis       2.044855

. 
. tab reported if kids_cat4!=0 & age<=65

      Reported |
     Infection |
        Source |      Freq.     Percent        Cum.
---------------+-----------------------------------
          SGSS |     14,682       99.47       99.47
     test_code |         28        0.19       99.66
 sequalae_code |         20        0.14       99.80
diagnosis_code |         30        0.20      100.00
---------------+-----------------------------------
         Total |     14,760      100.00

. tab reported if kids_cat4==0 & age<=65

      Reported |
     Infection |
        Source |      Freq.     Percent        Cum.
---------------+-----------------------------------
          SGSS |        414       99.52       99.52
     test_code |          1        0.24       99.76
 sequalae_code |          1        0.24      100.00
---------------+-----------------------------------
         Total |        416      100.00

. 
. 
. /* DEATHS by STP=======================================================*/
. tab  stp covid_death, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,058        992 |     2,050 
           |      9.67      10.23 |      9.94 
-----------+----------------------+----------
         2 |     1,113      1,017 |     2,130 
           |     10.18      10.49 |     10.32 
-----------+----------------------+----------
         3 |     1,141        959 |     2,100 
           |     10.43       9.89 |     10.18 
-----------+----------------------+----------
         4 |     1,072        970 |     2,042 
           |      9.80      10.01 |      9.90 
-----------+----------------------+----------
         5 |     1,083        943 |     2,026 
           |      9.90       9.73 |      9.82 
-----------+----------------------+----------
         6 |     1,112        927 |     2,039 
           |     10.17       9.56 |      9.88 
-----------+----------------------+----------
         7 |     1,093      1,020 |     2,113 
           |      9.99      10.52 |     10.24 
-----------+----------------------+----------
         8 |     1,127        916 |     2,043 
           |     10.30       9.45 |      9.90 
-----------+----------------------+----------
         9 |     1,048        982 |     2,030 
           |      9.58      10.13 |      9.84 
-----------+----------------------+----------
        10 |     1,091        969 |     2,060 
           |      9.97       9.99 |      9.98 
-----------+----------------------+----------
     Total |    10,938      9,695 |    20,633 
           |    100.00     100.00 |    100.00 

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/02_an_data_checks.log
  log type:  text
 closed on:  28 Oct 2021, 11:14:39
-------------------------------------------------------------------------------
