-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/03a_an_descriptive_tables.log
  log type:  text
 opened on:  24 Jul 2021, 18:04:51

. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  3. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. safetab htdiag_or_highbp, m
 16. safetab imd 
 17. safetab imd, m
 18. safetab ethnicity
 19. safetab ethnicity, m
 20. safetab stp
 21. safetab tot_adults_hh
 22. safetab household_size
 23. safetab household_size imd, col chi
 24. 
. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat   ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 25.                                                 
. safetab `var'
 26. }
 27. safetab shield
 28. 
. 
. *Exposure 
. foreach var in kids_cat4 gp_number_kids {
 29. safetab `var'
 30. }
 31. 
. * Outcomes
. foreach var in  non_covid_death  ///
>  covid_tpp_prob {
 32. safetab `var'
 33. }
 34. 
. 
. * Outcomes by exposure
. foreach var in non_covid_death  ///
>  covid_tpp_prob {
 35. safetab `var'
 36. safetab `var' kids_cat4, col row
 37. safetab `var' gp_number_kids, col row
 38. 
. }
 39. 
. 
. **********************************
. *  Number (%) with each exposure  *
. **********************************
. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    kids_cat4, col
 40.         safetab male                                                      
>       kids_cat4, col
 41.         safetab bmicat                                                    
>       kids_cat4, col m 
 42.         safetab smoke                                                     
>       kids_cat4, col m
 43.         safetab obese4cat                                                 
>       kids_cat4, col m 
 44.         safetab shield                                                    
>       kids_cat4, col m 
 45.         safetab tot_adults_hh                                           ki
> ds_cat4, col m 
 46.         safetab household_size                                          ki
> ds_cat4, col m 
 47.         safetab imd                                                       
>       kids_cat4, col m
 48.         safetab ethnicity                                                 
>       kids_cat4, col m
 49.         safetab stp                                                       
>       kids_cat4, col
 50.         
.         
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 51.         safetab `var'           kids_cat4, col
 52. }
 53.         
. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     16,007    41.25964    13.54105         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |      3,965       24.77       24.77
     30-<40 |      3,520       21.99       46.76
     40-<50 |      3,287       20.53       67.30
     50-<60 |      3,568       22.29       89.59
     60-<70 |      1,667       10.41      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,007      100.00      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,101       50.61       50.61
          1 |      7,906       49.39      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,442       11.70       11.70
  Normal (18.5-24.9) |      3,566       28.94       40.64
Overweight (25-29.9) |      2,851       23.14       63.78
   Obese I (30-34.9) |      2,220       18.02       81.80
  Obese II (35-39.9) |      1,372       11.13       92.93
     Obese III (40+) |        871        7.07      100.00
---------------------+-----------------------------------
               Total |     12,322      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,442        9.01        9.01
  Normal (18.5-24.9) |      3,566       22.28       31.29
Overweight (25-29.9) |      2,851       17.81       49.10
   Obese I (30-34.9) |      2,220       13.87       62.97
  Obese II (35-39.9) |      1,372        8.57       71.54
     Obese III (40+) |        871        5.44       76.98
        Unknown (.u) |      3,685       23.02      100.00
---------------------+-----------------------------------
               Total |     16,007      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     11,544       72.12       72.12
   Obese I (30-34.9) |      2,220       13.87       85.99
  Obese II (35-39.9) |      1,372        8.57       94.56
     Obese III (40+) |        871        5.44      100.00
---------------------+-----------------------------------
               Total |     16,007      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        642       22.16       22.16
      Former |        301       10.39       32.55
     Current |      1,954       67.45      100.00
-------------+-----------------------------------
       Total |      2,897      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        642        4.01        4.01
      Former |        301        1.88        5.89
     Current |      1,954       12.21       18.10
Unknown (.u) |     13,110       81.90      100.00
-------------+-----------------------------------
       Total |     16,007      100.00
0

**TABLE OF bpcat REDACTED DUE TO SMALL N**

6

**TABLE OF bpcat REDACTED DUE TO SMALL N**

0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,287        8.04        8.04
          1 |     14,720       91.96      100.00
------------+-----------------------------------
      Total |     16,007      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,287        8.04        8.04
          1 |     14,720       91.96      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,158       69.71       69.71
               4 |      3,243       20.26       89.97
 5 most deprived |      1,606       10.03      100.00
-----------------+-----------------------------------
           Total |     16,007      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,158       69.71       69.71
               4 |      3,243       20.26       89.97
 5 most deprived |      1,606       10.03      100.00
-----------------+-----------------------------------
           Total |     16,007      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,869       80.40       80.40
Asian or Asian British |      1,556        9.72       90.12
                 Other |      1,582        9.88      100.00
-----------------------+-----------------------------------
                 Total |     16,007      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,869       80.40       80.40
Asian or Asian British |      1,556        9.72       90.12
                 Other |      1,582        9.88      100.00
-----------------------+-----------------------------------
                 Total |     16,007      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,644       10.27       10.27
          2 |      1,575        9.84       20.11
          3 |      1,549        9.68       29.79
          4 |      1,630       10.18       39.97
          5 |      1,607       10.04       50.01
          6 |      1,643       10.26       60.27
          7 |      1,607       10.04       70.31
          8 |      1,576        9.85       80.16
          9 |      1,605       10.03       90.19
         10 |      1,571        9.81      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         85        0.53        0.53
          2 |        114        0.71        1.24
          3 |     15,808       98.76      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

**TABLE OF household_size REDACTED DUE TO SMALL N**

19

**TABLE OF household_size imd REDACTED DUE TO SMALL N**

0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,820       80.09       80.09
          1 |      3,187       19.91      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,720       91.96       91.96
          1 |      1,287        8.04      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,870       80.40       80.40
          1 |      3,137       19.60      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     12,359       77.21       77.21
  T1DM, controlled |        407        2.54       79.75
T1DM, uncontrolled |         81        0.51       80.26
  T2DM, controlled |      2,605       16.27       96.53
T2DM, uncontrolled |        545        3.40       99.94
Diabetes, no HbA1c |         10        0.06      100.00
-------------------+-----------------------------------
             Total |     16,007      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     12,938       80.83       80.83
    Last year |         61        0.38       81.21
2-5 years ago |        266        1.66       82.87
     5+ years |      2,742       17.13      100.00
--------------+-----------------------------------
        Total |     16,007      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     12,916       80.69       80.69
    Last year |         55        0.34       81.03
2-5 years ago |        231        1.44       82.48
     5+ years |      2,805       17.52      100.00
--------------+-----------------------------------
        Total |     16,007      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,815       80.06       80.06
          1 |      3,192       19.94      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,831       80.16       80.16
          1 |      3,176       19.84      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,814       80.05       80.05
          1 |      3,193       19.95      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,812       80.04       80.04
          1 |      3,195       19.96      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,817       80.07       80.07
          1 |      3,190       19.93      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,832       80.16       80.16
          1 |      3,175       19.84      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         45 |         65        0.43        0.43
         60 |     15,080       99.57      100.00
------------+-----------------------------------
      Total |     15,145      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |     15,942       99.59       99.59
Stage 3a/3b egfr 30-60       |         65        0.41      100.00
-----------------------------+-----------------------------------
                       Total |     16,007      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,181       63.60       63.60
          1 |      5,826       36.40      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,833       80.17       80.17
          1 |      3,174       19.83      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,857       80.32       80.32
          1 |      3,150       19.68      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,504       15.64       15.64
          1 |     13,503       84.36      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

 Exposure (v2) |
   with 4-cats |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        405        2.53        2.53
only <12 years |      1,561        9.75       12.28
    only 12-18 |        273        1.71       13.99
         mixed |     13,768       86.01      100.00
---------------+-----------------------------------
         Total |     16,007      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |        424       27.16       27.16
 2 children <12 |        284       18.19       45.36
 3 children <12 |        279       17.87       63.23
4+ children <12 |        574       36.77      100.00
----------------+-----------------------------------
          Total |      1,561      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,981       68.60       68.60
          1 |      5,026       31.40      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,098        6.86        6.86
          1 |     14,909       93.14      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,981       68.60       68.60
          1 |      5,026       31.40      100.00
------------+-----------------------------------
      Total |     16,007      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |          Exposure (v2) with 4-cats
     death |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       278      1,096        178      9,429 |    10,981 
           |      2.53       9.98       1.62      85.87 |    100.00 
           |     68.64      70.21      65.20      68.48 |     68.60 
-----------+--------------------------------------------+----------
         1 |       127        465         95      4,339 |     5,026 
           |      2.53       9.25       1.89      86.33 |    100.00 
           |     31.36      29.79      34.80      31.52 |     31.40 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |      2.53       9.75       1.71      86.01 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |      Number kids under 12 years in hh
     death | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |       293        195        198        410 |     1,096 
           |     26.73      17.79      18.07      37.41 |    100.00 
           |     69.10      68.66      70.97      71.43 |     70.21 
-----------+--------------------------------------------+----------
         1 |       131         89         81        164 |       465 
           |     28.17      19.14      17.42      35.27 |    100.00 
           |     30.90      31.34      29.03      28.57 |     29.79 
-----------+--------------------------------------------+----------
     Total |       424        284        279        574 |     1,561 
           |     27.16      18.19      17.87      36.77 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,098        6.86        6.86
          1 |     14,909       93.14      100.00
------------+-----------------------------------
      Total |     16,007      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |          Exposure (v2) with 4-cats
      case |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        36        115         21        926 |     1,098 
           |      3.28      10.47       1.91      84.34 |    100.00 
           |      8.89       7.37       7.69       6.73 |      6.86 
-----------+--------------------------------------------+----------
         1 |       369      1,446        252     12,842 |    14,909 
           |      2.48       9.70       1.69      86.14 |    100.00 
           |     91.11      92.63      92.31      93.27 |     93.14 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |      2.53       9.75       1.71      86.01 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |      Number kids under 12 years in hh
      case | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |        30         19         18         48 |       115 
           |     26.09      16.52      15.65      41.74 |    100.00 
           |      7.08       6.69       6.45       8.36 |      7.37 
-----------+--------------------------------------------+----------
         1 |       394        265        261        526 |     1,446 
           |     27.25      18.33      18.05      36.38 |    100.00 
           |     92.92      93.31      93.55      91.64 |     92.63 
-----------+--------------------------------------------+----------
     Total |       424        284        279        574 |     1,561 
           |     27.16      18.19      17.87      36.77 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |          Exposure (v2) with 4-cats
       age |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
    18-<30 |        97        403         59      3,406 |     3,965 
           |     23.95      25.82      21.61      24.74 |     24.77 
-----------+--------------------------------------------+----------
    30-<40 |        86        346         75      3,013 |     3,520 
           |     21.23      22.17      27.47      21.88 |     21.99 
-----------+--------------------------------------------+----------
    40-<50 |        91        315         60      2,821 |     3,287 
           |     22.47      20.18      21.98      20.49 |     20.53 
-----------+--------------------------------------------+----------
    50-<60 |        83        348         45      3,092 |     3,568 
           |     20.49      22.29      16.48      22.46 |     22.29 
-----------+--------------------------------------------+----------
    60-<70 |        48        149         34      1,436 |     1,667 
           |     11.85       9.55      12.45      10.43 |     10.41 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
      Male |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       198        781        133      6,989 |     8,101 
           |     48.89      50.03      48.72      50.76 |     50.61 
-----------+--------------------------------------------+----------
         1 |       207        780        140      6,779 |     7,906 
           |     51.11      49.97      51.28      49.24 |     49.39 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |          Exposure (v2) with 4-cats
         Grouped BMI |      none  only <12   only 12-1      mixed |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |        36        143         18      1,245 |     1,442 
                     |      8.89       9.16       6.59       9.04 |      9.01 
---------------------+--------------------------------------------+----------
  Normal (18.5-24.9) |        89        358         67      3,052 |     3,566 
                     |     21.98      22.93      24.54      22.17 |     22.28 
---------------------+--------------------------------------------+----------
Overweight (25-29.9) |        56        280         43      2,472 |     2,851 
                     |     13.83      17.94      15.75      17.95 |     17.81 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |        69        219         35      1,897 |     2,220 
                     |     17.04      14.03      12.82      13.78 |     13.87 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |        33        130         27      1,182 |     1,372 
                     |      8.15       8.33       9.89       8.59 |      8.57 
---------------------+--------------------------------------------+----------
     Obese III (40+) |        22         82         17        750 |       871 
                     |      5.43       5.25       6.23       5.45 |      5.44 
---------------------+--------------------------------------------+----------
        Unknown (.u) |       100        349         66      3,170 |     3,685 
                     |     24.69      22.36      24.18      23.02 |     23.02 
---------------------+--------------------------------------------+----------
               Total |       405      1,561        273     13,768 |    16,007 
                     |    100.00     100.00     100.00     100.00 |    100.00 
16

**TABLE OF smoke kids_cat4 REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Evidence of obesity |          Exposure (v2) with 4-cats
      (4 categories) |      none  only <12   only 12-1      mixed |     Total
---------------------+--------------------------------------------+----------
No record of obesity |       281      1,130        194      9,939 |    11,544 
                     |     69.38      72.39      71.06      72.19 |     72.12 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |        69        219         35      1,897 |     2,220 
                     |     17.04      14.03      12.82      13.78 |     13.87 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |        33        130         27      1,182 |     1,372 
                     |      8.15       8.33       9.89       8.59 |      8.57 
---------------------+--------------------------------------------+----------
     Obese III (40+) |        22         82         17        750 |       871 
                     |      5.43       5.25       6.23       5.45 |      5.44 
---------------------+--------------------------------------------+----------
               Total |       405      1,561        273     13,768 |    16,007 
                     |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Probable |          Exposure (v2) with 4-cats
 shielding |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        52        257         36      2,159 |     2,504 
           |     12.84      16.46      13.19      15.68 |     15.64 
-----------+--------------------------------------------+----------
         1 |       353      1,304        237     11,609 |    13,503 
           |     87.16      83.54      86.81      84.32 |     84.36 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
24

**TABLE OF tot_adults_hh kids_cat4 REDACTED DUE TO SMALL N**

25

**TABLE OF household_size kids_cat4 REDACTED DUE TO SMALL N**

14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation |          Exposure (v2) with 4-cats
           (IMD) |      none  only <12   only 12-1      mixed |     Total
-----------------+--------------------------------------------+----------
1 least deprived |       275      1,085        192      9,606 |    11,158 
                 |     67.90      69.51      70.33      69.77 |     69.71 
-----------------+--------------------------------------------+----------
               4 |        89        317         56      2,781 |     3,243 
                 |     21.98      20.31      20.51      20.20 |     20.26 
-----------------+--------------------------------------------+----------
 5 most deprived |        41        159         25      1,381 |     1,606 
                 |     10.12      10.19       9.16      10.03 |     10.03 
-----------------+--------------------------------------------+----------
           Total |       405      1,561        273     13,768 |    16,007 
                 |    100.00     100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |          Exposure (v2) with 4-cats
            Ethnicity |      none  only <12   only 12-1      mixed |     Total
----------------------+--------------------------------------------+----------
                White |       328      1,241        225     11,075 |    12,869 
                      |     80.99      79.50      82.42      80.44 |     80.40 
----------------------+--------------------------------------------+----------
Asian or Asian Britis |        31        149         18      1,358 |     1,556 
                      |      7.65       9.55       6.59       9.86 |      9.72 
----------------------+--------------------------------------------+----------
                Other |        46        171         30      1,335 |     1,582 
                      |     11.36      10.95      10.99       9.70 |      9.88 
----------------------+--------------------------------------------+----------
                Total |       405      1,561        273     13,768 |    16,007 
                      |    100.00     100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |
      tion |
Partnershi |          Exposure (v2) with 4-cats
         p |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         1 |        38        157         24      1,425 |     1,644 
           |      9.38      10.06       8.79      10.35 |     10.27 
-----------+--------------------------------------------+----------
         2 |        44        168         29      1,334 |     1,575 
           |     10.86      10.76      10.62       9.69 |      9.84 
-----------+--------------------------------------------+----------
         3 |        51        128         27      1,343 |     1,549 
           |     12.59       8.20       9.89       9.75 |      9.68 
-----------+--------------------------------------------+----------
         4 |        40        168         29      1,393 |     1,630 
           |      9.88      10.76      10.62      10.12 |     10.18 
-----------+--------------------------------------------+----------
         5 |        33        159         33      1,382 |     1,607 
           |      8.15      10.19      12.09      10.04 |     10.04 
-----------+--------------------------------------------+----------
         6 |        31        153         27      1,432 |     1,643 
           |      7.65       9.80       9.89      10.40 |     10.26 
-----------+--------------------------------------------+----------
         7 |        43        155         20      1,389 |     1,607 
           |     10.62       9.93       7.33      10.09 |     10.04 
-----------+--------------------------------------------+----------
         8 |        36        153         30      1,357 |     1,576 
           |      8.89       9.80      10.99       9.86 |      9.85 
-----------+--------------------------------------------+----------
         9 |        45        168         32      1,360 |     1,605 
           |     11.11      10.76      11.72       9.88 |     10.03 
-----------+--------------------------------------------+----------
        10 |        44        152         22      1,353 |     1,571 
           |     10.86       9.74       8.06       9.83 |      9.81 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator |          Exposure (v2) with 4-cats
y Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       312      1,262        211     11,035 |    12,820 
           |     77.04      80.85      77.29      80.15 |     80.09 
-----------+--------------------------------------------+----------
         1 |        93        299         62      2,733 |     3,187 
           |     22.96      19.15      22.71      19.85 |     19.91 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Asthma |          Exposure (v2) with 4-cats
  category |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       366      1,438        247     12,669 |    14,720 
           |     90.37      92.12      90.48      92.02 |     91.96 
-----------+--------------------------------------------+----------
         1 |        39        123         26      1,099 |     1,287 
           |      9.63       7.88       9.52       7.98 |      8.04 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac |          Exposure (v2) with 4-cats
  Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       331      1,271        222     11,046 |    12,870 
           |     81.73      81.42      81.32      80.23 |     80.40 
-----------+--------------------------------------------+----------
         1 |        74        290         51      2,722 |     3,137 
           |     18.27      18.58      18.68      19.77 |     19.60 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
18

**TABLE OF diabcat kids_cat4 REDACTED DUE TO SMALL N**

28

**TABLE OF cancer_exhaem_cat kids_cat4 REDACTED DUE TO SMALL N**

26

**TABLE OF cancer_haem_cat kids_cat4 REDACTED DUE TO SMALL N**

23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |
        on |          Exposure (v2) with 4-cats
algorithm) |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       327      1,270        220     10,998 |    12,815 
           |     80.74      81.36      80.59      79.88 |     80.06 
-----------+--------------------------------------------+----------
         1 |        78        291         53      2,770 |     3,192 
           |     19.26      18.64      19.41      20.12 |     19.94 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |
     organ |          Exposure (v2) with 4-cats
transplant |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       334      1,241        219     11,037 |    12,831 
           |     82.47      79.50      80.22      80.16 |     80.16 
-----------+--------------------------------------------+----------
         1 |        71        320         54      2,731 |     3,176 
           |     17.53      20.50      19.78      19.84 |     19.84 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
  Asplenia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       313      1,263        217     11,021 |    12,814 
           |     77.28      80.91      79.49      80.05 |     80.05 
-----------+--------------------------------------------+----------
         1 |        92        298         56      2,747 |     3,193 
           |     22.72      19.09      20.51      19.95 |     19.95 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       333      1,241        221     11,017 |    12,812 
           |     82.22      79.50      80.95      80.02 |     80.04 
-----------+--------------------------------------------+----------
         1 |        72        320         52      2,751 |     3,195 
           |     17.78      20.50      19.05      19.98 |     19.96 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic |          Exposure (v2) with 4-cats
al disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       327      1,270        236     10,984 |    12,817 
           |     80.74      81.36      86.45      79.78 |     80.07 
-----------+--------------------------------------------+----------
         1 |        78        291         37      2,784 |     3,190 
           |     19.26      18.64      13.55      20.22 |     19.93 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Stroke or |          Exposure (v2) with 4-cats
  dementia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       323      1,256        218     11,035 |    12,832 
           |     79.75      80.46      79.85      80.15 |     80.16 
-----------+--------------------------------------------+----------
         1 |        82        305         55      2,733 |     3,175 
           |     20.25      19.54      20.15      19.85 |     19.84 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

**TABLE OF egfr_cat kids_cat4 REDACTED DUE TO SMALL N**

34

**TABLE OF reduced_kidney_function kids_cat4 REDACTED DUE TO SMALL N**

15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |
     renal |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       256        995        172      8,758 |    10,181 
           |     63.21      63.74      63.00      63.61 |     63.60 
-----------+--------------------------------------------+----------
         1 |       149        566        101      5,010 |     5,826 
           |     36.79      36.26      37.00      36.39 |     36.40 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |
hypertensi |          Exposure (v2) with 4-cats
        on |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       319      1,261        221     11,032 |    12,833 
           |     78.77      80.78      80.95      80.13 |     80.17 
-----------+--------------------------------------------+----------
         1 |        86        300         52      2,736 |     3,174 
           |     21.23      19.22      19.05      19.87 |     19.83 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       330      1,251        209     11,067 |    12,857 
           |     81.48      80.14      76.56      80.38 |     80.32 
-----------+--------------------------------------------+----------
         1 |        75        310         64      2,701 |     3,150 
           |     18.52      19.86      23.44      19.62 |     19.68 
-----------+--------------------------------------------+----------
     Total |       405      1,561        273     13,768 |    16,007 
           |    100.00     100.00     100.00     100.00 |    100.00 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      4,605    75.76743    7.569486         66        108
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |      1,105       24.00       24.00
     70-<80 |      2,193       47.62       71.62
        80+ |      1,307       28.38      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        298        6.47        6.47
          1 |      4,307       93.53      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,355       51.14       51.14
          1 |      2,250       48.86      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        456       12.50       12.50
  Normal (18.5-24.9) |      1,012       27.74       40.24
Overweight (25-29.9) |        814       22.31       62.55
   Obese I (30-34.9) |        651       17.85       80.40
  Obese II (35-39.9) |        420       11.51       91.91
     Obese III (40+) |        295        8.09      100.00
---------------------+-----------------------------------
               Total |      3,648      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        456        9.90        9.90
  Normal (18.5-24.9) |      1,012       21.98       31.88
Overweight (25-29.9) |        814       17.68       49.55
   Obese I (30-34.9) |        651       14.14       63.69
  Obese II (35-39.9) |        420        9.12       72.81
     Obese III (40+) |        295        6.41       79.22
        Unknown (.u) |        957       20.78      100.00
---------------------+-----------------------------------
               Total |      4,605      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |      3,239       70.34       70.34
   Obese I (30-34.9) |        651       14.14       84.47
  Obese II (35-39.9) |        420        9.12       93.59
     Obese III (40+) |        295        6.41      100.00
---------------------+-----------------------------------
               Total |      4,605      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        174       21.75       21.75
      Former |        101       12.62       34.38
     Current |        525       65.62      100.00
-------------+-----------------------------------
       Total |        800      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        174        3.78        3.78
      Former |        101        2.19        5.97
     Current |        525       11.40       17.37
Unknown (.u) |      3,805       82.63      100.00
-------------+-----------------------------------
       Total |      4,605      100.00
0

**TABLE OF bpcat REDACTED DUE TO SMALL N**

6

**TABLE OF bpcat REDACTED DUE TO SMALL N**

0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        361        7.84        7.84
          1 |      4,244       92.16      100.00
------------+-----------------------------------
      Total |      4,605      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        361        7.84        7.84
          1 |      4,244       92.16      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,237       70.29       70.29
               4 |        916       19.89       90.18
 5 most deprived |        452        9.82      100.00
-----------------+-----------------------------------
           Total |      4,605      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,237       70.29       70.29
               4 |        916       19.89       90.18
 5 most deprived |        452        9.82      100.00
-----------------+-----------------------------------
           Total |      4,605      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,621       78.63       78.63
Asian or Asian British |        493       10.71       89.34
                 Other |        491       10.66      100.00
-----------------------+-----------------------------------
                 Total |      4,605      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,621       78.63       78.63
Asian or Asian British |        493       10.71       89.34
                 Other |        491       10.66      100.00
-----------------------+-----------------------------------
                 Total |      4,605      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        456        9.90        9.90
          2 |        450        9.77       19.67
          3 |        493       10.71       30.38
          4 |        435        9.45       39.83
          5 |        451        9.79       49.62
          6 |        450        9.77       59.39
          7 |        433        9.40       68.79
          8 |        480       10.42       79.22
          9 |        470       10.21       89.42
         10 |        487       10.58      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         31        0.67        0.67
          2 |         39        0.85        1.52
          3 |      4,535       98.48      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

**TABLE OF household_size REDACTED DUE TO SMALL N**

19

**TABLE OF household_size imd REDACTED DUE TO SMALL N**

0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,672       79.74       79.74
          1 |        933       20.26      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,231       91.88       91.88
          1 |        374        8.12      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,692       80.17       80.17
          1 |        913       19.83      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

**TABLE OF diabcat REDACTED DUE TO SMALL N**

0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,651       79.28       79.28
    Last year |         18        0.39       79.67
2-5 years ago |         82        1.78       81.45
     5+ years |        854       18.55      100.00
--------------+-----------------------------------
        Total |      4,605      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,671       79.72       79.72
    Last year |         29        0.63       80.35
2-5 years ago |         73        1.59       81.93
     5+ years |        832       18.07      100.00
--------------+-----------------------------------
        Total |      4,605      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,676       79.83       79.83
          1 |        929       20.17      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,678       79.87       79.87
          1 |        927       20.13      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,697       80.28       80.28
          1 |        908       19.72      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,710       80.56       80.56
          1 |        895       19.44      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,674       79.78       79.78
          1 |        931       20.22      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,695       80.24       80.24
          1 |        910       19.76      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         30 |          6        0.14        0.14
         45 |        194        4.44        4.58
         60 |      4,167       95.42      100.00
------------+-----------------------------------
      Total |      4,367      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |      4,405       95.66       95.66
Stage 3a/3b egfr 30-60       |        200        4.34      100.00
-----------------------------+-----------------------------------
                       Total |      4,605      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,980       64.71       64.71
          1 |      1,625       35.29      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,660       79.48       79.48
          1 |        945       20.52      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,673       79.76       79.76
          1 |        932       20.24      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        708       15.37       15.37
          1 |      3,897       84.63      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

 Exposure (v2) |
   with 4-cats |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        143        3.11        3.11
only <12 years |        455        9.88       12.99
    only 12-18 |         85        1.85       14.83
         mixed |      3,922       85.17      100.00
---------------+-----------------------------------
         Total |      4,605      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |        136       29.89       29.89
 2 children <12 |         76       16.70       46.59
 3 children <12 |         74       16.26       62.86
4+ children <12 |        169       37.14      100.00
----------------+-----------------------------------
          Total |        455      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,220       69.92       69.92
          1 |      1,385       30.08      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        334        7.25        7.25
          1 |      4,271       92.75      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,220       69.92       69.92
          1 |      1,385       30.08      100.00
------------+-----------------------------------
      Total |      4,605      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |          Exposure (v2) with 4-cats
     death |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        95        302         55      2,768 |     3,220 
           |      2.95       9.38       1.71      85.96 |    100.00 
           |     66.43      66.37      64.71      70.58 |     69.92 
-----------+--------------------------------------------+----------
         1 |        48        153         30      1,154 |     1,385 
           |      3.47      11.05       2.17      83.32 |    100.00 
           |     33.57      33.63      35.29      29.42 |     30.08 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |      3.11       9.88       1.85      85.17 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |      Number kids under 12 years in hh
     death | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |       100         49         53        100 |       302 
           |     33.11      16.23      17.55      33.11 |    100.00 
           |     73.53      64.47      71.62      59.17 |     66.37 
-----------+--------------------------------------------+----------
         1 |        36         27         21         69 |       153 
           |     23.53      17.65      13.73      45.10 |    100.00 
           |     26.47      35.53      28.38      40.83 |     33.63 
-----------+--------------------------------------------+----------
     Total |       136         76         74        169 |       455 
           |     29.89      16.70      16.26      37.14 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        334        7.25        7.25
          1 |      4,271       92.75      100.00
------------+-----------------------------------
      Total |      4,605      100.00
25

**TABLE OF covid_tpp_prob kids_cat4 REDACTED DUE TO SMALL N**

30

**TABLE OF covid_tpp_prob gp_number_kids REDACTED DUE TO SMALL N**

19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |          Exposure (v2) with 4-cats
       age |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
    60-<70 |        33        117         16        939 |     1,105 
           |     23.08      25.71      18.82      23.94 |     24.00 
-----------+--------------------------------------------+----------
    70-<80 |        65        217         50      1,861 |     2,193 
           |     45.45      47.69      58.82      47.45 |     47.62 
-----------+--------------------------------------------+----------
       80+ |        45        121         19      1,122 |     1,307 
           |     31.47      26.59      22.35      28.61 |     28.38 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
      Male |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        77        233         42      2,003 |     2,355 
           |     53.85      51.21      49.41      51.07 |     51.14 
-----------+--------------------------------------------+----------
         1 |        66        222         43      1,919 |     2,250 
           |     46.15      48.79      50.59      48.93 |     48.86 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

**TABLE OF bmicat kids_cat4 REDACTED DUE TO SMALL N**

16

**TABLE OF smoke kids_cat4 REDACTED DUE TO SMALL N**

20

**TABLE OF obese4cat kids_cat4 REDACTED DUE TO SMALL N**

17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Probable |          Exposure (v2) with 4-cats
 shielding |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        22         74         16        596 |       708 
           |     15.38      16.26      18.82      15.20 |     15.37 
-----------+--------------------------------------------+----------
         1 |       121        381         69      3,326 |     3,897 
           |     84.62      83.74      81.18      84.80 |     84.63 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
24

**TABLE OF tot_adults_hh kids_cat4 REDACTED DUE TO SMALL N**

25

**TABLE OF household_size kids_cat4 REDACTED DUE TO SMALL N**

14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation |          Exposure (v2) with 4-cats
           (IMD) |      none  only <12   only 12-1      mixed |     Total
-----------------+--------------------------------------------+----------
1 least deprived |        94        309         57      2,777 |     3,237 
                 |     65.73      67.91      67.06      70.81 |     70.29 
-----------------+--------------------------------------------+----------
               4 |        39         92         19        766 |       916 
                 |     27.27      20.22      22.35      19.53 |     19.89 
-----------------+--------------------------------------------+----------
 5 most deprived |        10         54          9        379 |       452 
                 |      6.99      11.87      10.59       9.66 |      9.82 
-----------------+--------------------------------------------+----------
           Total |       143        455         85      3,922 |     4,605 
                 |    100.00     100.00     100.00     100.00 |    100.00 
20

**TABLE OF ethnicity kids_cat4 REDACTED DUE TO SMALL N**

14

**TABLE OF stp kids_cat4 REDACTED DUE TO SMALL N**

38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator |          Exposure (v2) with 4-cats
y Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       106        353         65      3,148 |     3,672 
           |     74.13      77.58      76.47      80.27 |     79.74 
-----------+--------------------------------------------+----------
         1 |        37        102         20        774 |       933 
           |     25.87      22.42      23.53      19.73 |     20.26 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Asthma |          Exposure (v2) with 4-cats
  category |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       137        428         78      3,588 |     4,231 
           |     95.80      94.07      91.76      91.48 |     91.88 
-----------+--------------------------------------------+----------
         1 |         6         27          7        334 |       374 
           |      4.20       5.93       8.24       8.52 |      8.12 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac |          Exposure (v2) with 4-cats
  Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       110        355         66      3,161 |     3,692 
           |     76.92      78.02      77.65      80.60 |     80.17 
-----------+--------------------------------------------+----------
         1 |        33        100         19        761 |       913 
           |     23.08      21.98      22.35      19.40 |     19.83 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
18

**TABLE OF diabcat kids_cat4 REDACTED DUE TO SMALL N**

28

**TABLE OF cancer_exhaem_cat kids_cat4 REDACTED DUE TO SMALL N**

26

**TABLE OF cancer_haem_cat kids_cat4 REDACTED DUE TO SMALL N**

23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |
        on |          Exposure (v2) with 4-cats
algorithm) |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       110        363         64      3,139 |     3,676 
           |     76.92      79.78      75.29      80.04 |     79.83 
-----------+--------------------------------------------+----------
         1 |        33         92         21        783 |       929 
           |     23.08      20.22      24.71      19.96 |     20.17 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |
     organ |          Exposure (v2) with 4-cats
transplant |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       113        345         71      3,149 |     3,678 
           |     79.02      75.82      83.53      80.29 |     79.87 
-----------+--------------------------------------------+----------
         1 |        30        110         14        773 |       927 
           |     20.98      24.18      16.47      19.71 |     20.13 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
  Asplenia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       112        347         73      3,165 |     3,697 
           |     78.32      76.26      85.88      80.70 |     80.28 
-----------+--------------------------------------------+----------
         1 |        31        108         12        757 |       908 
           |     21.68      23.74      14.12      19.30 |     19.72 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       111        378         71      3,150 |     3,710 
           |     77.62      83.08      83.53      80.32 |     80.56 
-----------+--------------------------------------------+----------
         1 |        32         77         14        772 |       895 
           |     22.38      16.92      16.47      19.68 |     19.44 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic |          Exposure (v2) with 4-cats
al disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       112        368         73      3,121 |     3,674 
           |     78.32      80.88      85.88      79.58 |     79.78 
-----------+--------------------------------------------+----------
         1 |        31         87         12        801 |       931 
           |     21.68      19.12      14.12      20.42 |     20.22 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Stroke or |          Exposure (v2) with 4-cats
  dementia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       112        357         71      3,155 |     3,695 
           |     78.32      78.46      83.53      80.44 |     80.24 
-----------+--------------------------------------------+----------
         1 |        31         98         14        767 |       910 
           |     21.68      21.54      16.47      19.56 |     19.76 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

**TABLE OF egfr_cat kids_cat4 REDACTED DUE TO SMALL N**

34

**TABLE OF reduced_kidney_function kids_cat4 REDACTED DUE TO SMALL N**

15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |
     renal |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        92        303         48      2,537 |     2,980 
           |     64.34      66.59      56.47      64.69 |     64.71 
-----------+--------------------------------------------+----------
         1 |        51        152         37      1,385 |     1,625 
           |     35.66      33.41      43.53      35.31 |     35.29 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |
hypertensi |          Exposure (v2) with 4-cats
        on |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       122        375         66      3,097 |     3,660 
           |     85.31      82.42      77.65      78.96 |     79.48 
-----------+--------------------------------------------+----------
         1 |        21         80         19        825 |       945 
           |     14.69      17.58      22.35      21.04 |     20.52 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       113        368         64      3,128 |     3,673 
           |     79.02      80.88      75.29      79.76 |     79.76 
-----------+--------------------------------------------+----------
         1 |        30         87         21        794 |       932 
           |     20.98      19.12      24.71      20.24 |     20.24 
-----------+--------------------------------------------+----------
     Total |       143        455         85      3,922 |     4,605 
           |    100.00     100.00     100.00     100.00 |    100.00 

. * Close the log file
. log close
      name:  <unnamed>
       log:  /workspace/logs/03a_an_descriptive_tables.log
  log type:  text
 closed on:  24 Jul 2021, 18:04:57
-------------------------------------------------------------------------------
