-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/03a_an_descriptive_tables.log
  log type:  text
 opened on:  17 Aug 2021, 07:44:34

. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  3. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. safetab htdiag_or_highbp, m
 16. safetab imd 
 17. safetab imd, m
 18. safetab ethnicity
 19. safetab ethnicity, m
 20. safetab stp
 21. safetab tot_adults_hh
 22. safetab household_size
 23. safetab household_size imd, col chi
 24. 
. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat   ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 25.                                                 
. safetab `var'
 26. }
 27. safetab shield
 28. 
. 
. *Exposure 
. foreach var in kids_cat4 gp_number_kids {
 29. safetab `var'
 30. }
 31. 
. * Outcomes
. foreach var in  non_covid_death  ///
>  covid_tpp_prob {
 32. safetab `var'
 33. }
 34. 
. 
. * Outcomes by exposure
. foreach var in non_covid_death  ///
>  covid_tpp_prob {
 35. safetab `var'
 36. safetab `var' kids_cat4, col row
 37. safetab `var' gp_number_kids, col row
 38. 
. }
 39. 
. 
. **********************************
. *  Number (%) with each exposure  *
. **********************************
. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    kids_cat4, col
 40.         safetab male                                                      
>       kids_cat4, col
 41.         safetab bmicat                                                    
>       kids_cat4, col m 
 42.         safetab smoke                                                     
>       kids_cat4, col m
 43.         safetab obese4cat                                                 
>       kids_cat4, col m 
 44.         safetab shield                                                    
>       kids_cat4, col m 
 45.         safetab tot_adults_hh                                           ki
> ds_cat4, col m 
 46.         safetab household_size                                          ki
> ds_cat4, col m 
 47.         safetab imd                                                       
>       kids_cat4, col m
 48.         safetab ethnicity                                                 
>       kids_cat4, col m
 49.         safetab stp                                                       
>       kids_cat4, col
 50.         
.         
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 51.         safetab `var'           kids_cat4, col
 52. }
 53.         
. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     16,149    41.27191    13.49964         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |      4,031       24.96       24.96
     30-<40 |      3,419       21.17       46.13
     40-<50 |      3,488       21.60       67.73
     50-<60 |      3,539       21.91       89.65
     60-<70 |      1,672       10.35      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,149      100.00      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,309       51.45       51.45
          1 |      7,840       48.55      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,437       11.43       11.43
  Normal (18.5-24.9) |      3,654       29.06       40.48
Overweight (25-29.9) |      2,834       22.53       63.02
   Obese I (30-34.9) |      2,250       17.89       80.91
  Obese II (35-39.9) |      1,439       11.44       92.35
     Obese III (40+) |        962        7.65      100.00
---------------------+-----------------------------------
               Total |     12,576      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,437        8.90        8.90
  Normal (18.5-24.9) |      3,654       22.63       31.53
Overweight (25-29.9) |      2,834       17.55       49.07
   Obese I (30-34.9) |      2,250       13.93       63.01
  Obese II (35-39.9) |      1,439        8.91       71.92
     Obese III (40+) |        962        5.96       77.87
        Unknown (.u) |      3,573       22.13      100.00
---------------------+-----------------------------------
               Total |     16,149      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     11,498       71.20       71.20
   Obese I (30-34.9) |      2,250       13.93       85.13
  Obese II (35-39.9) |      1,439        8.91       94.04
     Obese III (40+) |        962        5.96      100.00
---------------------+-----------------------------------
               Total |     16,149      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        643       22.50       22.50
      Former |        310       10.85       33.34
     Current |      1,905       66.66      100.00
-------------+-----------------------------------
       Total |      2,858      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        643        3.98        3.98
      Former |        310        1.92        5.90
     Current |      1,905       11.80       17.70
Unknown (.u) |     13,291       82.30      100.00
-------------+-----------------------------------
       Total |     16,149      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      3,680       25.31       25.31
      Elevated |      2,456       16.89       42.20
 High, stage I |      5,845       40.20       82.39
High, stage II |      2,560       17.61      100.00
---------------+-----------------------------------
         Total |     14,541      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      3,680       22.79       22.79
      Elevated |      2,456       15.21       38.00
 High, stage I |      5,845       36.19       74.19
High, stage II |      2,560       15.85       90.04
       Unknown |      1,608        9.96      100.00
---------------+-----------------------------------
         Total |     16,149      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,845       67.16       67.16
          1 |      5,304       32.84      100.00
------------+-----------------------------------
      Total |     16,149      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,845       67.16       67.16
          1 |      5,304       32.84      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,253       69.68       69.68
               4 |      3,300       20.43       90.12
 5 most deprived |      1,596        9.88      100.00
-----------------+-----------------------------------
           Total |     16,149      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,253       69.68       69.68
               4 |      3,300       20.43       90.12
 5 most deprived |      1,596        9.88      100.00
-----------------+-----------------------------------
           Total |     16,149      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,937       80.11       80.11
Asian or Asian British |      1,556        9.64       89.75
                 Other |      1,656       10.25      100.00
-----------------------+-----------------------------------
                 Total |     16,149      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,937       80.11       80.11
Asian or Asian British |      1,556        9.64       89.75
                 Other |      1,656       10.25      100.00
-----------------------+-----------------------------------
                 Total |     16,149      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,677       10.38       10.38
          2 |      1,593        9.86       20.25
          3 |      1,600        9.91       30.16
          4 |      1,600        9.91       40.06
          5 |      1,504        9.31       49.38
          6 |      1,616       10.01       59.38
          7 |      1,621       10.04       69.42
          8 |      1,662       10.29       79.71
          9 |      1,664       10.30       90.02
         10 |      1,612        9.98      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        102        0.63        0.63
          2 |         98        0.61        1.24
          3 |     15,949       98.76      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

**TABLE OF household_size REDACTED DUE TO SMALL N**

19

**TABLE OF household_size imd REDACTED DUE TO SMALL N**

0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,928       80.05       80.05
          1 |      3,221       19.95      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,827       91.81       91.81
          1 |      1,322        8.19      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,968       80.30       80.30
          1 |      3,181       19.70      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     12,433       76.99       76.99
  T1DM, controlled |        406        2.51       79.50
T1DM, uncontrolled |         81        0.50       80.00
  T2DM, controlled |      2,629       16.28       96.28
T2DM, uncontrolled |        587        3.63       99.92
Diabetes, no HbA1c |         13        0.08      100.00
-------------------+-----------------------------------
             Total |     16,149      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     13,019       80.62       80.62
    Last year |         71        0.44       81.06
2-5 years ago |        247        1.53       82.59
     5+ years |      2,812       17.41      100.00
--------------+-----------------------------------
        Total |     16,149      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     12,956       80.23       80.23
    Last year |         69        0.43       80.66
2-5 years ago |        250        1.55       82.20
     5+ years |      2,874       17.80      100.00
--------------+-----------------------------------
        Total |     16,149      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,968       80.30       80.30
          1 |      3,181       19.70      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,860       79.63       79.63
          1 |      3,289       20.37      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,889       79.81       79.81
          1 |      3,260       20.19      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,962       80.27       80.27
          1 |      3,187       19.73      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,987       80.42       80.42
          1 |      3,162       19.58      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,888       79.81       79.81
          1 |      3,261       20.19      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

**TABLE OF egfr_cat REDACTED DUE TO SMALL N**

0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |     16,078       99.56       99.56
Stage 3a/3b egfr 30-60       |         71        0.44      100.00
-----------------------------+-----------------------------------
                       Total |     16,149      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,362       64.16       64.16
          1 |      5,787       35.84      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,895       79.85       79.85
          1 |      3,254       20.15      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,962       80.27       80.27
          1 |      3,187       19.73      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,484       15.38       15.38
          1 |     13,665       84.62      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

 Exposure (v2) |
   with 4-cats |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        473        2.93        2.93
only <12 years |      1,664       10.30       13.23
    only 12-18 |        265        1.64       14.87
         mixed |     13,747       85.13      100.00
---------------+-----------------------------------
         Total |     16,149      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |        373       22.42       22.42
 2 children <12 |        307       18.45       40.87
 3 children <12 |        227       13.64       54.51
4+ children <12 |        757       45.49      100.00
----------------+-----------------------------------
          Total |      1,664      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,647       72.12       72.12
          1 |      4,502       27.88      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,753       17.05       17.05
          1 |     13,396       82.95      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,647       72.12       72.12
          1 |      4,502       27.88      100.00
------------+-----------------------------------
      Total |     16,149      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |          Exposure (v2) with 4-cats
     death |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       342      1,211        195      9,899 |    11,647 
           |      2.94      10.40       1.67      84.99 |    100.00 
           |     72.30      72.78      73.58      72.01 |     72.12 
-----------+--------------------------------------------+----------
         1 |       131        453         70      3,848 |     4,502 
           |      2.91      10.06       1.55      85.47 |    100.00 
           |     27.70      27.22      26.42      27.99 |     27.88 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |      2.93      10.30       1.64      85.13 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |      Number kids under 12 years in hh
     death | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |       269        223        165        554 |     1,211 
           |     22.21      18.41      13.63      45.75 |    100.00 
           |     72.12      72.64      72.69      73.18 |     72.78 
-----------+--------------------------------------------+----------
         1 |       104         84         62        203 |       453 
           |     22.96      18.54      13.69      44.81 |    100.00 
           |     27.88      27.36      27.31      26.82 |     27.22 
-----------+--------------------------------------------+----------
     Total |       373        307        227        757 |     1,664 
           |     22.42      18.45      13.64      45.49 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,753       17.05       17.05
          1 |     13,396       82.95      100.00
------------+-----------------------------------
      Total |     16,149      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |          Exposure (v2) with 4-cats
      case |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        96        266         46      2,345 |     2,753 
           |      3.49       9.66       1.67      85.18 |    100.00 
           |     20.30      15.99      17.36      17.06 |     17.05 
-----------+--------------------------------------------+----------
         1 |       377      1,398        219     11,402 |    13,396 
           |      2.81      10.44       1.63      85.11 |    100.00 
           |     79.70      84.01      82.64      82.94 |     82.95 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |      2.93      10.30       1.64      85.13 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |      Number kids under 12 years in hh
      case | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |        65         54         33        114 |       266 
           |     24.44      20.30      12.41      42.86 |    100.00 
           |     17.43      17.59      14.54      15.06 |     15.99 
-----------+--------------------------------------------+----------
         1 |       308        253        194        643 |     1,398 
           |     22.03      18.10      13.88      45.99 |    100.00 
           |     82.57      82.41      85.46      84.94 |     84.01 
-----------+--------------------------------------------+----------
     Total |       373        307        227        757 |     1,664 
           |     22.42      18.45      13.64      45.49 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |          Exposure (v2) with 4-cats
       age |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
    18-<30 |       117        426         72      3,416 |     4,031 
           |     24.74      25.60      27.17      24.85 |     24.96 
-----------+--------------------------------------------+----------
    30-<40 |       101        346         55      2,917 |     3,419 
           |     21.35      20.79      20.75      21.22 |     21.17 
-----------+--------------------------------------------+----------
    40-<50 |       104        378         61      2,945 |     3,488 
           |     21.99      22.72      23.02      21.42 |     21.60 
-----------+--------------------------------------------+----------
    50-<60 |       112        350         58      3,019 |     3,539 
           |     23.68      21.03      21.89      21.96 |     21.91 
-----------+--------------------------------------------+----------
    60-<70 |        39        164         19      1,450 |     1,672 
           |      8.25       9.86       7.17      10.55 |     10.35 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
      Male |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       247        855        118      7,089 |     8,309 
           |     52.22      51.38      44.53      51.57 |     51.45 
-----------+--------------------------------------------+----------
         1 |       226        809        147      6,658 |     7,840 
           |     47.78      48.62      55.47      48.43 |     48.55 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |          Exposure (v2) with 4-cats
         Grouped BMI |      none  only <12   only 12-1      mixed |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |        46        128         24      1,239 |     1,437 
                     |      9.73       7.69       9.06       9.01 |      8.90 
---------------------+--------------------------------------------+----------
  Normal (18.5-24.9) |       121        376         49      3,108 |     3,654 
                     |     25.58      22.60      18.49      22.61 |     22.63 
---------------------+--------------------------------------------+----------
Overweight (25-29.9) |        81        275         49      2,429 |     2,834 
                     |     17.12      16.53      18.49      17.67 |     17.55 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |        59        235         38      1,918 |     2,250 
                     |     12.47      14.12      14.34      13.95 |     13.93 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |        38        154         28      1,219 |     1,439 
                     |      8.03       9.25      10.57       8.87 |      8.91 
---------------------+--------------------------------------------+----------
     Obese III (40+) |        27        112         14        809 |       962 
                     |      5.71       6.73       5.28       5.88 |      5.96 
---------------------+--------------------------------------------+----------
        Unknown (.u) |       101        384         63      3,025 |     3,573 
                     |     21.35      23.08      23.77      22.00 |     22.13 
---------------------+--------------------------------------------+----------
               Total |       473      1,664        265     13,747 |    16,149 
                     |    100.00     100.00     100.00     100.00 |    100.00 
16

**TABLE OF smoke kids_cat4 REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Evidence of obesity |          Exposure (v2) with 4-cats
      (4 categories) |      none  only <12   only 12-1      mixed |     Total
---------------------+--------------------------------------------+----------
No record of obesity |       349      1,163        185      9,801 |    11,498 
                     |     73.78      69.89      69.81      71.30 |     71.20 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |        59        235         38      1,918 |     2,250 
                     |     12.47      14.12      14.34      13.95 |     13.93 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |        38        154         28      1,219 |     1,439 
                     |      8.03       9.25      10.57       8.87 |      8.91 
---------------------+--------------------------------------------+----------
     Obese III (40+) |        27        112         14        809 |       962 
                     |      5.71       6.73       5.28       5.88 |      5.96 
---------------------+--------------------------------------------+----------
               Total |       473      1,664        265     13,747 |    16,149 
                     |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Probable |          Exposure (v2) with 4-cats
 shielding |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        57        269         38      2,120 |     2,484 
           |     12.05      16.17      14.34      15.42 |     15.38 
-----------+--------------------------------------------+----------
         1 |       416      1,395        227     11,627 |    13,665 
           |     87.95      83.83      85.66      84.58 |     84.62 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
24

**TABLE OF tot_adults_hh kids_cat4 REDACTED DUE TO SMALL N**

25

**TABLE OF household_size kids_cat4 REDACTED DUE TO SMALL N**

14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation |          Exposure (v2) with 4-cats
           (IMD) |      none  only <12   only 12-1      mixed |     Total
-----------------+--------------------------------------------+----------
1 least deprived |       330      1,141        178      9,604 |    11,253 
                 |     69.77      68.57      67.17      69.86 |     69.68 
-----------------+--------------------------------------------+----------
               4 |       102        338         53      2,807 |     3,300 
                 |     21.56      20.31      20.00      20.42 |     20.43 
-----------------+--------------------------------------------+----------
 5 most deprived |        41        185         34      1,336 |     1,596 
                 |      8.67      11.12      12.83       9.72 |      9.88 
-----------------+--------------------------------------------+----------
           Total |       473      1,664        265     13,747 |    16,149 
                 |    100.00     100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |          Exposure (v2) with 4-cats
            Ethnicity |      none  only <12   only 12-1      mixed |     Total
----------------------+--------------------------------------------+----------
                White |       375      1,342        222     10,998 |    12,937 
                      |     79.28      80.65      83.77      80.00 |     80.11 
----------------------+--------------------------------------------+----------
Asian or Asian Britis |        43        161         16      1,336 |     1,556 
                      |      9.09       9.68       6.04       9.72 |      9.64 
----------------------+--------------------------------------------+----------
                Other |        55        161         27      1,413 |     1,656 
                      |     11.63       9.68      10.19      10.28 |     10.25 
----------------------+--------------------------------------------+----------
                Total |       473      1,664        265     13,747 |    16,149 
                      |    100.00     100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |
      tion |
Partnershi |          Exposure (v2) with 4-cats
         p |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         1 |        51        170         15      1,441 |     1,677 
           |     10.78      10.22       5.66      10.48 |     10.38 
-----------+--------------------------------------------+----------
         2 |        38        183         31      1,341 |     1,593 
           |      8.03      11.00      11.70       9.75 |      9.86 
-----------+--------------------------------------------+----------
         3 |        38        156         22      1,384 |     1,600 
           |      8.03       9.38       8.30      10.07 |      9.91 
-----------+--------------------------------------------+----------
         4 |        54        159         38      1,349 |     1,600 
           |     11.42       9.56      14.34       9.81 |      9.91 
-----------+--------------------------------------------+----------
         5 |        42        150         29      1,283 |     1,504 
           |      8.88       9.01      10.94       9.33 |      9.31 
-----------+--------------------------------------------+----------
         6 |        63        170         31      1,352 |     1,616 
           |     13.32      10.22      11.70       9.83 |     10.01 
-----------+--------------------------------------------+----------
         7 |        58        164         26      1,373 |     1,621 
           |     12.26       9.86       9.81       9.99 |     10.04 
-----------+--------------------------------------------+----------
         8 |        44        164         22      1,432 |     1,662 
           |      9.30       9.86       8.30      10.42 |     10.29 
-----------+--------------------------------------------+----------
         9 |        40        166         23      1,435 |     1,664 
           |      8.46       9.98       8.68      10.44 |     10.30 
-----------+--------------------------------------------+----------
        10 |        45        182         28      1,357 |     1,612 
           |      9.51      10.94      10.57       9.87 |      9.98 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator |          Exposure (v2) with 4-cats
y Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       367      1,328        219     11,014 |    12,928 
           |     77.59      79.81      82.64      80.12 |     80.05 
-----------+--------------------------------------------+----------
         1 |       106        336         46      2,733 |     3,221 
           |     22.41      20.19      17.36      19.88 |     19.95 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Asthma |          Exposure (v2) with 4-cats
  category |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       445      1,523        235     12,624 |    14,827 
           |     94.08      91.53      88.68      91.83 |     91.81 
-----------+--------------------------------------------+----------
         1 |        28        141         30      1,123 |     1,322 
           |      5.92       8.47      11.32       8.17 |      8.19 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac |          Exposure (v2) with 4-cats
  Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       393      1,337        207     11,031 |    12,968 
           |     83.09      80.35      78.11      80.24 |     80.30 
-----------+--------------------------------------------+----------
         1 |        80        327         58      2,716 |     3,181 
           |     16.91      19.65      21.89      19.76 |     19.70 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
18

**TABLE OF diabcat kids_cat4 REDACTED DUE TO SMALL N**

28

**TABLE OF cancer_exhaem_cat kids_cat4 REDACTED DUE TO SMALL N**

26

**TABLE OF cancer_haem_cat kids_cat4 REDACTED DUE TO SMALL N**

23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |
        on |          Exposure (v2) with 4-cats
algorithm) |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       372      1,351        209     11,036 |    12,968 
           |     78.65      81.19      78.87      80.28 |     80.30 
-----------+--------------------------------------------+----------
         1 |       101        313         56      2,711 |     3,181 
           |     21.35      18.81      21.13      19.72 |     19.70 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |
     organ |          Exposure (v2) with 4-cats
transplant |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       361      1,319        212     10,968 |    12,860 
           |     76.32      79.27      80.00      79.78 |     79.63 
-----------+--------------------------------------------+----------
         1 |       112        345         53      2,779 |     3,289 
           |     23.68      20.73      20.00      20.22 |     20.37 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
  Asplenia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       367      1,306        207     11,009 |    12,889 
           |     77.59      78.49      78.11      80.08 |     79.81 
-----------+--------------------------------------------+----------
         1 |       106        358         58      2,738 |     3,260 
           |     22.41      21.51      21.89      19.92 |     20.19 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       385      1,312        198     11,067 |    12,962 
           |     81.40      78.85      74.72      80.50 |     80.27 
-----------+--------------------------------------------+----------
         1 |        88        352         67      2,680 |     3,187 
           |     18.60      21.15      25.28      19.50 |     19.73 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic |          Exposure (v2) with 4-cats
al disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       383      1,329        200     11,075 |    12,987 
           |     80.97      79.87      75.47      80.56 |     80.42 
-----------+--------------------------------------------+----------
         1 |        90        335         65      2,672 |     3,162 
           |     19.03      20.13      24.53      19.44 |     19.58 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Stroke or |          Exposure (v2) with 4-cats
  dementia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       389      1,317        212     10,970 |    12,888 
           |     82.24      79.15      80.00      79.80 |     79.81 
-----------+--------------------------------------------+----------
         1 |        84        347         53      2,777 |     3,261 
           |     17.76      20.85      20.00      20.20 |     20.19 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

**TABLE OF egfr_cat kids_cat4 REDACTED DUE TO SMALL N**

34

**TABLE OF reduced_kidney_function kids_cat4 REDACTED DUE TO SMALL N**

15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |
     renal |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       300      1,070        171      8,821 |    10,362 
           |     63.42      64.30      64.53      64.17 |     64.16 
-----------+--------------------------------------------+----------
         1 |       173        594         94      4,926 |     5,787 
           |     36.58      35.70      35.47      35.83 |     35.84 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |
hypertensi |          Exposure (v2) with 4-cats
        on |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       368      1,319        199     11,009 |    12,895 
           |     77.80      79.27      75.09      80.08 |     79.85 
-----------+--------------------------------------------+----------
         1 |       105        345         66      2,738 |     3,254 
           |     22.20      20.73      24.91      19.92 |     20.15 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       389      1,325        214     11,034 |    12,962 
           |     82.24      79.63      80.75      80.26 |     80.27 
-----------+--------------------------------------------+----------
         1 |        84        339         51      2,713 |     3,187 
           |     17.76      20.37      19.25      19.74 |     19.73 
-----------+--------------------------------------------+----------
     Total |       473      1,664        265     13,747 |    16,149 
           |    100.00     100.00     100.00     100.00 |    100.00 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      4,505    75.89034    7.540916         66        109
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |      1,038       23.04       23.04
     70-<80 |      2,160       47.95       70.99
        80+ |      1,307       29.01      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        275        6.10        6.10
          1 |      4,230       93.90      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,290       50.83       50.83
          1 |      2,215       49.17      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        458       12.79       12.79
  Normal (18.5-24.9) |      1,046       29.21       42.00
Overweight (25-29.9) |        799       22.31       64.31
   Obese I (30-34.9) |        643       17.96       82.27
  Obese II (35-39.9) |        388       10.83       93.10
     Obese III (40+) |        247        6.90      100.00
---------------------+-----------------------------------
               Total |      3,581      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        458       10.17       10.17
  Normal (18.5-24.9) |      1,046       23.22       33.39
Overweight (25-29.9) |        799       17.74       51.12
   Obese I (30-34.9) |        643       14.27       65.39
  Obese II (35-39.9) |        388        8.61       74.01
     Obese III (40+) |        247        5.48       79.49
        Unknown (.u) |        924       20.51      100.00
---------------------+-----------------------------------
               Total |      4,505      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |      3,227       71.63       71.63
   Obese I (30-34.9) |        643       14.27       85.90
  Obese II (35-39.9) |        388        8.61       94.52
     Obese III (40+) |        247        5.48      100.00
---------------------+-----------------------------------
               Total |      4,505      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        198       25.13       25.13
      Former |         88       11.17       36.29
     Current |        502       63.71      100.00
-------------+-----------------------------------
       Total |        788      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        198        4.40        4.40
      Former |         88        1.95        6.35
     Current |        502       11.14       17.49
Unknown (.u) |      3,717       82.51      100.00
-------------+-----------------------------------
       Total |      4,505      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      1,019       25.14       25.14
      Elevated |        672       16.58       41.71
 High, stage I |      1,625       40.08       81.80
High, stage II |        738       18.20      100.00
---------------+-----------------------------------
         Total |      4,054      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      1,019       22.62       22.62
      Elevated |        672       14.92       37.54
 High, stage I |      1,625       36.07       73.61
High, stage II |        738       16.38       89.99
       Unknown |        451       10.01      100.00
---------------+-----------------------------------
         Total |      4,505      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,027       67.19       67.19
          1 |      1,478       32.81      100.00
------------+-----------------------------------
      Total |      4,505      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,027       67.19       67.19
          1 |      1,478       32.81      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,120       69.26       69.26
               4 |        941       20.89       90.14
 5 most deprived |        444        9.86      100.00
-----------------+-----------------------------------
           Total |      4,505      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,120       69.26       69.26
               4 |        941       20.89       90.14
 5 most deprived |        444        9.86      100.00
-----------------+-----------------------------------
           Total |      4,505      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,599       79.89       79.89
Asian or Asian British |        465       10.32       90.21
                 Other |        441        9.79      100.00
-----------------------+-----------------------------------
                 Total |      4,505      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,599       79.89       79.89
Asian or Asian British |        465       10.32       90.21
                 Other |        441        9.79      100.00
-----------------------+-----------------------------------
                 Total |      4,505      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        455       10.10       10.10
          2 |        430        9.54       19.64
          3 |        421        9.35       28.99
          4 |        490       10.88       39.87
          5 |        475       10.54       50.41
          6 |        465       10.32       60.73
          7 |        433        9.61       70.34
          8 |        452       10.03       80.38
          9 |        443        9.83       90.21
         10 |        441        9.79      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         31        0.69        0.69
          2 |         18        0.40        1.09
          3 |      4,456       98.91      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

**TABLE OF household_size REDACTED DUE TO SMALL N**

19

**TABLE OF household_size imd REDACTED DUE TO SMALL N**

0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,585       79.58       79.58
          1 |        920       20.42      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,118       91.41       91.41
          1 |        387        8.59      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,600       79.91       79.91
          1 |        905       20.09      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

**TABLE OF diabcat REDACTED DUE TO SMALL N**

0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,613       80.20       80.20
    Last year |         19        0.42       80.62
2-5 years ago |         75        1.66       82.29
     5+ years |        798       17.71      100.00
--------------+-----------------------------------
        Total |      4,505      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,600       79.91       79.91
    Last year |         16        0.36       80.27
2-5 years ago |         71        1.58       81.84
     5+ years |        818       18.16      100.00
--------------+-----------------------------------
        Total |      4,505      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,579       79.45       79.45
          1 |        926       20.55      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,655       81.13       81.13
          1 |        850       18.87      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,591       79.71       79.71
          1 |        914       20.29      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,570       79.25       79.25
          1 |        935       20.75      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,554       78.89       78.89
          1 |        951       21.11      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,631       80.60       80.60
          1 |        874       19.40      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

**TABLE OF egfr_cat REDACTED DUE TO SMALL N**

0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |      4,347       96.49       96.49
Stage 3a/3b egfr 30-60       |        158        3.51      100.00
-----------------------------+-----------------------------------
                       Total |      4,505      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,894       64.24       64.24
          1 |      1,611       35.76      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,612       80.18       80.18
          1 |        893       19.82      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,575       79.36       79.36
          1 |        930       20.64      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        668       14.83       14.83
          1 |      3,837       85.17      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

 Exposure (v2) |
   with 4-cats |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        133        2.95        2.95
only <12 years |        490       10.88       13.83
    only 12-18 |         59        1.31       15.14
         mixed |      3,823       84.86      100.00
---------------+-----------------------------------
         Total |      4,505      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |        135       27.55       27.55
 2 children <12 |         85       17.35       44.90
 3 children <12 |         61       12.45       57.35
4+ children <12 |        209       42.65      100.00
----------------+-----------------------------------
          Total |        490      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,269       72.56       72.56
          1 |      1,236       27.44      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        768       17.05       17.05
          1 |      3,737       82.95      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,269       72.56       72.56
          1 |      1,236       27.44      100.00
------------+-----------------------------------
      Total |      4,505      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |          Exposure (v2) with 4-cats
     death |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       106        364         41      2,758 |     3,269 
           |      3.24      11.13       1.25      84.37 |    100.00 
           |     79.70      74.29      69.49      72.14 |     72.56 
-----------+--------------------------------------------+----------
         1 |        27        126         18      1,065 |     1,236 
           |      2.18      10.19       1.46      86.17 |    100.00 
           |     20.30      25.71      30.51      27.86 |     27.44 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |      2.95      10.88       1.31      84.86 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |      Number kids under 12 years in hh
     death | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |       102         62         48        152 |       364 
           |     28.02      17.03      13.19      41.76 |    100.00 
           |     75.56      72.94      78.69      72.73 |     74.29 
-----------+--------------------------------------------+----------
         1 |        33         23         13         57 |       126 
           |     26.19      18.25      10.32      45.24 |    100.00 
           |     24.44      27.06      21.31      27.27 |     25.71 
-----------+--------------------------------------------+----------
     Total |       135         85         61        209 |       490 
           |     27.55      17.35      12.45      42.65 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        768       17.05       17.05
          1 |      3,737       82.95      100.00
------------+-----------------------------------
      Total |      4,505      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |          Exposure (v2) with 4-cats
      case |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        19         86          8        655 |       768 
           |      2.47      11.20       1.04      85.29 |    100.00 
           |     14.29      17.55      13.56      17.13 |     17.05 
-----------+--------------------------------------------+----------
         1 |       114        404         51      3,168 |     3,737 
           |      3.05      10.81       1.36      84.77 |    100.00 
           |     85.71      82.45      86.44      82.87 |     82.95 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |      2.95      10.88       1.31      84.86 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |      Number kids under 12 years in hh
      case | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |        16         17         12         41 |        86 
           |     18.60      19.77      13.95      47.67 |    100.00 
           |     11.85      20.00      19.67      19.62 |     17.55 
-----------+--------------------------------------------+----------
         1 |       119         68         49        168 |       404 
           |     29.46      16.83      12.13      41.58 |    100.00 
           |     88.15      80.00      80.33      80.38 |     82.45 
-----------+--------------------------------------------+----------
     Total |       135         85         61        209 |       490 
           |     27.55      17.35      12.45      42.65 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |          Exposure (v2) with 4-cats
       age |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
    60-<70 |        31        111         13        883 |     1,038 
           |     23.31      22.65      22.03      23.10 |     23.04 
-----------+--------------------------------------------+----------
    70-<80 |        60        219         27      1,854 |     2,160 
           |     45.11      44.69      45.76      48.50 |     47.95 
-----------+--------------------------------------------+----------
       80+ |        42        160         19      1,086 |     1,307 
           |     31.58      32.65      32.20      28.41 |     29.01 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
      Male |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        63        270         24      1,933 |     2,290 
           |     47.37      55.10      40.68      50.56 |     50.83 
-----------+--------------------------------------------+----------
         1 |        70        220         35      1,890 |     2,215 
           |     52.63      44.90      59.32      49.44 |     49.17 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

**TABLE OF bmicat kids_cat4 REDACTED DUE TO SMALL N**

16

**TABLE OF smoke kids_cat4 REDACTED DUE TO SMALL N**

20

**TABLE OF obese4cat kids_cat4 REDACTED DUE TO SMALL N**

17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Probable |          Exposure (v2) with 4-cats
 shielding |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        20         64         11        573 |       668 
           |     15.04      13.06      18.64      14.99 |     14.83 
-----------+--------------------------------------------+----------
         1 |       113        426         48      3,250 |     3,837 
           |     84.96      86.94      81.36      85.01 |     85.17 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
24

**TABLE OF tot_adults_hh kids_cat4 REDACTED DUE TO SMALL N**

25

**TABLE OF household_size kids_cat4 REDACTED DUE TO SMALL N**

14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation |          Exposure (v2) with 4-cats
           (IMD) |      none  only <12   only 12-1      mixed |     Total
-----------------+--------------------------------------------+----------
1 least deprived |        86        347         47      2,640 |     3,120 
                 |     64.66      70.82      79.66      69.06 |     69.26 
-----------------+--------------------------------------------+----------
               4 |        34         99          6        802 |       941 
                 |     25.56      20.20      10.17      20.98 |     20.89 
-----------------+--------------------------------------------+----------
 5 most deprived |        13         44          6        381 |       444 
                 |      9.77       8.98      10.17       9.97 |      9.86 
-----------------+--------------------------------------------+----------
           Total |       133        490         59      3,823 |     4,505 
                 |    100.00     100.00     100.00     100.00 |    100.00 
20

**TABLE OF ethnicity kids_cat4 REDACTED DUE TO SMALL N**

14

**TABLE OF stp kids_cat4 REDACTED DUE TO SMALL N**

38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator |          Exposure (v2) with 4-cats
y Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       101        383         52      3,049 |     3,585 
           |     75.94      78.16      88.14      79.75 |     79.58 
-----------+--------------------------------------------+----------
         1 |        32        107          7        774 |       920 
           |     24.06      21.84      11.86      20.25 |     20.42 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

**TABLE OF asthma kids_cat4 REDACTED DUE TO SMALL N**

34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac |          Exposure (v2) with 4-cats
  Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       115        389         46      3,050 |     3,600 
           |     86.47      79.39      77.97      79.78 |     79.91 
-----------+--------------------------------------------+----------
         1 |        18        101         13        773 |       905 
           |     13.53      20.61      22.03      20.22 |     20.09 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
18

**TABLE OF diabcat kids_cat4 REDACTED DUE TO SMALL N**

28

**TABLE OF cancer_exhaem_cat kids_cat4 REDACTED DUE TO SMALL N**

26

**TABLE OF cancer_haem_cat kids_cat4 REDACTED DUE TO SMALL N**

23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |
        on |          Exposure (v2) with 4-cats
algorithm) |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       106        382         44      3,047 |     3,579 
           |     79.70      77.96      74.58      79.70 |     79.45 
-----------+--------------------------------------------+----------
         1 |        27        108         15        776 |       926 
           |     20.30      22.04      25.42      20.30 |     20.55 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |
     organ |          Exposure (v2) with 4-cats
transplant |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       111        386         48      3,110 |     3,655 
           |     83.46      78.78      81.36      81.35 |     81.13 
-----------+--------------------------------------------+----------
         1 |        22        104         11        713 |       850 
           |     16.54      21.22      18.64      18.65 |     18.87 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
  Asplenia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       115        376         46      3,054 |     3,591 
           |     86.47      76.73      77.97      79.88 |     79.71 
-----------+--------------------------------------------+----------
         1 |        18        114         13        769 |       914 
           |     13.53      23.27      22.03      20.12 |     20.29 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       104        398         50      3,018 |     3,570 
           |     78.20      81.22      84.75      78.94 |     79.25 
-----------+--------------------------------------------+----------
         1 |        29         92          9        805 |       935 
           |     21.80      18.78      15.25      21.06 |     20.75 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic |          Exposure (v2) with 4-cats
al disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       109        404         47      2,994 |     3,554 
           |     81.95      82.45      79.66      78.32 |     78.89 
-----------+--------------------------------------------+----------
         1 |        24         86         12        829 |       951 
           |     18.05      17.55      20.34      21.68 |     21.11 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Stroke or |          Exposure (v2) with 4-cats
  dementia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       112        393         50      3,076 |     3,631 
           |     84.21      80.20      84.75      80.46 |     80.60 
-----------+--------------------------------------------+----------
         1 |        21         97          9        747 |       874 
           |     15.79      19.80      15.25      19.54 |     19.40 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

**TABLE OF egfr_cat kids_cat4 REDACTED DUE TO SMALL N**

34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       Reduced kidney |          Exposure (v2) with 4-cats
             function |      none  only <12   only 12-1      mixed |     Total
----------------------+--------------------------------------------+----------
                 None |       133        468         59      3,687 |     4,347 
                      |    100.00      95.51     100.00      96.44 |     96.49 
----------------------+--------------------------------------------+----------
Stage 3a/3b egfr 30-6 |         0         22          0        136 |       158 
                      |      0.00       4.49       0.00       3.56 |      3.51 
----------------------+--------------------------------------------+----------
                Total |       133        490         59      3,823 |     4,505 
                      |    100.00     100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |
     renal |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        87        318         32      2,457 |     2,894 
           |     65.41      64.90      54.24      64.27 |     64.24 
-----------+--------------------------------------------+----------
         1 |        46        172         27      1,366 |     1,611 
           |     34.59      35.10      45.76      35.73 |     35.76 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |
hypertensi |          Exposure (v2) with 4-cats
        on |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       102        388         45      3,077 |     3,612 
           |     76.69      79.18      76.27      80.49 |     80.18 
-----------+--------------------------------------------+----------
         1 |        31        102         14        746 |       893 
           |     23.31      20.82      23.73      19.51 |     19.82 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       107        385         50      3,033 |     3,575 
           |     80.45      78.57      84.75      79.34 |     79.36 
-----------+--------------------------------------------+----------
         1 |        26        105          9        790 |       930 
           |     19.55      21.43      15.25      20.66 |     20.64 
-----------+--------------------------------------------+----------
     Total |       133        490         59      3,823 |     4,505 
           |    100.00     100.00     100.00     100.00 |    100.00 

. * Close the log file
. log close
      name:  <unnamed>
       log:  /workspace/logs/03a_an_descriptive_tables.log
  log type:  text
 closed on:  17 Aug 2021, 07:44:35
-------------------------------------------------------------------------------
