-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/03a_an_descriptive_tables.log
  log type:  text
 opened on:  28 Oct 2021, 11:14:58

. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  3. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. safetab htdiag_or_highbp, m
 16. safetab imd 
 17. safetab imd, m
 18. safetab ethnicity
 19. safetab ethnicity, m
 20. safetab stp
 21. safetab tot_adults_hh
 22. safetab household_size
 23. safetab household_size imd, col chi
 24. 
. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat   ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 25.                                                 
. safetab `var'
 26. }
 27. safetab shield
 28. 
. 
. *Exposure 
. foreach var in kids_cat4 gp_number_kids {
 29. safetab `var'
 30. }
 31. 
. * Outcomes
. foreach var in  non_covid_death  ///
>  covid_tpp_prob {
 32. safetab `var'
 33. }
 34. 
. 
. * Outcomes by exposure
. foreach var in non_covid_death  ///
>  covid_tpp_prob {
 35. safetab `var'
 36. safetab `var' kids_cat4, col row
 37. safetab `var' gp_number_kids, col row
 38. 
. }
 39. 
. 
. **********************************
. *  Number (%) with each exposure  *
. **********************************
. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    kids_cat4, col
 40.         safetab male                                                      
>       kids_cat4, col
 41.         safetab bmicat                                                    
>       kids_cat4, col m 
 42.         safetab smoke                                                     
>       kids_cat4, col m
 43.         safetab obese4cat                                                 
>       kids_cat4, col m 
 44.         safetab shield                                                    
>       kids_cat4, col m 
 45.         safetab tot_adults_hh                                           ki
> ds_cat4, col m 
 46.         safetab household_size                                          ki
> ds_cat4, col m 
 47.         safetab imd                                                       
>       kids_cat4, col m
 48.         safetab ethnicity                                                 
>       kids_cat4, col m
 49.         safetab stp                                                       
>       kids_cat4, col
 50.         
.         
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd                    ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 51.         safetab `var'           kids_cat4, col
 52. }
 53.         
. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     16,082    41.27198    13.62689         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |      4,017       24.98       24.98
     30-<40 |      3,506       21.80       46.78
     40-<50 |      3,312       20.59       67.37
     50-<60 |      3,449       21.45       88.82
     60-<70 |      1,798       11.18      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,082      100.00      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,218       51.10       51.10
          1 |      7,864       48.90      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,500       12.19       12.19
  Normal (18.5-24.9) |      3,572       29.02       41.21
Overweight (25-29.9) |      2,783       22.61       63.82
   Obese I (30-34.9) |      2,181       17.72       81.54
  Obese II (35-39.9) |      1,379       11.20       92.74
     Obese III (40+) |        893        7.26      100.00
---------------------+-----------------------------------
               Total |     12,308      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,500        9.33        9.33
  Normal (18.5-24.9) |      3,572       22.21       31.54
Overweight (25-29.9) |      2,783       17.31       48.84
   Obese I (30-34.9) |      2,181       13.56       62.41
  Obese II (35-39.9) |      1,379        8.57       70.98
     Obese III (40+) |        893        5.55       76.53
        Unknown (.u) |      3,774       23.47      100.00
---------------------+-----------------------------------
               Total |     16,082      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     11,629       72.31       72.31
   Obese I (30-34.9) |      2,181       13.56       85.87
  Obese II (35-39.9) |      1,379        8.57       94.45
     Obese III (40+) |        893        5.55      100.00
---------------------+-----------------------------------
               Total |     16,082      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        646       22.03       22.03
      Former |        339       11.56       33.59
     Current |      1,947       66.41      100.00
-------------+-----------------------------------
       Total |      2,932      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        646        4.02        4.02
      Former |        339        2.11        6.12
     Current |      1,947       12.11       18.23
Unknown (.u) |     13,150       81.77      100.00
-------------+-----------------------------------
       Total |     16,082      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      3,628       25.06       25.06
      Elevated |      2,441       16.86       41.92
 High, stage I |      5,859       40.47       82.40
High, stage II |      2,548       17.60      100.00
---------------+-----------------------------------
         Total |     14,476      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      3,628       22.56       22.56
      Elevated |      2,441       15.18       37.74
 High, stage I |      5,859       36.43       74.17
High, stage II |      2,548       15.84       90.01
       Unknown |      1,606        9.99      100.00
---------------+-----------------------------------
         Total |     16,082      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,774       66.99       66.99
          1 |      5,308       33.01      100.00
------------+-----------------------------------
      Total |     16,082      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,774       66.99       66.99
          1 |      5,308       33.01      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,298       70.25       70.25
               4 |      3,159       19.64       89.90
 5 most deprived |      1,625       10.10      100.00
-----------------+-----------------------------------
           Total |     16,082      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,298       70.25       70.25
               4 |      3,159       19.64       89.90
 5 most deprived |      1,625       10.10      100.00
-----------------+-----------------------------------
           Total |     16,082      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,953       80.54       80.54
Asian or Asian British |      1,549        9.63       90.18
                 Other |      1,580        9.82      100.00
-----------------------+-----------------------------------
                 Total |     16,082      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,953       80.54       80.54
Asian or Asian British |      1,549        9.63       90.18
                 Other |      1,580        9.82      100.00
-----------------------+-----------------------------------
                 Total |     16,082      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,625       10.10       10.10
          2 |      1,656       10.30       20.40
          3 |      1,641       10.20       30.61
          4 |      1,558        9.69       40.29
          5 |      1,606        9.99       50.28
          6 |      1,597        9.93       60.21
          7 |      1,597        9.93       70.14
          8 |      1,594        9.91       80.05
          9 |      1,565        9.73       89.78
         10 |      1,643       10.22      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         93        0.58        0.58
          2 |        111        0.69        1.27
          3 |     15,878       98.73      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

     Number |
  people in |
  household |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        383        2.38        2.38
          1 |      2,239       13.92       16.30
          2 |      5,511       34.27       50.57
          3 |      5,380       33.45       84.03
          4 |      2,184       13.58       97.61
          5 |        365        2.27       99.88
          6 |         20        0.12      100.00
------------+-----------------------------------
      Total |     16,082      100.00
19

**TABLE OF household_size imd REDACTED DUE TO SMALL N**

0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,861       79.97       79.97
          1 |      3,221       20.03      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,844       92.30       92.30
          1 |      1,238        7.70      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,888       80.14       80.14
          1 |      3,194       19.86      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     12,307       76.53       76.53
  T1DM, controlled |        414        2.57       79.10
T1DM, uncontrolled |         82        0.51       79.61
  T2DM, controlled |      2,651       16.48       96.10
T2DM, uncontrolled |        608        3.78       99.88
Diabetes, no HbA1c |         20        0.12      100.00
-------------------+-----------------------------------
             Total |     16,082      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     12,946       80.50       80.50
    Last year |         42        0.26       80.76
2-5 years ago |        264        1.64       82.40
     5+ years |      2,830       17.60      100.00
--------------+-----------------------------------
        Total |     16,082      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     12,898       80.20       80.20
    Last year |         57        0.35       80.56
2-5 years ago |        254        1.58       82.14
     5+ years |      2,873       17.86      100.00
--------------+-----------------------------------
        Total |     16,082      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,911       80.28       80.28
          1 |      3,171       19.72      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,805       79.62       79.62
          1 |      3,277       20.38      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,810       79.65       79.65
          1 |      3,272       20.35      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,883       80.11       80.11
          1 |      3,199       19.89      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,850       79.90       79.90
          1 |      3,232       20.10      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,910       80.28       80.28
          1 |      3,172       19.72      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         45 |         62        0.41        0.41
         60 |     15,130       99.59      100.00
------------+-----------------------------------
      Total |     15,192      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |     16,020       99.61       99.61
Stage 3a/3b egfr 30-60       |         62        0.39      100.00
-----------------------------+-----------------------------------
                       Total |     16,082      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,320       64.17       64.17
          1 |      5,762       35.83      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,824       79.74       79.74
          1 |      3,258       20.26      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,816       79.69       79.69
          1 |      3,266       20.31      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,471       15.37       15.37
          1 |     13,611       84.63      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

 Exposure (v2) |
   with 4-cats |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        440        2.74        2.74
only <12 years |      1,652       10.27       13.01
    only 12-18 |        259        1.61       14.62
         mixed |     13,731       85.38      100.00
---------------+-----------------------------------
         Total |     16,082      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |        289       17.49       17.49
 2 children <12 |        312       18.89       36.38
 3 children <12 |        235       14.23       50.61
4+ children <12 |        816       49.39      100.00
----------------+-----------------------------------
          Total |      1,652      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,002       68.41       68.41
          1 |      5,080       31.59      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        906        5.63        5.63
          1 |     15,176       94.37      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,002       68.41       68.41
          1 |      5,080       31.59      100.00
------------+-----------------------------------
      Total |     16,082      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |          Exposure (v2) with 4-cats
     death |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       301      1,120        183      9,398 |    11,002 
           |      2.74      10.18       1.66      85.42 |    100.00 
           |     68.41      67.80      70.66      68.44 |     68.41 
-----------+--------------------------------------------+----------
         1 |       139        532         76      4,333 |     5,080 
           |      2.74      10.47       1.50      85.30 |    100.00 
           |     31.59      32.20      29.34      31.56 |     31.59 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |      2.74      10.27       1.61      85.38 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |      Number kids under 12 years in hh
     death | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |       186        213        153        568 |     1,120 
           |     16.61      19.02      13.66      50.71 |    100.00 
           |     64.36      68.27      65.11      69.61 |     67.80 
-----------+--------------------------------------------+----------
         1 |       103         99         82        248 |       532 
           |     19.36      18.61      15.41      46.62 |    100.00 
           |     35.64      31.73      34.89      30.39 |     32.20 
-----------+--------------------------------------------+----------
     Total |       289        312        235        816 |     1,652 
           |     17.49      18.89      14.23      49.39 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        906        5.63        5.63
          1 |     15,176       94.37      100.00
------------+-----------------------------------
      Total |     16,082      100.00
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |          Exposure (v2) with 4-cats
      case |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        24         73         12        797 |       906 
           |      2.65       8.06       1.32      87.97 |    100.00 
           |      5.45       4.42       4.63       5.80 |      5.63 
-----------+--------------------------------------------+----------
         1 |       416      1,579        247     12,934 |    15,176 
           |      2.74      10.40       1.63      85.23 |    100.00 
           |     94.55      95.58      95.37      94.20 |     94.37 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |      2.74      10.27       1.61      85.38 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
covid prob |      Number kids under 12 years in hh
      case | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |         7         13         10         43 |        73 
           |      9.59      17.81      13.70      58.90 |    100.00 
           |      2.42       4.17       4.26       5.27 |      4.42 
-----------+--------------------------------------------+----------
         1 |       282        299        225        773 |     1,579 
           |     17.86      18.94      14.25      48.96 |    100.00 
           |     97.58      95.83      95.74      94.73 |     95.58 
-----------+--------------------------------------------+----------
     Total |       289        312        235        816 |     1,652 
           |     17.49      18.89      14.23      49.39 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |          Exposure (v2) with 4-cats
       age |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
    18-<30 |       112        400         80      3,425 |     4,017 
           |     25.45      24.21      30.89      24.94 |     24.98 
-----------+--------------------------------------------+----------
    30-<40 |        98        387         57      2,964 |     3,506 
           |     22.27      23.43      22.01      21.59 |     21.80 
-----------+--------------------------------------------+----------
    40-<50 |        86        335         44      2,847 |     3,312 
           |     19.55      20.28      16.99      20.73 |     20.59 
-----------+--------------------------------------------+----------
    50-<60 |       104        335         45      2,965 |     3,449 
           |     23.64      20.28      17.37      21.59 |     21.45 
-----------+--------------------------------------------+----------
    60-<70 |        40        195         33      1,530 |     1,798 
           |      9.09      11.80      12.74      11.14 |     11.18 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
      Male |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       231        880        128      6,979 |     8,218 
           |     52.50      53.27      49.42      50.83 |     51.10 
-----------+--------------------------------------------+----------
         1 |       209        772        131      6,752 |     7,864 
           |     47.50      46.73      50.58      49.17 |     48.90 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |          Exposure (v2) with 4-cats
         Grouped BMI |      none  only <12   only 12-1      mixed |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |        38        174         32      1,256 |     1,500 
                     |      8.64      10.53      12.36       9.15 |      9.33 
---------------------+--------------------------------------------+----------
  Normal (18.5-24.9) |        95        354         56      3,067 |     3,572 
                     |     21.59      21.43      21.62      22.34 |     22.21 
---------------------+--------------------------------------------+----------
Overweight (25-29.9) |        74        286         48      2,375 |     2,783 
                     |     16.82      17.31      18.53      17.30 |     17.31 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |        69        204         32      1,876 |     2,181 
                     |     15.68      12.35      12.36      13.66 |     13.56 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |        26        139         13      1,201 |     1,379 
                     |      5.91       8.41       5.02       8.75 |      8.57 
---------------------+--------------------------------------------+----------
     Obese III (40+) |        30         90         16        757 |       893 
                     |      6.82       5.45       6.18       5.51 |      5.55 
---------------------+--------------------------------------------+----------
        Unknown (.u) |       108        405         62      3,199 |     3,774 
                     |     24.55      24.52      23.94      23.30 |     23.47 
---------------------+--------------------------------------------+----------
               Total |       440      1,652        259     13,731 |    16,082 
                     |    100.00     100.00     100.00     100.00 |    100.00 
16

**TABLE OF smoke kids_cat4 REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Evidence of obesity |          Exposure (v2) with 4-cats
      (4 categories) |      none  only <12   only 12-1      mixed |     Total
---------------------+--------------------------------------------+----------
No record of obesity |       315      1,219        198      9,897 |    11,629 
                     |     71.59      73.79      76.45      72.08 |     72.31 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |        69        204         32      1,876 |     2,181 
                     |     15.68      12.35      12.36      13.66 |     13.56 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |        26        139         13      1,201 |     1,379 
                     |      5.91       8.41       5.02       8.75 |      8.57 
---------------------+--------------------------------------------+----------
     Obese III (40+) |        30         90         16        757 |       893 
                     |      6.82       5.45       6.18       5.51 |      5.55 
---------------------+--------------------------------------------+----------
               Total |       440      1,652        259     13,731 |    16,082 
                     |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Probable |          Exposure (v2) with 4-cats
 shielding |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        61        249         50      2,111 |     2,471 
           |     13.86      15.07      19.31      15.37 |     15.37 
-----------+--------------------------------------------+----------
         1 |       379      1,403        209     11,620 |    13,611 
           |     86.14      84.93      80.69      84.63 |     84.63 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
24

**TABLE OF tot_adults_hh kids_cat4 REDACTED DUE TO SMALL N**

25

**TABLE OF household_size kids_cat4 REDACTED DUE TO SMALL N**

14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation |          Exposure (v2) with 4-cats
           (IMD) |      none  only <12   only 12-1      mixed |     Total
-----------------+--------------------------------------------+----------
1 least deprived |       313      1,146        168      9,671 |    11,298 
                 |     71.14      69.37      64.86      70.43 |     70.25 
-----------------+--------------------------------------------+----------
               4 |        85        336         61      2,677 |     3,159 
                 |     19.32      20.34      23.55      19.50 |     19.64 
-----------------+--------------------------------------------+----------
 5 most deprived |        42        170         30      1,383 |     1,625 
                 |      9.55      10.29      11.58      10.07 |     10.10 
-----------------+--------------------------------------------+----------
           Total |       440      1,652        259     13,731 |    16,082 
                 |    100.00     100.00     100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |          Exposure (v2) with 4-cats
            Ethnicity |      none  only <12   only 12-1      mixed |     Total
----------------------+--------------------------------------------+----------
                White |       356      1,337        209     11,051 |    12,953 
                      |     80.91      80.93      80.69      80.48 |     80.54 
----------------------+--------------------------------------------+----------
Asian or Asian Britis |        33        166         21      1,329 |     1,549 
                      |      7.50      10.05       8.11       9.68 |      9.63 
----------------------+--------------------------------------------+----------
                Other |        51        149         29      1,351 |     1,580 
                      |     11.59       9.02      11.20       9.84 |      9.82 
----------------------+--------------------------------------------+----------
                Total |       440      1,652        259     13,731 |    16,082 
                      |    100.00     100.00     100.00     100.00 |    100.00 
14

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |
      tion |
Partnershi |          Exposure (v2) with 4-cats
         p |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         1 |        38        186         33      1,368 |     1,625 
           |      8.64      11.26      12.74       9.96 |     10.10 
-----------+--------------------------------------------+----------
         2 |        45        169         28      1,414 |     1,656 
           |     10.23      10.23      10.81      10.30 |     10.30 
-----------+--------------------------------------------+----------
         3 |        43        177         30      1,391 |     1,641 
           |      9.77      10.71      11.58      10.13 |     10.20 
-----------+--------------------------------------------+----------
         4 |        38        143         21      1,356 |     1,558 
           |      8.64       8.66       8.11       9.88 |      9.69 
-----------+--------------------------------------------+----------
         5 |        46        159         20      1,381 |     1,606 
           |     10.45       9.62       7.72      10.06 |      9.99 
-----------+--------------------------------------------+----------
         6 |        52        170         29      1,346 |     1,597 
           |     11.82      10.29      11.20       9.80 |      9.93 
-----------+--------------------------------------------+----------
         7 |        53        145         20      1,379 |     1,597 
           |     12.05       8.78       7.72      10.04 |      9.93 
-----------+--------------------------------------------+----------
         8 |        30        168         34      1,362 |     1,594 
           |      6.82      10.17      13.13       9.92 |      9.91 
-----------+--------------------------------------------+----------
         9 |        44        163         19      1,339 |     1,565 
           |     10.00       9.87       7.34       9.75 |      9.73 
-----------+--------------------------------------------+----------
        10 |        51        172         25      1,395 |     1,643 
           |     11.59      10.41       9.65      10.16 |     10.22 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator |          Exposure (v2) with 4-cats
y Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       353      1,321        216     10,971 |    12,861 
           |     80.23      79.96      83.40      79.90 |     79.97 
-----------+--------------------------------------------+----------
         1 |        87        331         43      2,760 |     3,221 
           |     19.77      20.04      16.60      20.10 |     20.03 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Asthma |          Exposure (v2) with 4-cats
  category |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       395      1,531        245     12,673 |    14,844 
           |     89.77      92.68      94.59      92.29 |     92.30 
-----------+--------------------------------------------+----------
         1 |        45        121         14      1,058 |     1,238 
           |     10.23       7.32       5.41       7.71 |      7.70 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac |          Exposure (v2) with 4-cats
  Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       348      1,290        207     11,043 |    12,888 
           |     79.09      78.09      79.92      80.42 |     80.14 
-----------+--------------------------------------------+----------
         1 |        92        362         52      2,688 |     3,194 
           |     20.91      21.91      20.08      19.58 |     19.86 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
18

**TABLE OF diabcat kids_cat4 REDACTED DUE TO SMALL N**

28

**TABLE OF cancer_exhaem_cat kids_cat4 REDACTED DUE TO SMALL N**

26

**TABLE OF cancer_haem_cat kids_cat4 REDACTED DUE TO SMALL N**

23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |
        on |          Exposure (v2) with 4-cats
algorithm) |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       341      1,312        207     11,051 |    12,911 
           |     77.50      79.42      79.92      80.48 |     80.28 
-----------+--------------------------------------------+----------
         1 |        99        340         52      2,680 |     3,171 
           |     22.50      20.58      20.08      19.52 |     19.72 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |
     organ |          Exposure (v2) with 4-cats
transplant |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       335      1,319        213     10,938 |    12,805 
           |     76.14      79.84      82.24      79.66 |     79.62 
-----------+--------------------------------------------+----------
         1 |       105        333         46      2,793 |     3,277 
           |     23.86      20.16      17.76      20.34 |     20.38 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
  Asplenia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       350      1,346        216     10,898 |    12,810 
           |     79.55      81.48      83.40      79.37 |     79.65 
-----------+--------------------------------------------+----------
         1 |        90        306         43      2,833 |     3,272 
           |     20.45      18.52      16.60      20.63 |     20.35 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       360      1,353        212     10,958 |    12,883 
           |     81.82      81.90      81.85      79.80 |     80.11 
-----------+--------------------------------------------+----------
         1 |        80        299         47      2,773 |     3,199 
           |     18.18      18.10      18.15      20.20 |     19.89 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic |          Exposure (v2) with 4-cats
al disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       350      1,309        205     10,986 |    12,850 
           |     79.55      79.24      79.15      80.01 |     79.90 
-----------+--------------------------------------------+----------
         1 |        90        343         54      2,745 |     3,232 
           |     20.45      20.76      20.85      19.99 |     20.10 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Stroke or |          Exposure (v2) with 4-cats
  dementia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       347      1,303        211     11,049 |    12,910 
           |     78.86      78.87      81.47      80.47 |     80.28 
-----------+--------------------------------------------+----------
         1 |        93        349         48      2,682 |     3,172 
           |     21.14      21.13      18.53      19.53 |     19.72 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

**TABLE OF egfr_cat kids_cat4 REDACTED DUE TO SMALL N**

34

**TABLE OF reduced_kidney_function kids_cat4 REDACTED DUE TO SMALL N**

15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |
     renal |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       273      1,029        176      8,842 |    10,320 
           |     62.05      62.29      67.95      64.39 |     64.17 
-----------+--------------------------------------------+----------
         1 |       167        623         83      4,889 |     5,762 
           |     37.95      37.71      32.05      35.61 |     35.83 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |
hypertensi |          Exposure (v2) with 4-cats
        on |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       351      1,295        210     10,968 |    12,824 
           |     79.77      78.39      81.08      79.88 |     79.74 
-----------+--------------------------------------------+----------
         1 |        89        357         49      2,763 |     3,258 
           |     20.23      21.61      18.92      20.12 |     20.26 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       356      1,312        206     10,942 |    12,816 
           |     80.91      79.42      79.54      79.69 |     79.69 
-----------+--------------------------------------------+----------
         1 |        84        340         53      2,789 |     3,266 
           |     19.09      20.58      20.46      20.31 |     20.31 
-----------+--------------------------------------------+----------
     Total |       440      1,652        259     13,731 |    16,082 
           |    100.00     100.00     100.00     100.00 |    100.00 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      4,551    75.47858    7.296991         66        109
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |      1,092       23.99       23.99
     70-<80 |      2,249       49.42       73.41
        80+ |      1,210       26.59      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        277        6.09        6.09
          1 |      4,274       93.91      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,349       51.62       51.62
          1 |      2,202       48.38      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        450       12.49       12.49
  Normal (18.5-24.9) |      1,029       28.57       41.06
Overweight (25-29.9) |        807       22.40       63.46
   Obese I (30-34.9) |        687       19.07       82.54
  Obese II (35-39.9) |        389       10.80       93.34
     Obese III (40+) |        240        6.66      100.00
---------------------+-----------------------------------
               Total |      3,602      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        450        9.89        9.89
  Normal (18.5-24.9) |      1,029       22.61       32.50
Overweight (25-29.9) |        807       17.73       50.23
   Obese I (30-34.9) |        687       15.10       65.33
  Obese II (35-39.9) |        389        8.55       73.87
     Obese III (40+) |        240        5.27       79.15
        Unknown (.u) |        949       20.85      100.00
---------------------+-----------------------------------
               Total |      4,551      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |      3,235       71.08       71.08
   Obese I (30-34.9) |        687       15.10       86.18
  Obese II (35-39.9) |        389        8.55       94.73
     Obese III (40+) |        240        5.27      100.00
---------------------+-----------------------------------
               Total |      4,551      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        190       22.95       22.95
      Former |         87       10.51       33.45
     Current |        551       66.55      100.00
-------------+-----------------------------------
       Total |        828      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        190        4.17        4.17
      Former |         87        1.91        6.09
     Current |        551       12.11       18.19
Unknown (.u) |      3,723       81.81      100.00
-------------+-----------------------------------
       Total |      4,551      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |        950       23.22       23.22
      Elevated |        725       17.72       40.94
 High, stage I |      1,701       41.58       82.52
High, stage II |        715       17.48      100.00
---------------+-----------------------------------
         Total |      4,091      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |        950       20.87       20.87
      Elevated |        725       15.93       36.81
 High, stage I |      1,701       37.38       74.18
High, stage II |        715       15.71       89.89
       Unknown |        460       10.11      100.00
---------------+-----------------------------------
         Total |      4,551      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,097       68.05       68.05
          1 |      1,454       31.95      100.00
------------+-----------------------------------
      Total |      4,551      100.00
17

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,097       68.05       68.05
          1 |      1,454       31.95      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,209       70.51       70.51
               4 |        916       20.13       90.64
 5 most deprived |        426        9.36      100.00
-----------------+-----------------------------------
           Total |      4,551      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,209       70.51       70.51
               4 |        916       20.13       90.64
 5 most deprived |        426        9.36      100.00
-----------------+-----------------------------------
           Total |      4,551      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,611       79.35       79.35
Asian or Asian British |        456       10.02       89.36
                 Other |        484       10.64      100.00
-----------------------+-----------------------------------
                 Total |      4,551      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,611       79.35       79.35
Asian or Asian British |        456       10.02       89.36
                 Other |        484       10.64      100.00
-----------------------+-----------------------------------
                 Total |      4,551      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        425        9.34        9.34
          2 |        474       10.42       19.75
          3 |        459       10.09       29.84
          4 |        484       10.64       40.47
          5 |        420        9.23       49.70
          6 |        442        9.71       59.42
          7 |        516       11.34       70.75
          8 |        449        9.87       80.62
          9 |        465       10.22       90.84
         10 |        417        9.16      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

      Total |
     number |
  adults in |
         hh |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         33        0.73        0.73
          2 |         25        0.55        1.27
          3 |      4,493       98.73      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

**TABLE OF household_size REDACTED DUE TO SMALL N**

19

**TABLE OF household_size imd REDACTED DUE TO SMALL N**

0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,620       79.54       79.54
          1 |        931       20.46      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,169       91.61       91.61
          1 |        382        8.39      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,619       79.52       79.52
          1 |        932       20.48      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

**TABLE OF diabcat REDACTED DUE TO SMALL N**

0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,653       80.27       80.27
    Last year |         24        0.53       80.80
2-5 years ago |         68        1.49       82.29
     5+ years |        806       17.71      100.00
--------------+-----------------------------------
        Total |      4,551      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,667       80.58       80.58
    Last year |         25        0.55       81.13
2-5 years ago |         69        1.52       82.64
     5+ years |        790       17.36      100.00
--------------+-----------------------------------
        Total |      4,551      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,611       79.35       79.35
          1 |        940       20.65      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,626       79.67       79.67
          1 |        925       20.33      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,641       80.00       80.00
          1 |        910       20.00      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,634       79.85       79.85
          1 |        917       20.15      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,640       79.98       79.98
          1 |        911       20.02      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,619       79.52       79.52
          1 |        932       20.48      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         30 |          6        0.14        0.14
         45 |        180        4.16        4.30
         60 |      4,140       95.70      100.00
------------+-----------------------------------
      Total |      4,326      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |      4,365       95.91       95.91
Stage 3a/3b egfr 30-60       |        186        4.09      100.00
-----------------------------+-----------------------------------
                       Total |      4,551      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,952       64.86       64.86
          1 |      1,599       35.14      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,694       81.17       81.17
          1 |        857       18.83      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,669       80.62       80.62
          1 |        882       19.38      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        723       15.89       15.89
          1 |      3,828       84.11      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

 Exposure (v2) |
   with 4-cats |      Freq.     Percent        Cum.
---------------+-----------------------------------
          none |        132        2.90        2.90
only <12 years |        475       10.44       13.34
    only 12-18 |         93        2.04       15.38
         mixed |      3,851       84.62      100.00
---------------+-----------------------------------
         Total |      4,551      100.00
0

    Number kids |
 under 12 years |
          in hh |      Freq.     Percent        Cum.
----------------+-----------------------------------
    1 child <12 |         77       16.21       16.21
 2 children <12 |        107       22.53       38.74
 3 children <12 |         58       12.21       50.95
4+ children <12 |        233       49.05      100.00
----------------+-----------------------------------
          Total |        475      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,126       68.69       68.69
          1 |      1,425       31.31      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        259        5.69        5.69
          1 |      4,292       94.31      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,126       68.69       68.69
          1 |      1,425       31.31      100.00
------------+-----------------------------------
      Total |      4,551      100.00
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |          Exposure (v2) with 4-cats
     death |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        86        347         62      2,631 |     3,126 
           |      2.75      11.10       1.98      84.17 |    100.00 
           |     65.15      73.05      66.67      68.32 |     68.69 
-----------+--------------------------------------------+----------
         1 |        46        128         31      1,220 |     1,425 
           |      3.23       8.98       2.18      85.61 |    100.00 
           |     34.85      26.95      33.33      31.68 |     31.31 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |      2.90      10.44       2.04      84.62 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

Failure/ce |
   nsoring |
 indicator |
       for |
  outcome: |
 non-covid |      Number kids under 12 years in hh
     death | 1 child <  2 childre  3 childre  4+ childr |     Total
-----------+--------------------------------------------+----------
         0 |        60         74         45        168 |       347 
           |     17.29      21.33      12.97      48.41 |    100.00 
           |     77.92      69.16      77.59      72.10 |     73.05 
-----------+--------------------------------------------+----------
         1 |        17         33         13         65 |       128 
           |     13.28      25.78      10.16      50.78 |    100.00 
           |     22.08      30.84      22.41      27.90 |     26.95 
-----------+--------------------------------------------+----------
     Total |        77        107         58        233 |       475 
           |     16.21      22.53      12.21      49.05 |    100.00 
           |    100.00     100.00     100.00     100.00 |    100.00 
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        259        5.69        5.69
          1 |      4,292       94.31      100.00
------------+-----------------------------------
      Total |      4,551      100.00
25

**TABLE OF covid_tpp_prob kids_cat4 REDACTED DUE TO SMALL N**

30

**TABLE OF covid_tpp_prob gp_number_kids REDACTED DUE TO SMALL N**

19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |          Exposure (v2) with 4-cats
       age |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
    60-<70 |        28        122         29        913 |     1,092 
           |     21.21      25.68      31.18      23.71 |     23.99 
-----------+--------------------------------------------+----------
    70-<80 |        61        233         40      1,915 |     2,249 
           |     46.21      49.05      43.01      49.73 |     49.42 
-----------+--------------------------------------------+----------
       80+ |        43        120         24      1,023 |     1,210 
           |     32.58      25.26      25.81      26.56 |     26.59 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
      Male |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        66        251         47      1,985 |     2,349 
           |     50.00      52.84      50.54      51.55 |     51.62 
-----------+--------------------------------------------+----------
         1 |        66        224         46      1,866 |     2,202 
           |     50.00      47.16      49.46      48.45 |     48.38 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |          Exposure (v2) with 4-cats
         Grouped BMI |      none  only <12   only 12-1      mixed |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |        14         48         14        374 |       450 
                     |     10.61      10.11      15.05       9.71 |      9.89 
---------------------+--------------------------------------------+----------
  Normal (18.5-24.9) |        29        108         20        872 |     1,029 
                     |     21.97      22.74      21.51      22.64 |     22.61 
---------------------+--------------------------------------------+----------
Overweight (25-29.9) |        21         92         18        676 |       807 
                     |     15.91      19.37      19.35      17.55 |     17.73 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |        27         77         12        571 |       687 
                     |     20.45      16.21      12.90      14.83 |     15.10 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |         6         39         10        334 |       389 
                     |      4.55       8.21      10.75       8.67 |      8.55 
---------------------+--------------------------------------------+----------
     Obese III (40+) |         7         20          6        207 |       240 
                     |      5.30       4.21       6.45       5.38 |      5.27 
---------------------+--------------------------------------------+----------
        Unknown (.u) |        28         91         13        817 |       949 
                     |     21.21      19.16      13.98      21.22 |     20.85 
---------------------+--------------------------------------------+----------
               Total |       132        475         93      3,851 |     4,551 
                     |    100.00     100.00     100.00     100.00 |    100.00 
16

**TABLE OF smoke kids_cat4 REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Evidence of obesity |          Exposure (v2) with 4-cats
      (4 categories) |      none  only <12   only 12-1      mixed |     Total
---------------------+--------------------------------------------+----------
No record of obesity |        92        339         65      2,739 |     3,235 
                     |     69.70      71.37      69.89      71.12 |     71.08 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |        27         77         12        571 |       687 
                     |     20.45      16.21      12.90      14.83 |     15.10 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |         6         39         10        334 |       389 
                     |      4.55       8.21      10.75       8.67 |      8.55 
---------------------+--------------------------------------------+----------
     Obese III (40+) |         7         20          6        207 |       240 
                     |      5.30       4.21       6.45       5.38 |      5.27 
---------------------+--------------------------------------------+----------
               Total |       132        475         93      3,851 |     4,551 
                     |    100.00     100.00     100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Probable |          Exposure (v2) with 4-cats
 shielding |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        29         85         16        593 |       723 
           |     21.97      17.89      17.20      15.40 |     15.89 
-----------+--------------------------------------------+----------
         1 |       103        390         77      3,258 |     3,828 
           |     78.03      82.11      82.80      84.60 |     84.11 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
24

**TABLE OF tot_adults_hh kids_cat4 REDACTED DUE TO SMALL N**

25

**TABLE OF household_size kids_cat4 REDACTED DUE TO SMALL N**

14

**TABLE OF imd kids_cat4 REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |          Exposure (v2) with 4-cats
            Ethnicity |      none  only <12   only 12-1      mixed |     Total
----------------------+--------------------------------------------+----------
                White |       102        376         73      3,060 |     3,611 
                      |     77.27      79.16      78.49      79.46 |     79.35 
----------------------+--------------------------------------------+----------
Asian or Asian Britis |         9         46          6        395 |       456 
                      |      6.82       9.68       6.45      10.26 |     10.02 
----------------------+--------------------------------------------+----------
                Other |        21         53         14        396 |       484 
                      |     15.91      11.16      15.05      10.28 |     10.64 
----------------------+--------------------------------------------+----------
                Total |       132        475         93      3,851 |     4,551 
                      |    100.00     100.00     100.00     100.00 |    100.00 
14

**TABLE OF stp kids_cat4 REDACTED DUE TO SMALL N**

38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator |          Exposure (v2) with 4-cats
y Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       116        382         68      3,054 |     3,620 
           |     87.88      80.42      73.12      79.30 |     79.54 
-----------+--------------------------------------------+----------
         1 |        16         93         25        797 |       931 
           |     12.12      19.58      26.88      20.70 |     20.46 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
17

**TABLE OF asthma kids_cat4 REDACTED DUE TO SMALL N**

34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac |          Exposure (v2) with 4-cats
  Diseases |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       111        390         76      3,042 |     3,619 
           |     84.09      82.11      81.72      78.99 |     79.52 
-----------+--------------------------------------------+----------
         1 |        21         85         17        809 |       932 
           |     15.91      17.89      18.28      21.01 |     20.48 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
18

**TABLE OF diabcat kids_cat4 REDACTED DUE TO SMALL N**

28

**TABLE OF cancer_exhaem_cat kids_cat4 REDACTED DUE TO SMALL N**

26

**TABLE OF cancer_haem_cat kids_cat4 REDACTED DUE TO SMALL N**

23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |
(combinati |
        on |          Exposure (v2) with 4-cats
algorithm) |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       108        383         78      3,042 |     3,611 
           |     81.82      80.63      83.87      78.99 |     79.35 
-----------+--------------------------------------------+----------
         1 |        24         92         15        809 |       940 
           |     18.18      19.37      16.13      21.01 |     20.65 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |
     solid |
     organ |          Exposure (v2) with 4-cats
transplant |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       116        379         67      3,064 |     3,626 
           |     87.88      79.79      72.04      79.56 |     79.67 
-----------+--------------------------------------------+----------
         1 |        16         96         26        787 |       925 
           |     12.12      20.21      27.96      20.44 |     20.33 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |          Exposure (v2) with 4-cats
  Asplenia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       108        395         75      3,063 |     3,641 
           |     81.82      83.16      80.65      79.54 |     80.00 
-----------+--------------------------------------------+----------
         1 |        24         80         18        788 |       910 
           |     18.18      16.84      19.35      20.46 |     20.00 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       108        379         69      3,078 |     3,634 
           |     81.82      79.79      74.19      79.93 |     79.85 
-----------+--------------------------------------------+----------
         1 |        24         96         24        773 |       917 
           |     18.18      20.21      25.81      20.07 |     20.15 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic |          Exposure (v2) with 4-cats
al disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       107        371         72      3,090 |     3,640 
           |     81.06      78.11      77.42      80.24 |     79.98 
-----------+--------------------------------------------+----------
         1 |        25        104         21        761 |       911 
           |     18.94      21.89      22.58      19.76 |     20.02 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Stroke or |          Exposure (v2) with 4-cats
  dementia |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       105        385         77      3,052 |     3,619 
           |     79.55      81.05      82.80      79.25 |     79.52 
-----------+--------------------------------------------+----------
         1 |        27         90         16        799 |       932 
           |     20.45      18.95      17.20      20.75 |     20.48 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
19

**TABLE OF egfr_cat kids_cat4 REDACTED DUE TO SMALL N**

34

**TABLE OF reduced_kidney_function kids_cat4 REDACTED DUE TO SMALL N**

15

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 End-stage |
     renal |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |        83        298         63      2,508 |     2,952 
           |     62.88      62.74      67.74      65.13 |     64.86 
-----------+--------------------------------------------+----------
         1 |        49        177         30      1,343 |     1,599 
           |     37.12      37.26      32.26      34.87 |     35.14 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Diagnosed |
hypertensi |          Exposure (v2) with 4-cats
        on |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       116        377         77      3,124 |     3,694 
           |     87.88      79.37      82.80      81.12 |     81.17 
-----------+--------------------------------------------+----------
         1 |        16         98         16        727 |       857 
           |     12.12      20.63      17.20      18.88 |     18.83 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune |          Exposure (v2) with 4-cats
   disease |      none  only <12   only 12-1      mixed |     Total
-----------+--------------------------------------------+----------
         0 |       110        390         76      3,093 |     3,669 
           |     83.33      82.11      81.72      80.32 |     80.62 
-----------+--------------------------------------------+----------
         1 |        22         85         17        758 |       882 
           |     16.67      17.89      18.28      19.68 |     19.38 
-----------+--------------------------------------------+----------
     Total |       132        475         93      3,851 |     4,551 
           |    100.00     100.00     100.00     100.00 |    100.00 

. * Close the log file
. log close
      name:  <unnamed>
       log:  /workspace/logs/03a_an_descriptive_tables.log
  log type:  text
 closed on:  28 Oct 2021, 11:14:59
-------------------------------------------------------------------------------
