-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/03b_an_descriptive_table_1.log
  log type:  text
 opened on:  24 Jul 2021, 18:06:20

. 
. program define generaterow
  1. syntax, variable(varname) condition(string) outcome(string)
  2.         
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3.         
.         cou
  4.         local overalldenom=r(N)
  5.         
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  (" (") %3.1f (`colpct') (")"
> ) _tab
  9. 
.         cou if kids_cat4==0 
 10.         local coldenom = r(N)
 11.         cou if kids_cat4==0 & `variable' `condition'
 12.         local pct = 100*(r(N)/`coldenom')
 13.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 14.         
.         cou if kids_cat4==1 
 15.         local coldenom = r(N)
 16.         cou if kids_cat4==1 & `variable' `condition'
 17.         local pct = 100*(r(N)/`coldenom')
 18.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 19.         
.         cou if kids_cat4==2 
 20.         local coldenom = r(N)
 21.         cou if kids_cat4==2 & `variable' `condition'
 22.         local pct = 100*(r(N)/`coldenom')
 23.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 24. 
.         cou if kids_cat4==3 
 25.         local coldenom = r(N)
 26.         cou if kids_cat4==3 & `variable' `condition'
 27.         local pct = 100*(r(N)/`coldenom')
 28.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _n
 29.         
. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] outcome(string)
  2. 
.         foreach varlevel of numlist `start'/`end'{ 
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) outcome(kids_cat4)
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") outcome(kids_cat4)
  6. 
. end

. 
. *****************************************************************************
> **
. 
. *Set up output file
. 
. forvalues x=0/1 {
  2. 
. cap file close tablecontent
  3. file open tablecontent using ./output/03b_an_descriptive_table_1_kids_cat4
> _ageband`x'`dataset'.txt, write text replace
  4. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) outcome(kids_cat4)
  7. file write tablecontent _n 
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) outcome(kids_cat4) 
  9. file write tablecontent _n 
 10. 
. tabulatevariable, variable(male) start(0) end(1) outcome(kids_cat4)
 11. file write tablecontent _n 
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing outcome(kids_cat4)
 13. file write tablecontent _n 
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing outcome(kids_cat4) 
 15. file write tablecontent _n 
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing outcome(kids_ca
> t4)
 17. file write tablecontent _n 
 18. 
. tabulatevariable, variable(imd) start(1) end(5) outcome(kids_cat4)
 19. file write tablecontent _n 
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) outcome(kids_cat4)
 21. file write tablecontent _n 
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing outcome(kids_cat4)
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) outcome(kids_
> cat4)                 
 24. file write tablecontent _n  
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) outco
> me(kids_cat4)
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1) outcome(kids_cat4) /*ever 
> asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) outcome(k
> ids_cat4)
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) outcome(kids_cat4) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4) outcome(kids_cat4
> ) /*<1, 1-4.9, 5+ years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4) outcome(kids_ca
> t4) /*<1, 1-4.9, 5+ years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) outco
> me(kids_cat4)
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) outcome(kids_cat4)
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) outcome(kid
> s_cat4)
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) outcome(kids_cat4
> )
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) outcome(kids_cat4)
 40. *OTHER ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) outcome(kids_cat
> 4)
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) outcome(kids_cat4)
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) outcome(kids_cat
> 4)
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) outcome(kids_cat4)
 44. *SHEILDING
. tabulatevariable, variable(shield) start(1) end(1) outcome(kids_cat4)
 45. *anycomorbidity
. tabulatevariable, variable(anycomorb) start(1) end(1) outcome(kids_cat4)
 46. 
. file close tablecontent
 47. 
. }
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband0.txt not foun
> d)
  16,007
  16,007
  405
  405
  1,561
  1,561
  273
  273
  13,768
  13,768
  16,007
  3,965
  405
  97
  1,561
  403
  273
  59
  13,768
  3,406
  16,007
  3,520
  405
  86
  1,561
  346
  273
  75
  13,768
  3,013
  16,007
  3,287
  405
  91
  1,561
  315
  273
  60
  13,768
  2,821
  16,007
  3,568
  405
  83
  1,561
  348
  273
  45
  13,768
  3,092
  16,007
  1,667
  405
  48
  1,561
  149
  273
  34
  13,768
  1,436
  16,007
  0
  405
  0
  1,561
  0
  273
  0
  13,768
  0
  16,007
  0
  405
  0
  1,561
  0
  273
  0
  13,768
  0
  16,007
  8,101
  405
  198
  1,561
  781
  273
  133
  13,768
  6,989
  16,007
  7,906
  405
  207
  1,561
  780
  273
  140
  13,768
  6,779
  16,007
  1,442
  405
  36
  1,561
  143
  273
  18
  13,768
  1,245
  16,007
  3,566
  405
  89
  1,561
  358
  273
  67
  13,768
  3,052
  16,007
  2,851
  405
  56
  1,561
  280
  273
  43
  13,768
  2,472
  16,007
  2,220
  405
  69
  1,561
  219
  273
  35
  13,768
  1,897
  16,007
  1,372
  405
  33
  1,561
  130
  273
  27
  13,768
  1,182
  16,007
  871
  405
  22
  1,561
  82
  273
  17
  13,768
  750
  16,007
  3,685
  405
  100
  1,561
  349
  273
  66
  13,768
  3,170
  16,007
  642
  405
  14
  1,561
  53
  273
  10
  13,768
  565
  16,007
  301
  405
  7
  1,561
  26
  273
  5
  13,768
  263
  16,007
  1,954
  405
  43
  1,561
  200
  273
  37
  13,768
  1,674
  16,007
  13,110
  405
  341
  1,561
  1,282
  273
  221
  13,768
  11,266
  16,007
  12,869
  405
  328
  1,561
  1,241
  273
  225
  13,768
  11,075
  16,007
  0
  405
  0
  1,561
  0
  273
  0
  13,768
  0
  16,007
  1,556
  405
  31
  1,561
  149
  273
  18
  13,768
  1,358
  16,007
  0
  405
  0
  1,561
  0
  273
  0
  13,768
  0
  16,007
  1,582
  405
  46
  1,561
  171
  273
  30
  13,768
  1,335
  16,007
  0
  405
  0
  1,561
  0
  273
  0
  13,768
  0
  16,007
  11,158
  405
  275
  1,561
  1,085
  273
  192
  13,768
  9,606
  16,007
  0
  405
  0
  1,561
  0
  273
  0
  13,768
  0
  16,007
  0
  405
  0
  1,561
  0
  273
  0
  13,768
  0
  16,007
  3,243
  405
  89
  1,561
  317
  273
  56
  13,768
  2,781
  16,007
  1,606
  405
  41
  1,561
  159
  273
  25
  13,768
  1,381
  16,007
  85
  405
  71
  1,561
  9
  273
  3
  13,768
  2
  16,007
  114
  405
  61
  1,561
  26
  273
  21
  13,768
  6
  16,007
  15,808
  405
  273
  1,561
  1,526
  273
  249
  13,768
  13,760
  16,007
  1
  405
  0
  1,561
  0
  273
  0
  13,768
  1
  16,007
  0
  405
  0
  1,561
  0
  273
  0
  13,768
  0
  16,007
  25
  405
  2
  1,561
  1
  273
  0
  13,768
  22
  16,007
  14,385
  405
  369
  1,561
  1,377
  273
  247
  13,768
  12,392
  16,007
  1,596
  405
  34
  1,561
  183
  273
  26
  13,768
  1,353
  16,007
  14,720
  405
  375
  1,561
  1,408
  273
  254
  13,768
  12,683
  16,007
  3,187
  405
  93
  1,561
  299
  273
  62
  13,768
  2,733
  16,007
  1,287
  405
  39
  1,561
  123
  273
  26
  13,768
  1,099
  16,007
  3,137
  405
  74
  1,561
  290
  273
  51
  13,768
  2,722
  16,007
  12,359
  405
  309
  1,561
  1,247
  273
  218
  13,768
  10,585
  16,007
  407
  405
  11
  1,561
  45
  273
  6
  13,768
  345
  16,007
  81
  405
  3
  1,561
  4
  273
  2
  13,768
  72
  16,007
  2,605
  405
  66
  1,561
  209
  273
  36
  13,768
  2,294
  16,007
  545
  405
  16
  1,561
  56
  273
  10
  13,768
  463
  16,007
  10
  405
  0
  1,561
  0
  273
  1
  13,768
  9
  16,007
  55
  405
  1
  1,561
  1
  273
  0
  13,768
  53
  16,007
  231
  405
  6
  1,561
  24
  273
  2
  13,768
  199
  16,007
  2,805
  405
  62
  1,561
  269
  273
  57
  13,768
  2,417
  16,007
  61
  405
  1
  1,561
  7
  273
  0
  13,768
  53
  16,007
  266
  405
  5
  1,561
  31
  273
  2
  13,768
  228
  16,007
  2,742
  405
  59
  1,561
  258
  273
  38
  13,768
  2,387
  16,007
  65
  405
  0
  1,561
  6
  273
  1
  13,768
  58
  16,007
  0
  405
  0
  1,561
  0
  273
  0
  13,768
  0
  16,007
  5,826
  405
  149
  1,561
  566
  273
  101
  13,768
  5,010
  16,007
  3,195
  405
  72
  1,561
  320
  273
  52
  13,768
  2,751
  16,007
  3,175
  405
  82
  1,561
  305
  273
  55
  13,768
  2,733
  16,007
  3,190
  405
  78
  1,561
  291
  273
  37
  13,768
  2,784
  16,007
  3,176
  405
  71
  1,561
  320
  273
  54
  13,768
  2,731
  16,007
  3,193
  405
  92
  1,561
  298
  273
  56
  13,768
  2,747
  16,007
  3,150
  405
  75
  1,561
  310
  273
  64
  13,768
  2,701
  16,007
  3,192
  405
  78
  1,561
  291
  273
  53
  13,768
  2,770
  16,007
  13,503
  405
  353
  1,561
  1,304
  273
  237
  13,768
  11,609
  16,007
  15,347
  405
  391
  1,561
  1,483
  273
  259
  13,768
  13,214
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband1.txt not foun
> d)
  4,605
  4,605
  143
  143
  455
  455
  85
  85
  3,922
  3,922
  4,605
  0
  143
  0
  455
  0
  85
  0
  3,922
  0
  4,605
  0
  143
  0
  455
  0
  85
  0
  3,922
  0
  4,605
  0
  143
  0
  455
  0
  85
  0
  3,922
  0
  4,605
  0
  143
  0
  455
  0
  85
  0
  3,922
  0
  4,605
  1,105
  143
  33
  455
  117
  85
  16
  3,922
  939
  4,605
  2,193
  143
  65
  455
  217
  85
  50
  3,922
  1,861
  4,605
  1,307
  143
  45
  455
  121
  85
  19
  3,922
  1,122
  4,605
  2,355
  143
  77
  455
  233
  85
  42
  3,922
  2,003
  4,605
  2,250
  143
  66
  455
  222
  85
  43
  3,922
  1,919
  4,605
  456
  143
  11
  455
  35
  85
  10
  3,922
  400
  4,605
  1,012
  143
  27
  455
  95
  85
  19
  3,922
  871
  4,605
  814
  143
  35
  455
  68
  85
  10
  3,922
  701
  4,605
  651
  143
  18
  455
  59
  85
  9
  3,922
  565
  4,605
  420
  143
  9
  455
  56
  85
  10
  3,922
  345
  4,605
  295
  143
  15
  455
  34
  85
  4
  3,922
  242
  4,605
  957
  143
  28
  455
  108
  85
  23
  3,922
  798
  4,605
  174
  143
  5
  455
  13
  85
  3
  3,922
  153
  4,605
  101
  143
  2
  455
  10
  85
  2
  3,922
  87
  4,605
  525
  143
  19
  455
  47
  85
  12
  3,922
  447
  4,605
  3,805
  143
  117
  455
  385
  85
  68
  3,922
  3,235
  4,605
  3,621
  143
  121
  455
  363
  85
  63
  3,922
  3,074
  4,605
  0
  143
  0
  455
  0
  85
  0
  3,922
  0
  4,605
  493
  143
  10
  455
  47
  85
  18
  3,922
  418
  4,605
  0
  143
  0
  455
  0
  85
  0
  3,922
  0
  4,605
  491
  143
  12
  455
  45
  85
  4
  3,922
  430
  4,605
  0
  143
  0
  455
  0
  85
  0
  3,922
  0
  4,605
  3,237
  143
  94
  455
  309
  85
  57
  3,922
  2,777
  4,605
  0
  143
  0
  455
  0
  85
  0
  3,922
  0
  4,605
  0
  143
  0
  455
  0
  85
  0
  3,922
  0
  4,605
  916
  143
  39
  455
  92
  85
  19
  3,922
  766
  4,605
  452
  143
  10
  455
  54
  85
  9
  3,922
  379
  4,605
  31
  143
  28
  455
  2
  85
  1
  3,922
  0
  4,605
  39
  143
  24
  455
  11
  85
  3
  3,922
  1
  4,605
  4,535
  143
  91
  455
  442
  85
  81
  3,922
  3,921
  4,605
  1
  143
  0
  455
  0
  85
  0
  3,922
  1
  4,605
  0
  143
  0
  455
  0
  85
  0
  3,922
  0
  4,605
  8
  143
  1
  455
  1
  85
  0
  3,922
  6
  4,605
  4,161
  143
  129
  455
  421
  85
  72
  3,922
  3,539
  4,605
  435
  143
  13
  455
  33
  85
  13
  3,922
  376
  4,605
  4,244
  143
  131
  455
  426
  85
  76
  3,922
  3,611
  4,605
  933
  143
  37
  455
  102
  85
  20
  3,922
  774
  4,605
  374
  143
  6
  455
  27
  85
  7
  3,922
  334
  4,605
  913
  143
  33
  455
  100
  85
  19
  3,922
  761
  4,605
  3,486
  143
  108
  455
  345
  85
  71
  3,922
  2,962
  4,605
  99
  143
  5
  455
  10
  85
  2
  3,922
  82
  4,605
  30
  143
  3
  455
  5
  85
  0
  3,922
  22
  4,605
  814
  143
  18
  455
  73
  85
  10
  3,922
  713
  4,605
  172
  143
  9
  455
  20
  85
  2
  3,922
  141
  4,605
  4
  143
  0
  455
  2
  85
  0
  3,922
  2
  4,605
  29
  143
  2
  455
  3
  85
  0
  3,922
  24
  4,605
  73
  143
  3
  455
  9
  85
  3
  3,922
  58
  4,605
  832
  143
  30
  455
  61
  85
  13
  3,922
  728
  4,605
  18
  143
  0
  455
  2
  85
  1
  3,922
  15
  4,605
  82
  143
  2
  455
  9
  85
  2
  3,922
  69
  4,605
  854
  143
  34
  455
  93
  85
  14
  3,922
  713
  4,605
  200
  143
  3
  455
  20
  85
  6
  3,922
  171
  4,605
  0
  143
  0
  455
  0
  85
  0
  3,922
  0
  4,605
  1,625
  143
  51
  455
  152
  85
  37
  3,922
  1,385
  4,605
  895
  143
  32
  455
  77
  85
  14
  3,922
  772
  4,605
  910
  143
  31
  455
  98
  85
  14
  3,922
  767
  4,605
  931
  143
  31
  455
  87
  85
  12
  3,922
  801
  4,605
  927
  143
  30
  455
  110
  85
  14
  3,922
  773
  4,605
  908
  143
  31
  455
  108
  85
  12
  3,922
  757
  4,605
  932
  143
  30
  455
  87
  85
  21
  3,922
  794
  4,605
  929
  143
  33
  455
  92
  85
  21
  3,922
  783
  4,605
  3,897
  143
  121
  455
  381
  85
  69
  3,922
  3,326
  4,605
  4,438
  143
  139
  455
  440
  85
  81
  3,922
  3,778

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/03b_an_descriptive_table_1.log
  log type:  text
 closed on:  24 Jul 2021, 18:06:31
-------------------------------------------------------------------------------
