-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/03b_an_descriptive_table_1.log
  log type:  text
 opened on:  28 Oct 2021, 11:15:39

. 
. program define generaterow
  1. syntax, variable(varname) condition(string) outcome(string)
  2.         
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3.         
.         cou
  4.         local overalldenom=r(N)
  5.         
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  (" (") %3.1f (`colpct') (")"
> ) _tab
  9. 
.         cou if kids_cat4==0 
 10.         local coldenom = r(N)
 11.         cou if kids_cat4==0 & `variable' `condition'
 12.         local pct = 100*(r(N)/`coldenom')
 13.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 14.         
.         cou if kids_cat4==1 
 15.         local coldenom = r(N)
 16.         cou if kids_cat4==1 & `variable' `condition'
 17.         local pct = 100*(r(N)/`coldenom')
 18.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 19.         
.         cou if kids_cat4==2 
 20.         local coldenom = r(N)
 21.         cou if kids_cat4==2 & `variable' `condition'
 22.         local pct = 100*(r(N)/`coldenom')
 23.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 24. 
.         cou if kids_cat4==3 
 25.         local coldenom = r(N)
 26.         cou if kids_cat4==3 & `variable' `condition'
 27.         local pct = 100*(r(N)/`coldenom')
 28.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _n
 29.         
. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] outcome(string)
  2. 
.         foreach varlevel of numlist `start'/`end'{ 
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) outcome(kids_cat4)
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") outcome(kids_cat4)
  6. 
. end

. 
. *****************************************************************************
> **
. 
. *Set up output file
. 
. forvalues x=0/1 {
  2. 
. cap file close tablecontent
  3. file open tablecontent using ./output/03b_an_descriptive_table_1_kids_cat4
> _ageband`x'`dataset'.txt, write text replace
  4. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) outcome(kids_cat4)
  7. file write tablecontent _n 
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) outcome(kids_cat4) 
  9. file write tablecontent _n 
 10. 
. tabulatevariable, variable(male) start(0) end(1) outcome(kids_cat4)
 11. file write tablecontent _n 
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing outcome(kids_cat4)
 13. file write tablecontent _n 
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing outcome(kids_cat4) 
 15. file write tablecontent _n 
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing outcome(kids_ca
> t4)
 17. file write tablecontent _n 
 18. 
. tabulatevariable, variable(imd) start(1) end(5) outcome(kids_cat4)
 19. file write tablecontent _n 
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) outcome(kids_cat4)
 21. file write tablecontent _n 
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing outcome(kids_cat4)
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) outcome(kids_
> cat4)                 
 24. file write tablecontent _n  
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) outco
> me(kids_cat4)
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1) outcome(kids_cat4) /*ever 
> asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) outcome(k
> ids_cat4)
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) outcome(kids_cat4) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4) outcome(kids_cat4
> ) /*<1, 1-4.9, 5+ years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4) outcome(kids_ca
> t4) /*<1, 1-4.9, 5+ years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) outco
> me(kids_cat4)
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) outcome(kids_cat4)
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) outcome(kid
> s_cat4)
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) outcome(kids_cat4
> )
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) outcome(kids_cat4)
 40. *OTHER ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) outcome(kids_cat
> 4)
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) outcome(kids_cat4)
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) outcome(kids_cat
> 4)
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) outcome(kids_cat4)
 44. *SHEILDING
. tabulatevariable, variable(shield) start(1) end(1) outcome(kids_cat4)
 45. *anycomorbidity
. tabulatevariable, variable(anycomorb) start(1) end(1) outcome(kids_cat4)
 46. 
. file close tablecontent
 47. 
. }
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband0.txt not foun
> d)
  16,082
  16,082
  440
  440
  1,652
  1,652
  259
  259
  13,731
  13,731
  16,082
  4,017
  440
  112
  1,652
  400
  259
  80
  13,731
  3,425
  16,082
  3,506
  440
  98
  1,652
  387
  259
  57
  13,731
  2,964
  16,082
  3,312
  440
  86
  1,652
  335
  259
  44
  13,731
  2,847
  16,082
  3,449
  440
  104
  1,652
  335
  259
  45
  13,731
  2,965
  16,082
  1,798
  440
  40
  1,652
  195
  259
  33
  13,731
  1,530
  16,082
  0
  440
  0
  1,652
  0
  259
  0
  13,731
  0
  16,082
  0
  440
  0
  1,652
  0
  259
  0
  13,731
  0
  16,082
  8,218
  440
  231
  1,652
  880
  259
  128
  13,731
  6,979
  16,082
  7,864
  440
  209
  1,652
  772
  259
  131
  13,731
  6,752
  16,082
  1,500
  440
  38
  1,652
  174
  259
  32
  13,731
  1,256
  16,082
  3,572
  440
  95
  1,652
  354
  259
  56
  13,731
  3,067
  16,082
  2,783
  440
  74
  1,652
  286
  259
  48
  13,731
  2,375
  16,082
  2,181
  440
  69
  1,652
  204
  259
  32
  13,731
  1,876
  16,082
  1,379
  440
  26
  1,652
  139
  259
  13
  13,731
  1,201
  16,082
  893
  440
  30
  1,652
  90
  259
  16
  13,731
  757
  16,082
  3,774
  440
  108
  1,652
  405
  259
  62
  13,731
  3,199
  16,082
  646
  440
  17
  1,652
  70
  259
  11
  13,731
  548
  16,082
  339
  440
  5
  1,652
  44
  259
  2
  13,731
  288
  16,082
  1,947
  440
  49
  1,652
  213
  259
  31
  13,731
  1,654
  16,082
  13,150
  440
  369
  1,652
  1,325
  259
  215
  13,731
  11,241
  16,082
  12,953
  440
  356
  1,652
  1,337
  259
  209
  13,731
  11,051
  16,082
  0
  440
  0
  1,652
  0
  259
  0
  13,731
  0
  16,082
  1,549
  440
  33
  1,652
  166
  259
  21
  13,731
  1,329
  16,082
  0
  440
  0
  1,652
  0
  259
  0
  13,731
  0
  16,082
  1,580
  440
  51
  1,652
  149
  259
  29
  13,731
  1,351
  16,082
  0
  440
  0
  1,652
  0
  259
  0
  13,731
  0
  16,082
  11,298
  440
  313
  1,652
  1,146
  259
  168
  13,731
  9,671
  16,082
  0
  440
  0
  1,652
  0
  259
  0
  13,731
  0
  16,082
  0
  440
  0
  1,652
  0
  259
  0
  13,731
  0
  16,082
  3,159
  440
  85
  1,652
  336
  259
  61
  13,731
  2,677
  16,082
  1,625
  440
  42
  1,652
  170
  259
  30
  13,731
  1,383
  16,082
  93
  440
  74
  1,652
  12
  259
  5
  13,731
  2
  16,082
  111
  440
  67
  1,652
  27
  259
  14
  13,731
  3
  16,082
  15,878
  440
  299
  1,652
  1,613
  259
  240
  13,731
  13,726
  16,082
  3,628
  440
  86
  1,652
  358
  259
  58
  13,731
  3,126
  16,082
  2,441
  440
  71
  1,652
  243
  259
  38
  13,731
  2,089
  16,082
  5,859
  440
  164
  1,652
  610
  259
  100
  13,731
  4,985
  16,082
  2,548
  440
  76
  1,652
  260
  259
  34
  13,731
  2,178
  16,082
  1,606
  440
  43
  1,652
  181
  259
  29
  13,731
  1,353
  16,082
  5,308
  440
  147
  1,652
  569
  259
  79
  13,731
  4,513
  16,082
  3,221
  440
  87
  1,652
  331
  259
  43
  13,731
  2,760
  16,082
  1,238
  440
  45
  1,652
  121
  259
  14
  13,731
  1,058
  16,082
  3,194
  440
  92
  1,652
  362
  259
  52
  13,731
  2,688
  16,082
  12,307
  440
  342
  1,652
  1,264
  259
  190
  13,731
  10,511
  16,082
  414
  440
  10
  1,652
  43
  259
  11
  13,731
  350
  16,082
  82
  440
  2
  1,652
  8
  259
  0
  13,731
  72
  16,082
  2,651
  440
  68
  1,652
  289
  259
  42
  13,731
  2,252
  16,082
  608
  440
  18
  1,652
  47
  259
  16
  13,731
  527
  16,082
  20
  440
  0
  1,652
  1
  259
  0
  13,731
  19
  16,082
  57
  440
  1
  1,652
  8
  259
  0
  13,731
  48
  16,082
  254
  440
  8
  1,652
  29
  259
  2
  13,731
  215
  16,082
  2,873
  440
  78
  1,652
  296
  259
  45
  13,731
  2,454
  16,082
  42
  440
  0
  1,652
  2
  259
  0
  13,731
  40
  16,082
  264
  440
  8
  1,652
  30
  259
  7
  13,731
  219
  16,082
  2,830
  440
  77
  1,652
  253
  259
  48
  13,731
  2,452
  16,082
  62
  440
  4
  1,652
  8
  259
  1
  13,731
  49
  16,082
  0
  440
  0
  1,652
  0
  259
  0
  13,731
  0
  16,082
  5,762
  440
  167
  1,652
  623
  259
  83
  13,731
  4,889
  16,082
  3,199
  440
  80
  1,652
  299
  259
  47
  13,731
  2,773
  16,082
  3,172
  440
  93
  1,652
  349
  259
  48
  13,731
  2,682
  16,082
  3,232
  440
  90
  1,652
  343
  259
  54
  13,731
  2,745
  16,082
  3,277
  440
  105
  1,652
  333
  259
  46
  13,731
  2,793
  16,082
  3,272
  440
  90
  1,652
  306
  259
  43
  13,731
  2,833
  16,082
  3,266
  440
  84
  1,652
  340
  259
  53
  13,731
  2,789
  16,082
  3,171
  440
  99
  1,652
  340
  259
  52
  13,731
  2,680
  16,082
  13,611
  440
  379
  1,652
  1,403
  259
  209
  13,731
  11,620
  16,082
  15,484
  440
  425
  1,652
  1,589
  259
  245
  13,731
  13,225
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband1.txt not foun
> d)
  4,551
  4,551
  132
  132
  475
  475
  93
  93
  3,851
  3,851
  4,551
  0
  132
  0
  475
  0
  93
  0
  3,851
  0
  4,551
  0
  132
  0
  475
  0
  93
  0
  3,851
  0
  4,551
  0
  132
  0
  475
  0
  93
  0
  3,851
  0
  4,551
  0
  132
  0
  475
  0
  93
  0
  3,851
  0
  4,551
  1,092
  132
  28
  475
  122
  93
  29
  3,851
  913
  4,551
  2,249
  132
  61
  475
  233
  93
  40
  3,851
  1,915
  4,551
  1,210
  132
  43
  475
  120
  93
  24
  3,851
  1,023
  4,551
  2,349
  132
  66
  475
  251
  93
  47
  3,851
  1,985
  4,551
  2,202
  132
  66
  475
  224
  93
  46
  3,851
  1,866
  4,551
  450
  132
  14
  475
  48
  93
  14
  3,851
  374
  4,551
  1,029
  132
  29
  475
  108
  93
  20
  3,851
  872
  4,551
  807
  132
  21
  475
  92
  93
  18
  3,851
  676
  4,551
  687
  132
  27
  475
  77
  93
  12
  3,851
  571
  4,551
  389
  132
  6
  475
  39
  93
  10
  3,851
  334
  4,551
  240
  132
  7
  475
  20
  93
  6
  3,851
  207
  4,551
  949
  132
  28
  475
  91
  93
  13
  3,851
  817
  4,551
  190
  132
  7
  475
  20
  93
  3
  3,851
  160
  4,551
  87
  132
  2
  475
  11
  93
  3
  3,851
  71
  4,551
  551
  132
  7
  475
  52
  93
  13
  3,851
  479
  4,551
  3,723
  132
  116
  475
  392
  93
  74
  3,851
  3,141
  4,551
  3,611
  132
  102
  475
  376
  93
  73
  3,851
  3,060
  4,551
  0
  132
  0
  475
  0
  93
  0
  3,851
  0
  4,551
  456
  132
  9
  475
  46
  93
  6
  3,851
  395
  4,551
  0
  132
  0
  475
  0
  93
  0
  3,851
  0
  4,551
  484
  132
  21
  475
  53
  93
  14
  3,851
  396
  4,551
  0
  132
  0
  475
  0
  93
  0
  3,851
  0
  4,551
  3,209
  132
  94
  475
  336
  93
  77
  3,851
  2,702
  4,551
  0
  132
  0
  475
  0
  93
  0
  3,851
  0
  4,551
  0
  132
  0
  475
  0
  93
  0
  3,851
  0
  4,551
  916
  132
  26
  475
  98
  93
  11
  3,851
  781
  4,551
  426
  132
  12
  475
  41
  93
  5
  3,851
  368
  4,551
  33
  132
  27
  475
  4
  93
  1
  3,851
  1
  4,551
  25
  132
  17
  475
  4
  93
  3
  3,851
  1
  4,551
  4,493
  132
  88
  475
  467
  93
  89
  3,851
  3,849
  4,551
  950
  132
  46
  475
  95
  93
  17
  3,851
  792
  4,551
  725
  132
  20
  475
  75
  93
  14
  3,851
  616
  4,551
  1,701
  132
  43
  475
  197
  93
  38
  3,851
  1,423
  4,551
  715
  132
  18
  475
  75
  93
  12
  3,851
  610
  4,551
  460
  132
  5
  475
  33
  93
  12
  3,851
  410
  4,551
  1,454
  132
  31
  475
  164
  93
  28
  3,851
  1,231
  4,551
  931
  132
  16
  475
  93
  93
  25
  3,851
  797
  4,551
  382
  132
  14
  475
  46
  93
  3
  3,851
  319
  4,551
  932
  132
  21
  475
  85
  93
  17
  3,851
  809
  4,551
  3,490
  132
  110
  475
  353
  93
  77
  3,851
  2,950
  4,551
  127
  132
  0
  475
  19
  93
  5
  3,851
  103
  4,551
  26
  132
  2
  475
  6
  93
  0
  3,851
  18
  4,551
  724
  132
  17
  475
  74
  93
  11
  3,851
  622
  4,551
  180
  132
  3
  475
  23
  93
  0
  3,851
  154
  4,551
  4
  132
  0
  475
  0
  93
  0
  3,851
  4
  4,551
  25
  132
  0
  475
  5
  93
  0
  3,851
  20
  4,551
  69
  132
  6
  475
  5
  93
  1
  3,851
  57
  4,551
  790
  132
  19
  475
  84
  93
  16
  3,851
  671
  4,551
  24
  132
  0
  475
  4
  93
  2
  3,851
  18
  4,551
  68
  132
  3
  475
  8
  93
  1
  3,851
  56
  4,551
  806
  132
  22
  475
  74
  93
  16
  3,851
  694
  4,551
  186
  132
  3
  475
  21
  93
  3
  3,851
  159
  4,551
  0
  132
  0
  475
  0
  93
  0
  3,851
  0
  4,551
  1,599
  132
  49
  475
  177
  93
  30
  3,851
  1,343
  4,551
  917
  132
  24
  475
  96
  93
  24
  3,851
  773
  4,551
  932
  132
  27
  475
  90
  93
  16
  3,851
  799
  4,551
  911
  132
  25
  475
  104
  93
  21
  3,851
  761
  4,551
  925
  132
  16
  475
  96
  93
  26
  3,851
  787
  4,551
  910
  132
  24
  475
  80
  93
  18
  3,851
  788
  4,551
  882
  132
  22
  475
  85
  93
  17
  3,851
  758
  4,551
  940
  132
  24
  475
  92
  93
  15
  3,851
  809
  4,551
  3,828
  132
  103
  475
  390
  93
  77
  3,851
  3,258
  4,551
  4,385
  132
  122
  475
  455
  93
  88
  3,851
  3,720

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/03b_an_descriptive_table_1.log
  log type:  text
 closed on:  28 Oct 2021, 11:15:41
-------------------------------------------------------------------------------
