-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/03b_an_descriptive_table_1.log
  log type:  text
 opened on:  23 Nov 2021, 15:41:26

. 
. program define generaterow
  1. syntax, variable(varname) condition(string) outcome(string)
  2.         
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3.         
.         cou
  4.         local overalldenom=r(N)
  5.         
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  _tab %3.1f (`colpct') _tab
  9. 
.         cou if kids_cat4==0 
 10.         local coldenom = r(N)
 11.         cou if kids_cat4==0 & `variable' `condition'
 12.         local pct = 100*(r(N)/`coldenom')
 13.         file write tablecontent (r(N)) _tab %4.2f  (`pct')  _tab
 14.         
.         cou if kids_cat4==1 
 15.         local coldenom = r(N)
 16.         cou if kids_cat4==1 & `variable' `condition'
 17.         local pct = 100*(r(N)/`coldenom')
 18.         file write tablecontent (r(N)) _tab %4.2f  (`pct')  _tab
 19.         
.         cou if kids_cat4==2 
 20.         local coldenom = r(N)
 21.         cou if kids_cat4==2 & `variable' `condition'
 22.         local pct = 100*(r(N)/`coldenom')
 23.         file write tablecontent (r(N)) _tab %4.2f  (`pct')  _tab
 24. 
.         cou if kids_cat4==3 
 25.         local coldenom = r(N)
 26.         cou if kids_cat4==3 & `variable' `condition'
 27.         local pct = 100*(r(N)/`coldenom')
 28.         file write tablecontent (r(N)) _tab %4.2f  (`pct')  _n
 29.         
. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] outcome(string)
  2. 
.         foreach varlevel of numlist `start'/`end'{ 
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) outcome(kids_cat4)
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") outcome(kids_cat4)
  6. 
. end

. 
. *****************************************************************************
> **
. 
. *Set up output file
. 
. forvalues x=0/1 {
  2. 
. cap file close tablecontent
  3. file open tablecontent using ./output/03b_an_descriptive_table_1_kids_cat4
> _ageband`x'`dataset'.txt, write text replace
  4. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) outcome(kids_cat4)
  7. file write tablecontent _n 
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) outcome(kids_cat4) 
  9. file write tablecontent _n 
 10. 
. tabulatevariable, variable(male) start(0) end(1) outcome(kids_cat4)
 11. file write tablecontent _n 
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing outcome(kids_cat4)
 13. file write tablecontent _n 
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing outcome(kids_cat4) 
 15. file write tablecontent _n 
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing outcome(kids_ca
> t4)
 17. file write tablecontent _n 
 18. 
. tabulatevariable, variable(imd) start(1) end(5) outcome(kids_cat4)
 19. file write tablecontent _n 
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) outcome(kids_cat4)
 21. file write tablecontent _n 
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing outcome(kids_cat4)
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) outcome(kids_
> cat4)                 
 24. file write tablecontent _n  
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) outco
> me(kids_cat4)
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1) outcome(kids_cat4) /*ever 
> asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) outcome(k
> ids_cat4)
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) outcome(kids_cat4) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4) outcome(kids_cat4
> ) /*<1, 1-4.9, 5+ years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4) outcome(kids_ca
> t4) /*<1, 1-4.9, 5+ years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) outco
> me(kids_cat4)
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) outcome(kids_cat4)
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) outcome(kid
> s_cat4)
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) outcome(kids_cat4
> )
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) outcome(kids_cat4)
 40. *OTHER ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) outcome(kids_cat
> 4)
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) outcome(kids_cat4)
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) outcome(kids_cat
> 4)
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) outcome(kids_cat4)
 44. *SHEILDING
. tabulatevariable, variable(shield) start(1) end(1) outcome(kids_cat4)
 45. *anycomorbidity
. tabulatevariable, variable(anycomorb) start(1) end(1) outcome(kids_cat4)
 46. 
. file close tablecontent
 47. 
. }
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband0.txt not foun
> d)
  16,123
  16,123
  517
  517
  1,900
  1,900
  175
  175
  13,531
  13,531
  16,123
  4,024
  517
  126
  1,900
  468
  175
  48
  13,531
  3,382
  16,123
  3,440
  517
  112
  1,900
  400
  175
  38
  13,531
  2,890
  16,123
  3,316
  517
  99
  1,900
  400
  175
  38
  13,531
  2,779
  16,123
  3,649
  517
  112
  1,900
  443
  175
  31
  13,531
  3,063
  16,123
  1,694
  517
  68
  1,900
  189
  175
  20
  13,531
  1,417
  16,123
  0
  517
  0
  1,900
  0
  175
  0
  13,531
  0
  16,123
  0
  517
  0
  1,900
  0
  175
  0
  13,531
  0
  16,123
  8,169
  517
  244
  1,900
  964
  175
  91
  13,531
  6,870
  16,123
  7,954
  517
  273
  1,900
  936
  175
  84
  13,531
  6,661
  16,123
  1,526
  517
  48
  1,900
  174
  175
  17
  13,531
  1,287
  16,123
  3,654
  517
  110
  1,900
  445
  175
  35
  13,531
  3,064
  16,123
  2,838
  517
  98
  1,900
  352
  175
  24
  13,531
  2,364
  16,123
  2,146
  517
  63
  1,900
  249
  175
  26
  13,531
  1,808
  16,123
  1,412
  517
  51
  1,900
  182
  175
  12
  13,531
  1,167
  16,123
  885
  517
  29
  1,900
  94
  175
  16
  13,531
  746
  16,123
  3,662
  517
  118
  1,900
  404
  175
  45
  13,531
  3,095
  16,123
  667
  517
  21
  1,900
  98
  175
  5
  13,531
  543
  16,123
  309
  517
  7
  1,900
  34
  175
  3
  13,531
  265
  16,123
  1,979
  517
  69
  1,900
  216
  175
  20
  13,531
  1,674
  16,123
  13,168
  517
  420
  1,900
  1,552
  175
  147
  13,531
  11,049
  16,123
  12,919
  517
  421
  1,900
  1,499
  175
  136
  13,531
  10,863
  16,123
  0
  517
  0
  1,900
  0
  175
  0
  13,531
  0
  16,123
  1,615
  517
  55
  1,900
  196
  175
  20
  13,531
  1,344
  16,123
  0
  517
  0
  1,900
  0
  175
  0
  13,531
  0
  16,123
  1,589
  517
  41
  1,900
  205
  175
  19
  13,531
  1,324
  16,123
  0
  517
  0
  1,900
  0
  175
  0
  13,531
  0
  16,123
  11,284
  517
  363
  1,900
  1,313
  175
  126
  13,531
  9,482
  16,123
  0
  517
  0
  1,900
  0
  175
  0
  13,531
  0
  16,123
  0
  517
  0
  1,900
  0
  175
  0
  13,531
  0
  16,123
  3,246
  517
  94
  1,900
  394
  175
  34
  13,531
  2,724
  16,123
  1,593
  517
  60
  1,900
  193
  175
  15
  13,531
  1,325
  16,123
  99
  517
  80
  1,900
  13
  175
  4
  13,531
  2
  16,123
  104
  517
  68
  1,900
  19
  175
  6
  13,531
  11
  16,123
  15,920
  517
  369
  1,900
  1,868
  175
  165
  13,531
  13,518
  16,123
  3,698
  517
  114
  1,900
  450
  175
  42
  13,531
  3,092
  16,123
  2,344
  517
  73
  1,900
  272
  175
  19
  13,531
  1,980
  16,123
  5,957
  517
  186
  1,900
  695
  175
  71
  13,531
  5,005
  16,123
  2,533
  517
  84
  1,900
  305
  175
  28
  13,531
  2,116
  16,123
  1,591
  517
  60
  1,900
  178
  175
  15
  13,531
  1,338
  16,123
  5,223
  517
  165
  1,900
  620
  175
  59
  13,531
  4,379
  16,123
  3,232
  517
  101
  1,900
  391
  175
  48
  13,531
  2,692
  16,123
  1,267
  517
  40
  1,900
  144
  175
  19
  13,531
  1,064
  16,123
  3,235
  517
  87
  1,900
  401
  175
  39
  13,531
  2,708
  16,123
  12,396
  517
  394
  1,900
  1,465
  175
  127
  13,531
  10,410
  16,123
  378
  517
  19
  1,900
  42
  175
  3
  13,531
  314
  16,123
  89
  517
  2
  1,900
  8
  175
  2
  13,531
  77
  16,123
  2,673
  517
  84
  1,900
  325
  175
  38
  13,531
  2,226
  16,123
  580
  517
  18
  1,900
  59
  175
  5
  13,531
  498
  16,123
  7
  517
  0
  1,900
  1
  175
  0
  13,531
  6
  16,123
  59
  517
  2
  1,900
  7
  175
  1
  13,531
  49
  16,123
  288
  517
  11
  1,900
  35
  175
  1
  13,531
  241
  16,123
  2,914
  517
  100
  1,900
  361
  175
  32
  13,531
  2,421
  16,123
  61
  517
  2
  1,900
  11
  175
  1
  13,531
  47
  16,123
  242
  517
  13
  1,900
  26
  175
  5
  13,531
  198
  16,123
  2,861
  517
  82
  1,900
  349
  175
  34
  13,531
  2,396
  16,123
  72
  517
  4
  1,900
  12
  175
  0
  13,531
  56
  16,123
  0
  517
  0
  1,900
  0
  175
  0
  13,531
  0
  16,123
  5,851
  517
  187
  1,900
  716
  175
  67
  13,531
  4,881
  16,123
  3,174
  517
  85
  1,900
  365
  175
  34
  13,531
  2,690
  16,123
  3,242
  517
  92
  1,900
  400
  175
  32
  13,531
  2,718
  16,123
  3,212
  517
  84
  1,900
  392
  175
  38
  13,531
  2,698
  16,123
  3,226
  517
  113
  1,900
  385
  175
  36
  13,531
  2,692
  16,123
  3,232
  517
  108
  1,900
  398
  175
  42
  13,531
  2,684
  16,123
  3,270
  517
  96
  1,900
  407
  175
  41
  13,531
  2,726
  16,123
  3,205
  517
  115
  1,900
  370
  175
  31
  13,531
  2,689
  16,123
  13,643
  517
  449
  1,900
  1,616
  175
  150
  13,531
  11,428
  16,123
  15,501
  517
  498
  1,900
  1,833
  175
  172
  13,531
  12,998
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband1.txt not foun
> d)
  4,508
  4,508
  158
  158
  523
  523
  50
  50
  3,777
  3,777
  4,508
  0
  158
  0
  523
  0
  50
  0
  3,777
  0
  4,508
  0
  158
  0
  523
  0
  50
  0
  3,777
  0
  4,508
  0
  158
  0
  523
  0
  50
  0
  3,777
  0
  4,508
  0
  158
  0
  523
  0
  50
  0
  3,777
  0
  4,508
  1,018
  158
  36
  523
  125
  50
  14
  3,777
  843
  4,508
  2,227
  158
  75
  523
  246
  50
  20
  3,777
  1,886
  4,508
  1,263
  158
  47
  523
  152
  50
  16
  3,777
  1,048
  4,508
  2,290
  158
  74
  523
  266
  50
  25
  3,777
  1,925
  4,508
  2,218
  158
  84
  523
  257
  50
  25
  3,777
  1,852
  4,508
  399
  158
  14
  523
  55
  50
  3
  3,777
  327
  4,508
  1,028
  158
  40
  523
  123
  50
  12
  3,777
  853
  4,508
  826
  158
  34
  523
  95
  50
  7
  3,777
  690
  4,508
  637
  158
  18
  523
  58
  50
  9
  3,777
  552
  4,508
  382
  158
  20
  523
  43
  50
  5
  3,777
  314
  4,508
  274
  158
  8
  523
  28
  50
  1
  3,777
  237
  4,508
  962
  158
  24
  523
  121
  50
  13
  3,777
  804
  4,508
  194
  158
  10
  523
  14
  50
  3
  3,777
  167
  4,508
  91
  158
  1
  523
  12
  50
  1
  3,777
  77
  4,508
  535
  158
  16
  523
  63
  50
  4
  3,777
  452
  4,508
  3,688
  158
  131
  523
  434
  50
  42
  3,777
  3,081
  4,508
  3,598
  158
  131
  523
  410
  50
  40
  3,777
  3,017
  4,508
  0
  158
  0
  523
  0
  50
  0
  3,777
  0
  4,508
  460
  158
  14
  523
  59
  50
  4
  3,777
  383
  4,508
  0
  158
  0
  523
  0
  50
  0
  3,777
  0
  4,508
  450
  158
  13
  523
  54
  50
  6
  3,777
  377
  4,508
  0
  158
  0
  523
  0
  50
  0
  3,777
  0
  4,508
  3,173
  158
  117
  523
  372
  50
  39
  3,777
  2,645
  4,508
  0
  158
  0
  523
  0
  50
  0
  3,777
  0
  4,508
  0
  158
  0
  523
  0
  50
  0
  3,777
  0
  4,508
  887
  158
  25
  523
  99
  50
  8
  3,777
  755
  4,508
  448
  158
  16
  523
  52
  50
  3
  3,777
  377
  4,508
  28
  158
  23
  523
  4
  50
  1
  3,777
  0
  4,508
  29
  158
  19
  523
  4
  50
  3
  3,777
  3
  4,508
  4,451
  158
  116
  523
  515
  50
  46
  3,777
  3,774
  4,508
  982
  158
  36
  523
  137
  50
  7
  3,777
  802
  4,508
  689
  158
  21
  523
  82
  50
  7
  3,777
  579
  4,508
  1,647
  158
  53
  523
  173
  50
  19
  3,777
  1,402
  4,508
  745
  158
  25
  523
  85
  50
  11
  3,777
  624
  4,508
  445
  158
  23
  523
  46
  50
  6
  3,777
  370
  4,508
  1,480
  158
  58
  523
  168
  50
  15
  3,777
  1,239
  4,508
  869
  158
  40
  523
  92
  50
  13
  3,777
  724
  4,508
  349
  158
  20
  523
  41
  50
  4
  3,777
  284
  4,508
  885
  158
  36
  523
  99
  50
  9
  3,777
  741
  4,508
  3,436
  158
  113
  523
  394
  50
  41
  3,777
  2,888
  4,508
  115
  158
  6
  523
  8
  50
  2
  3,777
  99
  4,508
  27
  158
  2
  523
  2
  50
  0
  3,777
  23
  4,508
  734
  158
  27
  523
  94
  50
  6
  3,777
  607
  4,508
  190
  158
  9
  523
  22
  50
  1
  3,777
  158
  4,508
  6
  158
  1
  523
  3
  50
  0
  3,777
  2
  4,508
  13
  158
  0
  523
  1
  50
  0
  3,777
  12
  4,508
  74
  158
  1
  523
  9
  50
  1
  3,777
  63
  4,508
  772
  158
  24
  523
  101
  50
  7
  3,777
  640
  4,508
  14
  158
  0
  523
  1
  50
  1
  3,777
  12
  4,508
  76
  158
  2
  523
  10
  50
  2
  3,777
  62
  4,508
  791
  158
  33
  523
  83
  50
  4
  3,777
  671
  4,508
  168
  158
  2
  523
  18
  50
  3
  3,777
  145
  4,508
  0
  158
  0
  523
  0
  50
  0
  3,777
  0
  4,508
  1,634
  158
  69
  523
  199
  50
  12
  3,777
  1,354
  4,508
  934
  158
  37
  523
  104
  50
  10
  3,777
  783
  4,508
  882
  158
  30
  523
  99
  50
  5
  3,777
  748
  4,508
  906
  158
  29
  523
  97
  50
  13
  3,777
  767
  4,508
  908
  158
  37
  523
  102
  50
  14
  3,777
  755
  4,508
  899
  158
  32
  523
  95
  50
  11
  3,777
  761
  4,508
  906
  158
  29
  523
  100
  50
  8
  3,777
  769
  4,508
  914
  158
  30
  523
  95
  50
  17
  3,777
  772
  4,508
  3,775
  158
  135
  523
  434
  50
  43
  3,777
  3,163
  4,508
  4,333
  158
  154
  523
  499
  50
  48
  3,777
  3,632

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/03b_an_descriptive_table_1.log
  log type:  text
 closed on:  23 Nov 2021, 15:41:28
-------------------------------------------------------------------------------
