-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/03b_an_descriptive_table_1.log
  log type:  text
 opened on:  17 Aug 2021, 07:44:44

. 
. program define generaterow
  1. syntax, variable(varname) condition(string) outcome(string)
  2.         
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3.         
.         cou
  4.         local overalldenom=r(N)
  5.         
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  (" (") %3.1f (`colpct') (")"
> ) _tab
  9. 
.         cou if kids_cat4==0 
 10.         local coldenom = r(N)
 11.         cou if kids_cat4==0 & `variable' `condition'
 12.         local pct = 100*(r(N)/`coldenom')
 13.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 14.         
.         cou if kids_cat4==1 
 15.         local coldenom = r(N)
 16.         cou if kids_cat4==1 & `variable' `condition'
 17.         local pct = 100*(r(N)/`coldenom')
 18.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 19.         
.         cou if kids_cat4==2 
 20.         local coldenom = r(N)
 21.         cou if kids_cat4==2 & `variable' `condition'
 22.         local pct = 100*(r(N)/`coldenom')
 23.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab
 24. 
.         cou if kids_cat4==3 
 25.         local coldenom = r(N)
 26.         cou if kids_cat4==3 & `variable' `condition'
 27.         local pct = 100*(r(N)/`coldenom')
 28.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _n
 29.         
. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] outcome(string)
  2. 
.         foreach varlevel of numlist `start'/`end'{ 
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) outcome(kids_cat4)
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") outcome(kids_cat4)
  6. 
. end

. 
. *****************************************************************************
> **
. 
. *Set up output file
. 
. forvalues x=0/1 {
  2. 
. cap file close tablecontent
  3. file open tablecontent using ./output/03b_an_descriptive_table_1_kids_cat4
> _ageband`x'`dataset'.txt, write text replace
  4. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) outcome(kids_cat4)
  7. file write tablecontent _n 
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) outcome(kids_cat4) 
  9. file write tablecontent _n 
 10. 
. tabulatevariable, variable(male) start(0) end(1) outcome(kids_cat4)
 11. file write tablecontent _n 
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing outcome(kids_cat4)
 13. file write tablecontent _n 
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing outcome(kids_cat4) 
 15. file write tablecontent _n 
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing outcome(kids_ca
> t4)
 17. file write tablecontent _n 
 18. 
. tabulatevariable, variable(imd) start(1) end(5) outcome(kids_cat4)
 19. file write tablecontent _n 
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) outcome(kids_cat4)
 21. file write tablecontent _n 
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing outcome(kids_cat4)
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) outcome(kids_
> cat4)                 
 24. file write tablecontent _n  
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) outco
> me(kids_cat4)
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1) outcome(kids_cat4) /*ever 
> asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) outcome(k
> ids_cat4)
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) outcome(kids_cat4) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4) outcome(kids_cat4
> ) /*<1, 1-4.9, 5+ years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4) outcome(kids_ca
> t4) /*<1, 1-4.9, 5+ years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) outco
> me(kids_cat4)
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) outcome(kids_cat4)
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) outcome(kid
> s_cat4)
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) outcome(kids_cat4
> )
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) outcome(kids_cat4)
 40. *OTHER ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) outcome(kids_cat
> 4)
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) outcome(kids_cat4)
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) outcome(kids_cat
> 4)
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) outcome(kids_cat4)
 44. *SHEILDING
. tabulatevariable, variable(shield) start(1) end(1) outcome(kids_cat4)
 45. *anycomorbidity
. tabulatevariable, variable(anycomorb) start(1) end(1) outcome(kids_cat4)
 46. 
. file close tablecontent
 47. 
. }
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband0.txt not foun
> d)
  16,149
  16,149
  473
  473
  1,664
  1,664
  265
  265
  13,747
  13,747
  16,149
  4,031
  473
  117
  1,664
  426
  265
  72
  13,747
  3,416
  16,149
  3,419
  473
  101
  1,664
  346
  265
  55
  13,747
  2,917
  16,149
  3,488
  473
  104
  1,664
  378
  265
  61
  13,747
  2,945
  16,149
  3,539
  473
  112
  1,664
  350
  265
  58
  13,747
  3,019
  16,149
  1,672
  473
  39
  1,664
  164
  265
  19
  13,747
  1,450
  16,149
  0
  473
  0
  1,664
  0
  265
  0
  13,747
  0
  16,149
  0
  473
  0
  1,664
  0
  265
  0
  13,747
  0
  16,149
  8,309
  473
  247
  1,664
  855
  265
  118
  13,747
  7,089
  16,149
  7,840
  473
  226
  1,664
  809
  265
  147
  13,747
  6,658
  16,149
  1,437
  473
  46
  1,664
  128
  265
  24
  13,747
  1,239
  16,149
  3,654
  473
  121
  1,664
  376
  265
  49
  13,747
  3,108
  16,149
  2,834
  473
  81
  1,664
  275
  265
  49
  13,747
  2,429
  16,149
  2,250
  473
  59
  1,664
  235
  265
  38
  13,747
  1,918
  16,149
  1,439
  473
  38
  1,664
  154
  265
  28
  13,747
  1,219
  16,149
  962
  473
  27
  1,664
  112
  265
  14
  13,747
  809
  16,149
  3,573
  473
  101
  1,664
  384
  265
  63
  13,747
  3,025
  16,149
  643
  473
  15
  1,664
  66
  265
  14
  13,747
  548
  16,149
  310
  473
  9
  1,664
  42
  265
  4
  13,747
  255
  16,149
  1,905
  473
  61
  1,664
  193
  265
  36
  13,747
  1,615
  16,149
  13,291
  473
  388
  1,664
  1,363
  265
  211
  13,747
  11,329
  16,149
  12,937
  473
  375
  1,664
  1,342
  265
  222
  13,747
  10,998
  16,149
  0
  473
  0
  1,664
  0
  265
  0
  13,747
  0
  16,149
  1,556
  473
  43
  1,664
  161
  265
  16
  13,747
  1,336
  16,149
  0
  473
  0
  1,664
  0
  265
  0
  13,747
  0
  16,149
  1,656
  473
  55
  1,664
  161
  265
  27
  13,747
  1,413
  16,149
  0
  473
  0
  1,664
  0
  265
  0
  13,747
  0
  16,149
  11,253
  473
  330
  1,664
  1,141
  265
  178
  13,747
  9,604
  16,149
  0
  473
  0
  1,664
  0
  265
  0
  13,747
  0
  16,149
  0
  473
  0
  1,664
  0
  265
  0
  13,747
  0
  16,149
  3,300
  473
  102
  1,664
  338
  265
  53
  13,747
  2,807
  16,149
  1,596
  473
  41
  1,664
  185
  265
  34
  13,747
  1,336
  16,149
  102
  473
  73
  1,664
  15
  265
  13
  13,747
  1
  16,149
  98
  473
  48
  1,664
  30
  265
  15
  13,747
  5
  16,149
  15,949
  473
  352
  1,664
  1,619
  265
  237
  13,747
  13,741
  16,149
  3,680
  473
  105
  1,664
  393
  265
  54
  13,747
  3,128
  16,149
  2,456
  473
  69
  1,664
  255
  265
  39
  13,747
  2,093
  16,149
  5,845
  473
  173
  1,664
  589
  265
  101
  13,747
  4,982
  16,149
  2,560
  473
  69
  1,664
  246
  265
  45
  13,747
  2,200
  16,149
  1,608
  473
  57
  1,664
  181
  265
  26
  13,747
  1,344
  16,149
  5,304
  473
  155
  1,664
  535
  265
  98
  13,747
  4,516
  16,149
  3,221
  473
  106
  1,664
  336
  265
  46
  13,747
  2,733
  16,149
  1,322
  473
  28
  1,664
  141
  265
  30
  13,747
  1,123
  16,149
  3,181
  473
  80
  1,664
  327
  265
  58
  13,747
  2,716
  16,149
  12,433
  473
  361
  1,664
  1,292
  265
  196
  13,747
  10,584
  16,149
  406
  473
  12
  1,664
  42
  265
  6
  13,747
  346
  16,149
  81
  473
  1
  1,664
  9
  265
  1
  13,747
  70
  16,149
  2,629
  473
  78
  1,664
  254
  265
  47
  13,747
  2,250
  16,149
  587
  473
  21
  1,664
  66
  265
  14
  13,747
  486
  16,149
  13
  473
  0
  1,664
  1
  265
  1
  13,747
  11
  16,149
  69
  473
  1
  1,664
  6
  265
  2
  13,747
  60
  16,149
  250
  473
  5
  1,664
  17
  265
  4
  13,747
  224
  16,149
  2,874
  473
  90
  1,664
  278
  265
  48
  13,747
  2,458
  16,149
  71
  473
  5
  1,664
  9
  265
  3
  13,747
  54
  16,149
  247
  473
  13
  1,664
  28
  265
  2
  13,747
  204
  16,149
  2,812
  473
  83
  1,664
  275
  265
  57
  13,747
  2,397
  16,149
  71
  473
  1
  1,664
  3
  265
  1
  13,747
  66
  16,149
  0
  473
  0
  1,664
  0
  265
  0
  13,747
  0
  16,149
  5,787
  473
  173
  1,664
  594
  265
  94
  13,747
  4,926
  16,149
  3,187
  473
  88
  1,664
  352
  265
  67
  13,747
  2,680
  16,149
  3,261
  473
  84
  1,664
  347
  265
  53
  13,747
  2,777
  16,149
  3,162
  473
  90
  1,664
  335
  265
  65
  13,747
  2,672
  16,149
  3,289
  473
  112
  1,664
  345
  265
  53
  13,747
  2,779
  16,149
  3,260
  473
  106
  1,664
  358
  265
  58
  13,747
  2,738
  16,149
  3,187
  473
  84
  1,664
  339
  265
  51
  13,747
  2,713
  16,149
  3,181
  473
  101
  1,664
  313
  265
  56
  13,747
  2,711
  16,149
  13,665
  473
  416
  1,664
  1,395
  265
  227
  13,747
  11,627
  16,149
  15,512
  473
  460
  1,664
  1,610
  265
  256
  13,747
  13,186
(note: file ./output/03b_an_descriptive_table_1_kids_cat4_ageband1.txt not foun
> d)
  4,505
  4,505
  133
  133
  490
  490
  59
  59
  3,823
  3,823
  4,505
  0
  133
  0
  490
  0
  59
  0
  3,823
  0
  4,505
  0
  133
  0
  490
  0
  59
  0
  3,823
  0
  4,505
  0
  133
  0
  490
  0
  59
  0
  3,823
  0
  4,505
  0
  133
  0
  490
  0
  59
  0
  3,823
  0
  4,505
  1,038
  133
  31
  490
  111
  59
  13
  3,823
  883
  4,505
  2,160
  133
  60
  490
  219
  59
  27
  3,823
  1,854
  4,505
  1,307
  133
  42
  490
  160
  59
  19
  3,823
  1,086
  4,505
  2,290
  133
  63
  490
  270
  59
  24
  3,823
  1,933
  4,505
  2,215
  133
  70
  490
  220
  59
  35
  3,823
  1,890
  4,505
  458
  133
  10
  490
  49
  59
  5
  3,823
  394
  4,505
  1,046
  133
  28
  490
  100
  59
  18
  3,823
  900
  4,505
  799
  133
  26
  490
  92
  59
  9
  3,823
  672
  4,505
  643
  133
  20
  490
  70
  59
  6
  3,823
  547
  4,505
  388
  133
  10
  490
  53
  59
  3
  3,823
  322
  4,505
  247
  133
  10
  490
  26
  59
  5
  3,823
  206
  4,505
  924
  133
  29
  490
  100
  59
  13
  3,823
  782
  4,505
  198
  133
  6
  490
  22
  59
  1
  3,823
  169
  4,505
  88
  133
  0
  490
  18
  59
  2
  3,823
  68
  4,505
  502
  133
  10
  490
  58
  59
  6
  3,823
  428
  4,505
  3,717
  133
  117
  490
  392
  59
  50
  3,823
  3,158
  4,505
  3,599
  133
  109
  490
  375
  59
  46
  3,823
  3,069
  4,505
  0
  133
  0
  490
  0
  59
  0
  3,823
  0
  4,505
  465
  133
  13
  490
  61
  59
  5
  3,823
  386
  4,505
  0
  133
  0
  490
  0
  59
  0
  3,823
  0
  4,505
  441
  133
  11
  490
  54
  59
  8
  3,823
  368
  4,505
  0
  133
  0
  490
  0
  59
  0
  3,823
  0
  4,505
  3,120
  133
  86
  490
  347
  59
  47
  3,823
  2,640
  4,505
  0
  133
  0
  490
  0
  59
  0
  3,823
  0
  4,505
  0
  133
  0
  490
  0
  59
  0
  3,823
  0
  4,505
  941
  133
  34
  490
  99
  59
  6
  3,823
  802
  4,505
  444
  133
  13
  490
  44
  59
  6
  3,823
  381
  4,505
  31
  133
  26
  490
  5
  59
  0
  3,823
  0
  4,505
  18
  133
  9
  490
  9
  59
  0
  3,823
  0
  4,505
  4,456
  133
  98
  490
  476
  59
  59
  3,823
  3,823
  4,505
  1,019
  133
  34
  490
  99
  59
  12
  3,823
  874
  4,505
  672
  133
  24
  490
  72
  59
  7
  3,823
  569
  4,505
  1,625
  133
  41
  490
  188
  59
  17
  3,823
  1,379
  4,505
  738
  133
  20
  490
  89
  59
  11
  3,823
  618
  4,505
  451
  133
  14
  490
  42
  59
  12
  3,823
  383
  4,505
  1,478
  133
  47
  490
  173
  59
  22
  3,823
  1,236
  4,505
  920
  133
  32
  490
  107
  59
  7
  3,823
  774
  4,505
  387
  133
  12
  490
  49
  59
  4
  3,823
  322
  4,505
  905
  133
  18
  490
  101
  59
  13
  3,823
  773
  4,505
  3,495
  133
  109
  490
  373
  59
  45
  3,823
  2,968
  4,505
  87
  133
  3
  490
  5
  59
  2
  3,823
  77
  4,505
  32
  133
  1
  490
  4
  59
  0
  3,823
  27
  4,505
  730
  133
  15
  490
  88
  59
  9
  3,823
  618
  4,505
  157
  133
  5
  490
  19
  59
  3
  3,823
  130
  4,505
  4
  133
  0
  490
  1
  59
  0
  3,823
  3
  4,505
  16
  133
  0
  490
  0
  59
  0
  3,823
  16
  4,505
  71
  133
  1
  490
  7
  59
  1
  3,823
  62
  4,505
  818
  133
  23
  490
  89
  59
  9
  3,823
  697
  4,505
  19
  133
  0
  490
  0
  59
  0
  3,823
  19
  4,505
  75
  133
  6
  490
  10
  59
  1
  3,823
  58
  4,505
  798
  133
  20
  490
  97
  59
  9
  3,823
  672
  4,505
  158
  133
  0
  490
  22
  59
  0
  3,823
  136
  4,505
  0
  133
  0
  490
  0
  59
  0
  3,823
  0
  4,505
  1,611
  133
  46
  490
  172
  59
  27
  3,823
  1,366
  4,505
  935
  133
  29
  490
  92
  59
  9
  3,823
  805
  4,505
  874
  133
  21
  490
  97
  59
  9
  3,823
  747
  4,505
  951
  133
  24
  490
  86
  59
  12
  3,823
  829
  4,505
  850
  133
  22
  490
  104
  59
  11
  3,823
  713
  4,505
  914
  133
  18
  490
  114
  59
  13
  3,823
  769
  4,505
  930
  133
  26
  490
  105
  59
  9
  3,823
  790
  4,505
  926
  133
  27
  490
  108
  59
  15
  3,823
  776
  4,505
  3,837
  133
  113
  490
  426
  59
  48
  3,823
  3,250
  4,505
  4,347
  133
  127
  490
  473
  59
  56
  3,823
  3,691

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/03b_an_descriptive_table_1.log
  log type:  text
 closed on:  17 Aug 2021, 07:44:45
-------------------------------------------------------------------------------
