-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04a_an_descriptive_tables.log
  log type:  text
 opened on:  17 Aug 2021, 07:44:55

. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  3. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. ta shield
 16. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd            ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 17.                                                 
. safetab `var'
 18. }
 19. 
. safetab imd 
 20. safetab imd, m
 21. safetab ethnicity
 22. safetab ethnicity, m
 23. safetab stp
 24. 
. 
. * Outcomes
. safetab non_covid_death
 25. safetab covid_death
 26. safetab covid_tpp_prob
 27. safetab covid_icu
 28. 
. * Outcome dates
. sum date*, format
 29. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death non_covid_death {
 30. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    `outvar', col
 31.         safetab male                                                      
>       `outvar', col
 32.         safetab bmicat                                                    
>       `outvar', col m 
 33.         safetab smoke                                                     
>       `outvar', col m
 34.         safetab obese4cat                                                 
>       `outvar', col m 
 35.         safetab shield                                                    
>       `outvar', col m 
 36. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 esrd ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 37.         safetab `var'           `outvar', col
 38. }
 39.         
.         safetab imd                                                          
>    `outvar', col m
 40.         safetab ethnicity                                                 
>       `outvar', col m
 41.         *safetab urban                                                    
>       `outvar', col
.         safetab stp                                                          
>    `outvar', col
 42. }
 43. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     16,149    41.27191    13.49964         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |      4,031       24.96       24.96
     30-<40 |      3,419       21.17       46.13
     40-<50 |      3,488       21.60       67.73
     50-<60 |      3,539       21.91       89.65
     60-<70 |      1,672       10.35      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,149      100.00      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,309       51.45       51.45
          1 |      7,840       48.55      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,437       11.43       11.43
  Normal (18.5-24.9) |      3,654       29.06       40.48
Overweight (25-29.9) |      2,834       22.53       63.02
   Obese I (30-34.9) |      2,250       17.89       80.91
  Obese II (35-39.9) |      1,439       11.44       92.35
     Obese III (40+) |        962        7.65      100.00
---------------------+-----------------------------------
               Total |     12,576      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,437        8.90        8.90
  Normal (18.5-24.9) |      3,654       22.63       31.53
Overweight (25-29.9) |      2,834       17.55       49.07
   Obese I (30-34.9) |      2,250       13.93       63.01
  Obese II (35-39.9) |      1,439        8.91       71.92
     Obese III (40+) |        962        5.96       77.87
        Unknown (.u) |      3,573       22.13      100.00
---------------------+-----------------------------------
               Total |     16,149      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     11,498       71.20       71.20
   Obese I (30-34.9) |      2,250       13.93       85.13
  Obese II (35-39.9) |      1,439        8.91       94.04
     Obese III (40+) |        962        5.96      100.00
---------------------+-----------------------------------
               Total |     16,149      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        643       22.50       22.50
      Former |        310       10.85       33.34
     Current |      1,905       66.66      100.00
-------------+-----------------------------------
       Total |      2,858      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        643        3.98        3.98
      Former |        310        1.92        5.90
     Current |      1,905       11.80       17.70
Unknown (.u) |     13,291       82.30      100.00
-------------+-----------------------------------
       Total |     16,149      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      3,680       25.31       25.31
      Elevated |      2,456       16.89       42.20
 High, stage I |      5,845       40.20       82.39
High, stage II |      2,560       17.61      100.00
---------------+-----------------------------------
         Total |     14,541      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      3,680       22.79       22.79
      Elevated |      2,456       15.21       38.00
 High, stage I |      5,845       36.19       74.19
High, stage II |      2,560       15.85       90.04
       Unknown |      1,608        9.96      100.00
---------------+-----------------------------------
         Total |     16,149      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,845       67.16       67.16
          1 |      5,304       32.84      100.00
------------+-----------------------------------
      Total |     16,149      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,484       15.38       15.38
          1 |     13,665       84.62      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,928       80.05       80.05
          1 |      3,221       19.95      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,827       91.81       91.81
          1 |      1,322        8.19      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,968       80.30       80.30
          1 |      3,181       19.70      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     12,433       76.99       76.99
  T1DM, controlled |        406        2.51       79.50
T1DM, uncontrolled |         81        0.50       80.00
  T2DM, controlled |      2,629       16.28       96.28
T2DM, uncontrolled |        587        3.63       99.92
Diabetes, no HbA1c |         13        0.08      100.00
-------------------+-----------------------------------
             Total |     16,149      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     13,019       80.62       80.62
    Last year |         71        0.44       81.06
2-5 years ago |        247        1.53       82.59
     5+ years |      2,812       17.41      100.00
--------------+-----------------------------------
        Total |     16,149      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     12,956       80.23       80.23
    Last year |         69        0.43       80.66
2-5 years ago |        250        1.55       82.20
     5+ years |      2,874       17.80      100.00
--------------+-----------------------------------
        Total |     16,149      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,968       80.30       80.30
          1 |      3,181       19.70      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,860       79.63       79.63
          1 |      3,289       20.37      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,889       79.81       79.81
          1 |      3,260       20.19      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,962       80.27       80.27
          1 |      3,187       19.73      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,987       80.42       80.42
          1 |      3,162       19.58      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,888       79.81       79.81
          1 |      3,261       20.19      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

**TABLE OF egfr_cat REDACTED DUE TO SMALL N**

0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |     16,078       99.56       99.56
Stage 3a/3b egfr 30-60       |         71        0.44      100.00
-----------------------------+-----------------------------------
                       Total |     16,149      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,362       64.16       64.16
          1 |      5,787       35.84      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,895       79.85       79.85
          1 |      3,254       20.15      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,962       80.27       80.27
          1 |      3,187       19.73      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,253       69.68       69.68
               4 |      3,300       20.43       90.12
 5 most deprived |      1,596        9.88      100.00
-----------------+-----------------------------------
           Total |     16,149      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,253       69.68       69.68
               4 |      3,300       20.43       90.12
 5 most deprived |      1,596        9.88      100.00
-----------------+-----------------------------------
           Total |     16,149      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,937       80.11       80.11
Asian or Asian British |      1,556        9.64       89.75
                 Other |      1,656       10.25      100.00
-----------------------+-----------------------------------
                 Total |     16,149      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,937       80.11       80.11
Asian or Asian British |      1,556        9.64       89.75
                 Other |      1,656       10.25      100.00
-----------------------+-----------------------------------
                 Total |     16,149      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,677       10.38       10.38
          2 |      1,593        9.86       20.25
          3 |      1,600        9.91       30.16
          4 |      1,600        9.91       40.06
          5 |      1,504        9.31       49.38
          6 |      1,616       10.01       59.38
          7 |      1,621       10.04       69.42
          8 |      1,662       10.29       79.71
          9 |      1,664       10.30       90.02
         10 |      1,612        9.98      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,647       72.12       72.12
          1 |      4,502       27.88      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,385       58.12       58.12
          1 |      6,764       41.88      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,753       17.05       17.05
          1 |     13,396       82.95      100.00
------------+-----------------------------------
      Total |     16,149      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,857       30.08       30.08
          1 |     11,292       69.92      100.00
------------+-----------------------------------
      Total |     16,149      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |     11,292   02apr2021    59.86262  21dec2020  16jul2021
date_posit~S |        819   22jun2021    24.28842  31jan2021  16jul2021
date_covid~b |     13,396   03apr2021    60.29787  21dec2020  16jul2021
date_covid~n |      1,900   08mar2021    49.07554  20dec2020  16jun2021
date_covid~s |     13,358   03apr2021    60.20166  21dec2020  16jul2021
-------------+---------------------------------------------------------
date_covid~h |      6,764   03apr2021    60.12995  21dec2020  16jul2021
date_non_c~h |      4,502   02apr2021    59.66032  21dec2020  16jul2021
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       712      3,319 |     4,031 
           |     25.86      24.78 |     24.96 
-----------+----------------------+----------
    30-<40 |       554      2,865 |     3,419 
           |     20.12      21.39 |     21.17 
-----------+----------------------+----------
    40-<50 |       618      2,870 |     3,488 
           |     22.45      21.42 |     21.60 
-----------+----------------------+----------
    50-<60 |       590      2,949 |     3,539 
           |     21.43      22.01 |     21.91 
-----------+----------------------+----------
    60-<70 |       279      1,393 |     1,672 
           |     10.13      10.40 |     10.35 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,456      6,853 |     8,309 
           |     52.89      51.16 |     51.45 
-----------+----------------------+----------
         1 |     1,297      6,543 |     7,840 
           |     47.11      48.84 |     48.55 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       237      1,200 |     1,437 
                     |      8.61       8.96 |      8.90 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       610      3,044 |     3,654 
                     |     22.16      22.72 |     22.63 
---------------------+----------------------+----------
Overweight (25-29.9) |       487      2,347 |     2,834 
                     |     17.69      17.52 |     17.55 
---------------------+----------------------+----------
   Obese I (30-34.9) |       378      1,872 |     2,250 
                     |     13.73      13.97 |     13.93 
---------------------+----------------------+----------
  Obese II (35-39.9) |       233      1,206 |     1,439 
                     |      8.46       9.00 |      8.91 
---------------------+----------------------+----------
     Obese III (40+) |       166        796 |       962 
                     |      6.03       5.94 |      5.96 
---------------------+----------------------+----------
        Unknown (.u) |       642      2,931 |     3,573 
                     |     23.32      21.88 |     22.13 
---------------------+----------------------+----------
               Total |     2,753     13,396 |    16,149 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |        98        545 |       643 
             |      3.56       4.07 |      3.98 
-------------+----------------------+----------
      Former |        50        260 |       310 
             |      1.82       1.94 |      1.92 
-------------+----------------------+----------
     Current |       334      1,571 |     1,905 
             |     12.13      11.73 |     11.80 
-------------+----------------------+----------
Unknown (.u) |     2,271     11,020 |    13,291 
             |     82.49      82.26 |     82.30 
-------------+----------------------+----------
       Total |     2,753     13,396 |    16,149 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     1,976      9,522 |    11,498 
                     |     71.78      71.08 |     71.20 
---------------------+----------------------+----------
   Obese I (30-34.9) |       378      1,872 |     2,250 
                     |     13.73      13.97 |     13.93 
---------------------+----------------------+----------
  Obese II (35-39.9) |       233      1,206 |     1,439 
                     |      8.46       9.00 |      8.91 
---------------------+----------------------+----------
     Obese III (40+) |       166        796 |       962 
                     |      6.03       5.94 |      5.96 
---------------------+----------------------+----------
               Total |     2,753     13,396 |    16,149 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       414      2,070 |     2,484 
           |     15.04      15.45 |     15.38 
-----------+----------------------+----------
         1 |     2,339     11,326 |    13,665 
           |     84.96      84.55 |     84.62 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,193     10,735 |    12,928 
           |     79.66      80.14 |     80.05 
-----------+----------------------+----------
         1 |       560      2,661 |     3,221 
           |     20.34      19.86 |     19.95 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,523     12,304 |    14,827 
           |     91.65      91.85 |     91.81 
-----------+----------------------+----------
         1 |       230      1,092 |     1,322 
           |      8.35       8.15 |      8.19 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,187     10,781 |    12,968 
           |     79.44      80.48 |     80.30 
-----------+----------------------+----------
         1 |       566      2,615 |     3,181 
           |     20.56      19.52 |     19.70 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: covid prob
                   |         case
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |     2,115     10,318 |    12,433 
                   |     76.83      77.02 |     76.99 
-------------------+----------------------+----------
  T1DM, controlled |        61        345 |       406 
                   |      2.22       2.58 |      2.51 
-------------------+----------------------+----------
T1DM, uncontrolled |        12         69 |        81 
                   |      0.44       0.52 |      0.50 
-------------------+----------------------+----------
  T2DM, controlled |       472      2,157 |     2,629 
                   |     17.14      16.10 |     16.28 
-------------------+----------------------+----------
T2DM, uncontrolled |        93        494 |       587 
                   |      3.38       3.69 |      3.63 
-------------------+----------------------+----------
Diabetes, no HbA1c |         0         13 |        13 
                   |      0.00       0.10 |      0.08 
-------------------+----------------------+----------
             Total |     2,753     13,396 |    16,149 
                   |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Non-haematolo |         case
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,234     10,785 |    13,019 
              |     81.15      80.51 |     80.62 
--------------+----------------------+----------
    Last year |        14         57 |        71 
              |      0.51       0.43 |      0.44 
--------------+----------------------+----------
2-5 years ago |        40        207 |       247 
              |      1.45       1.55 |      1.53 
--------------+----------------------+----------
     5+ years |       465      2,347 |     2,812 
              |     16.89      17.52 |     17.41 
--------------+----------------------+----------
        Total |     2,753     13,396 |    16,149 
              |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,214     10,742 |    12,956 
              |     80.42      80.19 |     80.23 
--------------+----------------------+----------
    Last year |        13         56 |        69 
              |      0.47       0.42 |      0.43 
--------------+----------------------+----------
2-5 years ago |        43        207 |       250 
              |      1.56       1.55 |      1.55 
--------------+----------------------+----------
     5+ years |       483      2,391 |     2,874 
              |     17.54      17.85 |     17.80 
--------------+----------------------+----------
        Total |     2,753     13,396 |    16,149 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,218     10,750 |    12,968 
           |     80.57      80.25 |     80.30 
-----------+----------------------+----------
         1 |       535      2,646 |     3,181 
           |     19.43      19.75 |     19.70 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,210     10,650 |    12,860 
           |     80.28      79.50 |     79.63 
-----------+----------------------+----------
         1 |       543      2,746 |     3,289 
           |     19.72      20.50 |     20.37 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,183     10,706 |    12,889 
           |     79.30      79.92 |     79.81 
-----------+----------------------+----------
         1 |       570      2,690 |     3,260 
           |     20.70      20.08 |     20.19 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,234     10,728 |    12,962 
           |     81.15      80.08 |     80.27 
-----------+----------------------+----------
         1 |       519      2,668 |     3,187 
           |     18.85      19.92 |     19.73 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,207     10,780 |    12,987 
           |     80.17      80.47 |     80.42 
-----------+----------------------+----------
         1 |       546      2,616 |     3,162 
           |     19.83      19.53 |     19.58 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,200     10,688 |    12,888 
           |     79.91      79.79 |     79.81 
-----------+----------------------+----------
         1 |       553      2,708 |     3,261 
           |     20.09      20.21 |     20.19 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
24

**TABLE OF egfr_cat covid_tpp_prob REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,766      8,596 |    10,362 
           |     64.15      64.17 |     64.16 
-----------+----------------------+----------
         1 |       987      4,800 |     5,787 
           |     35.85      35.83 |     35.84 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     2,738     13,340 |    16,078 
                      |     99.46      99.58 |     99.56 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        15         56 |        71 
                      |      0.54       0.42 |      0.44 
----------------------+----------------------+----------
                Total |     2,753     13,396 |    16,149 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,208     10,687 |    12,895 
           |     80.20      79.78 |     79.85 
-----------+----------------------+----------
         1 |       545      2,709 |     3,254 
           |     19.80      20.22 |     20.15 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,269     10,693 |    12,962 
           |     82.42      79.82 |     80.27 
-----------+----------------------+----------
         1 |       484      2,703 |     3,187 
           |     17.58      20.18 |     19.73 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     1,927      9,326 |    11,253 
                 |     70.00      69.62 |     69.68 
-----------------+----------------------+----------
               4 |       550      2,750 |     3,300 
                 |     19.98      20.53 |     20.43 
-----------------+----------------------+----------
 5 most deprived |       276      1,320 |     1,596 
                 |     10.03       9.85 |      9.88 
-----------------+----------------------+----------
           Total |     2,753     13,396 |    16,149 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     2,240     10,697 |    12,937 
                      |     81.37      79.85 |     80.11 
----------------------+----------------------+----------
Asian or Asian Britis |       234      1,322 |     1,556 
                      |      8.50       9.87 |      9.64 
----------------------+----------------------+----------
                Other |       279      1,377 |     1,656 
                      |     10.13      10.28 |     10.25 
----------------------+----------------------+----------
                Total |     2,753     13,396 |    16,149 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       287      1,390 |     1,677 
           |     10.42      10.38 |     10.38 
-----------+----------------------+----------
         2 |       270      1,323 |     1,593 
           |      9.81       9.88 |      9.86 
-----------+----------------------+----------
         3 |       266      1,334 |     1,600 
           |      9.66       9.96 |      9.91 
-----------+----------------------+----------
         4 |       273      1,327 |     1,600 
           |      9.92       9.91 |      9.91 
-----------+----------------------+----------
         5 |       247      1,257 |     1,504 
           |      8.97       9.38 |      9.31 
-----------+----------------------+----------
         6 |       301      1,315 |     1,616 
           |     10.93       9.82 |     10.01 
-----------+----------------------+----------
         7 |       281      1,340 |     1,621 
           |     10.21      10.00 |     10.04 
-----------+----------------------+----------
         8 |       291      1,371 |     1,662 
           |     10.57      10.23 |     10.29 
-----------+----------------------+----------
         9 |       294      1,370 |     1,664 
           |     10.68      10.23 |     10.30 
-----------+----------------------+----------
        10 |       243      1,369 |     1,612 
           |      8.83      10.22 |      9.98 
-----------+----------------------+----------
     Total |     2,753     13,396 |    16,149 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped | outcome: covid death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     2,338      1,693 |     4,031 
           |     24.91      25.03 |     24.96 
-----------+----------------------+----------
    30-<40 |     1,981      1,438 |     3,419 
           |     21.11      21.26 |     21.17 
-----------+----------------------+----------
    40-<50 |     2,037      1,451 |     3,488 
           |     21.70      21.45 |     21.60 
-----------+----------------------+----------
    50-<60 |     2,065      1,474 |     3,539 
           |     22.00      21.79 |     21.91 
-----------+----------------------+----------
    60-<70 |       964        708 |     1,672 
           |     10.27      10.47 |     10.35 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,844      3,465 |     8,309 
           |     51.61      51.23 |     51.45 
-----------+----------------------+----------
         1 |     4,541      3,299 |     7,840 
           |     48.39      48.77 |     48.55 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     | outcome: covid death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       846        591 |     1,437 
                     |      9.01       8.74 |      8.90 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     2,151      1,503 |     3,654 
                     |     22.92      22.22 |     22.63 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,657      1,177 |     2,834 
                     |     17.66      17.40 |     17.55 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,316        934 |     2,250 
                     |     14.02      13.81 |     13.93 
---------------------+----------------------+----------
  Obese II (35-39.9) |       813        626 |     1,439 
                     |      8.66       9.25 |      8.91 
---------------------+----------------------+----------
     Obese III (40+) |       545        417 |       962 
                     |      5.81       6.16 |      5.96 
---------------------+----------------------+----------
        Unknown (.u) |     2,057      1,516 |     3,573 
                     |     21.92      22.41 |     22.13 
---------------------+----------------------+----------
               Total |     9,385      6,764 |    16,149 
                     |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking | outcome: covid death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       370        273 |       643 
             |      3.94       4.04 |      3.98 
-------------+----------------------+----------
      Former |       174        136 |       310 
             |      1.85       2.01 |      1.92 
-------------+----------------------+----------
     Current |     1,095        810 |     1,905 
             |     11.67      11.98 |     11.80 
-------------+----------------------+----------
Unknown (.u) |     7,746      5,545 |    13,291 
             |     82.54      81.98 |     82.30 
-------------+----------------------+----------
       Total |     9,385      6,764 |    16,149 
             |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity | outcome: covid death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     6,711      4,787 |    11,498 
                     |     71.51      70.77 |     71.20 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,316        934 |     2,250 
                     |     14.02      13.81 |     13.93 
---------------------+----------------------+----------
  Obese II (35-39.9) |       813        626 |     1,439 
                     |      8.66       9.25 |      8.91 
---------------------+----------------------+----------
     Obese III (40+) |       545        417 |       962 
                     |      5.81       6.16 |      5.96 
---------------------+----------------------+----------
               Total |     9,385      6,764 |    16,149 
                     |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,474      1,010 |     2,484 
           |     15.71      14.93 |     15.38 
-----------+----------------------+----------
         1 |     7,911      5,754 |    13,665 
           |     84.29      85.07 |     84.62 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator | outcome: covid death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,510      5,418 |    12,928 
           |     80.02      80.10 |     80.05 
-----------+----------------------+----------
         1 |     1,875      1,346 |     3,221 
           |     19.98      19.90 |     19.95 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma | outcome: covid death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,616      6,211 |    14,827 
           |     91.81      91.82 |     91.81 
-----------+----------------------+----------
         1 |       769        553 |     1,322 
           |      8.19       8.18 |      8.19 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac | outcome: covid death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,564      5,404 |    12,968 
           |     80.60      79.89 |     80.30 
-----------+----------------------+----------
         1 |     1,821      1,360 |     3,181 
           |     19.40      20.11 |     19.70 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   | outcome: covid death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |     7,249      5,184 |    12,433 
                   |     77.24      76.64 |     76.99 
-------------------+----------------------+----------
  T1DM, controlled |       224        182 |       406 
                   |      2.39       2.69 |      2.51 
-------------------+----------------------+----------
T1DM, uncontrolled |        40         41 |        81 
                   |      0.43       0.61 |      0.50 
-------------------+----------------------+----------
  T2DM, controlled |     1,517      1,112 |     2,629 
                   |     16.16      16.44 |     16.28 
-------------------+----------------------+----------
T2DM, uncontrolled |       348        239 |       587 
                   |      3.71       3.53 |      3.63 
-------------------+----------------------+----------
Diabetes, no HbA1c |         7          6 |        13 
                   |      0.07       0.09 |      0.08 
-------------------+----------------------+----------
             Total |     9,385      6,764 |    16,149 
                   |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo | outcome: covid death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     7,559      5,460 |    13,019 
              |     80.54      80.72 |     80.62 
--------------+----------------------+----------
    Last year |        44         27 |        71 
              |      0.47       0.40 |      0.44 
--------------+----------------------+----------
2-5 years ago |       143        104 |       247 
              |      1.52       1.54 |      1.53 
--------------+----------------------+----------
     5+ years |     1,639      1,173 |     2,812 
              |     17.46      17.34 |     17.41 
--------------+----------------------+----------
        Total |     9,385      6,764 |    16,149 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica | outcome: covid death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     7,540      5,416 |    12,956 
              |     80.34      80.07 |     80.23 
--------------+----------------------+----------
    Last year |        39         30 |        69 
              |      0.42       0.44 |      0.43 
--------------+----------------------+----------
2-5 years ago |       157         93 |       250 
              |      1.67       1.37 |      1.55 
--------------+----------------------+----------
     5+ years |     1,649      1,225 |     2,874 
              |     17.57      18.11 |     17.80 
--------------+----------------------+----------
        Total |     9,385      6,764 |    16,149 
              |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on | outcome: covid death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,552      5,416 |    12,968 
           |     80.47      80.07 |     80.30 
-----------+----------------------+----------
         1 |     1,833      1,348 |     3,181 
           |     19.53      19.93 |     19.70 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |   Failure/censoring
     solid |     indicator for
     organ | outcome: covid death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,451      5,409 |    12,860 
           |     79.39      79.97 |     79.63 
-----------+----------------------+----------
         1 |     1,934      1,355 |     3,289 
           |     20.61      20.03 |     20.37 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,506      5,383 |    12,889 
           |     79.98      79.58 |     79.81 
-----------+----------------------+----------
         1 |     1,879      1,381 |     3,260 
           |     20.02      20.42 |     20.19 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,550      5,412 |    12,962 
           |     80.45      80.01 |     80.27 
-----------+----------------------+----------
         1 |     1,835      1,352 |     3,187 
           |     19.55      19.99 |     19.73 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic | outcome: covid death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,556      5,431 |    12,987 
           |     80.51      80.29 |     80.42 
-----------+----------------------+----------
         1 |     1,829      1,333 |     3,162 
           |     19.49      19.71 |     19.58 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or | outcome: covid death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,463      5,425 |    12,888 
           |     79.52      80.20 |     79.81 
-----------+----------------------+----------
         1 |     1,922      1,339 |     3,261 
           |     20.48      19.80 |     20.19 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
21

**TABLE OF egfr_cat covid_death REDACTED DUE TO SMALL N**

17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 End-stage |     indicator for
     renal | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,057      4,305 |    10,362 
           |     64.54      63.65 |     64.16 
-----------+----------------------+----------
         1 |     3,328      2,459 |     5,787 
           |     35.46      36.35 |     35.84 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney | outcome: covid death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     9,344      6,734 |    16,078 
                      |     99.56      99.56 |     99.56 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        41         30 |        71 
                      |      0.44       0.44 |      0.44 
----------------------+----------------------+----------
                Total |     9,385      6,764 |    16,149 
                      |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi | outcome: covid death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,506      5,389 |    12,895 
           |     79.98      79.67 |     79.85 
-----------+----------------------+----------
         1 |     1,879      1,375 |     3,254 
           |     20.02      20.33 |     20.15 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,509      5,453 |    12,962 
           |     80.01      80.62 |     80.27 
-----------+----------------------+----------
         1 |     1,876      1,311 |     3,187 
           |     19.99      19.38 |     19.73 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation | outcome: covid death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     6,536      4,717 |    11,253 
                 |     69.64      69.74 |     69.68 
-----------------+----------------------+----------
               4 |     1,938      1,362 |     3,300 
                 |     20.65      20.14 |     20.43 
-----------------+----------------------+----------
 5 most deprived |       911        685 |     1,596 
                 |      9.71      10.13 |      9.88 
-----------------+----------------------+----------
           Total |     9,385      6,764 |    16,149 
                 |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      | outcome: covid death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     7,508      5,429 |    12,937 
                      |     80.00      80.26 |     80.11 
----------------------+----------------------+----------
Asian or Asian Britis |       891        665 |     1,556 
                      |      9.49       9.83 |      9.64 
----------------------+----------------------+----------
                Other |       986        670 |     1,656 
                      |     10.51       9.91 |     10.25 
----------------------+----------------------+----------
                Total |     9,385      6,764 |    16,149 
                      |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       966        711 |     1,677 
           |     10.29      10.51 |     10.38 
-----------+----------------------+----------
         2 |       904        689 |     1,593 
           |      9.63      10.19 |      9.86 
-----------+----------------------+----------
         3 |       940        660 |     1,600 
           |     10.02       9.76 |      9.91 
-----------+----------------------+----------
         4 |       886        714 |     1,600 
           |      9.44      10.56 |      9.91 
-----------+----------------------+----------
         5 |       859        645 |     1,504 
           |      9.15       9.54 |      9.31 
-----------+----------------------+----------
         6 |       953        663 |     1,616 
           |     10.15       9.80 |     10.01 
-----------+----------------------+----------
         7 |       982        639 |     1,621 
           |     10.46       9.45 |     10.04 
-----------+----------------------+----------
         8 |       937        725 |     1,662 
           |      9.98      10.72 |     10.29 
-----------+----------------------+----------
         9 |       993        671 |     1,664 
           |     10.58       9.92 |     10.30 
-----------+----------------------+----------
        10 |       965        647 |     1,612 
           |     10.28       9.57 |      9.98 
-----------+----------------------+----------
     Total |     9,385      6,764 |    16,149 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     2,886      1,145 |     4,031 
           |     24.78      25.43 |     24.96 
-----------+----------------------+----------
    30-<40 |     2,457        962 |     3,419 
           |     21.10      21.37 |     21.17 
-----------+----------------------+----------
    40-<50 |     2,511        977 |     3,488 
           |     21.56      21.70 |     21.60 
-----------+----------------------+----------
    50-<60 |     2,577        962 |     3,539 
           |     22.13      21.37 |     21.91 
-----------+----------------------+----------
    60-<70 |     1,216        456 |     1,672 
           |     10.44      10.13 |     10.35 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,949      2,360 |     8,309 
           |     51.08      52.42 |     51.45 
-----------+----------------------+----------
         1 |     5,698      2,142 |     7,840 
           |     48.92      47.58 |     48.55 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     1,004        433 |     1,437 
                     |      8.62       9.62 |      8.90 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     2,650      1,004 |     3,654 
                     |     22.75      22.30 |     22.63 
---------------------+----------------------+----------
Overweight (25-29.9) |     2,040        794 |     2,834 
                     |     17.52      17.64 |     17.55 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,616        634 |     2,250 
                     |     13.87      14.08 |     13.93 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,045        394 |     1,439 
                     |      8.97       8.75 |      8.91 
---------------------+----------------------+----------
     Obese III (40+) |       704        258 |       962 
                     |      6.04       5.73 |      5.96 
---------------------+----------------------+----------
        Unknown (.u) |     2,588        985 |     3,573 
                     |     22.22      21.88 |     22.13 
---------------------+----------------------+----------
               Total |    11,647      4,502 |    16,149 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       481        162 |       643 
             |      4.13       3.60 |      3.98 
-------------+----------------------+----------
      Former |       226         84 |       310 
             |      1.94       1.87 |      1.92 
-------------+----------------------+----------
     Current |     1,368        537 |     1,905 
             |     11.75      11.93 |     11.80 
-------------+----------------------+----------
Unknown (.u) |     9,572      3,719 |    13,291 
             |     82.18      82.61 |     82.30 
-------------+----------------------+----------
       Total |    11,647      4,502 |    16,149 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     8,282      3,216 |    11,498 
                     |     71.11      71.43 |     71.20 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,616        634 |     2,250 
                     |     13.87      14.08 |     13.93 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,045        394 |     1,439 
                     |      8.97       8.75 |      8.91 
---------------------+----------------------+----------
     Obese III (40+) |       704        258 |       962 
                     |      6.04       5.73 |      5.96 
---------------------+----------------------+----------
               Total |    11,647      4,502 |    16,149 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,806        678 |     2,484 
           |     15.51      15.06 |     15.38 
-----------+----------------------+----------
         1 |     9,841      3,824 |    13,665 
           |     84.49      84.94 |     84.62 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,330      3,598 |    12,928 
           |     80.11      79.92 |     80.05 
-----------+----------------------+----------
         1 |     2,317        904 |     3,221 
           |     19.89      20.08 |     19.95 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,700      4,127 |    14,827 
           |     91.87      91.67 |     91.81 
-----------+----------------------+----------
         1 |       947        375 |     1,322 
           |      8.13       8.33 |      8.19 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,308      3,660 |    12,968 
           |     79.92      81.30 |     80.30 
-----------+----------------------+----------
         1 |     2,339        842 |     3,181 
           |     20.08      18.70 |     19.70 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
24

**TABLE OF diabcat non_covid_death REDACTED DUE TO SMALL N**

34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     9,413      3,606 |    13,019 
              |     80.82      80.10 |     80.62 
--------------+----------------------+----------
    Last year |        43         28 |        71 
              |      0.37       0.62 |      0.44 
--------------+----------------------+----------
2-5 years ago |       179         68 |       247 
              |      1.54       1.51 |      1.53 
--------------+----------------------+----------
     5+ years |     2,012        800 |     2,812 
              |     17.27      17.77 |     17.41 
--------------+----------------------+----------
        Total |    11,647      4,502 |    16,149 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     9,324      3,632 |    12,956 
              |     80.05      80.68 |     80.23 
--------------+----------------------+----------
    Last year |        50         19 |        69 
              |      0.43       0.42 |      0.43 
--------------+----------------------+----------
2-5 years ago |       173         77 |       250 
              |      1.49       1.71 |      1.55 
--------------+----------------------+----------
     5+ years |     2,100        774 |     2,874 
              |     18.03      17.19 |     17.80 
--------------+----------------------+----------
        Total |    11,647      4,502 |    16,149 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,358      3,610 |    12,968 
           |     80.35      80.19 |     80.30 
-----------+----------------------+----------
         1 |     2,289        892 |     3,181 
           |     19.65      19.81 |     19.70 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,314      3,546 |    12,860 
           |     79.97      78.76 |     79.63 
-----------+----------------------+----------
         1 |     2,333        956 |     3,289 
           |     20.03      21.24 |     20.37 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,295      3,594 |    12,889 
           |     79.81      79.83 |     79.81 
-----------+----------------------+----------
         1 |     2,352        908 |     3,260 
           |     20.19      20.17 |     20.19 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,338      3,624 |    12,962 
           |     80.18      80.50 |     80.27 
-----------+----------------------+----------
         1 |     2,309        878 |     3,187 
           |     19.82      19.50 |     19.73 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,327      3,660 |    12,987 
           |     80.08      81.30 |     80.42 
-----------+----------------------+----------
         1 |     2,320        842 |     3,162 
           |     19.92      18.70 |     19.58 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,305      3,583 |    12,888 
           |     79.89      79.59 |     79.81 
-----------+----------------------+----------
         1 |     2,342        919 |     3,261 
           |     20.11      20.41 |     20.19 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
25

**TABLE OF egfr_cat non_covid_death REDACTED DUE TO SMALL N**

21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,473      2,889 |    10,362 
           |     64.16      64.17 |     64.16 
-----------+----------------------+----------
         1 |     4,174      1,613 |     5,787 
           |     35.84      35.83 |     35.84 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    11,601      4,477 |    16,078 
                      |     99.61      99.44 |     99.56 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        46         25 |        71 
                      |      0.39       0.56 |      0.44 
----------------------+----------------------+----------
                Total |    11,647      4,502 |    16,149 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,276      3,619 |    12,895 
           |     79.64      80.39 |     79.85 
-----------+----------------------+----------
         1 |     2,371        883 |     3,254 
           |     20.36      19.61 |     20.15 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,359      3,603 |    12,962 
           |     80.36      80.03 |     80.27 
-----------+----------------------+----------
         1 |     2,288        899 |     3,187 
           |     19.64      19.97 |     19.73 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     8,112      3,141 |    11,253 
                 |     69.65      69.77 |     69.68 
-----------------+----------------------+----------
               4 |     2,382        918 |     3,300 
                 |     20.45      20.39 |     20.43 
-----------------+----------------------+----------
 5 most deprived |     1,153        443 |     1,596 
                 |      9.90       9.84 |      9.88 
-----------------+----------------------+----------
           Total |    11,647      4,502 |    16,149 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     9,327      3,610 |    12,937 
                      |     80.08      80.19 |     80.11 
----------------------+----------------------+----------
Asian or Asian Britis |     1,127        429 |     1,556 
                      |      9.68       9.53 |      9.64 
----------------------+----------------------+----------
                Other |     1,193        463 |     1,656 
                      |     10.24      10.28 |     10.25 
----------------------+----------------------+----------
                Total |    11,647      4,502 |    16,149 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,219        458 |     1,677 
           |     10.47      10.17 |     10.38 
-----------+----------------------+----------
         2 |     1,141        452 |     1,593 
           |      9.80      10.04 |      9.86 
-----------+----------------------+----------
         3 |     1,140        460 |     1,600 
           |      9.79      10.22 |      9.91 
-----------+----------------------+----------
         4 |     1,191        409 |     1,600 
           |     10.23       9.08 |      9.91 
-----------+----------------------+----------
         5 |     1,080        424 |     1,504 
           |      9.27       9.42 |      9.31 
-----------+----------------------+----------
         6 |     1,172        444 |     1,616 
           |     10.06       9.86 |     10.01 
-----------+----------------------+----------
         7 |     1,154        467 |     1,621 
           |      9.91      10.37 |     10.04 
-----------+----------------------+----------
         8 |     1,231        431 |     1,662 
           |     10.57       9.57 |     10.29 
-----------+----------------------+----------
         9 |     1,187        477 |     1,664 
           |     10.19      10.60 |     10.30 
-----------+----------------------+----------
        10 |     1,132        480 |     1,612 
           |      9.72      10.66 |      9.98 
-----------+----------------------+----------
     Total |    11,647      4,502 |    16,149 
           |    100.00     100.00 |    100.00 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      4,505    75.89034    7.540916         66        109
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |      1,038       23.04       23.04
     70-<80 |      2,160       47.95       70.99
        80+ |      1,307       29.01      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        275        6.10        6.10
          1 |      4,230       93.90      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,290       50.83       50.83
          1 |      2,215       49.17      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        458       12.79       12.79
  Normal (18.5-24.9) |      1,046       29.21       42.00
Overweight (25-29.9) |        799       22.31       64.31
   Obese I (30-34.9) |        643       17.96       82.27
  Obese II (35-39.9) |        388       10.83       93.10
     Obese III (40+) |        247        6.90      100.00
---------------------+-----------------------------------
               Total |      3,581      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        458       10.17       10.17
  Normal (18.5-24.9) |      1,046       23.22       33.39
Overweight (25-29.9) |        799       17.74       51.12
   Obese I (30-34.9) |        643       14.27       65.39
  Obese II (35-39.9) |        388        8.61       74.01
     Obese III (40+) |        247        5.48       79.49
        Unknown (.u) |        924       20.51      100.00
---------------------+-----------------------------------
               Total |      4,505      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |      3,227       71.63       71.63
   Obese I (30-34.9) |        643       14.27       85.90
  Obese II (35-39.9) |        388        8.61       94.52
     Obese III (40+) |        247        5.48      100.00
---------------------+-----------------------------------
               Total |      4,505      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        198       25.13       25.13
      Former |         88       11.17       36.29
     Current |        502       63.71      100.00
-------------+-----------------------------------
       Total |        788      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        198        4.40        4.40
      Former |         88        1.95        6.35
     Current |        502       11.14       17.49
Unknown (.u) |      3,717       82.51      100.00
-------------+-----------------------------------
       Total |      4,505      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      1,019       25.14       25.14
      Elevated |        672       16.58       41.71
 High, stage I |      1,625       40.08       81.80
High, stage II |        738       18.20      100.00
---------------+-----------------------------------
         Total |      4,054      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      1,019       22.62       22.62
      Elevated |        672       14.92       37.54
 High, stage I |      1,625       36.07       73.61
High, stage II |        738       16.38       89.99
       Unknown |        451       10.01      100.00
---------------+-----------------------------------
         Total |      4,505      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,027       67.19       67.19
          1 |      1,478       32.81      100.00
------------+-----------------------------------
      Total |      4,505      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        668       14.83       14.83
          1 |      3,837       85.17      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,585       79.58       79.58
          1 |        920       20.42      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,118       91.41       91.41
          1 |        387        8.59      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,600       79.91       79.91
          1 |        905       20.09      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

**TABLE OF diabcat REDACTED DUE TO SMALL N**

0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,613       80.20       80.20
    Last year |         19        0.42       80.62
2-5 years ago |         75        1.66       82.29
     5+ years |        798       17.71      100.00
--------------+-----------------------------------
        Total |      4,505      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,600       79.91       79.91
    Last year |         16        0.36       80.27
2-5 years ago |         71        1.58       81.84
     5+ years |        818       18.16      100.00
--------------+-----------------------------------
        Total |      4,505      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,579       79.45       79.45
          1 |        926       20.55      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,655       81.13       81.13
          1 |        850       18.87      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,591       79.71       79.71
          1 |        914       20.29      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,570       79.25       79.25
          1 |        935       20.75      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,554       78.89       78.89
          1 |        951       21.11      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,631       80.60       80.60
          1 |        874       19.40      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

**TABLE OF egfr_cat REDACTED DUE TO SMALL N**

0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |      4,347       96.49       96.49
Stage 3a/3b egfr 30-60       |        158        3.51      100.00
-----------------------------+-----------------------------------
                       Total |      4,505      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,894       64.24       64.24
          1 |      1,611       35.76      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,612       80.18       80.18
          1 |        893       19.82      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,575       79.36       79.36
          1 |        930       20.64      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,120       69.26       69.26
               4 |        941       20.89       90.14
 5 most deprived |        444        9.86      100.00
-----------------+-----------------------------------
           Total |      4,505      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,120       69.26       69.26
               4 |        941       20.89       90.14
 5 most deprived |        444        9.86      100.00
-----------------+-----------------------------------
           Total |      4,505      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,599       79.89       79.89
Asian or Asian British |        465       10.32       90.21
                 Other |        441        9.79      100.00
-----------------------+-----------------------------------
                 Total |      4,505      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,599       79.89       79.89
Asian or Asian British |        465       10.32       90.21
                 Other |        441        9.79      100.00
-----------------------+-----------------------------------
                 Total |      4,505      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        455       10.10       10.10
          2 |        430        9.54       19.64
          3 |        421        9.35       28.99
          4 |        490       10.88       39.87
          5 |        475       10.54       50.41
          6 |        465       10.32       60.73
          7 |        433        9.61       70.34
          8 |        452       10.03       80.38
          9 |        443        9.83       90.21
         10 |        441        9.79      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,269       72.56       72.56
          1 |      1,236       27.44      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,633       58.45       58.45
          1 |      1,872       41.55      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        768       17.05       17.05
          1 |      3,737       82.95      100.00
------------+-----------------------------------
      Total |      4,505      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,414       31.39       31.39
          1 |      3,091       68.61      100.00
------------+-----------------------------------
      Total |      4,505      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |      3,091   03apr2021     59.5583  21dec2020  16jul2021
date_posit~S |        231   23jun2021    23.55078  19mar2021  16jul2021
date_covid~b |      3,737   03apr2021    59.68979  21dec2020  16jul2021
date_covid~n |        508   06mar2021    49.46328  20dec2020  15jun2021
date_covid~s |      3,729   03apr2021    59.62824  21dec2020  16jul2021
-------------+---------------------------------------------------------
date_covid~h |      1,872   01apr2021    59.85481  21dec2020  16jul2021
date_non_c~h |      1,236   04apr2021    60.74269  21dec2020  16jul2021
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |       187        851 |     1,038 
           |     24.35      22.77 |     23.04 
-----------+----------------------+----------
    70-<80 |       361      1,799 |     2,160 
           |     47.01      48.14 |     47.95 
-----------+----------------------+----------
       80+ |       220      1,087 |     1,307 
           |     28.65      29.09 |     29.01 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |       374      1,916 |     2,290 
           |     48.70      51.27 |     50.83 
-----------+----------------------+----------
         1 |       394      1,821 |     2,215 
           |     51.30      48.73 |     49.17 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |        71        387 |       458 
                     |      9.24      10.36 |     10.17 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       190        856 |     1,046 
                     |     24.74      22.91 |     23.22 
---------------------+----------------------+----------
Overweight (25-29.9) |       133        666 |       799 
                     |     17.32      17.82 |     17.74 
---------------------+----------------------+----------
   Obese I (30-34.9) |       105        538 |       643 
                     |     13.67      14.40 |     14.27 
---------------------+----------------------+----------
  Obese II (35-39.9) |        70        318 |       388 
                     |      9.11       8.51 |      8.61 
---------------------+----------------------+----------
     Obese III (40+) |        45        202 |       247 
                     |      5.86       5.41 |      5.48 
---------------------+----------------------+----------
        Unknown (.u) |       154        770 |       924 
                     |     20.05      20.60 |     20.51 
---------------------+----------------------+----------
               Total |       768      3,737 |     4,505 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |        41        157 |       198 
             |      5.34       4.20 |      4.40 
-------------+----------------------+----------
      Former |        12         76 |        88 
             |      1.56       2.03 |      1.95 
-------------+----------------------+----------
     Current |        82        420 |       502 
             |     10.68      11.24 |     11.14 
-------------+----------------------+----------
Unknown (.u) |       633      3,084 |     3,717 
             |     82.42      82.53 |     82.51 
-------------+----------------------+----------
       Total |       768      3,737 |     4,505 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |       548      2,679 |     3,227 
                     |     71.35      71.69 |     71.63 
---------------------+----------------------+----------
   Obese I (30-34.9) |       105        538 |       643 
                     |     13.67      14.40 |     14.27 
---------------------+----------------------+----------
  Obese II (35-39.9) |        70        318 |       388 
                     |      9.11       8.51 |      8.61 
---------------------+----------------------+----------
     Obese III (40+) |        45        202 |       247 
                     |      5.86       5.41 |      5.48 
---------------------+----------------------+----------
               Total |       768      3,737 |     4,505 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       113        555 |       668 
           |     14.71      14.85 |     14.83 
-----------+----------------------+----------
         1 |       655      3,182 |     3,837 
           |     85.29      85.15 |     85.17 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |       605      2,980 |     3,585 
           |     78.78      79.74 |     79.58 
-----------+----------------------+----------
         1 |       163        757 |       920 
           |     21.22      20.26 |     20.42 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |       699      3,419 |     4,118 
           |     91.02      91.49 |     91.41 
-----------+----------------------+----------
         1 |        69        318 |       387 
           |      8.98       8.51 |      8.59 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |       624      2,976 |     3,600 
           |     81.25      79.64 |     79.91 
-----------+----------------------+----------
         1 |       144        761 |       905 
           |     18.75      20.36 |     20.09 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
23

**TABLE OF diabcat covid_tpp_prob REDACTED DUE TO SMALL N**

33

**TABLE OF cancer_exhaem_cat covid_tpp_prob REDACTED DUE TO SMALL N**

31

**TABLE OF cancer_haem_cat covid_tpp_prob REDACTED DUE TO SMALL N**

28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |       621      2,958 |     3,579 
           |     80.86      79.15 |     79.45 
-----------+----------------------+----------
         1 |       147        779 |       926 
           |     19.14      20.85 |     20.55 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |       627      3,028 |     3,655 
           |     81.64      81.03 |     81.13 
-----------+----------------------+----------
         1 |       141        709 |       850 
           |     18.36      18.97 |     18.87 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |       619      2,972 |     3,591 
           |     80.60      79.53 |     79.71 
-----------+----------------------+----------
         1 |       149        765 |       914 
           |     19.40      20.47 |     20.29 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       611      2,959 |     3,570 
           |     79.56      79.18 |     79.25 
-----------+----------------------+----------
         1 |       157        778 |       935 
           |     20.44      20.82 |     20.75 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       608      2,946 |     3,554 
           |     79.17      78.83 |     78.89 
-----------+----------------------+----------
         1 |       160        791 |       951 
           |     20.83      21.17 |     21.11 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       611      3,020 |     3,631 
           |     79.56      80.81 |     80.60 
-----------+----------------------+----------
         1 |       157        717 |       874 
           |     20.44      19.19 |     19.40 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
24

**TABLE OF egfr_cat covid_tpp_prob REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       490      2,404 |     2,894 
           |     63.80      64.33 |     64.24 
-----------+----------------------+----------
         1 |       278      1,333 |     1,611 
           |     36.20      35.67 |     35.76 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |       749      3,598 |     4,347 
                      |     97.53      96.28 |     96.49 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        19        139 |       158 
                      |      2.47       3.72 |      3.51 
----------------------+----------------------+----------
                Total |       768      3,737 |     4,505 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |       610      3,002 |     3,612 
           |     79.43      80.33 |     80.18 
-----------+----------------------+----------
         1 |       158        735 |       893 
           |     20.57      19.67 |     19.82 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       597      2,978 |     3,575 
           |     77.73      79.69 |     79.36 
-----------+----------------------+----------
         1 |       171        759 |       930 
           |     22.27      20.31 |     20.64 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |       556      2,564 |     3,120 
                 |     72.40      68.61 |     69.26 
-----------------+----------------------+----------
               4 |       151        790 |       941 
                 |     19.66      21.14 |     20.89 
-----------------+----------------------+----------
 5 most deprived |        61        383 |       444 
                 |      7.94      10.25 |      9.86 
-----------------+----------------------+----------
           Total |       768      3,737 |     4,505 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |       616      2,983 |     3,599 
                      |     80.21      79.82 |     79.89 
----------------------+----------------------+----------
Asian or Asian Britis |        77        388 |       465 
                      |     10.03      10.38 |     10.32 
----------------------+----------------------+----------
                Other |        75        366 |       441 
                      |      9.77       9.79 |      9.79 
----------------------+----------------------+----------
                Total |       768      3,737 |     4,505 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |        64        391 |       455 
           |      8.33      10.46 |     10.10 
-----------+----------------------+----------
         2 |        66        364 |       430 
           |      8.59       9.74 |      9.54 
-----------+----------------------+----------
         3 |        69        352 |       421 
           |      8.98       9.42 |      9.35 
-----------+----------------------+----------
         4 |        95        395 |       490 
           |     12.37      10.57 |     10.88 
-----------+----------------------+----------
         5 |        84        391 |       475 
           |     10.94      10.46 |     10.54 
-----------+----------------------+----------
         6 |        77        388 |       465 
           |     10.03      10.38 |     10.32 
-----------+----------------------+----------
         7 |        76        357 |       433 
           |      9.90       9.55 |      9.61 
-----------+----------------------+----------
         8 |        87        365 |       452 
           |     11.33       9.77 |     10.03 
-----------+----------------------+----------
         9 |        70        373 |       443 
           |      9.11       9.98 |      9.83 
-----------+----------------------+----------
        10 |        80        361 |       441 
           |     10.42       9.66 |      9.79 
-----------+----------------------+----------
     Total |       768      3,737 |     4,505 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped | outcome: covid death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |       579        459 |     1,038 
           |     21.99      24.52 |     23.04 
-----------+----------------------+----------
    70-<80 |     1,285        875 |     2,160 
           |     48.80      46.74 |     47.95 
-----------+----------------------+----------
       80+ |       769        538 |     1,307 
           |     29.21      28.74 |     29.01 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,330        960 |     2,290 
           |     50.51      51.28 |     50.83 
-----------+----------------------+----------
         1 |     1,303        912 |     2,215 
           |     49.49      48.72 |     49.17 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     | outcome: covid death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       264        194 |       458 
                     |     10.03      10.36 |     10.17 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       604        442 |     1,046 
                     |     22.94      23.61 |     23.22 
---------------------+----------------------+----------
Overweight (25-29.9) |       466        333 |       799 
                     |     17.70      17.79 |     17.74 
---------------------+----------------------+----------
   Obese I (30-34.9) |       362        281 |       643 
                     |     13.75      15.01 |     14.27 
---------------------+----------------------+----------
  Obese II (35-39.9) |       234        154 |       388 
                     |      8.89       8.23 |      8.61 
---------------------+----------------------+----------
     Obese III (40+) |       146        101 |       247 
                     |      5.55       5.40 |      5.48 
---------------------+----------------------+----------
        Unknown (.u) |       557        367 |       924 
                     |     21.15      19.60 |     20.51 
---------------------+----------------------+----------
               Total |     2,633      1,872 |     4,505 
                     |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking | outcome: covid death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       112         86 |       198 
             |      4.25       4.59 |      4.40 
-------------+----------------------+----------
      Former |        59         29 |        88 
             |      2.24       1.55 |      1.95 
-------------+----------------------+----------
     Current |       309        193 |       502 
             |     11.74      10.31 |     11.14 
-------------+----------------------+----------
Unknown (.u) |     2,153      1,564 |     3,717 
             |     81.77      83.55 |     82.51 
-------------+----------------------+----------
       Total |     2,633      1,872 |     4,505 
             |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity | outcome: covid death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     1,891      1,336 |     3,227 
                     |     71.82      71.37 |     71.63 
---------------------+----------------------+----------
   Obese I (30-34.9) |       362        281 |       643 
                     |     13.75      15.01 |     14.27 
---------------------+----------------------+----------
  Obese II (35-39.9) |       234        154 |       388 
                     |      8.89       8.23 |      8.61 
---------------------+----------------------+----------
     Obese III (40+) |       146        101 |       247 
                     |      5.55       5.40 |      5.48 
---------------------+----------------------+----------
               Total |     2,633      1,872 |     4,505 
                     |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       386        282 |       668 
           |     14.66      15.06 |     14.83 
-----------+----------------------+----------
         1 |     2,247      1,590 |     3,837 
           |     85.34      84.94 |     85.17 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator | outcome: covid death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,087      1,498 |     3,585 
           |     79.26      80.02 |     79.58 
-----------+----------------------+----------
         1 |       546        374 |       920 
           |     20.74      19.98 |     20.42 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma | outcome: covid death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,393      1,725 |     4,118 
           |     90.88      92.15 |     91.41 
-----------+----------------------+----------
         1 |       240        147 |       387 
           |      9.12       7.85 |      8.59 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac | outcome: covid death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,113      1,487 |     3,600 
           |     80.25      79.43 |     79.91 
-----------+----------------------+----------
         1 |       520        385 |       905 
           |     19.75      20.57 |     20.09 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
20

**TABLE OF diabcat covid_death REDACTED DUE TO SMALL N**

30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo | outcome: covid death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,130      1,483 |     3,613 
              |     80.90      79.22 |     80.20 
--------------+----------------------+----------
    Last year |        12          7 |        19 
              |      0.46       0.37 |      0.42 
--------------+----------------------+----------
2-5 years ago |        45         30 |        75 
              |      1.71       1.60 |      1.66 
--------------+----------------------+----------
     5+ years |       446        352 |       798 
              |     16.94      18.80 |     17.71 
--------------+----------------------+----------
        Total |     2,633      1,872 |     4,505 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica | outcome: covid death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,105      1,495 |     3,600 
              |     79.95      79.86 |     79.91 
--------------+----------------------+----------
    Last year |         9          7 |        16 
              |      0.34       0.37 |      0.36 
--------------+----------------------+----------
2-5 years ago |        48         23 |        71 
              |      1.82       1.23 |      1.58 
--------------+----------------------+----------
     5+ years |       471        347 |       818 
              |     17.89      18.54 |     18.16 
--------------+----------------------+----------
        Total |     2,633      1,872 |     4,505 
              |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on | outcome: covid death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,075      1,504 |     3,579 
           |     78.81      80.34 |     79.45 
-----------+----------------------+----------
         1 |       558        368 |       926 
           |     21.19      19.66 |     20.55 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |   Failure/censoring
     solid |     indicator for
     organ | outcome: covid death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,136      1,519 |     3,655 
           |     81.12      81.14 |     81.13 
-----------+----------------------+----------
         1 |       497        353 |       850 
           |     18.88      18.86 |     18.87 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,103      1,488 |     3,591 
           |     79.87      79.49 |     79.71 
-----------+----------------------+----------
         1 |       530        384 |       914 
           |     20.13      20.51 |     20.29 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,096      1,474 |     3,570 
           |     79.61      78.74 |     79.25 
-----------+----------------------+----------
         1 |       537        398 |       935 
           |     20.39      21.26 |     20.75 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic | outcome: covid death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,073      1,481 |     3,554 
           |     78.73      79.11 |     78.89 
-----------+----------------------+----------
         1 |       560        391 |       951 
           |     21.27      20.89 |     21.11 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or | outcome: covid death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,132      1,499 |     3,631 
           |     80.97      80.07 |     80.60 
-----------+----------------------+----------
         1 |       501        373 |       874 
           |     19.03      19.93 |     19.40 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
21

**TABLE OF egfr_cat covid_death REDACTED DUE TO SMALL N**

17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 End-stage |     indicator for
     renal | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,700      1,194 |     2,894 
           |     64.57      63.78 |     64.24 
-----------+----------------------+----------
         1 |       933        678 |     1,611 
           |     35.43      36.22 |     35.76 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney | outcome: covid death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     2,541      1,806 |     4,347 
                      |     96.51      96.47 |     96.49 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        92         66 |       158 
                      |      3.49       3.53 |      3.51 
----------------------+----------------------+----------
                Total |     2,633      1,872 |     4,505 
                      |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi | outcome: covid death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,120      1,492 |     3,612 
           |     80.52      79.70 |     80.18 
-----------+----------------------+----------
         1 |       513        380 |       893 
           |     19.48      20.30 |     19.82 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,076      1,499 |     3,575 
           |     78.85      80.07 |     79.36 
-----------+----------------------+----------
         1 |       557        373 |       930 
           |     21.15      19.93 |     20.64 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation | outcome: covid death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     1,826      1,294 |     3,120 
                 |     69.35      69.12 |     69.26 
-----------------+----------------------+----------
               4 |       544        397 |       941 
                 |     20.66      21.21 |     20.89 
-----------------+----------------------+----------
 5 most deprived |       263        181 |       444 
                 |      9.99       9.67 |      9.86 
-----------------+----------------------+----------
           Total |     2,633      1,872 |     4,505 
                 |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      | outcome: covid death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     2,106      1,493 |     3,599 
                      |     79.98      79.75 |     79.89 
----------------------+----------------------+----------
Asian or Asian Britis |       272        193 |       465 
                      |     10.33      10.31 |     10.32 
----------------------+----------------------+----------
                Other |       255        186 |       441 
                      |      9.68       9.94 |      9.79 
----------------------+----------------------+----------
                Total |     2,633      1,872 |     4,505 
                      |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       282        173 |       455 
           |     10.71       9.24 |     10.10 
-----------+----------------------+----------
         2 |       251        179 |       430 
           |      9.53       9.56 |      9.54 
-----------+----------------------+----------
         3 |       251        170 |       421 
           |      9.53       9.08 |      9.35 
-----------+----------------------+----------
         4 |       282        208 |       490 
           |     10.71      11.11 |     10.88 
-----------+----------------------+----------
         5 |       262        213 |       475 
           |      9.95      11.38 |     10.54 
-----------+----------------------+----------
         6 |       299        166 |       465 
           |     11.36       8.87 |     10.32 
-----------+----------------------+----------
         7 |       248        185 |       433 
           |      9.42       9.88 |      9.61 
-----------+----------------------+----------
         8 |       252        200 |       452 
           |      9.57      10.68 |     10.03 
-----------+----------------------+----------
         9 |       262        181 |       443 
           |      9.95       9.67 |      9.83 
-----------+----------------------+----------
        10 |       244        197 |       441 
           |      9.27      10.52 |      9.79 
-----------+----------------------+----------
     Total |     2,633      1,872 |     4,505 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |       749        289 |     1,038 
           |     22.91      23.38 |     23.04 
-----------+----------------------+----------
    70-<80 |     1,564        596 |     2,160 
           |     47.84      48.22 |     47.95 
-----------+----------------------+----------
       80+ |       956        351 |     1,307 
           |     29.24      28.40 |     29.01 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,685        605 |     2,290 
           |     51.54      48.95 |     50.83 
-----------+----------------------+----------
         1 |     1,584        631 |     2,215 
           |     48.46      51.05 |     49.17 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       337        121 |       458 
                     |     10.31       9.79 |     10.17 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       739        307 |     1,046 
                     |     22.61      24.84 |     23.22 
---------------------+----------------------+----------
Overweight (25-29.9) |       595        204 |       799 
                     |     18.20      16.50 |     17.74 
---------------------+----------------------+----------
   Obese I (30-34.9) |       464        179 |       643 
                     |     14.19      14.48 |     14.27 
---------------------+----------------------+----------
  Obese II (35-39.9) |       285        103 |       388 
                     |      8.72       8.33 |      8.61 
---------------------+----------------------+----------
     Obese III (40+) |       181         66 |       247 
                     |      5.54       5.34 |      5.48 
---------------------+----------------------+----------
        Unknown (.u) |       668        256 |       924 
                     |     20.43      20.71 |     20.51 
---------------------+----------------------+----------
               Total |     3,269      1,236 |     4,505 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       148         50 |       198 
             |      4.53       4.05 |      4.40 
-------------+----------------------+----------
      Former |        63         25 |        88 
             |      1.93       2.02 |      1.95 
-------------+----------------------+----------
     Current |       365        137 |       502 
             |     11.17      11.08 |     11.14 
-------------+----------------------+----------
Unknown (.u) |     2,693      1,024 |     3,717 
             |     82.38      82.85 |     82.51 
-------------+----------------------+----------
       Total |     3,269      1,236 |     4,505 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     2,339        888 |     3,227 
                     |     71.55      71.84 |     71.63 
---------------------+----------------------+----------
   Obese I (30-34.9) |       464        179 |       643 
                     |     14.19      14.48 |     14.27 
---------------------+----------------------+----------
  Obese II (35-39.9) |       285        103 |       388 
                     |      8.72       8.33 |      8.61 
---------------------+----------------------+----------
     Obese III (40+) |       181         66 |       247 
                     |      5.54       5.34 |      5.48 
---------------------+----------------------+----------
               Total |     3,269      1,236 |     4,505 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       482        186 |       668 
           |     14.74      15.05 |     14.83 
-----------+----------------------+----------
         1 |     2,787      1,050 |     3,837 
           |     85.26      84.95 |     85.17 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,597        988 |     3,585 
           |     79.44      79.94 |     79.58 
-----------+----------------------+----------
         1 |       672        248 |       920 
           |     20.56      20.06 |     20.42 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,995      1,123 |     4,118 
           |     91.62      90.86 |     91.41 
-----------+----------------------+----------
         1 |       274        113 |       387 
           |      8.38       9.14 |      8.59 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,608        992 |     3,600 
           |     79.78      80.26 |     79.91 
-----------+----------------------+----------
         1 |       661        244 |       905 
           |     20.22      19.74 |     20.09 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
24

**TABLE OF diabcat non_covid_death REDACTED DUE TO SMALL N**

34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,617        996 |     3,613 
              |     80.06      80.58 |     80.20 
--------------+----------------------+----------
    Last year |        11          8 |        19 
              |      0.34       0.65 |      0.42 
--------------+----------------------+----------
2-5 years ago |        52         23 |        75 
              |      1.59       1.86 |      1.66 
--------------+----------------------+----------
     5+ years |       589        209 |       798 
              |     18.02      16.91 |     17.71 
--------------+----------------------+----------
        Total |     3,269      1,236 |     4,505 
              |    100.00     100.00 |    100.00 
32

**TABLE OF cancer_haem_cat non_covid_death REDACTED DUE TO SMALL N**

29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,603        976 |     3,579 
           |     79.63      78.96 |     79.45 
-----------+----------------------+----------
         1 |       666        260 |       926 
           |     20.37      21.04 |     20.55 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,646      1,009 |     3,655 
           |     80.94      81.63 |     81.13 
-----------+----------------------+----------
         1 |       623        227 |       850 
           |     19.06      18.37 |     18.87 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,601        990 |     3,591 
           |     79.57      80.10 |     79.71 
-----------+----------------------+----------
         1 |       668        246 |       914 
           |     20.43      19.90 |     20.29 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,591        979 |     3,570 
           |     79.26      79.21 |     79.25 
-----------+----------------------+----------
         1 |       678        257 |       935 
           |     20.74      20.79 |     20.75 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,571        983 |     3,554 
           |     78.65      79.53 |     78.89 
-----------+----------------------+----------
         1 |       698        253 |       951 
           |     21.35      20.47 |     21.11 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,628      1,003 |     3,631 
           |     80.39      81.15 |     80.60 
-----------+----------------------+----------
         1 |       641        233 |       874 
           |     19.61      18.85 |     19.40 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
25

**TABLE OF egfr_cat non_covid_death REDACTED DUE TO SMALL N**

21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,108        786 |     2,894 
           |     64.48      63.59 |     64.24 
-----------+----------------------+----------
         1 |     1,161        450 |     1,611 
           |     35.52      36.41 |     35.76 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     3,151      1,196 |     4,347 
                      |     96.39      96.76 |     96.49 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       118         40 |       158 
                      |      3.61       3.24 |      3.51 
----------------------+----------------------+----------
                Total |     3,269      1,236 |     4,505 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,616        996 |     3,612 
           |     80.02      80.58 |     80.18 
-----------+----------------------+----------
         1 |       653        240 |       893 
           |     19.98      19.42 |     19.82 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,604        971 |     3,575 
           |     79.66      78.56 |     79.36 
-----------+----------------------+----------
         1 |       665        265 |       930 
           |     20.34      21.44 |     20.64 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     2,262        858 |     3,120 
                 |     69.20      69.42 |     69.26 
-----------------+----------------------+----------
               4 |       688        253 |       941 
                 |     21.05      20.47 |     20.89 
-----------------+----------------------+----------
 5 most deprived |       319        125 |       444 
                 |      9.76      10.11 |      9.86 
-----------------+----------------------+----------
           Total |     3,269      1,236 |     4,505 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     2,629        970 |     3,599 
                      |     80.42      78.48 |     79.89 
----------------------+----------------------+----------
Asian or Asian Britis |       334        131 |       465 
                      |     10.22      10.60 |     10.32 
----------------------+----------------------+----------
                Other |       306        135 |       441 
                      |      9.36      10.92 |      9.79 
----------------------+----------------------+----------
                Total |     3,269      1,236 |     4,505 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       322        133 |       455 
           |      9.85      10.76 |     10.10 
-----------+----------------------+----------
         2 |       315        115 |       430 
           |      9.64       9.30 |      9.54 
-----------+----------------------+----------
         3 |       305        116 |       421 
           |      9.33       9.39 |      9.35 
-----------+----------------------+----------
         4 |       354        136 |       490 
           |     10.83      11.00 |     10.88 
-----------+----------------------+----------
         5 |       356        119 |       475 
           |     10.89       9.63 |     10.54 
-----------+----------------------+----------
         6 |       326        139 |       465 
           |      9.97      11.25 |     10.32 
-----------+----------------------+----------
         7 |       325        108 |       433 
           |      9.94       8.74 |      9.61 
-----------+----------------------+----------
         8 |       331        121 |       452 
           |     10.13       9.79 |     10.03 
-----------+----------------------+----------
         9 |       314        129 |       443 
           |      9.61      10.44 |      9.83 
-----------+----------------------+----------
        10 |       321        120 |       441 
           |      9.82       9.71 |      9.79 
-----------+----------------------+----------
     Total |     3,269      1,236 |     4,505 
           |    100.00     100.00 |    100.00 

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  /workspace/logs/04a_an_descriptive_tables.log
  log type:  text
 closed on:  17 Aug 2021, 07:44:56
-------------------------------------------------------------------------------
