-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04a_an_descriptive_tables.log
  log type:  text
 opened on:  24 Jul 2021, 18:07:42

. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  3. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. ta shield
 16. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd            ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 17.                                                 
. safetab `var'
 18. }
 19. 
. safetab imd 
 20. safetab imd, m
 21. safetab ethnicity
 22. safetab ethnicity, m
 23. safetab stp
 24. 
. 
. * Outcomes
. safetab non_covid_death
 25. safetab covid_death
 26. safetab covid_tpp_prob
 27. safetab covid_icu
 28. 
. * Outcome dates
. sum date*, format
 29. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death non_covid_death {
 30. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    `outvar', col
 31.         safetab male                                                      
>       `outvar', col
 32.         safetab bmicat                                                    
>       `outvar', col m 
 33.         safetab smoke                                                     
>       `outvar', col m
 34.         safetab obese4cat                                                 
>       `outvar', col m 
 35.         safetab shield                                                    
>       `outvar', col m 
 36. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 esrd ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 37.         safetab `var'           `outvar', col
 38. }
 39.         
.         safetab imd                                                          
>    `outvar', col m
 40.         safetab ethnicity                                                 
>       `outvar', col m
 41.         *safetab urban                                                    
>       `outvar', col
.         safetab stp                                                          
>    `outvar', col
 42. }
 43. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     16,007    41.25964    13.54105         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |      3,965       24.77       24.77
     30-<40 |      3,520       21.99       46.76
     40-<50 |      3,287       20.53       67.30
     50-<60 |      3,568       22.29       89.59
     60-<70 |      1,667       10.41      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,007      100.00      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,101       50.61       50.61
          1 |      7,906       49.39      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,442       11.70       11.70
  Normal (18.5-24.9) |      3,566       28.94       40.64
Overweight (25-29.9) |      2,851       23.14       63.78
   Obese I (30-34.9) |      2,220       18.02       81.80
  Obese II (35-39.9) |      1,372       11.13       92.93
     Obese III (40+) |        871        7.07      100.00
---------------------+-----------------------------------
               Total |     12,322      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,442        9.01        9.01
  Normal (18.5-24.9) |      3,566       22.28       31.29
Overweight (25-29.9) |      2,851       17.81       49.10
   Obese I (30-34.9) |      2,220       13.87       62.97
  Obese II (35-39.9) |      1,372        8.57       71.54
     Obese III (40+) |        871        5.44       76.98
        Unknown (.u) |      3,685       23.02      100.00
---------------------+-----------------------------------
               Total |     16,007      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     11,544       72.12       72.12
   Obese I (30-34.9) |      2,220       13.87       85.99
  Obese II (35-39.9) |      1,372        8.57       94.56
     Obese III (40+) |        871        5.44      100.00
---------------------+-----------------------------------
               Total |     16,007      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        642       22.16       22.16
      Former |        301       10.39       32.55
     Current |      1,954       67.45      100.00
-------------+-----------------------------------
       Total |      2,897      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        642        4.01        4.01
      Former |        301        1.88        5.89
     Current |      1,954       12.21       18.10
Unknown (.u) |     13,110       81.90      100.00
-------------+-----------------------------------
       Total |     16,007      100.00
0

**TABLE OF bpcat REDACTED DUE TO SMALL N**

6

**TABLE OF bpcat REDACTED DUE TO SMALL N**

0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,287        8.04        8.04
          1 |     14,720       91.96      100.00
------------+-----------------------------------
      Total |     16,007      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,504       15.64       15.64
          1 |     13,503       84.36      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,820       80.09       80.09
          1 |      3,187       19.91      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,720       91.96       91.96
          1 |      1,287        8.04      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,870       80.40       80.40
          1 |      3,137       19.60      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     12,359       77.21       77.21
  T1DM, controlled |        407        2.54       79.75
T1DM, uncontrolled |         81        0.51       80.26
  T2DM, controlled |      2,605       16.27       96.53
T2DM, uncontrolled |        545        3.40       99.94
Diabetes, no HbA1c |         10        0.06      100.00
-------------------+-----------------------------------
             Total |     16,007      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     12,938       80.83       80.83
    Last year |         61        0.38       81.21
2-5 years ago |        266        1.66       82.87
     5+ years |      2,742       17.13      100.00
--------------+-----------------------------------
        Total |     16,007      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     12,916       80.69       80.69
    Last year |         55        0.34       81.03
2-5 years ago |        231        1.44       82.48
     5+ years |      2,805       17.52      100.00
--------------+-----------------------------------
        Total |     16,007      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,815       80.06       80.06
          1 |      3,192       19.94      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,831       80.16       80.16
          1 |      3,176       19.84      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,814       80.05       80.05
          1 |      3,193       19.95      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,812       80.04       80.04
          1 |      3,195       19.96      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,817       80.07       80.07
          1 |      3,190       19.93      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,832       80.16       80.16
          1 |      3,175       19.84      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         45 |         65        0.43        0.43
         60 |     15,080       99.57      100.00
------------+-----------------------------------
      Total |     15,145      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |     15,942       99.59       99.59
Stage 3a/3b egfr 30-60       |         65        0.41      100.00
-----------------------------+-----------------------------------
                       Total |     16,007      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,181       63.60       63.60
          1 |      5,826       36.40      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,833       80.17       80.17
          1 |      3,174       19.83      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,857       80.32       80.32
          1 |      3,150       19.68      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,158       69.71       69.71
               4 |      3,243       20.26       89.97
 5 most deprived |      1,606       10.03      100.00
-----------------+-----------------------------------
           Total |     16,007      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,158       69.71       69.71
               4 |      3,243       20.26       89.97
 5 most deprived |      1,606       10.03      100.00
-----------------+-----------------------------------
           Total |     16,007      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,869       80.40       80.40
Asian or Asian British |      1,556        9.72       90.12
                 Other |      1,582        9.88      100.00
-----------------------+-----------------------------------
                 Total |     16,007      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,869       80.40       80.40
Asian or Asian British |      1,556        9.72       90.12
                 Other |      1,582        9.88      100.00
-----------------------+-----------------------------------
                 Total |     16,007      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,644       10.27       10.27
          2 |      1,575        9.84       20.11
          3 |      1,549        9.68       29.79
          4 |      1,630       10.18       39.97
          5 |      1,607       10.04       50.01
          6 |      1,643       10.26       60.27
          7 |      1,607       10.04       70.31
          8 |      1,576        9.85       80.16
          9 |      1,605       10.03       90.19
         10 |      1,571        9.81      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,981       68.60       68.60
          1 |      5,026       31.40      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,535       53.32       53.32
          1 |      7,472       46.68      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,098        6.86        6.86
          1 |     14,909       93.14      100.00
------------+-----------------------------------
      Total |     16,007      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,587       22.41       22.41
          1 |     12,420       77.59      100.00
------------+-----------------------------------
      Total |     16,007      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |     12,420   03apr2021    59.80187  21dec2020  16jul2021
date_posit~S |      2,372   25jun2021    21.40065  25dec2020  16jul2021
date_covid~b |     14,909   04apr2021    60.18126  21dec2020  16jul2021
date_covid~n |      7,153   04mar2021    49.45602  20dec2020  16jun2021
date_covid~s |     14,800   03apr2021    59.95292  21dec2020  16jul2021
-------------+---------------------------------------------------------
date_covid~h |      7,472   03apr2021    59.78847  21dec2020  16jul2021
date_non_c~h |      5,026   03apr2021    60.63204  21dec2020  16jul2021
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       310      3,655 |     3,965 
           |     28.23      24.52 |     24.77 
-----------+----------------------+----------
    30-<40 |       236      3,284 |     3,520 
           |     21.49      22.03 |     21.99 
-----------+----------------------+----------
    40-<50 |       226      3,061 |     3,287 
           |     20.58      20.53 |     20.53 
-----------+----------------------+----------
    50-<60 |       214      3,354 |     3,568 
           |     19.49      22.50 |     22.29 
-----------+----------------------+----------
    60-<70 |       112      1,555 |     1,667 
           |     10.20      10.43 |     10.41 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |       548      7,553 |     8,101 
           |     49.91      50.66 |     50.61 
-----------+----------------------+----------
         1 |       550      7,356 |     7,906 
           |     50.09      49.34 |     49.39 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       112      1,330 |     1,442 
                     |     10.20       8.92 |      9.01 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       227      3,339 |     3,566 
                     |     20.67      22.40 |     22.28 
---------------------+----------------------+----------
Overweight (25-29.9) |       176      2,675 |     2,851 
                     |     16.03      17.94 |     17.81 
---------------------+----------------------+----------
   Obese I (30-34.9) |       166      2,054 |     2,220 
                     |     15.12      13.78 |     13.87 
---------------------+----------------------+----------
  Obese II (35-39.9) |        90      1,282 |     1,372 
                     |      8.20       8.60 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |        59        812 |       871 
                     |      5.37       5.45 |      5.44 
---------------------+----------------------+----------
        Unknown (.u) |       268      3,417 |     3,685 
                     |     24.41      22.92 |     23.02 
---------------------+----------------------+----------
               Total |     1,098     14,909 |    16,007 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |        49        593 |       642 
             |      4.46       3.98 |      4.01 
-------------+----------------------+----------
      Former |        16        285 |       301 
             |      1.46       1.91 |      1.88 
-------------+----------------------+----------
     Current |       136      1,818 |     1,954 
             |     12.39      12.19 |     12.21 
-------------+----------------------+----------
Unknown (.u) |       897     12,213 |    13,110 
             |     81.69      81.92 |     81.90 
-------------+----------------------+----------
       Total |     1,098     14,909 |    16,007 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |       783     10,761 |    11,544 
                     |     71.31      72.18 |     72.12 
---------------------+----------------------+----------
   Obese I (30-34.9) |       166      2,054 |     2,220 
                     |     15.12      13.78 |     13.87 
---------------------+----------------------+----------
  Obese II (35-39.9) |        90      1,282 |     1,372 
                     |      8.20       8.60 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |        59        812 |       871 
                     |      5.37       5.45 |      5.44 
---------------------+----------------------+----------
               Total |     1,098     14,909 |    16,007 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       149      2,355 |     2,504 
           |     13.57      15.80 |     15.64 
-----------+----------------------+----------
         1 |       949     12,554 |    13,503 
           |     86.43      84.20 |     84.36 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |       869     11,951 |    12,820 
           |     79.14      80.16 |     80.09 
-----------+----------------------+----------
         1 |       229      2,958 |     3,187 
           |     20.86      19.84 |     19.91 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,002     13,718 |    14,720 
           |     91.26      92.01 |     91.96 
-----------+----------------------+----------
         1 |        96      1,191 |     1,287 
           |      8.74       7.99 |      8.04 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |       892     11,978 |    12,870 
           |     81.24      80.34 |     80.40 
-----------+----------------------+----------
         1 |       206      2,931 |     3,137 
           |     18.76      19.66 |     19.60 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
23

**TABLE OF diabcat covid_tpp_prob REDACTED DUE TO SMALL N**

33

**TABLE OF cancer_exhaem_cat covid_tpp_prob REDACTED DUE TO SMALL N**

31

**TABLE OF cancer_haem_cat covid_tpp_prob REDACTED DUE TO SMALL N**

28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |       867     11,948 |    12,815 
           |     78.96      80.14 |     80.06 
-----------+----------------------+----------
         1 |       231      2,961 |     3,192 
           |     21.04      19.86 |     19.94 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |       868     11,963 |    12,831 
           |     79.05      80.24 |     80.16 
-----------+----------------------+----------
         1 |       230      2,946 |     3,176 
           |     20.95      19.76 |     19.84 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |       891     11,923 |    12,814 
           |     81.15      79.97 |     80.05 
-----------+----------------------+----------
         1 |       207      2,986 |     3,193 
           |     18.85      20.03 |     19.95 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       872     11,940 |    12,812 
           |     79.42      80.09 |     80.04 
-----------+----------------------+----------
         1 |       226      2,969 |     3,195 
           |     20.58      19.91 |     19.96 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       868     11,949 |    12,817 
           |     79.05      80.15 |     80.07 
-----------+----------------------+----------
         1 |       230      2,960 |     3,190 
           |     20.95      19.85 |     19.93 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       882     11,950 |    12,832 
           |     80.33      80.15 |     80.16 
-----------+----------------------+----------
         1 |       216      2,959 |     3,175 
           |     19.67      19.85 |     19.84 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
24

**TABLE OF egfr_cat covid_tpp_prob REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       683      9,498 |    10,181 
           |     62.20      63.71 |     63.60 
-----------+----------------------+----------
         1 |       415      5,411 |     5,826 
           |     37.80      36.29 |     36.40 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
39

**TABLE OF reduced_kidney_function covid_tpp_prob REDACTED DUE TO SMALL N**

28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |       880     11,953 |    12,833 
           |     80.15      80.17 |     80.17 
-----------+----------------------+----------
         1 |       218      2,956 |     3,174 
           |     19.85      19.83 |     19.83 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       862     11,995 |    12,857 
           |     78.51      80.45 |     80.32 
-----------+----------------------+----------
         1 |       236      2,914 |     3,150 
           |     21.49      19.55 |     19.68 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |       763     10,395 |    11,158 
                 |     69.49      69.72 |     69.71 
-----------------+----------------------+----------
               4 |       220      3,023 |     3,243 
                 |     20.04      20.28 |     20.26 
-----------------+----------------------+----------
 5 most deprived |       115      1,491 |     1,606 
                 |     10.47      10.00 |     10.03 
-----------------+----------------------+----------
           Total |     1,098     14,909 |    16,007 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |       885     11,984 |    12,869 
                      |     80.60      80.38 |     80.40 
----------------------+----------------------+----------
Asian or Asian Britis |       107      1,449 |     1,556 
                      |      9.74       9.72 |      9.72 
----------------------+----------------------+----------
                Other |       106      1,476 |     1,582 
                      |      9.65       9.90 |      9.88 
----------------------+----------------------+----------
                Total |     1,098     14,909 |    16,007 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |        98      1,546 |     1,644 
           |      8.93      10.37 |     10.27 
-----------+----------------------+----------
         2 |       100      1,475 |     1,575 
           |      9.11       9.89 |      9.84 
-----------+----------------------+----------
         3 |       105      1,444 |     1,549 
           |      9.56       9.69 |      9.68 
-----------+----------------------+----------
         4 |       111      1,519 |     1,630 
           |     10.11      10.19 |     10.18 
-----------+----------------------+----------
         5 |       121      1,486 |     1,607 
           |     11.02       9.97 |     10.04 
-----------+----------------------+----------
         6 |       113      1,530 |     1,643 
           |     10.29      10.26 |     10.26 
-----------+----------------------+----------
         7 |       127      1,480 |     1,607 
           |     11.57       9.93 |     10.04 
-----------+----------------------+----------
         8 |       105      1,471 |     1,576 
           |      9.56       9.87 |      9.85 
-----------+----------------------+----------
         9 |       123      1,482 |     1,605 
           |     11.20       9.94 |     10.03 
-----------+----------------------+----------
        10 |        95      1,476 |     1,571 
           |      8.65       9.90 |      9.81 
-----------+----------------------+----------
     Total |     1,098     14,909 |    16,007 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped | outcome: covid death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     2,098      1,867 |     3,965 
           |     24.58      24.99 |     24.77 
-----------+----------------------+----------
    30-<40 |     1,878      1,642 |     3,520 
           |     22.00      21.98 |     21.99 
-----------+----------------------+----------
    40-<50 |     1,772      1,515 |     3,287 
           |     20.76      20.28 |     20.53 
-----------+----------------------+----------
    50-<60 |     1,899      1,669 |     3,568 
           |     22.25      22.34 |     22.29 
-----------+----------------------+----------
    60-<70 |       888        779 |     1,667 
           |     10.40      10.43 |     10.41 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,278      3,823 |     8,101 
           |     50.12      51.16 |     50.61 
-----------+----------------------+----------
         1 |     4,257      3,649 |     7,906 
           |     49.88      48.84 |     49.39 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     | outcome: covid death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       768        674 |     1,442 
                     |      9.00       9.02 |      9.01 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,844      1,722 |     3,566 
                     |     21.61      23.05 |     22.28 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,541      1,310 |     2,851 
                     |     18.06      17.53 |     17.81 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,176      1,044 |     2,220 
                     |     13.78      13.97 |     13.87 
---------------------+----------------------+----------
  Obese II (35-39.9) |       733        639 |     1,372 
                     |      8.59       8.55 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |       457        414 |       871 
                     |      5.35       5.54 |      5.44 
---------------------+----------------------+----------
        Unknown (.u) |     2,016      1,669 |     3,685 
                     |     23.62      22.34 |     23.02 
---------------------+----------------------+----------
               Total |     8,535      7,472 |    16,007 
                     |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking | outcome: covid death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       355        287 |       642 
             |      4.16       3.84 |      4.01 
-------------+----------------------+----------
      Former |       168        133 |       301 
             |      1.97       1.78 |      1.88 
-------------+----------------------+----------
     Current |     1,030        924 |     1,954 
             |     12.07      12.37 |     12.21 
-------------+----------------------+----------
Unknown (.u) |     6,982      6,128 |    13,110 
             |     81.80      82.01 |     81.90 
-------------+----------------------+----------
       Total |     8,535      7,472 |    16,007 
             |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity | outcome: covid death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     6,169      5,375 |    11,544 
                     |     72.28      71.94 |     72.12 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,176      1,044 |     2,220 
                     |     13.78      13.97 |     13.87 
---------------------+----------------------+----------
  Obese II (35-39.9) |       733        639 |     1,372 
                     |      8.59       8.55 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |       457        414 |       871 
                     |      5.35       5.54 |      5.44 
---------------------+----------------------+----------
               Total |     8,535      7,472 |    16,007 
                     |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,323      1,181 |     2,504 
           |     15.50      15.81 |     15.64 
-----------+----------------------+----------
         1 |     7,212      6,291 |    13,503 
           |     84.50      84.19 |     84.36 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator | outcome: covid death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,844      5,976 |    12,820 
           |     80.19      79.98 |     80.09 
-----------+----------------------+----------
         1 |     1,691      1,496 |     3,187 
           |     19.81      20.02 |     19.91 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma | outcome: covid death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,844      6,876 |    14,720 
           |     91.90      92.02 |     91.96 
-----------+----------------------+----------
         1 |       691        596 |     1,287 
           |      8.10       7.98 |      8.04 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac | outcome: covid death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,868      6,002 |    12,870 
           |     80.47      80.33 |     80.40 
-----------+----------------------+----------
         1 |     1,667      1,470 |     3,137 
           |     19.53      19.67 |     19.60 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
20

**TABLE OF diabcat covid_death REDACTED DUE TO SMALL N**

30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo | outcome: covid death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     6,898      6,040 |    12,938 
              |     80.82      80.84 |     80.83 
--------------+----------------------+----------
    Last year |        29         32 |        61 
              |      0.34       0.43 |      0.38 
--------------+----------------------+----------
2-5 years ago |       138        128 |       266 
              |      1.62       1.71 |      1.66 
--------------+----------------------+----------
     5+ years |     1,470      1,272 |     2,742 
              |     17.22      17.02 |     17.13 
--------------+----------------------+----------
        Total |     8,535      7,472 |    16,007 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica | outcome: covid death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     6,901      6,015 |    12,916 
              |     80.86      80.50 |     80.69 
--------------+----------------------+----------
    Last year |        27         28 |        55 
              |      0.32       0.37 |      0.34 
--------------+----------------------+----------
2-5 years ago |       123        108 |       231 
              |      1.44       1.45 |      1.44 
--------------+----------------------+----------
     5+ years |     1,484      1,321 |     2,805 
              |     17.39      17.68 |     17.52 
--------------+----------------------+----------
        Total |     8,535      7,472 |    16,007 
              |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on | outcome: covid death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,793      6,022 |    12,815 
           |     79.59      80.59 |     80.06 
-----------+----------------------+----------
         1 |     1,742      1,450 |     3,192 
           |     20.41      19.41 |     19.94 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |   Failure/censoring
     solid |     indicator for
     organ | outcome: covid death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,829      6,002 |    12,831 
           |     80.01      80.33 |     80.16 
-----------+----------------------+----------
         1 |     1,706      1,470 |     3,176 
           |     19.99      19.67 |     19.84 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,819      5,995 |    12,814 
           |     79.89      80.23 |     80.05 
-----------+----------------------+----------
         1 |     1,716      1,477 |     3,193 
           |     20.11      19.77 |     19.95 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,824      5,988 |    12,812 
           |     79.95      80.14 |     80.04 
-----------+----------------------+----------
         1 |     1,711      1,484 |     3,195 
           |     20.05      19.86 |     19.96 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic | outcome: covid death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,792      6,025 |    12,817 
           |     79.58      80.63 |     80.07 
-----------+----------------------+----------
         1 |     1,743      1,447 |     3,190 
           |     20.42      19.37 |     19.93 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or | outcome: covid death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,849      5,983 |    12,832 
           |     80.25      80.07 |     80.16 
-----------+----------------------+----------
         1 |     1,686      1,489 |     3,175 
           |     19.75      19.93 |     19.84 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Calculated | outcome: covid death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        45 |        40         25 |        65 
           |      0.50       0.35 |      0.43 
-----------+----------------------+----------
        60 |     8,001      7,079 |    15,080 
           |     99.50      99.65 |     99.57 
-----------+----------------------+----------
     Total |     8,041      7,104 |    15,145 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 End-stage |     indicator for
     renal | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,402      4,779 |    10,181 
           |     63.29      63.96 |     63.60 
-----------+----------------------+----------
         1 |     3,133      2,693 |     5,826 
           |     36.71      36.04 |     36.40 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney | outcome: covid death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     8,495      7,447 |    15,942 
                      |     99.53      99.67 |     99.59 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        40         25 |        65 
                      |      0.47       0.33 |      0.41 
----------------------+----------------------+----------
                Total |     8,535      7,472 |    16,007 
                      |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi | outcome: covid death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,855      5,978 |    12,833 
           |     80.32      80.01 |     80.17 
-----------+----------------------+----------
         1 |     1,680      1,494 |     3,174 
           |     19.68      19.99 |     19.83 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,868      5,989 |    12,857 
           |     80.47      80.15 |     80.32 
-----------+----------------------+----------
         1 |     1,667      1,483 |     3,150 
           |     19.53      19.85 |     19.68 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation | outcome: covid death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     5,920      5,238 |    11,158 
                 |     69.36      70.10 |     69.71 
-----------------+----------------------+----------
               4 |     1,740      1,503 |     3,243 
                 |     20.39      20.12 |     20.26 
-----------------+----------------------+----------
 5 most deprived |       875        731 |     1,606 
                 |     10.25       9.78 |     10.03 
-----------------+----------------------+----------
           Total |     8,535      7,472 |    16,007 
                 |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      | outcome: covid death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     6,880      5,989 |    12,869 
                      |     80.61      80.15 |     80.40 
----------------------+----------------------+----------
Asian or Asian Britis |       824        732 |     1,556 
                      |      9.65       9.80 |      9.72 
----------------------+----------------------+----------
                Other |       831        751 |     1,582 
                      |      9.74      10.05 |      9.88 
----------------------+----------------------+----------
                Total |     8,535      7,472 |    16,007 
                      |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       898        746 |     1,644 
           |     10.52       9.98 |     10.27 
-----------+----------------------+----------
         2 |       807        768 |     1,575 
           |      9.46      10.28 |      9.84 
-----------+----------------------+----------
         3 |       856        693 |     1,549 
           |     10.03       9.27 |      9.68 
-----------+----------------------+----------
         4 |       827        803 |     1,630 
           |      9.69      10.75 |     10.18 
-----------+----------------------+----------
         5 |       845        762 |     1,607 
           |      9.90      10.20 |     10.04 
-----------+----------------------+----------
         6 |       921        722 |     1,643 
           |     10.79       9.66 |     10.26 
-----------+----------------------+----------
         7 |       844        763 |     1,607 
           |      9.89      10.21 |     10.04 
-----------+----------------------+----------
         8 |       863        713 |     1,576 
           |     10.11       9.54 |      9.85 
-----------+----------------------+----------
         9 |       856        749 |     1,605 
           |     10.03      10.02 |     10.03 
-----------+----------------------+----------
        10 |       818        753 |     1,571 
           |      9.58      10.08 |      9.81 
-----------+----------------------+----------
     Total |     8,535      7,472 |    16,007 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     2,748      1,217 |     3,965 
           |     25.03      24.21 |     24.77 
-----------+----------------------+----------
    30-<40 |     2,406      1,114 |     3,520 
           |     21.91      22.16 |     21.99 
-----------+----------------------+----------
    40-<50 |     2,230      1,057 |     3,287 
           |     20.31      21.03 |     20.53 
-----------+----------------------+----------
    50-<60 |     2,452      1,116 |     3,568 
           |     22.33      22.20 |     22.29 
-----------+----------------------+----------
    60-<70 |     1,145        522 |     1,667 
           |     10.43      10.39 |     10.41 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,565      2,536 |     8,101 
           |     50.68      50.46 |     50.61 
-----------+----------------------+----------
         1 |     5,416      2,490 |     7,906 
           |     49.32      49.54 |     49.39 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       992        450 |     1,442 
                     |      9.03       8.95 |      9.01 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     2,523      1,043 |     3,566 
                     |     22.98      20.75 |     22.28 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,951        900 |     2,851 
                     |     17.77      17.91 |     17.81 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,513        707 |     2,220 
                     |     13.78      14.07 |     13.87 
---------------------+----------------------+----------
  Obese II (35-39.9) |       944        428 |     1,372 
                     |      8.60       8.52 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |       578        293 |       871 
                     |      5.26       5.83 |      5.44 
---------------------+----------------------+----------
        Unknown (.u) |     2,480      1,205 |     3,685 
                     |     22.58      23.98 |     23.02 
---------------------+----------------------+----------
               Total |    10,981      5,026 |    16,007 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       445        197 |       642 
             |      4.05       3.92 |      4.01 
-------------+----------------------+----------
      Former |       215         86 |       301 
             |      1.96       1.71 |      1.88 
-------------+----------------------+----------
     Current |     1,346        608 |     1,954 
             |     12.26      12.10 |     12.21 
-------------+----------------------+----------
Unknown (.u) |     8,975      4,135 |    13,110 
             |     81.73      82.27 |     81.90 
-------------+----------------------+----------
       Total |    10,981      5,026 |    16,007 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     7,946      3,598 |    11,544 
                     |     72.36      71.59 |     72.12 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,513        707 |     2,220 
                     |     13.78      14.07 |     13.87 
---------------------+----------------------+----------
  Obese II (35-39.9) |       944        428 |     1,372 
                     |      8.60       8.52 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |       578        293 |       871 
                     |      5.26       5.83 |      5.44 
---------------------+----------------------+----------
               Total |    10,981      5,026 |    16,007 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,708        796 |     2,504 
           |     15.55      15.84 |     15.64 
-----------+----------------------+----------
         1 |     9,273      4,230 |    13,503 
           |     84.45      84.16 |     84.36 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,804      4,016 |    12,820 
           |     80.17      79.90 |     80.09 
-----------+----------------------+----------
         1 |     2,177      1,010 |     3,187 
           |     19.83      20.10 |     19.91 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,094      4,626 |    14,720 
           |     91.92      92.04 |     91.96 
-----------+----------------------+----------
         1 |       887        400 |     1,287 
           |      8.08       7.96 |      8.04 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,820      4,050 |    12,870 
           |     80.32      80.58 |     80.40 
-----------+----------------------+----------
         1 |     2,161        976 |     3,137 
           |     19.68      19.42 |     19.60 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
24

**TABLE OF diabcat non_covid_death REDACTED DUE TO SMALL N**

34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     8,897      4,041 |    12,938 
              |     81.02      80.40 |     80.83 
--------------+----------------------+----------
    Last year |        44         17 |        61 
              |      0.40       0.34 |      0.38 
--------------+----------------------+----------
2-5 years ago |       190         76 |       266 
              |      1.73       1.51 |      1.66 
--------------+----------------------+----------
     5+ years |     1,850        892 |     2,742 
              |     16.85      17.75 |     17.13 
--------------+----------------------+----------
        Total |    10,981      5,026 |    16,007 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     8,862      4,054 |    12,916 
              |     80.70      80.66 |     80.69 
--------------+----------------------+----------
    Last year |        39         16 |        55 
              |      0.36       0.32 |      0.34 
--------------+----------------------+----------
2-5 years ago |       157         74 |       231 
              |      1.43       1.47 |      1.44 
--------------+----------------------+----------
     5+ years |     1,923        882 |     2,805 
              |     17.51      17.55 |     17.52 
--------------+----------------------+----------
        Total |    10,981      5,026 |    16,007 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,782      4,033 |    12,815 
           |     79.97      80.24 |     80.06 
-----------+----------------------+----------
         1 |     2,199        993 |     3,192 
           |     20.03      19.76 |     19.94 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,804      4,027 |    12,831 
           |     80.17      80.12 |     80.16 
-----------+----------------------+----------
         1 |     2,177        999 |     3,176 
           |     19.83      19.88 |     19.84 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,778      4,036 |    12,814 
           |     79.94      80.30 |     80.05 
-----------+----------------------+----------
         1 |     2,203        990 |     3,193 
           |     20.06      19.70 |     19.95 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,756      4,056 |    12,812 
           |     79.74      80.70 |     80.04 
-----------+----------------------+----------
         1 |     2,225        970 |     3,195 
           |     20.26      19.30 |     19.96 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,826      3,991 |    12,817 
           |     80.38      79.41 |     80.07 
-----------+----------------------+----------
         1 |     2,155      1,035 |     3,190 
           |     19.62      20.59 |     19.93 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,807      4,025 |    12,832 
           |     80.20      80.08 |     80.16 
-----------+----------------------+----------
         1 |     2,174      1,001 |     3,175 
           |     19.80      19.92 |     19.84 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        45 |        45         20 |        65 
           |      0.43       0.42 |      0.43 
-----------+----------------------+----------
        60 |    10,352      4,728 |    15,080 
           |     99.57      99.58 |     99.57 
-----------+----------------------+----------
     Total |    10,397      4,748 |    15,145 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,005      3,176 |    10,181 
           |     63.79      63.19 |     63.60 
-----------+----------------------+----------
         1 |     3,976      1,850 |     5,826 
           |     36.21      36.81 |     36.40 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    10,936      5,006 |    15,942 
                      |     99.59      99.60 |     99.59 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        45         20 |        65 
                      |      0.41       0.40 |      0.41 
----------------------+----------------------+----------
                Total |    10,981      5,026 |    16,007 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,778      4,055 |    12,833 
           |     79.94      80.68 |     80.17 
-----------+----------------------+----------
         1 |     2,203        971 |     3,174 
           |     20.06      19.32 |     19.83 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,830      4,027 |    12,857 
           |     80.41      80.12 |     80.32 
-----------+----------------------+----------
         1 |     2,151        999 |     3,150 
           |     19.59      19.88 |     19.68 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     7,666      3,492 |    11,158 
                 |     69.81      69.48 |     69.71 
-----------------+----------------------+----------
               4 |     2,213      1,030 |     3,243 
                 |     20.15      20.49 |     20.26 
-----------------+----------------------+----------
 5 most deprived |     1,102        504 |     1,606 
                 |     10.04      10.03 |     10.03 
-----------------+----------------------+----------
           Total |    10,981      5,026 |    16,007 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     8,823      4,046 |    12,869 
                      |     80.35      80.50 |     80.40 
----------------------+----------------------+----------
Asian or Asian Britis |     1,071        485 |     1,556 
                      |      9.75       9.65 |      9.72 
----------------------+----------------------+----------
                Other |     1,087        495 |     1,582 
                      |      9.90       9.85 |      9.88 
----------------------+----------------------+----------
                Total |    10,981      5,026 |    16,007 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,129        515 |     1,644 
           |     10.28      10.25 |     10.27 
-----------+----------------------+----------
         2 |     1,107        468 |     1,575 
           |     10.08       9.31 |      9.84 
-----------+----------------------+----------
         3 |     1,044        505 |     1,549 
           |      9.51      10.05 |      9.68 
-----------+----------------------+----------
         4 |     1,115        515 |     1,630 
           |     10.15      10.25 |     10.18 
-----------+----------------------+----------
         5 |     1,127        480 |     1,607 
           |     10.26       9.55 |     10.04 
-----------+----------------------+----------
         6 |     1,111        532 |     1,643 
           |     10.12      10.58 |     10.26 
-----------+----------------------+----------
         7 |     1,100        507 |     1,607 
           |     10.02      10.09 |     10.04 
-----------+----------------------+----------
         8 |     1,043        533 |     1,576 
           |      9.50      10.60 |      9.85 
-----------+----------------------+----------
         9 |     1,090        515 |     1,605 
           |      9.93      10.25 |     10.03 
-----------+----------------------+----------
        10 |     1,115        456 |     1,571 
           |     10.15       9.07 |      9.81 
-----------+----------------------+----------
     Total |    10,981      5,026 |    16,007 
           |    100.00     100.00 |    100.00 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      4,605    75.76743    7.569486         66        108
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |      1,105       24.00       24.00
     70-<80 |      2,193       47.62       71.62
        80+ |      1,307       28.38      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        298        6.47        6.47
          1 |      4,307       93.53      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,355       51.14       51.14
          1 |      2,250       48.86      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        456       12.50       12.50
  Normal (18.5-24.9) |      1,012       27.74       40.24
Overweight (25-29.9) |        814       22.31       62.55
   Obese I (30-34.9) |        651       17.85       80.40
  Obese II (35-39.9) |        420       11.51       91.91
     Obese III (40+) |        295        8.09      100.00
---------------------+-----------------------------------
               Total |      3,648      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        456        9.90        9.90
  Normal (18.5-24.9) |      1,012       21.98       31.88
Overweight (25-29.9) |        814       17.68       49.55
   Obese I (30-34.9) |        651       14.14       63.69
  Obese II (35-39.9) |        420        9.12       72.81
     Obese III (40+) |        295        6.41       79.22
        Unknown (.u) |        957       20.78      100.00
---------------------+-----------------------------------
               Total |      4,605      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |      3,239       70.34       70.34
   Obese I (30-34.9) |        651       14.14       84.47
  Obese II (35-39.9) |        420        9.12       93.59
     Obese III (40+) |        295        6.41      100.00
---------------------+-----------------------------------
               Total |      4,605      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        174       21.75       21.75
      Former |        101       12.62       34.38
     Current |        525       65.62      100.00
-------------+-----------------------------------
       Total |        800      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        174        3.78        3.78
      Former |        101        2.19        5.97
     Current |        525       11.40       17.37
Unknown (.u) |      3,805       82.63      100.00
-------------+-----------------------------------
       Total |      4,605      100.00
0

**TABLE OF bpcat REDACTED DUE TO SMALL N**

6

**TABLE OF bpcat REDACTED DUE TO SMALL N**

0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        361        7.84        7.84
          1 |      4,244       92.16      100.00
------------+-----------------------------------
      Total |      4,605      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        708       15.37       15.37
          1 |      3,897       84.63      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,672       79.74       79.74
          1 |        933       20.26      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,231       91.88       91.88
          1 |        374        8.12      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,692       80.17       80.17
          1 |        913       19.83      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

**TABLE OF diabcat REDACTED DUE TO SMALL N**

0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,651       79.28       79.28
    Last year |         18        0.39       79.67
2-5 years ago |         82        1.78       81.45
     5+ years |        854       18.55      100.00
--------------+-----------------------------------
        Total |      4,605      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,671       79.72       79.72
    Last year |         29        0.63       80.35
2-5 years ago |         73        1.59       81.93
     5+ years |        832       18.07      100.00
--------------+-----------------------------------
        Total |      4,605      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,676       79.83       79.83
          1 |        929       20.17      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,678       79.87       79.87
          1 |        927       20.13      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,697       80.28       80.28
          1 |        908       19.72      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,710       80.56       80.56
          1 |        895       19.44      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,674       79.78       79.78
          1 |        931       20.22      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,695       80.24       80.24
          1 |        910       19.76      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         30 |          6        0.14        0.14
         45 |        194        4.44        4.58
         60 |      4,167       95.42      100.00
------------+-----------------------------------
      Total |      4,367      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |      4,405       95.66       95.66
Stage 3a/3b egfr 30-60       |        200        4.34      100.00
-----------------------------+-----------------------------------
                       Total |      4,605      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,980       64.71       64.71
          1 |      1,625       35.29      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,660       79.48       79.48
          1 |        945       20.52      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,673       79.76       79.76
          1 |        932       20.24      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,237       70.29       70.29
               4 |        916       19.89       90.18
 5 most deprived |        452        9.82      100.00
-----------------+-----------------------------------
           Total |      4,605      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,237       70.29       70.29
               4 |        916       19.89       90.18
 5 most deprived |        452        9.82      100.00
-----------------+-----------------------------------
           Total |      4,605      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,621       78.63       78.63
Asian or Asian British |        493       10.71       89.34
                 Other |        491       10.66      100.00
-----------------------+-----------------------------------
                 Total |      4,605      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,621       78.63       78.63
Asian or Asian British |        493       10.71       89.34
                 Other |        491       10.66      100.00
-----------------------+-----------------------------------
                 Total |      4,605      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        456        9.90        9.90
          2 |        450        9.77       19.67
          3 |        493       10.71       30.38
          4 |        435        9.45       39.83
          5 |        451        9.79       49.62
          6 |        450        9.77       59.39
          7 |        433        9.40       68.79
          8 |        480       10.42       79.22
          9 |        470       10.21       89.42
         10 |        487       10.58      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,220       69.92       69.92
          1 |      1,385       30.08      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,417       52.49       52.49
          1 |      2,188       47.51      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        334        7.25        7.25
          1 |      4,271       92.75      100.00
------------+-----------------------------------
      Total |      4,605      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,017       22.08       22.08
          1 |      3,588       77.92      100.00
------------+-----------------------------------
      Total |      4,605      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |      3,588   03apr2021     59.9656  21dec2020  16jul2021
date_posit~S |        716   25jun2021    20.73574  03feb2021  16jul2021
date_covid~b |      4,271   03apr2021    60.38154  21dec2020  16jul2021
date_covid~n |      2,102   02mar2021    49.76399  20dec2020  16jun2021
date_covid~s |      4,239   02apr2021     60.1718  21dec2020  16jul2021
-------------+---------------------------------------------------------
date_covid~h |      2,188   03apr2021      59.341  21dec2020  16jul2021
date_non_c~h |      1,385   04apr2021    60.37571  21dec2020  16jul2021
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |        75      1,030 |     1,105 
           |     22.46      24.12 |     24.00 
-----------+----------------------+----------
    70-<80 |       148      2,045 |     2,193 
           |     44.31      47.88 |     47.62 
-----------+----------------------+----------
       80+ |       111      1,196 |     1,307 
           |     33.23      28.00 |     28.38 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |       180      2,175 |     2,355 
           |     53.89      50.92 |     51.14 
-----------+----------------------+----------
         1 |       154      2,096 |     2,250 
           |     46.11      49.08 |     48.86 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |        43        413 |       456 
                     |     12.87       9.67 |      9.90 
---------------------+----------------------+----------
  Normal (18.5-24.9) |        54        958 |     1,012 
                     |     16.17      22.43 |     21.98 
---------------------+----------------------+----------
Overweight (25-29.9) |        62        752 |       814 
                     |     18.56      17.61 |     17.68 
---------------------+----------------------+----------
   Obese I (30-34.9) |        50        601 |       651 
                     |     14.97      14.07 |     14.14 
---------------------+----------------------+----------
  Obese II (35-39.9) |        33        387 |       420 
                     |      9.88       9.06 |      9.12 
---------------------+----------------------+----------
     Obese III (40+) |        22        273 |       295 
                     |      6.59       6.39 |      6.41 
---------------------+----------------------+----------
        Unknown (.u) |        70        887 |       957 
                     |     20.96      20.77 |     20.78 
---------------------+----------------------+----------
               Total |       334      4,271 |     4,605 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |        14        160 |       174 
             |      4.19       3.75 |      3.78 
-------------+----------------------+----------
      Former |         7         94 |       101 
             |      2.10       2.20 |      2.19 
-------------+----------------------+----------
     Current |        33        492 |       525 
             |      9.88      11.52 |     11.40 
-------------+----------------------+----------
Unknown (.u) |       280      3,525 |     3,805 
             |     83.83      82.53 |     82.63 
-------------+----------------------+----------
       Total |       334      4,271 |     4,605 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |       229      3,010 |     3,239 
                     |     68.56      70.48 |     70.34 
---------------------+----------------------+----------
   Obese I (30-34.9) |        50        601 |       651 
                     |     14.97      14.07 |     14.14 
---------------------+----------------------+----------
  Obese II (35-39.9) |        33        387 |       420 
                     |      9.88       9.06 |      9.12 
---------------------+----------------------+----------
     Obese III (40+) |        22        273 |       295 
                     |      6.59       6.39 |      6.41 
---------------------+----------------------+----------
               Total |       334      4,271 |     4,605 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |        53        655 |       708 
           |     15.87      15.34 |     15.37 
-----------+----------------------+----------
         1 |       281      3,616 |     3,897 
           |     84.13      84.66 |     84.63 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |       247      3,425 |     3,672 
           |     73.95      80.19 |     79.74 
-----------+----------------------+----------
         1 |        87        846 |       933 
           |     26.05      19.81 |     20.26 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |       308      3,923 |     4,231 
           |     92.22      91.85 |     91.88 
-----------+----------------------+----------
         1 |        26        348 |       374 
           |      7.78       8.15 |      8.12 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |       283      3,409 |     3,692 
           |     84.73      79.82 |     80.17 
-----------+----------------------+----------
         1 |        51        862 |       913 
           |     15.27      20.18 |     19.83 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
23

**TABLE OF diabcat covid_tpp_prob REDACTED DUE TO SMALL N**

33

**TABLE OF cancer_exhaem_cat covid_tpp_prob REDACTED DUE TO SMALL N**

31

**TABLE OF cancer_haem_cat covid_tpp_prob REDACTED DUE TO SMALL N**

28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |       271      3,405 |     3,676 
           |     81.14      79.72 |     79.83 
-----------+----------------------+----------
         1 |        63        866 |       929 
           |     18.86      20.28 |     20.17 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |       263      3,415 |     3,678 
           |     78.74      79.96 |     79.87 
-----------+----------------------+----------
         1 |        71        856 |       927 
           |     21.26      20.04 |     20.13 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |       274      3,423 |     3,697 
           |     82.04      80.15 |     80.28 
-----------+----------------------+----------
         1 |        60        848 |       908 
           |     17.96      19.85 |     19.72 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       262      3,448 |     3,710 
           |     78.44      80.73 |     80.56 
-----------+----------------------+----------
         1 |        72        823 |       895 
           |     21.56      19.27 |     19.44 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       273      3,401 |     3,674 
           |     81.74      79.63 |     79.78 
-----------+----------------------+----------
         1 |        61        870 |       931 
           |     18.26      20.37 |     20.22 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       268      3,427 |     3,695 
           |     80.24      80.24 |     80.24 
-----------+----------------------+----------
         1 |        66        844 |       910 
           |     19.76      19.76 |     19.76 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
24

**TABLE OF egfr_cat covid_tpp_prob REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       229      2,751 |     2,980 
           |     68.56      64.41 |     64.71 
-----------+----------------------+----------
         1 |       105      1,520 |     1,625 
           |     31.44      35.59 |     35.29 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |       316      4,089 |     4,405 
                      |     94.61      95.74 |     95.66 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        18        182 |       200 
                      |      5.39       4.26 |      4.34 
----------------------+----------------------+----------
                Total |       334      4,271 |     4,605 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |       273      3,387 |     3,660 
           |     81.74      79.30 |     79.48 
-----------+----------------------+----------
         1 |        61        884 |       945 
           |     18.26      20.70 |     20.52 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       278      3,395 |     3,673 
           |     83.23      79.49 |     79.76 
-----------+----------------------+----------
         1 |        56        876 |       932 
           |     16.77      20.51 |     20.24 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |       241      2,996 |     3,237 
                 |     72.16      70.15 |     70.29 
-----------------+----------------------+----------
               4 |        65        851 |       916 
                 |     19.46      19.93 |     19.89 
-----------------+----------------------+----------
 5 most deprived |        28        424 |       452 
                 |      8.38       9.93 |      9.82 
-----------------+----------------------+----------
           Total |       334      4,271 |     4,605 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |       260      3,361 |     3,621 
                      |     77.84      78.69 |     78.63 
----------------------+----------------------+----------
Asian or Asian Britis |        35        458 |       493 
                      |     10.48      10.72 |     10.71 
----------------------+----------------------+----------
                Other |        39        452 |       491 
                      |     11.68      10.58 |     10.66 
----------------------+----------------------+----------
                Total |       334      4,271 |     4,605 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |        31        425 |       456 
           |      9.28       9.95 |      9.90 
-----------+----------------------+----------
         2 |        45        405 |       450 
           |     13.47       9.48 |      9.77 
-----------+----------------------+----------
         3 |        34        459 |       493 
           |     10.18      10.75 |     10.71 
-----------+----------------------+----------
         4 |        31        404 |       435 
           |      9.28       9.46 |      9.45 
-----------+----------------------+----------
         5 |        35        416 |       451 
           |     10.48       9.74 |      9.79 
-----------+----------------------+----------
         6 |        31        419 |       450 
           |      9.28       9.81 |      9.77 
-----------+----------------------+----------
         7 |        36        397 |       433 
           |     10.78       9.30 |      9.40 
-----------+----------------------+----------
         8 |        37        443 |       480 
           |     11.08      10.37 |     10.42 
-----------+----------------------+----------
         9 |        32        438 |       470 
           |      9.58      10.26 |     10.21 
-----------+----------------------+----------
        10 |        22        465 |       487 
           |      6.59      10.89 |     10.58 
-----------+----------------------+----------
     Total |       334      4,271 |     4,605 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped | outcome: covid death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |       567        538 |     1,105 
           |     23.46      24.59 |     24.00 
-----------+----------------------+----------
    70-<80 |     1,151      1,042 |     2,193 
           |     47.62      47.62 |     47.62 
-----------+----------------------+----------
       80+ |       699        608 |     1,307 
           |     28.92      27.79 |     28.38 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,237      1,118 |     2,355 
           |     51.18      51.10 |     51.14 
-----------+----------------------+----------
         1 |     1,180      1,070 |     2,250 
           |     48.82      48.90 |     48.86 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     | outcome: covid death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       248        208 |       456 
                     |     10.26       9.51 |      9.90 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       526        486 |     1,012 
                     |     21.76      22.21 |     21.98 
---------------------+----------------------+----------
Overweight (25-29.9) |       430        384 |       814 
                     |     17.79      17.55 |     17.68 
---------------------+----------------------+----------
   Obese I (30-34.9) |       338        313 |       651 
                     |     13.98      14.31 |     14.14 
---------------------+----------------------+----------
  Obese II (35-39.9) |       230        190 |       420 
                     |      9.52       8.68 |      9.12 
---------------------+----------------------+----------
     Obese III (40+) |       147        148 |       295 
                     |      6.08       6.76 |      6.41 
---------------------+----------------------+----------
        Unknown (.u) |       498        459 |       957 
                     |     20.60      20.98 |     20.78 
---------------------+----------------------+----------
               Total |     2,417      2,188 |     4,605 
                     |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking | outcome: covid death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |        83         91 |       174 
             |      3.43       4.16 |      3.78 
-------------+----------------------+----------
      Former |        57         44 |       101 
             |      2.36       2.01 |      2.19 
-------------+----------------------+----------
     Current |       250        275 |       525 
             |     10.34      12.57 |     11.40 
-------------+----------------------+----------
Unknown (.u) |     2,027      1,778 |     3,805 
             |     83.86      81.26 |     82.63 
-------------+----------------------+----------
       Total |     2,417      2,188 |     4,605 
             |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity | outcome: covid death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     1,702      1,537 |     3,239 
                     |     70.42      70.25 |     70.34 
---------------------+----------------------+----------
   Obese I (30-34.9) |       338        313 |       651 
                     |     13.98      14.31 |     14.14 
---------------------+----------------------+----------
  Obese II (35-39.9) |       230        190 |       420 
                     |      9.52       8.68 |      9.12 
---------------------+----------------------+----------
     Obese III (40+) |       147        148 |       295 
                     |      6.08       6.76 |      6.41 
---------------------+----------------------+----------
               Total |     2,417      2,188 |     4,605 
                     |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       386        322 |       708 
           |     15.97      14.72 |     15.37 
-----------+----------------------+----------
         1 |     2,031      1,866 |     3,897 
           |     84.03      85.28 |     84.63 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator | outcome: covid death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,928      1,744 |     3,672 
           |     79.77      79.71 |     79.74 
-----------+----------------------+----------
         1 |       489        444 |       933 
           |     20.23      20.29 |     20.26 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma | outcome: covid death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,218      2,013 |     4,231 
           |     91.77      92.00 |     91.88 
-----------+----------------------+----------
         1 |       199        175 |       374 
           |      8.23       8.00 |      8.12 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac | outcome: covid death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,934      1,758 |     3,692 
           |     80.02      80.35 |     80.17 
-----------+----------------------+----------
         1 |       483        430 |       913 
           |     19.98      19.65 |     19.83 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
20

**TABLE OF diabcat covid_death REDACTED DUE TO SMALL N**

30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo | outcome: covid death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     1,916      1,735 |     3,651 
              |     79.27      79.30 |     79.28 
--------------+----------------------+----------
    Last year |         7         11 |        18 
              |      0.29       0.50 |      0.39 
--------------+----------------------+----------
2-5 years ago |        46         36 |        82 
              |      1.90       1.65 |      1.78 
--------------+----------------------+----------
     5+ years |       448        406 |       854 
              |     18.54      18.56 |     18.55 
--------------+----------------------+----------
        Total |     2,417      2,188 |     4,605 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica | outcome: covid death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     1,932      1,739 |     3,671 
              |     79.93      79.48 |     79.72 
--------------+----------------------+----------
    Last year |        13         16 |        29 
              |      0.54       0.73 |      0.63 
--------------+----------------------+----------
2-5 years ago |        40         33 |        73 
              |      1.65       1.51 |      1.59 
--------------+----------------------+----------
     5+ years |       432        400 |       832 
              |     17.87      18.28 |     18.07 
--------------+----------------------+----------
        Total |     2,417      2,188 |     4,605 
              |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on | outcome: covid death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,939      1,737 |     3,676 
           |     80.22      79.39 |     79.83 
-----------+----------------------+----------
         1 |       478        451 |       929 
           |     19.78      20.61 |     20.17 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |   Failure/censoring
     solid |     indicator for
     organ | outcome: covid death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,891      1,787 |     3,678 
           |     78.24      81.67 |     79.87 
-----------+----------------------+----------
         1 |       526        401 |       927 
           |     21.76      18.33 |     20.13 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,954      1,743 |     3,697 
           |     80.84      79.66 |     80.28 
-----------+----------------------+----------
         1 |       463        445 |       908 
           |     19.16      20.34 |     19.72 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,977      1,733 |     3,710 
           |     81.80      79.20 |     80.56 
-----------+----------------------+----------
         1 |       440        455 |       895 
           |     18.20      20.80 |     19.44 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic | outcome: covid death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,939      1,735 |     3,674 
           |     80.22      79.30 |     79.78 
-----------+----------------------+----------
         1 |       478        453 |       931 
           |     19.78      20.70 |     20.22 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or | outcome: covid death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,940      1,755 |     3,695 
           |     80.26      80.21 |     80.24 
-----------+----------------------+----------
         1 |       477        433 |       910 
           |     19.74      19.79 |     19.76 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
21

**TABLE OF egfr_cat covid_death REDACTED DUE TO SMALL N**

17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 End-stage |     indicator for
     renal | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,589      1,391 |     2,980 
           |     65.74      63.57 |     64.71 
-----------+----------------------+----------
         1 |       828        797 |     1,625 
           |     34.26      36.43 |     35.29 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney | outcome: covid death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     2,311      2,094 |     4,405 
                      |     95.61      95.70 |     95.66 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       106         94 |       200 
                      |      4.39       4.30 |      4.34 
----------------------+----------------------+----------
                Total |     2,417      2,188 |     4,605 
                      |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi | outcome: covid death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,924      1,736 |     3,660 
           |     79.60      79.34 |     79.48 
-----------+----------------------+----------
         1 |       493        452 |       945 
           |     20.40      20.66 |     20.52 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,928      1,745 |     3,673 
           |     79.77      79.75 |     79.76 
-----------+----------------------+----------
         1 |       489        443 |       932 
           |     20.23      20.25 |     20.24 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation | outcome: covid death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     1,672      1,565 |     3,237 
                 |     69.18      71.53 |     70.29 
-----------------+----------------------+----------
               4 |       504        412 |       916 
                 |     20.85      18.83 |     19.89 
-----------------+----------------------+----------
 5 most deprived |       241        211 |       452 
                 |      9.97       9.64 |      9.82 
-----------------+----------------------+----------
           Total |     2,417      2,188 |     4,605 
                 |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      | outcome: covid death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     1,902      1,719 |     3,621 
                      |     78.69      78.56 |     78.63 
----------------------+----------------------+----------
Asian or Asian Britis |       255        238 |       493 
                      |     10.55      10.88 |     10.71 
----------------------+----------------------+----------
                Other |       260        231 |       491 
                      |     10.76      10.56 |     10.66 
----------------------+----------------------+----------
                Total |     2,417      2,188 |     4,605 
                      |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       229        227 |       456 
           |      9.47      10.37 |      9.90 
-----------+----------------------+----------
         2 |       239        211 |       450 
           |      9.89       9.64 |      9.77 
-----------+----------------------+----------
         3 |       259        234 |       493 
           |     10.72      10.69 |     10.71 
-----------+----------------------+----------
         4 |       231        204 |       435 
           |      9.56       9.32 |      9.45 
-----------+----------------------+----------
         5 |       231        220 |       451 
           |      9.56      10.05 |      9.79 
-----------+----------------------+----------
         6 |       229        221 |       450 
           |      9.47      10.10 |      9.77 
-----------+----------------------+----------
         7 |       219        214 |       433 
           |      9.06       9.78 |      9.40 
-----------+----------------------+----------
         8 |       246        234 |       480 
           |     10.18      10.69 |     10.42 
-----------+----------------------+----------
         9 |       253        217 |       470 
           |     10.47       9.92 |     10.21 
-----------+----------------------+----------
        10 |       281        206 |       487 
           |     11.63       9.41 |     10.58 
-----------+----------------------+----------
     Total |     2,417      2,188 |     4,605 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |       786        319 |     1,105 
           |     24.41      23.03 |     24.00 
-----------+----------------------+----------
    70-<80 |     1,528        665 |     2,193 
           |     47.45      48.01 |     47.62 
-----------+----------------------+----------
       80+ |       906        401 |     1,307 
           |     28.14      28.95 |     28.38 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,634        721 |     2,355 
           |     50.75      52.06 |     51.14 
-----------+----------------------+----------
         1 |     1,586        664 |     2,250 
           |     49.25      47.94 |     48.86 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       317        139 |       456 
                     |      9.84      10.04 |      9.90 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       716        296 |     1,012 
                     |     22.24      21.37 |     21.98 
---------------------+----------------------+----------
Overweight (25-29.9) |       562        252 |       814 
                     |     17.45      18.19 |     17.68 
---------------------+----------------------+----------
   Obese I (30-34.9) |       454        197 |       651 
                     |     14.10      14.22 |     14.14 
---------------------+----------------------+----------
  Obese II (35-39.9) |       297        123 |       420 
                     |      9.22       8.88 |      9.12 
---------------------+----------------------+----------
     Obese III (40+) |       218         77 |       295 
                     |      6.77       5.56 |      6.41 
---------------------+----------------------+----------
        Unknown (.u) |       656        301 |       957 
                     |     20.37      21.73 |     20.78 
---------------------+----------------------+----------
               Total |     3,220      1,385 |     4,605 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       124         50 |       174 
             |      3.85       3.61 |      3.78 
-------------+----------------------+----------
      Former |        63         38 |       101 
             |      1.96       2.74 |      2.19 
-------------+----------------------+----------
     Current |       380        145 |       525 
             |     11.80      10.47 |     11.40 
-------------+----------------------+----------
Unknown (.u) |     2,653      1,152 |     3,805 
             |     82.39      83.18 |     82.63 
-------------+----------------------+----------
       Total |     3,220      1,385 |     4,605 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     2,251        988 |     3,239 
                     |     69.91      71.34 |     70.34 
---------------------+----------------------+----------
   Obese I (30-34.9) |       454        197 |       651 
                     |     14.10      14.22 |     14.14 
---------------------+----------------------+----------
  Obese II (35-39.9) |       297        123 |       420 
                     |      9.22       8.88 |      9.12 
---------------------+----------------------+----------
     Obese III (40+) |       218         77 |       295 
                     |      6.77       5.56 |      6.41 
---------------------+----------------------+----------
               Total |     3,220      1,385 |     4,605 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       495        213 |       708 
           |     15.37      15.38 |     15.37 
-----------+----------------------+----------
         1 |     2,725      1,172 |     3,897 
           |     84.63      84.62 |     84.63 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,565      1,107 |     3,672 
           |     79.66      79.93 |     79.74 
-----------+----------------------+----------
         1 |       655        278 |       933 
           |     20.34      20.07 |     20.26 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,949      1,282 |     4,231 
           |     91.58      92.56 |     91.88 
-----------+----------------------+----------
         1 |       271        103 |       374 
           |      8.42       7.44 |      8.12 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,574      1,118 |     3,692 
           |     79.94      80.72 |     80.17 
-----------+----------------------+----------
         1 |       646        267 |       913 
           |     20.06      19.28 |     19.83 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
24

**TABLE OF diabcat non_covid_death REDACTED DUE TO SMALL N**

34

**TABLE OF cancer_exhaem_cat non_covid_death REDACTED DUE TO SMALL N**

32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,576      1,095 |     3,671 
              |     80.00      79.06 |     79.72 
--------------+----------------------+----------
    Last year |        20          9 |        29 
              |      0.62       0.65 |      0.63 
--------------+----------------------+----------
2-5 years ago |        48         25 |        73 
              |      1.49       1.81 |      1.59 
--------------+----------------------+----------
     5+ years |       576        256 |       832 
              |     17.89      18.48 |     18.07 
--------------+----------------------+----------
        Total |     3,220      1,385 |     4,605 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,552      1,124 |     3,676 
           |     79.25      81.16 |     79.83 
-----------+----------------------+----------
         1 |       668        261 |       929 
           |     20.75      18.84 |     20.17 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,596      1,082 |     3,678 
           |     80.62      78.12 |     79.87 
-----------+----------------------+----------
         1 |       624        303 |       927 
           |     19.38      21.88 |     20.13 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,579      1,118 |     3,697 
           |     80.09      80.72 |     80.28 
-----------+----------------------+----------
         1 |       641        267 |       908 
           |     19.91      19.28 |     19.72 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,574      1,136 |     3,710 
           |     79.94      82.02 |     80.56 
-----------+----------------------+----------
         1 |       646        249 |       895 
           |     20.06      17.98 |     19.44 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,564      1,110 |     3,674 
           |     79.63      80.14 |     79.78 
-----------+----------------------+----------
         1 |       656        275 |       931 
           |     20.37      19.86 |     20.22 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,596      1,099 |     3,695 
           |     80.62      79.35 |     80.24 
-----------+----------------------+----------
         1 |       624        286 |       910 
           |     19.38      20.65 |     19.76 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
25

**TABLE OF egfr_cat non_covid_death REDACTED DUE TO SMALL N**

21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,080        900 |     2,980 
           |     64.60      64.98 |     64.71 
-----------+----------------------+----------
         1 |     1,140        485 |     1,625 
           |     35.40      35.02 |     35.29 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     3,079      1,326 |     4,405 
                      |     95.62      95.74 |     95.66 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       141         59 |       200 
                      |      4.38       4.26 |      4.34 
----------------------+----------------------+----------
                Total |     3,220      1,385 |     4,605 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,571      1,089 |     3,660 
           |     79.84      78.63 |     79.48 
-----------+----------------------+----------
         1 |       649        296 |       945 
           |     20.16      21.37 |     20.52 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,576      1,097 |     3,673 
           |     80.00      79.21 |     79.76 
-----------+----------------------+----------
         1 |       644        288 |       932 
           |     20.00      20.79 |     20.24 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     2,242        995 |     3,237 
                 |     69.63      71.84 |     70.29 
-----------------+----------------------+----------
               4 |       659        257 |       916 
                 |     20.47      18.56 |     19.89 
-----------------+----------------------+----------
 5 most deprived |       319        133 |       452 
                 |      9.91       9.60 |      9.82 
-----------------+----------------------+----------
           Total |     3,220      1,385 |     4,605 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     2,537      1,084 |     3,621 
                      |     78.79      78.27 |     78.63 
----------------------+----------------------+----------
Asian or Asian Britis |       341        152 |       493 
                      |     10.59      10.97 |     10.71 
----------------------+----------------------+----------
                Other |       342        149 |       491 
                      |     10.62      10.76 |     10.66 
----------------------+----------------------+----------
                Total |     3,220      1,385 |     4,605 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       308        148 |       456 
           |      9.57      10.69 |      9.90 
-----------+----------------------+----------
         2 |       319        131 |       450 
           |      9.91       9.46 |      9.77 
-----------+----------------------+----------
         3 |       356        137 |       493 
           |     11.06       9.89 |     10.71 
-----------+----------------------+----------
         4 |       289        146 |       435 
           |      8.98      10.54 |      9.45 
-----------+----------------------+----------
         5 |       329        122 |       451 
           |     10.22       8.81 |      9.79 
-----------+----------------------+----------
         6 |       311        139 |       450 
           |      9.66      10.04 |      9.77 
-----------+----------------------+----------
         7 |       309        124 |       433 
           |      9.60       8.95 |      9.40 
-----------+----------------------+----------
         8 |       328        152 |       480 
           |     10.19      10.97 |     10.42 
-----------+----------------------+----------
         9 |       335        135 |       470 
           |     10.40       9.75 |     10.21 
-----------+----------------------+----------
        10 |       336        151 |       487 
           |     10.43      10.90 |     10.58 
-----------+----------------------+----------
     Total |     3,220      1,385 |     4,605 
           |    100.00     100.00 |    100.00 

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  /workspace/logs/04a_an_descriptive_tables.log
  log type:  text
 closed on:  24 Jul 2021, 18:07:51
-------------------------------------------------------------------------------
