-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04a_an_descriptive_tables.log
  log type:  text
 opened on:  28 Oct 2021, 11:16:24

. 
. forvalues x=0/1 {
  2. 
. use $tempdir/analysis_dataset_ageband_`x'`dataset', clear
  3. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age
  4. safetab agegroup
  5. safetab age66
  6. safetab male
  7. safetab bmicat
  8. safetab bmicat, m
  9. safetab obese4cat
 10. safetab smoke
 11. safetab smoke, m
 12. safetab bpcat
 13. safetab bpcat, m
 14. safetab htdiag_or_highbp
 15. ta shield
 16. 
. * Comorbidities
. foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 reduced_kidney_function ///
>                                                 esrd            ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 17.                                                 
. safetab `var'
 18. }
 19. 
. safetab imd 
 20. safetab imd, m
 21. safetab ethnicity
 22. safetab ethnicity, m
 23. safetab stp
 24. 
. 
. * Outcomes
. safetab non_covid_death
 25. safetab covid_death
 26. safetab covid_tpp_prob
 27. safetab covid_icu
 28. 
. * Outcome dates
. sum date*, format
 29. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist covid_tpp_prob covid_death non_covid_death {
 30. 
. *** Repeat for each outcome
. 
.         * Demographics
.         safetab agegroup                                                     
>    `outvar', col
 31.         safetab male                                                      
>       `outvar', col
 32.         safetab bmicat                                                    
>       `outvar', col m 
 33.         safetab smoke                                                     
>       `outvar', col m
 34.         safetab obese4cat                                                 
>       `outvar', col m 
 35.         safetab shield                                                    
>       `outvar', col m 
 36. 
.         * Comorbidities
.         foreach var in chronic_respiratory_disease ///
>                                                 asthma  ///
>                                                 chronic_cardiac_disease  ///
>                                                 diabcat  ///
>                                                 cancer_exhaem_cat            
>                                    ///
>                                                 cancer_haem_cat              
>                                    ///
>                                                 other_immuno    ///
>                                                 other_transplant             
>            /// 
>                                                 asplenia                     
>    /// 
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke_dementia              
>            ///
>                                                 egfr_cat  ///
>                                                 esrd ///
>                                                 reduced_kidney_function ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
 37.         safetab `var'           `outvar', col
 38. }
 39.         
.         safetab imd                                                          
>    `outvar', col m
 40.         safetab ethnicity                                                 
>       `outvar', col m
 41.         *safetab urban                                                    
>       `outvar', col
.         safetab stp                                                          
>    `outvar', col
 42. }
 43. 
. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     16,082    41.27198    13.62689         18         65
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |      4,017       24.98       24.98
     30-<40 |      3,506       21.80       46.78
     40-<50 |      3,312       20.59       67.37
     50-<60 |      3,449       21.45       88.82
     60-<70 |      1,798       11.18      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,082      100.00      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,218       51.10       51.10
          1 |      7,864       48.90      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,500       12.19       12.19
  Normal (18.5-24.9) |      3,572       29.02       41.21
Overweight (25-29.9) |      2,783       22.61       63.82
   Obese I (30-34.9) |      2,181       17.72       81.54
  Obese II (35-39.9) |      1,379       11.20       92.74
     Obese III (40+) |        893        7.26      100.00
---------------------+-----------------------------------
               Total |     12,308      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,500        9.33        9.33
  Normal (18.5-24.9) |      3,572       22.21       31.54
Overweight (25-29.9) |      2,783       17.31       48.84
   Obese I (30-34.9) |      2,181       13.56       62.41
  Obese II (35-39.9) |      1,379        8.57       70.98
     Obese III (40+) |        893        5.55       76.53
        Unknown (.u) |      3,774       23.47      100.00
---------------------+-----------------------------------
               Total |     16,082      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     11,629       72.31       72.31
   Obese I (30-34.9) |      2,181       13.56       85.87
  Obese II (35-39.9) |      1,379        8.57       94.45
     Obese III (40+) |        893        5.55      100.00
---------------------+-----------------------------------
               Total |     16,082      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        646       22.03       22.03
      Former |        339       11.56       33.59
     Current |      1,947       66.41      100.00
-------------+-----------------------------------
       Total |      2,932      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        646        4.02        4.02
      Former |        339        2.11        6.12
     Current |      1,947       12.11       18.23
Unknown (.u) |     13,150       81.77      100.00
-------------+-----------------------------------
       Total |     16,082      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      3,628       25.06       25.06
      Elevated |      2,441       16.86       41.92
 High, stage I |      5,859       40.47       82.40
High, stage II |      2,548       17.60      100.00
---------------+-----------------------------------
         Total |     14,476      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |      3,628       22.56       22.56
      Elevated |      2,441       15.18       37.74
 High, stage I |      5,859       36.43       74.17
High, stage II |      2,548       15.84       90.01
       Unknown |      1,606        9.99      100.00
---------------+-----------------------------------
         Total |     16,082      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,774       66.99       66.99
          1 |      5,308       33.01      100.00
------------+-----------------------------------
      Total |     16,082      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,471       15.37       15.37
          1 |     13,611       84.63      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,861       79.97       79.97
          1 |      3,221       20.03      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,844       92.30       92.30
          1 |      1,238        7.70      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,888       80.14       80.14
          1 |      3,194       19.86      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

          Diabetes |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     12,307       76.53       76.53
  T1DM, controlled |        414        2.57       79.10
T1DM, uncontrolled |         82        0.51       79.61
  T2DM, controlled |      2,651       16.48       96.10
T2DM, uncontrolled |        608        3.78       99.88
Diabetes, no HbA1c |         20        0.12      100.00
-------------------+-----------------------------------
             Total |     16,082      100.00
0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     12,946       80.50       80.50
    Last year |         42        0.26       80.76
2-5 years ago |        264        1.64       82.40
     5+ years |      2,830       17.60      100.00
--------------+-----------------------------------
        Total |     16,082      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     12,898       80.20       80.20
    Last year |         57        0.35       80.56
2-5 years ago |        254        1.58       82.14
     5+ years |      2,873       17.86      100.00
--------------+-----------------------------------
        Total |     16,082      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,911       80.28       80.28
          1 |      3,171       19.72      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,805       79.62       79.62
          1 |      3,277       20.38      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,810       79.65       79.65
          1 |      3,272       20.35      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,883       80.11       80.11
          1 |      3,199       19.89      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,850       79.90       79.90
          1 |      3,232       20.10      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,910       80.28       80.28
          1 |      3,172       19.72      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         45 |         62        0.41        0.41
         60 |     15,130       99.59      100.00
------------+-----------------------------------
      Total |     15,192      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |     16,020       99.61       99.61
Stage 3a/3b egfr 30-60       |         62        0.39      100.00
-----------------------------+-----------------------------------
                       Total |     16,082      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,320       64.17       64.17
          1 |      5,762       35.83      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,824       79.74       79.74
          1 |      3,258       20.26      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,816       79.69       79.69
          1 |      3,266       20.31      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,298       70.25       70.25
               4 |      3,159       19.64       89.90
 5 most deprived |      1,625       10.10      100.00
-----------------+-----------------------------------
           Total |     16,082      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     11,298       70.25       70.25
               4 |      3,159       19.64       89.90
 5 most deprived |      1,625       10.10      100.00
-----------------+-----------------------------------
           Total |     16,082      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,953       80.54       80.54
Asian or Asian British |      1,549        9.63       90.18
                 Other |      1,580        9.82      100.00
-----------------------+-----------------------------------
                 Total |     16,082      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     12,953       80.54       80.54
Asian or Asian British |      1,549        9.63       90.18
                 Other |      1,580        9.82      100.00
-----------------------+-----------------------------------
                 Total |     16,082      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,625       10.10       10.10
          2 |      1,656       10.30       20.40
          3 |      1,641       10.20       30.61
          4 |      1,558        9.69       40.29
          5 |      1,606        9.99       50.28
          6 |      1,597        9.93       60.21
          7 |      1,597        9.93       70.14
          8 |      1,594        9.91       80.05
          9 |      1,565        9.73       89.78
         10 |      1,643       10.22      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,002       68.41       68.41
          1 |      5,080       31.59      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,555       53.20       53.20
          1 |      7,527       46.80      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        906        5.63        5.63
          1 |     15,176       94.37      100.00
------------+-----------------------------------
      Total |     16,082      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,436       21.37       21.37
          1 |     12,646       78.63      100.00
------------+-----------------------------------
      Total |     16,082      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |     12,646   22may2021    87.68099  21dec2020  22oct2021
date_posit~S |      2,704   21sep2021    31.16495  04feb2021  22oct2021
date_covid~b |     15,176   24may2021    89.04996  21dec2020  22oct2021
date_covid~n |      2,180   17apr2021    81.94707  20dec2020  21oct2021
date_covid~s |     15,034   23may2021    88.67957  21dec2020  22oct2021
-------------+---------------------------------------------------------
date_covid~h |      7,527   23may2021     88.2953  21dec2020  22oct2021
date_non_c~h |      5,080   22may2021     87.9931  21dec2020  22oct2021
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |       227      3,790 |     4,017 
           |     25.06      24.97 |     24.98 
-----------+----------------------+----------
    30-<40 |       211      3,295 |     3,506 
           |     23.29      21.71 |     21.80 
-----------+----------------------+----------
    40-<50 |       202      3,110 |     3,312 
           |     22.30      20.49 |     20.59 
-----------+----------------------+----------
    50-<60 |       170      3,279 |     3,449 
           |     18.76      21.61 |     21.45 
-----------+----------------------+----------
    60-<70 |        96      1,702 |     1,798 
           |     10.60      11.22 |     11.18 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |       428      7,790 |     8,218 
           |     47.24      51.33 |     51.10 
-----------+----------------------+----------
         1 |       478      7,386 |     7,864 
           |     52.76      48.67 |     48.90 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |        88      1,412 |     1,500 
                     |      9.71       9.30 |      9.33 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       194      3,378 |     3,572 
                     |     21.41      22.26 |     22.21 
---------------------+----------------------+----------
Overweight (25-29.9) |       142      2,641 |     2,783 
                     |     15.67      17.40 |     17.31 
---------------------+----------------------+----------
   Obese I (30-34.9) |       120      2,061 |     2,181 
                     |     13.25      13.58 |     13.56 
---------------------+----------------------+----------
  Obese II (35-39.9) |        78      1,301 |     1,379 
                     |      8.61       8.57 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |        58        835 |       893 
                     |      6.40       5.50 |      5.55 
---------------------+----------------------+----------
        Unknown (.u) |       226      3,548 |     3,774 
                     |     24.94      23.38 |     23.47 
---------------------+----------------------+----------
               Total |       906     15,176 |    16,082 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |        35        611 |       646 
             |      3.86       4.03 |      4.02 
-------------+----------------------+----------
      Former |        16        323 |       339 
             |      1.77       2.13 |      2.11 
-------------+----------------------+----------
     Current |       110      1,837 |     1,947 
             |     12.14      12.10 |     12.11 
-------------+----------------------+----------
Unknown (.u) |       745     12,405 |    13,150 
             |     82.23      81.74 |     81.77 
-------------+----------------------+----------
       Total |       906     15,176 |    16,082 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |       650     10,979 |    11,629 
                     |     71.74      72.34 |     72.31 
---------------------+----------------------+----------
   Obese I (30-34.9) |       120      2,061 |     2,181 
                     |     13.25      13.58 |     13.56 
---------------------+----------------------+----------
  Obese II (35-39.9) |        78      1,301 |     1,379 
                     |      8.61       8.57 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |        58        835 |       893 
                     |      6.40       5.50 |      5.55 
---------------------+----------------------+----------
               Total |       906     15,176 |    16,082 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       145      2,326 |     2,471 
           |     16.00      15.33 |     15.37 
-----------+----------------------+----------
         1 |       761     12,850 |    13,611 
           |     84.00      84.67 |     84.63 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |       737     12,124 |    12,861 
           |     81.35      79.89 |     79.97 
-----------+----------------------+----------
         1 |       169      3,052 |     3,221 
           |     18.65      20.11 |     20.03 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |       841     14,003 |    14,844 
           |     92.83      92.27 |     92.30 
-----------+----------------------+----------
         1 |        65      1,173 |     1,238 
           |      7.17       7.73 |      7.70 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |       723     12,165 |    12,888 
           |     79.80      80.16 |     80.14 
-----------+----------------------+----------
         1 |       183      3,011 |     3,194 
           |     20.20      19.84 |     19.86 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: covid prob
                   |         case
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |       709     11,598 |    12,307 
                   |     78.26      76.42 |     76.53 
-------------------+----------------------+----------
  T1DM, controlled |        23        391 |       414 
                   |      2.54       2.58 |      2.57 
-------------------+----------------------+----------
T1DM, uncontrolled |         7         75 |        82 
                   |      0.77       0.49 |      0.51 
-------------------+----------------------+----------
  T2DM, controlled |       135      2,516 |     2,651 
                   |     14.90      16.58 |     16.48 
-------------------+----------------------+----------
T2DM, uncontrolled |        32        576 |       608 
                   |      3.53       3.80 |      3.78 
-------------------+----------------------+----------
Diabetes, no HbA1c |         0         20 |        20 
                   |      0.00       0.13 |      0.12 
-------------------+----------------------+----------
             Total |       906     15,176 |    16,082 
                   |    100.00     100.00 |    100.00 
33

**TABLE OF cancer_exhaem_cat covid_tpp_prob REDACTED DUE TO SMALL N**

31

**TABLE OF cancer_haem_cat covid_tpp_prob REDACTED DUE TO SMALL N**

28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |       738     12,173 |    12,911 
           |     81.46      80.21 |     80.28 
-----------+----------------------+----------
         1 |       168      3,003 |     3,171 
           |     18.54      19.79 |     19.72 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |       736     12,069 |    12,805 
           |     81.24      79.53 |     79.62 
-----------+----------------------+----------
         1 |       170      3,107 |     3,277 
           |     18.76      20.47 |     20.38 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |       716     12,094 |    12,810 
           |     79.03      79.69 |     79.65 
-----------+----------------------+----------
         1 |       190      3,082 |     3,272 
           |     20.97      20.31 |     20.35 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       723     12,160 |    12,883 
           |     79.80      80.13 |     80.11 
-----------+----------------------+----------
         1 |       183      3,016 |     3,199 
           |     20.20      19.87 |     19.89 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       725     12,125 |    12,850 
           |     80.02      79.90 |     79.90 
-----------+----------------------+----------
         1 |       181      3,051 |     3,232 
           |     19.98      20.10 |     20.10 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       732     12,178 |    12,910 
           |     80.79      80.25 |     80.28 
-----------+----------------------+----------
         1 |       174      2,998 |     3,172 
           |     19.21      19.75 |     19.72 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
24

**TABLE OF egfr_cat covid_tpp_prob REDACTED DUE TO SMALL N**

20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       604      9,716 |    10,320 
           |     66.67      64.02 |     64.17 
-----------+----------------------+----------
         1 |       302      5,460 |     5,762 
           |     33.33      35.98 |     35.83 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
39

**TABLE OF reduced_kidney_function covid_tpp_prob REDACTED DUE TO SMALL N**

28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |       711     12,113 |    12,824 
           |     78.48      79.82 |     79.74 
-----------+----------------------+----------
         1 |       195      3,063 |     3,258 
           |     21.52      20.18 |     20.26 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       722     12,094 |    12,816 
           |     79.69      79.69 |     79.69 
-----------+----------------------+----------
         1 |       184      3,082 |     3,266 
           |     20.31      20.31 |     20.31 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |       640     10,658 |    11,298 
                 |     70.64      70.23 |     70.25 
-----------------+----------------------+----------
               4 |       182      2,977 |     3,159 
                 |     20.09      19.62 |     19.64 
-----------------+----------------------+----------
 5 most deprived |        84      1,541 |     1,625 
                 |      9.27      10.15 |     10.10 
-----------------+----------------------+----------
           Total |       906     15,176 |    16,082 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |       729     12,224 |    12,953 
                      |     80.46      80.55 |     80.54 
----------------------+----------------------+----------
Asian or Asian Britis |        85      1,464 |     1,549 
                      |      9.38       9.65 |      9.63 
----------------------+----------------------+----------
                Other |        92      1,488 |     1,580 
                      |     10.15       9.80 |      9.82 
----------------------+----------------------+----------
                Total |       906     15,176 |    16,082 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |        91      1,534 |     1,625 
           |     10.04      10.11 |     10.10 
-----------+----------------------+----------
         2 |        90      1,566 |     1,656 
           |      9.93      10.32 |     10.30 
-----------+----------------------+----------
         3 |        83      1,558 |     1,641 
           |      9.16      10.27 |     10.20 
-----------+----------------------+----------
         4 |        80      1,478 |     1,558 
           |      8.83       9.74 |      9.69 
-----------+----------------------+----------
         5 |        92      1,514 |     1,606 
           |     10.15       9.98 |      9.99 
-----------+----------------------+----------
         6 |       105      1,492 |     1,597 
           |     11.59       9.83 |      9.93 
-----------+----------------------+----------
         7 |       105      1,492 |     1,597 
           |     11.59       9.83 |      9.93 
-----------+----------------------+----------
         8 |        99      1,495 |     1,594 
           |     10.93       9.85 |      9.91 
-----------+----------------------+----------
         9 |        79      1,486 |     1,565 
           |      8.72       9.79 |      9.73 
-----------+----------------------+----------
        10 |        82      1,561 |     1,643 
           |      9.05      10.29 |     10.22 
-----------+----------------------+----------
     Total |       906     15,176 |    16,082 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped | outcome: covid death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     2,076      1,941 |     4,017 
           |     24.27      25.79 |     24.98 
-----------+----------------------+----------
    30-<40 |     1,865      1,641 |     3,506 
           |     21.80      21.80 |     21.80 
-----------+----------------------+----------
    40-<50 |     1,816      1,496 |     3,312 
           |     21.23      19.88 |     20.59 
-----------+----------------------+----------
    50-<60 |     1,854      1,595 |     3,449 
           |     21.67      21.19 |     21.45 
-----------+----------------------+----------
    60-<70 |       944        854 |     1,798 
           |     11.03      11.35 |     11.18 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,376      3,842 |     8,218 
           |     51.15      51.04 |     51.10 
-----------+----------------------+----------
         1 |     4,179      3,685 |     7,864 
           |     48.85      48.96 |     48.90 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     | outcome: covid death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       813        687 |     1,500 
                     |      9.50       9.13 |      9.33 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,865      1,707 |     3,572 
                     |     21.80      22.68 |     22.21 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,470      1,313 |     2,783 
                     |     17.18      17.44 |     17.31 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,177      1,004 |     2,181 
                     |     13.76      13.34 |     13.56 
---------------------+----------------------+----------
  Obese II (35-39.9) |       747        632 |     1,379 
                     |      8.73       8.40 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |       446        447 |       893 
                     |      5.21       5.94 |      5.55 
---------------------+----------------------+----------
        Unknown (.u) |     2,037      1,737 |     3,774 
                     |     23.81      23.08 |     23.47 
---------------------+----------------------+----------
               Total |     8,555      7,527 |    16,082 
                     |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking | outcome: covid death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       342        304 |       646 
             |      4.00       4.04 |      4.02 
-------------+----------------------+----------
      Former |       183        156 |       339 
             |      2.14       2.07 |      2.11 
-------------+----------------------+----------
     Current |     1,018        929 |     1,947 
             |     11.90      12.34 |     12.11 
-------------+----------------------+----------
Unknown (.u) |     7,012      6,138 |    13,150 
             |     81.96      81.55 |     81.77 
-------------+----------------------+----------
       Total |     8,555      7,527 |    16,082 
             |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity | outcome: covid death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     6,185      5,444 |    11,629 
                     |     72.30      72.33 |     72.31 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,177      1,004 |     2,181 
                     |     13.76      13.34 |     13.56 
---------------------+----------------------+----------
  Obese II (35-39.9) |       747        632 |     1,379 
                     |      8.73       8.40 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |       446        447 |       893 
                     |      5.21       5.94 |      5.55 
---------------------+----------------------+----------
               Total |     8,555      7,527 |    16,082 
                     |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,300      1,171 |     2,471 
           |     15.20      15.56 |     15.37 
-----------+----------------------+----------
         1 |     7,255      6,356 |    13,611 
           |     84.80      84.44 |     84.63 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator | outcome: covid death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,830      6,031 |    12,861 
           |     79.84      80.12 |     79.97 
-----------+----------------------+----------
         1 |     1,725      1,496 |     3,221 
           |     20.16      19.88 |     20.03 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma | outcome: covid death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,902      6,942 |    14,844 
           |     92.37      92.23 |     92.30 
-----------+----------------------+----------
         1 |       653        585 |     1,238 
           |      7.63       7.77 |      7.70 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac | outcome: covid death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,874      6,014 |    12,888 
           |     80.35      79.90 |     80.14 
-----------+----------------------+----------
         1 |     1,681      1,513 |     3,194 
           |     19.65      20.10 |     19.86 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   | outcome: covid death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |     6,581      5,726 |    12,307 
                   |     76.93      76.07 |     76.53 
-------------------+----------------------+----------
  T1DM, controlled |       227        187 |       414 
                   |      2.65       2.48 |      2.57 
-------------------+----------------------+----------
T1DM, uncontrolled |        45         37 |        82 
                   |      0.53       0.49 |      0.51 
-------------------+----------------------+----------
  T2DM, controlled |     1,383      1,268 |     2,651 
                   |     16.17      16.85 |     16.48 
-------------------+----------------------+----------
T2DM, uncontrolled |       310        298 |       608 
                   |      3.62       3.96 |      3.78 
-------------------+----------------------+----------
Diabetes, no HbA1c |         9         11 |        20 
                   |      0.11       0.15 |      0.12 
-------------------+----------------------+----------
             Total |     8,555      7,527 |    16,082 
                   |    100.00     100.00 |    100.00 
30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo | outcome: covid death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     6,877      6,069 |    12,946 
              |     80.39      80.63 |     80.50 
--------------+----------------------+----------
    Last year |        23         19 |        42 
              |      0.27       0.25 |      0.26 
--------------+----------------------+----------
2-5 years ago |       152        112 |       264 
              |      1.78       1.49 |      1.64 
--------------+----------------------+----------
     5+ years |     1,503      1,327 |     2,830 
              |     17.57      17.63 |     17.60 
--------------+----------------------+----------
        Total |     8,555      7,527 |    16,082 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica | outcome: covid death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     6,911      5,987 |    12,898 
              |     80.78      79.54 |     80.20 
--------------+----------------------+----------
    Last year |        30         27 |        57 
              |      0.35       0.36 |      0.35 
--------------+----------------------+----------
2-5 years ago |       129        125 |       254 
              |      1.51       1.66 |      1.58 
--------------+----------------------+----------
     5+ years |     1,485      1,388 |     2,873 
              |     17.36      18.44 |     17.86 
--------------+----------------------+----------
        Total |     8,555      7,527 |    16,082 
              |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on | outcome: covid death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,920      5,991 |    12,911 
           |     80.89      79.59 |     80.28 
-----------+----------------------+----------
         1 |     1,635      1,536 |     3,171 
           |     19.11      20.41 |     19.72 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |   Failure/censoring
     solid |     indicator for
     organ | outcome: covid death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,810      5,995 |    12,805 
           |     79.60      79.65 |     79.62 
-----------+----------------------+----------
         1 |     1,745      1,532 |     3,277 
           |     20.40      20.35 |     20.38 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,819      5,991 |    12,810 
           |     79.71      79.59 |     79.65 
-----------+----------------------+----------
         1 |     1,736      1,536 |     3,272 
           |     20.29      20.41 |     20.35 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,843      6,040 |    12,883 
           |     79.99      80.24 |     80.11 
-----------+----------------------+----------
         1 |     1,712      1,487 |     3,199 
           |     20.01      19.76 |     19.89 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic | outcome: covid death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,842      6,008 |    12,850 
           |     79.98      79.82 |     79.90 
-----------+----------------------+----------
         1 |     1,713      1,519 |     3,232 
           |     20.02      20.18 |     20.10 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or | outcome: covid death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,821      6,089 |    12,910 
           |     79.73      80.90 |     80.28 
-----------+----------------------+----------
         1 |     1,734      1,438 |     3,172 
           |     20.27      19.10 |     19.72 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Calculated | outcome: covid death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        45 |        32         30 |        62 
           |      0.40       0.42 |      0.41 
-----------+----------------------+----------
        60 |     8,038      7,092 |    15,130 
           |     99.60      99.58 |     99.59 
-----------+----------------------+----------
     Total |     8,070      7,122 |    15,192 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 End-stage |     indicator for
     renal | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,468      4,852 |    10,320 
           |     63.92      64.46 |     64.17 
-----------+----------------------+----------
         1 |     3,087      2,675 |     5,762 
           |     36.08      35.54 |     35.83 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney | outcome: covid death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     8,523      7,497 |    16,020 
                      |     99.63      99.60 |     99.61 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        32         30 |        62 
                      |      0.37       0.40 |      0.39 
----------------------+----------------------+----------
                Total |     8,555      7,527 |    16,082 
                      |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi | outcome: covid death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,882      5,942 |    12,824 
           |     80.44      78.94 |     79.74 
-----------+----------------------+----------
         1 |     1,673      1,585 |     3,258 
           |     19.56      21.06 |     20.26 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,828      5,988 |    12,816 
           |     79.81      79.55 |     79.69 
-----------+----------------------+----------
         1 |     1,727      1,539 |     3,266 
           |     20.19      20.45 |     20.31 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation | outcome: covid death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     6,053      5,245 |    11,298 
                 |     70.75      69.68 |     70.25 
-----------------+----------------------+----------
               4 |     1,664      1,495 |     3,159 
                 |     19.45      19.86 |     19.64 
-----------------+----------------------+----------
 5 most deprived |       838        787 |     1,625 
                 |      9.80      10.46 |     10.10 
-----------------+----------------------+----------
           Total |     8,555      7,527 |    16,082 
                 |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      | outcome: covid death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     6,884      6,069 |    12,953 
                      |     80.47      80.63 |     80.54 
----------------------+----------------------+----------
Asian or Asian Britis |       817        732 |     1,549 
                      |      9.55       9.72 |      9.63 
----------------------+----------------------+----------
                Other |       854        726 |     1,580 
                      |      9.98       9.65 |      9.82 
----------------------+----------------------+----------
                Total |     8,555      7,527 |    16,082 
                      |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       819        806 |     1,625 
           |      9.57      10.71 |     10.10 
-----------+----------------------+----------
         2 |       886        770 |     1,656 
           |     10.36      10.23 |     10.30 
-----------+----------------------+----------
         3 |       903        738 |     1,641 
           |     10.56       9.80 |     10.20 
-----------+----------------------+----------
         4 |       812        746 |     1,558 
           |      9.49       9.91 |      9.69 
-----------+----------------------+----------
         5 |       851        755 |     1,606 
           |      9.95      10.03 |      9.99 
-----------+----------------------+----------
         6 |       876        721 |     1,597 
           |     10.24       9.58 |      9.93 
-----------+----------------------+----------
         7 |       818        779 |     1,597 
           |      9.56      10.35 |      9.93 
-----------+----------------------+----------
         8 |       901        693 |     1,594 
           |     10.53       9.21 |      9.91 
-----------+----------------------+----------
         9 |       813        752 |     1,565 
           |      9.50       9.99 |      9.73 
-----------+----------------------+----------
        10 |       876        767 |     1,643 
           |     10.24      10.19 |     10.22 
-----------+----------------------+----------
     Total |     8,555      7,527 |    16,082 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     2,766      1,251 |     4,017 
           |     25.14      24.63 |     24.98 
-----------+----------------------+----------
    30-<40 |     2,411      1,095 |     3,506 
           |     21.91      21.56 |     21.80 
-----------+----------------------+----------
    40-<50 |     2,246      1,066 |     3,312 
           |     20.41      20.98 |     20.59 
-----------+----------------------+----------
    50-<60 |     2,355      1,094 |     3,449 
           |     21.41      21.54 |     21.45 
-----------+----------------------+----------
    60-<70 |     1,224        574 |     1,798 
           |     11.13      11.30 |     11.18 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,652      2,566 |     8,218 
           |     51.37      50.51 |     51.10 
-----------+----------------------+----------
         1 |     5,350      2,514 |     7,864 
           |     48.63      49.49 |     48.90 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     1,004        496 |     1,500 
                     |      9.13       9.76 |      9.33 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     2,464      1,108 |     3,572 
                     |     22.40      21.81 |     22.21 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,894        889 |     2,783 
                     |     17.22      17.50 |     17.31 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,473        708 |     2,181 
                     |     13.39      13.94 |     13.56 
---------------------+----------------------+----------
  Obese II (35-39.9) |       945        434 |     1,379 
                     |      8.59       8.54 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |       652        241 |       893 
                     |      5.93       4.74 |      5.55 
---------------------+----------------------+----------
        Unknown (.u) |     2,570      1,204 |     3,774 
                     |     23.36      23.70 |     23.47 
---------------------+----------------------+----------
               Total |    11,002      5,080 |    16,082 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       445        201 |       646 
             |      4.04       3.96 |      4.02 
-------------+----------------------+----------
      Former |       228        111 |       339 
             |      2.07       2.19 |      2.11 
-------------+----------------------+----------
     Current |     1,332        615 |     1,947 
             |     12.11      12.11 |     12.11 
-------------+----------------------+----------
Unknown (.u) |     8,997      4,153 |    13,150 
             |     81.78      81.75 |     81.77 
-------------+----------------------+----------
       Total |    11,002      5,080 |    16,082 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     7,932      3,697 |    11,629 
                     |     72.10      72.78 |     72.31 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,473        708 |     2,181 
                     |     13.39      13.94 |     13.56 
---------------------+----------------------+----------
  Obese II (35-39.9) |       945        434 |     1,379 
                     |      8.59       8.54 |      8.57 
---------------------+----------------------+----------
     Obese III (40+) |       652        241 |       893 
                     |      5.93       4.74 |      5.55 
---------------------+----------------------+----------
               Total |    11,002      5,080 |    16,082 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,689        782 |     2,471 
           |     15.35      15.39 |     15.37 
-----------+----------------------+----------
         1 |     9,313      4,298 |    13,611 
           |     84.65      84.61 |     84.63 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,820      4,041 |    12,861 
           |     80.17      79.55 |     79.97 
-----------+----------------------+----------
         1 |     2,182      1,039 |     3,221 
           |     19.83      20.45 |     20.03 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,152      4,692 |    14,844 
           |     92.27      92.36 |     92.30 
-----------+----------------------+----------
         1 |       850        388 |     1,238 
           |      7.73       7.64 |      7.70 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,798      4,090 |    12,888 
           |     79.97      80.51 |     80.14 
-----------+----------------------+----------
         1 |     2,204        990 |     3,194 
           |     20.03      19.49 |     19.86 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                   |   Failure/censoring
                   |     indicator for
                   |  outcome: non-covid
                   |         death
          Diabetes |         0          1 |     Total
-------------------+----------------------+----------
       No diabetes |     8,404      3,903 |    12,307 
                   |     76.39      76.83 |     76.53 
-------------------+----------------------+----------
  T1DM, controlled |       282        132 |       414 
                   |      2.56       2.60 |      2.57 
-------------------+----------------------+----------
T1DM, uncontrolled |        51         31 |        82 
                   |      0.46       0.61 |      0.51 
-------------------+----------------------+----------
  T2DM, controlled |     1,829        822 |     2,651 
                   |     16.62      16.18 |     16.48 
-------------------+----------------------+----------
T2DM, uncontrolled |       422        186 |       608 
                   |      3.84       3.66 |      3.78 
-------------------+----------------------+----------
Diabetes, no HbA1c |        14          6 |        20 
                   |      0.13       0.12 |      0.12 
-------------------+----------------------+----------
             Total |    11,002      5,080 |    16,082 
                   |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     8,846      4,100 |    12,946 
              |     80.40      80.71 |     80.50 
--------------+----------------------+----------
    Last year |        27         15 |        42 
              |      0.25       0.30 |      0.26 
--------------+----------------------+----------
2-5 years ago |       182         82 |       264 
              |      1.65       1.61 |      1.64 
--------------+----------------------+----------
     5+ years |     1,947        883 |     2,830 
              |     17.70      17.38 |     17.60 
--------------+----------------------+----------
        Total |    11,002      5,080 |    16,082 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     8,801      4,097 |    12,898 
              |     79.99      80.65 |     80.20 
--------------+----------------------+----------
    Last year |        42         15 |        57 
              |      0.38       0.30 |      0.35 
--------------+----------------------+----------
2-5 years ago |       176         78 |       254 
              |      1.60       1.54 |      1.58 
--------------+----------------------+----------
     5+ years |     1,983        890 |     2,873 
              |     18.02      17.52 |     17.86 
--------------+----------------------+----------
        Total |    11,002      5,080 |    16,082 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,823      4,088 |    12,911 
           |     80.19      80.47 |     80.28 
-----------+----------------------+----------
         1 |     2,179        992 |     3,171 
           |     19.81      19.53 |     19.72 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,801      4,004 |    12,805 
           |     79.99      78.82 |     79.62 
-----------+----------------------+----------
         1 |     2,201      1,076 |     3,277 
           |     20.01      21.18 |     20.38 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,750      4,060 |    12,810 
           |     79.53      79.92 |     79.65 
-----------+----------------------+----------
         1 |     2,252      1,020 |     3,272 
           |     20.47      20.08 |     20.35 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,819      4,064 |    12,883 
           |     80.16      80.00 |     80.11 
-----------+----------------------+----------
         1 |     2,183      1,016 |     3,199 
           |     19.84      20.00 |     19.89 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,807      4,043 |    12,850 
           |     80.05      79.59 |     79.90 
-----------+----------------------+----------
         1 |     2,195      1,037 |     3,232 
           |     19.95      20.41 |     20.10 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,848      4,062 |    12,910 
           |     80.42      79.96 |     80.28 
-----------+----------------------+----------
         1 |     2,154      1,018 |     3,172 
           |     19.58      20.04 |     19.72 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        45 |        40         22 |        62 
           |      0.38       0.46 |      0.41 
-----------+----------------------+----------
        60 |    10,369      4,761 |    15,130 
           |     99.62      99.54 |     99.59 
-----------+----------------------+----------
     Total |    10,409      4,783 |    15,192 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,028      3,292 |    10,320 
           |     63.88      64.80 |     64.17 
-----------+----------------------+----------
         1 |     3,974      1,788 |     5,762 
           |     36.12      35.20 |     35.83 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    10,962      5,058 |    16,020 
                      |     99.64      99.57 |     99.61 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        40         22 |        62 
                      |      0.36       0.43 |      0.39 
----------------------+----------------------+----------
                Total |    11,002      5,080 |    16,082 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,762      4,062 |    12,824 
           |     79.64      79.96 |     79.74 
-----------+----------------------+----------
         1 |     2,240      1,018 |     3,258 
           |     20.36      20.04 |     20.26 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,748      4,068 |    12,816 
           |     79.51      80.08 |     79.69 
-----------+----------------------+----------
         1 |     2,254      1,012 |     3,266 
           |     20.49      19.92 |     20.31 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     7,681      3,617 |    11,298 
                 |     69.81      71.20 |     70.25 
-----------------+----------------------+----------
               4 |     2,201        958 |     3,159 
                 |     20.01      18.86 |     19.64 
-----------------+----------------------+----------
 5 most deprived |     1,120        505 |     1,625 
                 |     10.18       9.94 |     10.10 
-----------------+----------------------+----------
           Total |    11,002      5,080 |    16,082 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     8,865      4,088 |    12,953 
                      |     80.58      80.47 |     80.54 
----------------------+----------------------+----------
Asian or Asian Britis |     1,077        472 |     1,549 
                      |      9.79       9.29 |      9.63 
----------------------+----------------------+----------
                Other |     1,060        520 |     1,580 
                      |      9.63      10.24 |      9.82 
----------------------+----------------------+----------
                Total |    11,002      5,080 |    16,082 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |     1,137        488 |     1,625 
           |     10.33       9.61 |     10.10 
-----------+----------------------+----------
         2 |     1,131        525 |     1,656 
           |     10.28      10.33 |     10.30 
-----------+----------------------+----------
         3 |     1,108        533 |     1,641 
           |     10.07      10.49 |     10.20 
-----------+----------------------+----------
         4 |     1,093        465 |     1,558 
           |      9.93       9.15 |      9.69 
-----------+----------------------+----------
         5 |     1,095        511 |     1,606 
           |      9.95      10.06 |      9.99 
-----------+----------------------+----------
         6 |     1,088        509 |     1,597 
           |      9.89      10.02 |      9.93 
-----------+----------------------+----------
         7 |     1,088        509 |     1,597 
           |      9.89      10.02 |      9.93 
-----------+----------------------+----------
         8 |     1,064        530 |     1,594 
           |      9.67      10.43 |      9.91 
-----------+----------------------+----------
         9 |     1,059        506 |     1,565 
           |      9.63       9.96 |      9.73 
-----------+----------------------+----------
        10 |     1,139        504 |     1,643 
           |     10.35       9.92 |     10.22 
-----------+----------------------+----------
     Total |    11,002      5,080 |    16,082 
           |    100.00     100.00 |    100.00 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      4,551    75.47858    7.296991         66        109
0

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     60-<70 |      1,092       23.99       23.99
     70-<80 |      2,249       49.42       73.41
        80+ |      1,210       26.59      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

   66 years |
  and older |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        277        6.09        6.09
          1 |      4,274       93.91      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,349       51.62       51.62
          1 |      2,202       48.38      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        450       12.49       12.49
  Normal (18.5-24.9) |      1,029       28.57       41.06
Overweight (25-29.9) |        807       22.40       63.46
   Obese I (30-34.9) |        687       19.07       82.54
  Obese II (35-39.9) |        389       10.80       93.34
     Obese III (40+) |        240        6.66      100.00
---------------------+-----------------------------------
               Total |      3,602      100.00
7

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        450        9.89        9.89
  Normal (18.5-24.9) |      1,029       22.61       32.50
Overweight (25-29.9) |        807       17.73       50.23
   Obese I (30-34.9) |        687       15.10       65.33
  Obese II (35-39.9) |        389        8.55       73.87
     Obese III (40+) |        240        5.27       79.15
        Unknown (.u) |        949       20.85      100.00
---------------------+-----------------------------------
               Total |      4,551      100.00
0

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |      3,235       71.08       71.08
   Obese I (30-34.9) |        687       15.10       86.18
  Obese II (35-39.9) |        389        8.55       94.73
     Obese III (40+) |        240        5.27      100.00
---------------------+-----------------------------------
               Total |      4,551      100.00
0

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        190       22.95       22.95
      Former |         87       10.51       33.45
     Current |        551       66.55      100.00
-------------+-----------------------------------
       Total |        828      100.00
6

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |        190        4.17        4.17
      Former |         87        1.91        6.09
     Current |        551       12.11       18.19
Unknown (.u) |      3,723       81.81      100.00
-------------+-----------------------------------
       Total |      4,551      100.00
0

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |        950       23.22       23.22
      Elevated |        725       17.72       40.94
 High, stage I |      1,701       41.58       82.52
High, stage II |        715       17.48      100.00
---------------+-----------------------------------
         Total |      4,091      100.00
6

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |        950       20.87       20.87
      Elevated |        725       15.93       36.81
 High, stage I |      1,701       37.38       74.18
High, stage II |        715       15.71       89.89
       Unknown |        460       10.11      100.00
---------------+-----------------------------------
         Total |      4,551      100.00
0

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,097       68.05       68.05
          1 |      1,454       31.95      100.00
------------+-----------------------------------
      Total |      4,551      100.00

   Probable |
  shielding |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        723       15.89       15.89
          1 |      3,828       84.11      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,620       79.54       79.54
          1 |        931       20.46      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,169       91.61       91.61
          1 |        382        8.39      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,619       79.52       79.52
          1 |        932       20.48      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

**TABLE OF diabcat REDACTED DUE TO SMALL N**

0

Non-haematolo |
 gical cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,653       80.27       80.27
    Last year |         24        0.53       80.80
2-5 years ago |         68        1.49       82.29
     5+ years |        806       17.71      100.00
--------------+-----------------------------------
        Total |      4,551      100.00
0

Haematologica |
     l cancer |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |      3,667       80.58       80.58
    Last year |         25        0.55       81.13
2-5 years ago |         69        1.52       82.64
     5+ years |        790       17.36      100.00
--------------+-----------------------------------
        Total |      4,551      100.00
0

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,611       79.35       79.35
          1 |        940       20.65      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

Other solid |
      organ |
 transplant |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,626       79.67       79.67
          1 |        925       20.33      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

   Asplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,641       80.00       80.00
          1 |        910       20.00      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,634       79.85       79.85
          1 |        917       20.15      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,640       79.98       79.98
          1 |        911       20.02      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,619       79.52       79.52
          1 |        932       20.48      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

 Calculated |
       eGFR |      Freq.     Percent        Cum.
------------+-----------------------------------
         30 |          6        0.14        0.14
         45 |        180        4.16        4.30
         60 |      4,140       95.70      100.00
------------+-----------------------------------
      Total |      4,326      100.00
0

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |      4,365       95.91       95.91
Stage 3a/3b egfr 30-60       |        186        4.09      100.00
-----------------------------+-----------------------------------
                       Total |      4,551      100.00
0

  End-stage |
      renal |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,952       64.86       64.86
          1 |      1,599       35.14      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,694       81.17       81.17
          1 |        857       18.83      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,669       80.62       80.62
          1 |        882       19.38      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,209       70.51       70.51
               4 |        916       20.13       90.64
 5 most deprived |        426        9.36      100.00
-----------------+-----------------------------------
           Total |      4,551      100.00
4

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      3,209       70.51       70.51
               4 |        916       20.13       90.64
 5 most deprived |        426        9.36      100.00
-----------------+-----------------------------------
           Total |      4,551      100.00
0

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,611       79.35       79.35
Asian or Asian British |        456       10.02       89.36
                 Other |        484       10.64      100.00
-----------------------+-----------------------------------
                 Total |      4,551      100.00
10

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |      3,611       79.35       79.35
Asian or Asian British |        456       10.02       89.36
                 Other |        484       10.64      100.00
-----------------------+-----------------------------------
                 Total |      4,551      100.00
0

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        425        9.34        9.34
          2 |        474       10.42       19.75
          3 |        459       10.09       29.84
          4 |        484       10.64       40.47
          5 |        420        9.23       49.70
          6 |        442        9.71       59.42
          7 |        516       11.34       70.75
          8 |        449        9.87       80.62
          9 |        465       10.22       90.84
         10 |        417        9.16      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  non-covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,126       68.69       68.69
          1 |      1,425       31.31      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
covid death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,383       52.36       52.36
          1 |      2,168       47.64      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 covid prob |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        259        5.69        5.69
          1 |      4,292       94.31      100.00
------------+-----------------------------------
      Total |      4,551      100.00
0

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  covid icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,004       22.06       22.06
          1 |      3,547       77.94      100.00
------------+-----------------------------------
      Total |      4,551      100.00

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
date_covid~u |      3,547   21may2021    88.70881  21dec2020  22oct2021
date_posit~S |        716   24sep2021    26.37026  28may2021  22oct2021
date_covid~b |      4,292   23may2021    88.78475  21dec2020  22oct2021
date_covid~n |        621   22apr2021    84.36106  20dec2020  21oct2021
date_covid~s |      4,245   22may2021    88.38178  21dec2020  22oct2021
-------------+---------------------------------------------------------
date_covid~h |      2,168   20may2021    89.43678  21dec2020  22oct2021
date_non_c~h |      1,425   21may2021    89.23231  21dec2020  22oct2021
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |        63      1,029 |     1,092 
           |     24.32      23.97 |     23.99 
-----------+----------------------+----------
    70-<80 |       127      2,122 |     2,249 
           |     49.03      49.44 |     49.42 
-----------+----------------------+----------
       80+ |        69      1,141 |     1,210 
           |     26.64      26.58 |     26.59 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |       147      2,202 |     2,349 
           |     56.76      51.30 |     51.62 
-----------+----------------------+----------
         1 |       112      2,090 |     2,202 
           |     43.24      48.70 |     48.38 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
                     |         case
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |        26        424 |       450 
                     |     10.04       9.88 |      9.89 
---------------------+----------------------+----------
  Normal (18.5-24.9) |        62        967 |     1,029 
                     |     23.94      22.53 |     22.61 
---------------------+----------------------+----------
Overweight (25-29.9) |        40        767 |       807 
                     |     15.44      17.87 |     17.73 
---------------------+----------------------+----------
   Obese I (30-34.9) |        35        652 |       687 
                     |     13.51      15.19 |     15.10 
---------------------+----------------------+----------
  Obese II (35-39.9) |        21        368 |       389 
                     |      8.11       8.57 |      8.55 
---------------------+----------------------+----------
     Obese III (40+) |        10        230 |       240 
                     |      3.86       5.36 |      5.27 
---------------------+----------------------+----------
        Unknown (.u) |        65        884 |       949 
                     |     25.10      20.60 |     20.85 
---------------------+----------------------+----------
               Total |       259      4,292 |     4,551 
                     |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: covid prob
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |         9        181 |       190 
             |      3.47       4.22 |      4.17 
-------------+----------------------+----------
      Former |         8         79 |        87 
             |      3.09       1.84 |      1.91 
-------------+----------------------+----------
     Current |        34        517 |       551 
             |     13.13      12.05 |     12.11 
-------------+----------------------+----------
Unknown (.u) |       208      3,515 |     3,723 
             |     80.31      81.90 |     81.81 
-------------+----------------------+----------
       Total |       259      4,292 |     4,551 
             |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: covid prob
 Evidence of obesity |         case
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |       193      3,042 |     3,235 
                     |     74.52      70.88 |     71.08 
---------------------+----------------------+----------
   Obese I (30-34.9) |        35        652 |       687 
                     |     13.51      15.19 |     15.10 
---------------------+----------------------+----------
  Obese II (35-39.9) |        21        368 |       389 
                     |      8.11       8.57 |      8.55 
---------------------+----------------------+----------
     Obese III (40+) |        10        230 |       240 
                     |      3.86       5.36 |      5.27 
---------------------+----------------------+----------
               Total |       259      4,292 |     4,551 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |        33        690 |       723 
           |     12.74      16.08 |     15.89 
-----------+----------------------+----------
         1 |       226      3,602 |     3,828 
           |     87.26      83.92 |     84.11 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
43

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |       202      3,418 |     3,620 
           |     77.99      79.64 |     79.54 
-----------+----------------------+----------
         1 |        57        874 |       931 
           |     22.01      20.36 |     20.46 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |       239      3,930 |     4,169 
           |     92.28      91.57 |     91.61 
-----------+----------------------+----------
         1 |        20        362 |       382 
           |      7.72       8.43 |      8.39 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |       208      3,411 |     3,619 
           |     80.31      79.47 |     79.52 
-----------+----------------------+----------
         1 |        51        881 |       932 
           |     19.69      20.53 |     20.48 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
23

**TABLE OF diabcat covid_tpp_prob REDACTED DUE TO SMALL N**

33

**TABLE OF cancer_exhaem_cat covid_tpp_prob REDACTED DUE TO SMALL N**

31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: covid prob
Haematologica |         case
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |       203      3,464 |     3,667 
              |     78.38      80.71 |     80.58 
--------------+----------------------+----------
    Last year |         0         25 |        25 
              |      0.00       0.58 |      0.55 
--------------+----------------------+----------
2-5 years ago |         6         63 |        69 
              |      2.32       1.47 |      1.52 
--------------+----------------------+----------
     5+ years |        50        740 |       790 
              |     19.31      17.24 |     17.36 
--------------+----------------------+----------
        Total |       259      4,292 |     4,551 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: covid prob
        on |         case
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |       203      3,408 |     3,611 
           |     78.38      79.40 |     79.35 
-----------+----------------------+----------
         1 |        56        884 |       940 
           |     21.62      20.60 |     20.65 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: covid prob
     organ |         case
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |       208      3,418 |     3,626 
           |     80.31      79.64 |     79.67 
-----------+----------------------+----------
         1 |        51        874 |       925 
           |     19.69      20.36 |     20.33 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |       205      3,436 |     3,641 
           |     79.15      80.06 |     80.00 
-----------+----------------------+----------
         1 |        54        856 |       910 
           |     20.85      19.94 |     20.00 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
37

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: covid prob
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       207      3,427 |     3,634 
           |     79.92      79.85 |     79.85 
-----------+----------------------+----------
         1 |        52        865 |       917 
           |     20.08      20.15 |     20.15 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
27

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       207      3,433 |     3,640 
           |     79.92      79.99 |     79.98 
-----------+----------------------+----------
         1 |        52        859 |       911 
           |     20.08      20.01 |     20.02 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
31

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
 Stroke or |         case
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |       217      3,402 |     3,619 
           |     83.78      79.26 |     79.52 
-----------+----------------------+----------
         1 |        42        890 |       932 
           |     16.22      20.74 |     20.48 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Calculated |         case
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        30 |         0          6 |         6 
           |      0.00       0.15 |      0.14 
-----------+----------------------+----------
        45 |         8        172 |       180 
           |      3.25       4.22 |      4.16 
-----------+----------------------+----------
        60 |       238      3,902 |     4,140 
           |     96.75      95.64 |     95.70 
-----------+----------------------+----------
     Total |       246      4,080 |     4,326 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: covid prob
     renal |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       159      2,793 |     2,952 
           |     61.39      65.07 |     64.86 
-----------+----------------------+----------
         1 |       100      1,499 |     1,599 
           |     38.61      34.93 |     35.14 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
39

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |       251      4,114 |     4,365 
                      |     96.91      95.85 |     95.91 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |         8        178 |       186 
                      |      3.09       4.15 |      4.09 
----------------------+----------------------+----------
                Total |       259      4,292 |     4,551 
                      |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: covid prob
hypertensi |         case
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |       210      3,484 |     3,694 
           |     81.08      81.17 |     81.17 
-----------+----------------------+----------
         1 |        49        808 |       857 
           |     18.92      18.83 |     18.83 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |       208      3,461 |     3,669 
           |     80.31      80.64 |     80.62 
-----------+----------------------+----------
         1 |        51        831 |       882 
           |     19.69      19.36 |     19.38 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: covid prob
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |       187      3,022 |     3,209 
                 |     72.20      70.41 |     70.51 
-----------------+----------------------+----------
               4 |        56        860 |       916 
                 |     21.62      20.04 |     20.13 
-----------------+----------------------+----------
 5 most deprived |        16        410 |       426 
                 |      6.18       9.55 |      9.36 
-----------------+----------------------+----------
           Total |       259      4,292 |     4,551 
                 |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: covid prob
                      |         case
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |       211      3,400 |     3,611 
                      |     81.47      79.22 |     79.35 
----------------------+----------------------+----------
Asian or Asian Britis |        15        441 |       456 
                      |      5.79      10.27 |     10.02 
----------------------+----------------------+----------
                Other |        33        451 |       484 
                      |     12.74      10.51 |     10.64 
----------------------+----------------------+----------
                Total |       259      4,292 |     4,551 
                      |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: covid prob
Partnershi |         case
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |        27        398 |       425 
           |     10.42       9.27 |      9.34 
-----------+----------------------+----------
         2 |        27        447 |       474 
           |     10.42      10.41 |     10.42 
-----------+----------------------+----------
         3 |        29        430 |       459 
           |     11.20      10.02 |     10.09 
-----------+----------------------+----------
         4 |        25        459 |       484 
           |      9.65      10.69 |     10.64 
-----------+----------------------+----------
         5 |        24        396 |       420 
           |      9.27       9.23 |      9.23 
-----------+----------------------+----------
         6 |        25        417 |       442 
           |      9.65       9.72 |      9.71 
-----------+----------------------+----------
         7 |        24        492 |       516 
           |      9.27      11.46 |     11.34 
-----------+----------------------+----------
         8 |        25        424 |       449 
           |      9.65       9.88 |      9.87 
-----------+----------------------+----------
         9 |        32        433 |       465 
           |     12.36      10.09 |     10.22 
-----------+----------------------+----------
        10 |        21        396 |       417 
           |      8.11       9.23 |      9.16 
-----------+----------------------+----------
     Total |       259      4,292 |     4,551 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Grouped | outcome: covid death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |       570        522 |     1,092 
           |     23.92      24.08 |     23.99 
-----------+----------------------+----------
    70-<80 |     1,161      1,088 |     2,249 
           |     48.72      50.18 |     49.42 
-----------+----------------------+----------
       80+ |       652        558 |     1,210 
           |     27.36      25.74 |     26.59 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,222      1,127 |     2,349 
           |     51.28      51.98 |     51.62 
-----------+----------------------+----------
         1 |     1,161      1,041 |     2,202 
           |     48.72      48.02 |     48.38 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     | outcome: covid death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       243        207 |       450 
                     |     10.20       9.55 |      9.89 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       530        499 |     1,029 
                     |     22.24      23.02 |     22.61 
---------------------+----------------------+----------
Overweight (25-29.9) |       416        391 |       807 
                     |     17.46      18.04 |     17.73 
---------------------+----------------------+----------
   Obese I (30-34.9) |       370        317 |       687 
                     |     15.53      14.62 |     15.10 
---------------------+----------------------+----------
  Obese II (35-39.9) |       198        191 |       389 
                     |      8.31       8.81 |      8.55 
---------------------+----------------------+----------
     Obese III (40+) |       133        107 |       240 
                     |      5.58       4.94 |      5.27 
---------------------+----------------------+----------
        Unknown (.u) |       493        456 |       949 
                     |     20.69      21.03 |     20.85 
---------------------+----------------------+----------
               Total |     2,383      2,168 |     4,551 
                     |    100.00     100.00 |    100.00 
18

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
     Smoking | outcome: covid death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       100         90 |       190 
             |      4.20       4.15 |      4.17 
-------------+----------------------+----------
      Former |        38         49 |        87 
             |      1.59       2.26 |      1.91 
-------------+----------------------+----------
     Current |       283        268 |       551 
             |     11.88      12.36 |     12.11 
-------------+----------------------+----------
Unknown (.u) |     1,962      1,761 |     3,723 
             |     82.33      81.23 |     81.81 
-------------+----------------------+----------
       Total |     2,383      2,168 |     4,551 
             |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
 Evidence of obesity | outcome: covid death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     1,682      1,553 |     3,235 
                     |     70.58      71.63 |     71.08 
---------------------+----------------------+----------
   Obese I (30-34.9) |       370        317 |       687 
                     |     15.53      14.62 |     15.10 
---------------------+----------------------+----------
  Obese II (35-39.9) |       198        191 |       389 
                     |      8.31       8.81 |      8.55 
---------------------+----------------------+----------
     Obese III (40+) |       133        107 |       240 
                     |      5.58       4.94 |      5.27 
---------------------+----------------------+----------
               Total |     2,383      2,168 |     4,551 
                     |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       406        317 |       723 
           |     17.04      14.62 |     15.89 
-----------+----------------------+----------
         1 |     1,977      1,851 |     3,828 
           |     82.96      85.38 |     84.11 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
Respirator | outcome: covid death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,898      1,722 |     3,620 
           |     79.65      79.43 |     79.54 
-----------+----------------------+----------
         1 |       485        446 |       931 
           |     20.35      20.57 |     20.46 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
19

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
    Asthma | outcome: covid death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,182      1,987 |     4,169 
           |     91.57      91.65 |     91.61 
-----------+----------------------+----------
         1 |       201        181 |       382 
           |      8.43       8.35 |      8.39 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
   Cardiac | outcome: covid death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,878      1,741 |     3,619 
           |     78.81      80.30 |     79.52 
-----------+----------------------+----------
         1 |       505        427 |       932 
           |     21.19      19.70 |     20.48 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
20

**TABLE OF diabcat covid_death REDACTED DUE TO SMALL N**

30

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Non-haematolo | outcome: covid death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     1,937      1,716 |     3,653 
              |     81.28      79.15 |     80.27 
--------------+----------------------+----------
    Last year |         9         15 |        24 
              |      0.38       0.69 |      0.53 
--------------+----------------------+----------
2-5 years ago |        38         30 |        68 
              |      1.59       1.38 |      1.49 
--------------+----------------------+----------
     5+ years |       399        407 |       806 
              |     16.74      18.77 |     17.71 
--------------+----------------------+----------
        Total |     2,383      2,168 |     4,551 
              |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
Haematologica | outcome: covid death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     1,943      1,724 |     3,667 
              |     81.54      79.52 |     80.58 
--------------+----------------------+----------
    Last year |        13         12 |        25 
              |      0.55       0.55 |      0.55 
--------------+----------------------+----------
2-5 years ago |        34         35 |        69 
              |      1.43       1.61 |      1.52 
--------------+----------------------+----------
     5+ years |       393        397 |       790 
              |     16.49      18.31 |     17.36 
--------------+----------------------+----------
        Total |     2,383      2,168 |     4,551 
              |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |
    ressed |   Failure/censoring
(combinati |     indicator for
        on | outcome: covid death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,885      1,726 |     3,611 
           |     79.10      79.61 |     79.35 
-----------+----------------------+----------
         1 |       498        442 |       940 
           |     20.90      20.39 |     20.65 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Other |   Failure/censoring
     solid |     indicator for
     organ | outcome: covid death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,916      1,710 |     3,626 
           |     80.40      78.87 |     79.67 
-----------+----------------------+----------
         1 |       467        458 |       925 
           |     19.60      21.13 |     20.33 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,914      1,727 |     3,641 
           |     80.32      79.66 |     80.00 
-----------+----------------------+----------
         1 |       469        441 |       910 
           |     19.68      20.34 |     20.00 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
   Chronic |     indicator for
     liver | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,910      1,724 |     3,634 
           |     80.15      79.52 |     79.85 
-----------+----------------------+----------
         1 |       473        444 |       917 
           |     19.85      20.48 |     20.15 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
24

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Neurologic | outcome: covid death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,938      1,702 |     3,640 
           |     81.33      78.51 |     79.98 
-----------+----------------------+----------
         1 |       445        466 |       911 
           |     18.67      21.49 |     20.02 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Stroke or | outcome: covid death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,880      1,739 |     3,619 
           |     78.89      80.21 |     79.52 
-----------+----------------------+----------
         1 |       503        429 |       932 
           |     21.11      19.79 |     20.48 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
21

**TABLE OF egfr_cat covid_death REDACTED DUE TO SMALL N**

17

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 End-stage |     indicator for
     renal | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,568      1,384 |     2,952 
           |     65.80      63.84 |     64.86 
-----------+----------------------+----------
         1 |       815        784 |     1,599 
           |     34.20      36.16 |     35.14 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
36

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
       Reduced kidney | outcome: covid death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     2,298      2,067 |     4,365 
                      |     96.43      95.34 |     95.91 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |        85        101 |       186 
                      |      3.57       4.66 |      4.09 
----------------------+----------------------+----------
                Total |     2,383      2,168 |     4,551 
                      |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 Diagnosed |     indicator for
hypertensi | outcome: covid death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,934      1,760 |     3,694 
           |     81.16      81.18 |     81.17 
-----------+----------------------+----------
         1 |       449        408 |       857 
           |     18.84      18.82 |     18.83 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
Autoimmune | outcome: covid death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,930      1,739 |     3,669 
           |     80.99      80.21 |     80.62 
-----------+----------------------+----------
         1 |       453        429 |       882 
           |     19.01      19.79 |     19.38 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |   Failure/censoring
        Multiple |     indicator for
     Deprivation | outcome: covid death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     1,681      1,528 |     3,209 
                 |     70.54      70.48 |     70.51 
-----------------+----------------------+----------
               4 |       477        439 |       916 
                 |     20.02      20.25 |     20.13 
-----------------+----------------------+----------
 5 most deprived |       225        201 |       426 
                 |      9.44       9.27 |      9.36 
-----------------+----------------------+----------
           Total |     2,383      2,168 |     4,551 
                 |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      | outcome: covid death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     1,877      1,734 |     3,611 
                      |     78.77      79.98 |     79.35 
----------------------+----------------------+----------
Asian or Asian Britis |       240        216 |       456 
                      |     10.07       9.96 |     10.02 
----------------------+----------------------+----------
                Other |       266        218 |       484 
                      |     11.16      10.06 |     10.64 
----------------------+----------------------+----------
                Total |     2,383      2,168 |     4,551 
                      |    100.00     100.00 |    100.00 
16

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |
Transforma |   Failure/censoring
      tion |     indicator for
Partnershi | outcome: covid death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       239        186 |       425 
           |     10.03       8.58 |      9.34 
-----------+----------------------+----------
         2 |       227        247 |       474 
           |      9.53      11.39 |     10.42 
-----------+----------------------+----------
         3 |       238        221 |       459 
           |      9.99      10.19 |     10.09 
-----------+----------------------+----------
         4 |       260        224 |       484 
           |     10.91      10.33 |     10.64 
-----------+----------------------+----------
         5 |       232        188 |       420 
           |      9.74       8.67 |      9.23 
-----------+----------------------+----------
         6 |       236        206 |       442 
           |      9.90       9.50 |      9.71 
-----------+----------------------+----------
         7 |       275        241 |       516 
           |     11.54      11.12 |     11.34 
-----------+----------------------+----------
         8 |       226        223 |       449 
           |      9.48      10.29 |      9.87 
-----------+----------------------+----------
         9 |       235        230 |       465 
           |      9.86      10.61 |     10.22 
-----------+----------------------+----------
        10 |       215        202 |       417 
           |      9.02       9.32 |      9.16 
-----------+----------------------+----------
     Total |     2,383      2,168 |     4,551 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    60-<70 |       752        340 |     1,092 
           |     24.06      23.86 |     23.99 
-----------+----------------------+----------
    70-<80 |     1,570        679 |     2,249 
           |     50.22      47.65 |     49.42 
-----------+----------------------+----------
       80+ |       804        406 |     1,210 
           |     25.72      28.49 |     26.59 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,624        725 |     2,349 
           |     51.95      50.88 |     51.62 
-----------+----------------------+----------
         1 |     1,502        700 |     2,202 
           |     48.05      49.12 |     48.38 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       301        149 |       450 
                     |      9.63      10.46 |      9.89 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       705        324 |     1,029 
                     |     22.55      22.74 |     22.61 
---------------------+----------------------+----------
Overweight (25-29.9) |       566        241 |       807 
                     |     18.11      16.91 |     17.73 
---------------------+----------------------+----------
   Obese I (30-34.9) |       466        221 |       687 
                     |     14.91      15.51 |     15.10 
---------------------+----------------------+----------
  Obese II (35-39.9) |       277        112 |       389 
                     |      8.86       7.86 |      8.55 
---------------------+----------------------+----------
     Obese III (40+) |       165         75 |       240 
                     |      5.28       5.26 |      5.27 
---------------------+----------------------+----------
        Unknown (.u) |       646        303 |       949 
                     |     20.67      21.26 |     20.85 
---------------------+----------------------+----------
               Total |     3,126      1,425 |     4,551 
                     |    100.00     100.00 |    100.00 
22

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: non-covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |       133         57 |       190 
             |      4.25       4.00 |      4.17 
-------------+----------------------+----------
      Former |        69         18 |        87 
             |      2.21       1.26 |      1.91 
-------------+----------------------+----------
     Current |       371        180 |       551 
             |     11.87      12.63 |     12.11 
-------------+----------------------+----------
Unknown (.u) |     2,553      1,170 |     3,723 
             |     81.67      82.11 |     81.81 
-------------+----------------------+----------
       Total |     3,126      1,425 |     4,551 
             |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: non-covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |     2,218      1,017 |     3,235 
                     |     70.95      71.37 |     71.08 
---------------------+----------------------+----------
   Obese I (30-34.9) |       466        221 |       687 
                     |     14.91      15.51 |     15.10 
---------------------+----------------------+----------
  Obese II (35-39.9) |       277        112 |       389 
                     |      8.86       7.86 |      8.55 
---------------------+----------------------+----------
     Obese III (40+) |       165         75 |       240 
                     |      5.28       5.26 |      5.27 
---------------------+----------------------+----------
               Total |     3,126      1,425 |     4,551 
                     |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
  Probable |         death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       482        241 |       723 
           |     15.42      16.91 |     15.89 
-----------+----------------------+----------
         1 |     2,644      1,184 |     3,828 
           |     84.58      83.09 |     84.11 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
44

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,477      1,143 |     3,620 
           |     79.24      80.21 |     79.54 
-----------+----------------------+----------
         1 |       649        282 |       931 
           |     20.76      19.79 |     20.46 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
23

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,872      1,297 |     4,169 
           |     91.87      91.02 |     91.61 
-----------+----------------------+----------
         1 |       254        128 |       382 
           |      8.13       8.98 |      8.39 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,501      1,118 |     3,619 
           |     80.01      78.46 |     79.52 
-----------+----------------------+----------
         1 |       625        307 |       932 
           |     19.99      21.54 |     20.48 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
24

**TABLE OF diabcat non_covid_death REDACTED DUE TO SMALL N**

34

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Non-haematolo |         death
 gical cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,497      1,156 |     3,653 
              |     79.88      81.12 |     80.27 
--------------+----------------------+----------
    Last year |        18          6 |        24 
              |      0.58       0.42 |      0.53 
--------------+----------------------+----------
2-5 years ago |        49         19 |        68 
              |      1.57       1.33 |      1.49 
--------------+----------------------+----------
     5+ years |       562        244 |       806 
              |     17.98      17.12 |     17.71 
--------------+----------------------+----------
        Total |     3,126      1,425 |     4,551 
              |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

              |   Failure/censoring
              |     indicator for
              |  outcome: non-covid
Haematologica |         death
     l cancer |         0          1 |     Total
--------------+----------------------+----------
        Never |     2,498      1,169 |     3,667 
              |     79.91      82.04 |     80.58 
--------------+----------------------+----------
    Last year |        19          6 |        25 
              |      0.61       0.42 |      0.55 
--------------+----------------------+----------
2-5 years ago |        45         24 |        69 
              |      1.44       1.68 |      1.52 
--------------+----------------------+----------
     5+ years |       564        226 |       790 
              |     18.04      15.86 |     17.36 
--------------+----------------------+----------
        Total |     3,126      1,425 |     4,551 
              |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: non-covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,507      1,104 |     3,611 
           |     80.20      77.47 |     79.35 
-----------+----------------------+----------
         1 |       619        321 |       940 
           |     19.80      22.53 |     20.65 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
     Other |     indicator for
     solid |  outcome: non-covid
     organ |         death
transplant |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,476      1,150 |     3,626 
           |     79.21      80.70 |     79.67 
-----------+----------------------+----------
         1 |       650        275 |       925 
           |     20.79      19.30 |     20.33 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
           |         death
  Asplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      1,150 |     3,641 
           |     79.69      80.70 |     80.00 
-----------+----------------------+----------
         1 |       635        275 |       910 
           |     20.31      19.30 |     20.00 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
38

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: non-covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,493      1,141 |     3,634 
           |     79.75      80.07 |     79.85 
-----------+----------------------+----------
         1 |       633        284 |       917 
           |     20.25      19.93 |     20.15 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
28

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,478      1,162 |     3,640 
           |     79.27      81.54 |     79.98 
-----------+----------------------+----------
         1 |       648        263 |       911 
           |     20.73      18.46 |     20.02 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
32

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,492      1,127 |     3,619 
           |     79.72      79.09 |     79.52 
-----------+----------------------+----------
         1 |       634        298 |       932 
           |     20.28      20.91 |     20.48 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
25

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Calculated |         death
      eGFR |         0          1 |     Total
-----------+----------------------+----------
        30 |         6          0 |         6 
           |      0.20       0.00 |      0.14 
-----------+----------------------+----------
        45 |       130         50 |       180 
           |      4.36       3.71 |      4.16 
-----------+----------------------+----------
        60 |     2,843      1,297 |     4,140 
           |     95.43      96.29 |     95.70 
-----------+----------------------+----------
     Total |     2,979      1,347 |     4,326 
           |    100.00     100.00 |    100.00 
21

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 End-stage |  outcome: non-covid
     renal |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,999        953 |     2,952 
           |     63.95      66.88 |     64.86 
-----------+----------------------+----------
         1 |     1,127        472 |     1,599 
           |     36.05      33.12 |     35.14 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
40

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |     2,990      1,375 |     4,365 
                      |     95.65      96.49 |     95.91 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       136         50 |       186 
                      |      4.35       3.51 |      4.09 
----------------------+----------------------+----------
                Total |     3,126      1,425 |     4,551 
                      |    100.00     100.00 |    100.00 
29

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
 Diagnosed |  outcome: non-covid
hypertensi |         death
        on |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,538      1,156 |     3,694 
           |     81.19      81.12 |     81.17 
-----------+----------------------+----------
         1 |       588        269 |       857 
           |     18.81      18.88 |     18.83 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
33

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: non-covid
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,510      1,159 |     3,669 
           |     80.29      81.33 |     80.62 
-----------+----------------------+----------
         1 |       616        266 |       882 
           |     19.71      18.67 |     19.38 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: non-covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |     2,184      1,025 |     3,209 
                 |     69.87      71.93 |     70.51 
-----------------+----------------------+----------
               4 |       646        270 |       916 
                 |     20.67      18.95 |     20.13 
-----------------+----------------------+----------
 5 most deprived |       296        130 |       426 
                 |      9.47       9.12 |      9.36 
-----------------+----------------------+----------
           Total |     3,126      1,425 |     4,551 
                 |    100.00     100.00 |    100.00 
26

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: non-covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |     2,500      1,111 |     3,611 
                      |     79.97      77.96 |     79.35 
----------------------+----------------------+----------
Asian or Asian Britis |       296        160 |       456 
                      |      9.47      11.23 |     10.02 
----------------------+----------------------+----------
                Other |       330        154 |       484 
                      |     10.56      10.81 |     10.64 
----------------------+----------------------+----------
                Total |     3,126      1,425 |     4,551 
                      |    100.00     100.00 |    100.00 
20

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Sustainabi |
  lity and |   Failure/censoring
Transforma |     indicator for
      tion |  outcome: non-covid
Partnershi |         death
         p |         0          1 |     Total
-----------+----------------------+----------
         1 |       284        141 |       425 
           |      9.09       9.89 |      9.34 
-----------+----------------------+----------
         2 |       329        145 |       474 
           |     10.52      10.18 |     10.42 
-----------+----------------------+----------
         3 |       314        145 |       459 
           |     10.04      10.18 |     10.09 
-----------+----------------------+----------
         4 |       325        159 |       484 
           |     10.40      11.16 |     10.64 
-----------+----------------------+----------
         5 |       285        135 |       420 
           |      9.12       9.47 |      9.23 
-----------+----------------------+----------
         6 |       299        143 |       442 
           |      9.56      10.04 |      9.71 
-----------+----------------------+----------
         7 |       361        155 |       516 
           |     11.55      10.88 |     11.34 
-----------+----------------------+----------
         8 |       311        138 |       449 
           |      9.95       9.68 |      9.87 
-----------+----------------------+----------
         9 |       333        132 |       465 
           |     10.65       9.26 |     10.22 
-----------+----------------------+----------
        10 |       285        132 |       417 
           |      9.12       9.26 |      9.16 
-----------+----------------------+----------
     Total |     3,126      1,425 |     4,551 
           |    100.00     100.00 |    100.00 

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  /workspace/logs/04a_an_descriptive_tables.log
  log type:  text
 closed on:  28 Oct 2021, 11:16:25
-------------------------------------------------------------------------------
