-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04b_an_descriptive_table_2.log
  log type:  text
 opened on:  17 Aug 2021, 07:45:06

. 
. 
. *****************************************************************************
> **
. *Generic code to output one row of table
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string)
  2. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3. 
.         cou
  4.         local overalldenom=r(N)
  5. 
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  (" (") %3.1f (`colpct') (")"
> ) _tab
  9.         
.         foreach outcome in covid_tpp_prob  covidadmission  covid_icu covid_de
> ath non_covid_death {
 10.         cou if `outcome'==1 & `variable' `condition'
 11.         local pct = 100*(r(N)/`rowdenom')
 12.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab 
 13. 
. }
 14.         file write tablecontent _n 
 15. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] 
  2. 
.         foreach varlevel of numlist `start'/`end'{
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) 
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") 
  6. 
. end

. 
. *****************************************************************************
> **
. 
. 
. forvalues x=0/1 {
  2. 
. *Set up output file
. cap file close tablecontent
  3. file open tablecontent using ./output/04b_an_descriptive_table_2_ageband`x
> '.txt, write text replace
  4. 
. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) 
  7. file write tablecontent _n
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) 
  9. file write tablecontent _n
 10. 
. tabulatevariable, variable(male) start(0) end(1) 
 11. file write tablecontent _n
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing 
 13. file write tablecontent _n
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing 
 15. file write tablecontent _n
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing 
 17. file write tablecontent _n
 18. 
. tabulatevariable, variable(imd) start(1) end(5) 
 19. file write tablecontent _n
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) 
 21. file write tablecontent _n
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing 
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) 
 24. file write tablecontent _n
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) 
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1)  /*ever asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) 
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4)  /*<1, 1-4.9, 5+ 
> years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4)  /*<1, 1-4.9, 5
> + years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) 
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) 
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) 
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) 
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) 
 40. *ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) 
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) 
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) 
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) 
 44. 
. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(shield) start(1) end(1) 
 45. 
. file close tablecontent
 46. 
. }
(note: file ./output/04b_an_descriptive_table_2_ageband0.txt not found)
  16,149
  16,149
  13,396
  1,900
  11,292
  6,764
  4,502
  16,149
  4,031
  3,319
  495
  2,805
  1,693
  1,145
  16,149
  3,419
  2,865
  415
  2,404
  1,438
  962
  16,149
  3,488
  2,870
  389
  2,406
  1,451
  977
  16,149
  3,539
  2,949
  399
  2,483
  1,474
  962
  16,149
  1,672
  1,393
  202
  1,194
  708
  456
  16,149
  0
  0
  0
  0
  0
  0
  16,149
  0
  0
  0
  0
  0
  0
  16,149
  8,309
  6,853
  946
  5,800
  3,465
  2,360
  16,149
  7,840
  6,543
  954
  5,492
  3,299
  2,142
  16,149
  1,437
  1,200
  175
  1,010
  591
  433
  16,149
  3,654
  3,044
  413
  2,541
  1,503
  1,004
  16,149
  2,834
  2,347
  352
  2,009
  1,177
  794
  16,149
  2,250
  1,872
  281
  1,564
  934
  634
  16,149
  1,439
  1,206
  154
  991
  626
  394
  16,149
  962
  796
  95
  657
  417
  258
  16,149
  3,573
  2,931
  430
  2,520
  1,516
  985
  16,149
  643
  545
  72
  444
  273
  162
  16,149
  310
  260
  39
  211
  136
  84
  16,149
  1,905
  1,571
  222
  1,300
  810
  537
  16,149
  13,291
  11,020
  1,567
  9,337
  5,545
  3,719
  16,149
  12,937
  10,697
  1,523
  9,041
  5,429
  3,610
  16,149
  0
  0
  0
  0
  0
  0
  16,149
  1,556
  1,322
  190
  1,093
  665
  429
  16,149
  0
  0
  0
  0
  0
  0
  16,149
  1,656
  1,377
  187
  1,158
  670
  463
  16,149
  0
  0
  0
  0
  0
  0
  16,149
  11,253
  9,326
  1,334
  7,885
  4,717
  3,141
  16,149
  0
  0
  0
  0
  0
  0
  16,149
  0
  0
  0
  0
  0
  0
  16,149
  3,300
  2,750
  373
  2,306
  1,362
  918
  16,149
  1,596
  1,320
  193
  1,101
  685
  443
  16,149
  102
  85
  10
  71
  40
  28
  16,149
  98
  77
  6
  68
  49
  19
  16,149
  15,949
  13,234
  1,884
  11,153
  6,675
  4,455
  16,149
  3,680
  3,028
  406
  2,527
  1,523
  1,030
  16,149
  2,456
  2,051
  277
  1,731
  1,010
  689
  16,149
  5,845
  4,857
  718
  4,094
  2,473
  1,647
  16,149
  2,560
  2,127
  292
  1,803
  1,068
  691
  16,149
  1,608
  1,333
  207
  1,137
  690
  445
  16,149
  5,304
  4,405
  603
  3,713
  2,231
  1,442
  16,149
  3,221
  2,661
  377
  2,255
  1,346
  904
  16,149
  1,322
  1,092
  167
  943
  553
  375
  16,149
  3,181
  2,615
  396
  2,219
  1,360
  842
  16,149
  12,433
  10,318
  1,427
  8,715
  5,184
  3,473
  16,149
  406
  345
  51
  283
  182
  119
  16,149
  81
  69
  8
  56
  41
  20
  16,149
  2,629
  2,157
  335
  1,831
  1,112
  714
  16,149
  587
  494
  78
  397
  239
  174
  16,149
  13
  13
  1
  10
  6
  2
  16,149
  69
  56
  8
  52
  30
  19
  16,149
  250
  207
  25
  175
  93
  77
  16,149
  2,874
  2,391
  336
  2,021
  1,225
  774
  16,149
  71
  57
  5
  53
  27
  28
  16,149
  247
  207
  31
  170
  104
  68
  16,149
  2,812
  2,347
  332
  1,952
  1,173
  800
  16,149
  71
  56
  6
  51
  30
  25
  16,149
  0
  0
  0
  0
  0
  0
  16,149
  5,787
  4,800
  714
  4,076
  2,459
  1,613
  16,149
  3,187
  2,668
  355
  2,250
  1,352
  878
  16,149
  3,261
  2,708
  411
  2,243
  1,339
  919
  16,149
  3,162
  2,616
  409
  2,208
  1,333
  842
  16,149
  3,289
  2,746
  415
  2,304
  1,355
  956
  16,149
  3,260
  2,690
  410
  2,236
  1,381
  908
  16,149
  3,187
  2,703
  361
  2,204
  1,311
  899
  16,149
  3,181
  2,646
  389
  2,262
  1,348
  892
  16,149
  13,665
  11,326
  1,643
  9,591
  5,754
  3,824
(note: file ./output/04b_an_descriptive_table_2_ageband1.txt not found)
  4,505
  4,505
  3,737
  508
  3,091
  1,872
  1,236
  4,505
  0
  0
  0
  0
  0
  0
  4,505
  0
  0
  0
  0
  0
  0
  4,505
  0
  0
  0
  0
  0
  0
  4,505
  0
  0
  0
  0
  0
  0
  4,505
  1,038
  851
  117
  710
  459
  289
  4,505
  2,160
  1,799
  253
  1,475
  875
  596
  4,505
  1,307
  1,087
  138
  906
  538
  351
  4,505
  2,290
  1,916
  262
  1,576
  960
  605
  4,505
  2,215
  1,821
  246
  1,515
  912
  631
  4,505
  458
  387
  45
  306
  194
  121
  4,505
  1,046
  856
  115
  735
  442
  307
  4,505
  799
  666
  100
  543
  333
  204
  4,505
  643
  538
  69
  450
  281
  179
  4,505
  388
  318
  46
  271
  154
  103
  4,505
  247
  202
  27
  167
  101
  66
  4,505
  924
  770
  106
  619
  367
  256
  4,505
  198
  157
  24
  133
  86
  50
  4,505
  88
  76
  10
  63
  29
  25
  4,505
  502
  420
  65
  321
  193
  137
  4,505
  3,717
  3,084
  409
  2,574
  1,564
  1,024
  4,505
  3,599
  2,983
  397
  2,470
  1,493
  970
  4,505
  0
  0
  0
  0
  0
  0
  4,505
  465
  388
  63
  315
  193
  131
  4,505
  0
  0
  0
  0
  0
  0
  4,505
  441
  366
  48
  306
  186
  135
  4,505
  0
  0
  0
  0
  0
  0
  4,505
  3,120
  2,564
  347
  2,133
  1,294
  858
  4,505
  0
  0
  0
  0
  0
  0
  4,505
  0
  0
  0
  0
  0
  0
  4,505
  941
  790
  115
  645
  397
  253
  4,505
  444
  383
  46
  313
  181
  125
  4,505
  31
  27
  4
  21
  18
  6
  4,505
  18
  15
  3
  11
  7
  4
  4,505
  4,456
  3,695
  501
  3,059
  1,847
  1,226
  4,505
  1,019
  845
  121
  696
  441
  271
  4,505
  672
  567
  73
  475
  265
  197
  4,505
  1,625
  1,350
  181
  1,086
  698
  426
  4,505
  738
  595
  87
  509
  297
  217
  4,505
  451
  380
  46
  325
  171
  125
  4,505
  1,478
  1,207
  168
  1,021
  612
  414
  4,505
  920
  757
  96
  631
  374
  248
  4,505
  387
  318
  40
  259
  147
  113
  4,505
  905
  761
  105
  599
  385
  244
  4,505
  3,495
  2,902
  394
  2,400
  1,450
  974
  4,505
  87
  69
  12
  59
  41
  22
  4,505
  32
  29
  2
  24
  13
  9
  4,505
  730
  599
  82
  498
  300
  184
  4,505
  157
  135
  17
  107
  67
  47
  4,505
  4
  3
  1
  3
  1
  0
  4,505
  16
  15
  4
  9
  7
  4
  4,505
  71
  54
  3
  48
  23
  23
  4,505
  818
  678
  95
  587
  347
  213
  4,505
  19
  15
  3
  15
  7
  8
  4,505
  75
  63
  14
  45
  30
  23
  4,505
  798
  665
  80
  538
  352
  209
  4,505
  158
  139
  13
  110
  66
  40
  4,505
  0
  0
  0
  0
  0
  0
  4,505
  1,611
  1,333
  174
  1,099
  678
  450
  4,505
  935
  778
  115
  639
  398
  257
  4,505
  874
  717
  96
  595
  373
  233
  4,505
  951
  791
  106
  668
  391
  253
  4,505
  850
  709
  99
  568
  353
  227
  4,505
  914
  765
  101
  631
  384
  246
  4,505
  930
  759
  102
  641
  373
  265
  4,505
  926
  779
  114
  636
  368
  260
  4,505
  3,837
  3,182
  437
  2,626
  1,590
  1,050

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/04b_an_descriptive_table_2.log
  log type:  text
 closed on:  17 Aug 2021, 07:45:06
-------------------------------------------------------------------------------
