-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04b_an_descriptive_table_2.log
  log type:  text
 opened on:  28 Oct 2021, 11:17:05

. 
. 
. *****************************************************************************
> **
. *Generic code to output one row of table
. cap prog drop generaterow

. program define generaterow
  1. syntax, variable(varname) condition(string)
  2. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontent ("`variable'") _tab ("`condition'") _tab
  3. 
.         cou
  4.         local overalldenom=r(N)
  5. 
.         cou if `variable' `condition'
  6.         local rowdenom = r(N)
  7.         local colpct = 100*(r(N)/`overalldenom')
  8.         file write tablecontent (`rowdenom')  (" (") %3.1f (`colpct') (")"
> ) _tab
  9.         
.         foreach outcome in covid_tpp_prob  covidadmission  covid_icu covid_de
> ath non_covid_death {
 10.         cou if `outcome'==1 & `variable' `condition'
 11.         local pct = 100*(r(N)/`rowdenom')
 12.         file write tablecontent (r(N)) (" (") %4.2f  (`pct') (")") _tab 
 13. 
. }
 14.         file write tablecontent _n 
 15. end

. 
. *****************************************************************************
> **
. *Generic code to output one section (varible) within table (calls above)
. cap prog drop tabulatevariable

. prog define tabulatevariable
  1. syntax, variable(varname) start(real) end(real) [missing] 
  2. 
.         foreach varlevel of numlist `start'/`end'{
  3.                 generaterow, variable(`variable') condition("==`varlevel'"
> ) 
  4.         }
  5.         if "`missing'"!="" generaterow, variable(`variable') condition(">=
> .") 
  6. 
. end

. 
. *****************************************************************************
> **
. 
. 
. forvalues x=0/1 {
  2. 
. *Set up output file
. cap file close tablecontent
  3. file open tablecontent using ./output/04b_an_descriptive_table_2_ageband`x
> '.txt, write text replace
  4. 
. 
. use $tempdir/analysis_dataset_ageband_`x', clear
  5. 
. gen byte cons=1
  6. tabulatevariable, variable(cons) start(1) end(1) 
  7. file write tablecontent _n
  8. 
. tabulatevariable, variable(agegroup) start(1) end(7) 
  9. file write tablecontent _n
 10. 
. tabulatevariable, variable(male) start(0) end(1) 
 11. file write tablecontent _n
 12. 
. tabulatevariable, variable(bmicat) start(1) end(6) missing 
 13. file write tablecontent _n
 14. 
. tabulatevariable, variable(smoke) start(1) end(3) missing 
 15. file write tablecontent _n
 16. 
. tabulatevariable, variable(ethnicity) start(1) end(5) missing 
 17. file write tablecontent _n
 18. 
. tabulatevariable, variable(imd) start(1) end(5) 
 19. file write tablecontent _n
 20. 
. tabulatevariable, variable(tot_adults_hh) start(1) end(3) 
 21. file write tablecontent _n
 22. 
. tabulatevariable, variable(bpcat) start(1) end(4) missing 
 23. tabulatevariable, variable(htdiag_or_highbp) start(1) end(1) 
 24. file write tablecontent _n
 25. 
. **COMORBIDITIES
. *RESPIRATORY
. tabulatevariable, variable(chronic_respiratory_disease) start(1) end(1) 
 26. *ASTHMA
. tabulatevariable, variable(asthma) start(1) end(1)  /*ever asthma*/
 27. *CARDIAC
. tabulatevariable, variable(chronic_cardiac_disease) start(1) end(1) 
 28. file write tablecontent _n
 29. *DIABETES
. tabulatevariable, variable(diabcat) start(1) end(6) 
 30. file write tablecontent _n
 31. *CANCER EX HAEM
. tabulatevariable, variable(cancer_haem_cat) start(2) end(4)  /*<1, 1-4.9, 5+ 
> years ago*/
 32. file write tablecontent _n
 33. *CANCER HAEM
. tabulatevariable, variable(cancer_exhaem_cat) start(2) end(4)  /*<1, 1-4.9, 5
> + years ago*/
 34. file write tablecontent _n
 35. *REDUCED KIDNEY FUNCTION
. tabulatevariable, variable(reduced_kidney_function_cat) start(2) end(3) 
 36. *ESRD
. tabulatevariable, variable(esrd) start(1) end(1) 
 37. *LIVER
. tabulatevariable, variable(chronic_liver_disease) start(1) end(1) 
 38. *STROKE/DEMENTIA
. tabulatevariable, variable(stroke_dementia) start(1) end(1) 
 39. *OTHER NEURO
. tabulatevariable, variable(other_neuro) start(1) end(1) 
 40. *ORGAN TRANSPLANT
. tabulatevariable, variable(other_transplant) start(1) end(1) 
 41. *SPLEEN
. tabulatevariable, variable(asplenia) start(1) end(1) 
 42. *RA_SLE_PSORIASIS
. tabulatevariable, variable(ra_sle_psoriasis) start(1) end(1) 
 43. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(other_immuno) start(1) end(1) 
 44. 
. *OTHER IMMUNOSUPPRESSION
. tabulatevariable, variable(shield) start(1) end(1) 
 45. 
. file close tablecontent
 46. 
. }
(note: file ./output/04b_an_descriptive_table_2_ageband0.txt not found)
  16,082
  16,082
  15,176
  2,180
  12,646
  7,527
  5,080
  16,082
  4,017
  3,790
  542
  3,157
  1,941
  1,251
  16,082
  3,506
  3,295
  484
  2,775
  1,641
  1,095
  16,082
  3,312
  3,110
  422
  2,611
  1,496
  1,066
  16,082
  3,449
  3,279
  496
  2,709
  1,595
  1,094
  16,082
  1,798
  1,702
  236
  1,394
  854
  574
  16,082
  0
  0
  0
  0
  0
  0
  16,082
  0
  0
  0
  0
  0
  0
  16,082
  8,218
  7,790
  1,077
  6,456
  3,842
  2,566
  16,082
  7,864
  7,386
  1,103
  6,190
  3,685
  2,514
  16,082
  1,500
  1,412
  208
  1,178
  687
  496
  16,082
  3,572
  3,378
  494
  2,819
  1,707
  1,108
  16,082
  2,783
  2,641
  359
  2,173
  1,313
  889
  16,082
  2,181
  2,061
  315
  1,709
  1,004
  708
  16,082
  1,379
  1,301
  183
  1,099
  632
  434
  16,082
  893
  835
  115
  703
  447
  241
  16,082
  3,774
  3,548
  506
  2,965
  1,737
  1,204
  16,082
  646
  611
  96
  512
  304
  201
  16,082
  339
  323
  53
  268
  156
  111
  16,082
  1,947
  1,837
  237
  1,503
  929
  615
  16,082
  13,150
  12,405
  1,794
  10,363
  6,138
  4,153
  16,082
  12,953
  12,224
  1,788
  10,195
  6,069
  4,088
  16,082
  0
  0
  0
  0
  0
  0
  16,082
  1,549
  1,464
  186
  1,213
  732
  472
  16,082
  0
  0
  0
  0
  0
  0
  16,082
  1,580
  1,488
  206
  1,238
  726
  520
  16,082
  0
  0
  0
  0
  0
  0
  16,082
  11,298
  10,658
  1,545
  8,864
  5,245
  3,617
  16,082
  0
  0
  0
  0
  0
  0
  16,082
  0
  0
  0
  0
  0
  0
  16,082
  3,159
  2,977
  417
  2,504
  1,495
  958
  16,082
  1,625
  1,541
  218
  1,278
  787
  505
  16,082
  93
  90
  16
  74
  51
  28
  16,082
  111
  105
  25
  97
  51
  41
  16,082
  15,878
  14,981
  2,139
  12,475
  7,425
  5,011
  16,082
  3,628
  3,420
  500
  2,868
  1,705
  1,153
  16,082
  2,441
  2,296
  304
  1,900
  1,132
  770
  16,082
  5,859
  5,514
  796
  4,648
  2,773
  1,848
  16,082
  2,548
  2,436
  361
  1,971
  1,186
  793
  16,082
  1,606
  1,510
  219
  1,259
  731
  516
  16,082
  5,308
  5,023
  694
  4,156
  2,528
  1,661
  16,082
  3,221
  3,052
  426
  2,512
  1,496
  1,039
  16,082
  1,238
  1,173
  150
  958
  585
  388
  16,082
  3,194
  3,011
  414
  2,493
  1,513
  990
  16,082
  12,307
  11,598
  1,679
  9,649
  5,726
  3,903
  16,082
  414
  391
  65
  338
  187
  132
  16,082
  82
  75
  12
  65
  37
  31
  16,082
  2,651
  2,516
  336
  2,104
  1,268
  822
  16,082
  608
  576
  84
  473
  298
  186
  16,082
  20
  20
  4
  17
  11
  6
  16,082
  57
  53
  7
  44
  27
  15
  16,082
  254
  239
  38
  184
  125
  78
  16,082
  2,873
  2,707
  370
  2,269
  1,388
  890
  16,082
  42
  41
  7
  28
  19
  15
  16,082
  264
  255
  40
  196
  112
  82
  16,082
  2,830
  2,678
  361
  2,207
  1,327
  883
  16,082
  62
  60
  5
  49
  30
  22
  16,082
  0
  0
  0
  0
  0
  0
  16,082
  5,762
  5,460
  770
  4,531
  2,675
  1,788
  16,082
  3,199
  3,016
  440
  2,517
  1,487
  1,016
  16,082
  3,172
  2,998
  396
  2,476
  1,438
  1,018
  16,082
  3,232
  3,051
  429
  2,567
  1,519
  1,037
  16,082
  3,277
  3,107
  442
  2,590
  1,532
  1,076
  16,082
  3,272
  3,082
  454
  2,572
  1,536
  1,020
  16,082
  3,266
  3,082
  451
  2,542
  1,539
  1,012
  16,082
  3,171
  3,003
  415
  2,482
  1,536
  992
  16,082
  13,611
  12,850
  1,829
  10,693
  6,356
  4,298
(note: file ./output/04b_an_descriptive_table_2_ageband1.txt not found)
  4,551
  4,551
  4,292
  621
  3,547
  2,168
  1,425
  4,551
  0
  0
  0
  0
  0
  0
  4,551
  0
  0
  0
  0
  0
  0
  4,551
  0
  0
  0
  0
  0
  0
  4,551
  0
  0
  0
  0
  0
  0
  4,551
  1,092
  1,029
  162
  855
  522
  340
  4,551
  2,249
  2,122
  309
  1,743
  1,088
  679
  4,551
  1,210
  1,141
  150
  949
  558
  406
  4,551
  2,349
  2,202
  333
  1,821
  1,127
  725
  4,551
  2,202
  2,090
  288
  1,726
  1,041
  700
  4,551
  450
  424
  55
  346
  207
  149
  4,551
  1,029
  967
  136
  803
  499
  324
  4,551
  807
  767
  128
  623
  391
  241
  4,551
  687
  652
  89
  537
  317
  221
  4,551
  389
  368
  45
  306
  191
  112
  4,551
  240
  230
  43
  193
  107
  75
  4,551
  949
  884
  125
  739
  456
  303
  4,551
  190
  181
  19
  154
  90
  57
  4,551
  87
  79
  18
  70
  49
  18
  4,551
  551
  517
  67
  430
  268
  180
  4,551
  3,723
  3,515
  517
  2,893
  1,761
  1,170
  4,551
  3,611
  3,400
  495
  2,809
  1,734
  1,111
  4,551
  0
  0
  0
  0
  0
  0
  4,551
  456
  441
  58
  375
  216
  160
  4,551
  0
  0
  0
  0
  0
  0
  4,551
  484
  451
  68
  363
  218
  154
  4,551
  0
  0
  0
  0
  0
  0
  4,551
  3,209
  3,022
  449
  2,501
  1,528
  1,025
  4,551
  0
  0
  0
  0
  0
  0
  4,551
  0
  0
  0
  0
  0
  0
  4,551
  916
  860
  118
  721
  439
  270
  4,551
  426
  410
  54
  325
  201
  130
  4,551
  33
  30
  4
  21
  18
  10
  4,551
  25
  25
  5
  18
  12
  7
  4,551
  4,493
  4,237
  612
  3,508
  2,138
  1,408
  4,551
  950
  901
  127
  743
  472
  296
  4,551
  725
  677
  86
  572
  340
  235
  4,551
  1,701
  1,606
  251
  1,333
  800
  524
  4,551
  715
  676
  98
  546
  359
  209
  4,551
  460
  432
  59
  353
  197
  161
  4,551
  1,454
  1,372
  187
  1,127
  705
  443
  4,551
  931
  874
  118
  726
  446
  282
  4,551
  382
  362
  62
  305
  181
  128
  4,551
  932
  881
  154
  734
  427
  307
  4,551
  3,490
  3,287
  478
  2,720
  1,677
  1,079
  4,551
  127
  124
  17
  101
  66
  39
  4,551
  26
  21
  0
  22
  15
  6
  4,551
  724
  686
  101
  564
  322
  239
  4,551
  180
  170
  25
  136
  87
  61
  4,551
  4
  4
  0
  4
  1
  1
  4,551
  25
  25
  3
  20
  12
  6
  4,551
  69
  63
  7
  52
  35
  24
  4,551
  790
  740
  114
  608
  397
  226
  4,551
  24
  24
  4
  14
  15
  6
  4,551
  68
  65
  8
  56
  30
  19
  4,551
  806
  754
  103
  633
  407
  244
  4,551
  186
  178
  24
  147
  101
  50
  4,551
  0
  0
  0
  0
  0
  0
  4,551
  1,599
  1,499
  217
  1,226
  784
  472
  4,551
  917
  865
  111
  704
  444
  284
  4,551
  932
  890
  122
  721
  429
  298
  4,551
  911
  859
  127
  723
  466
  263
  4,551
  925
  874
  118
  720
  458
  275
  4,551
  910
  856
  116
  720
  441
  275
  4,551
  882
  831
  122
  695
  429
  266
  4,551
  940
  884
  123
  711
  442
  321
  4,551
  3,828
  3,602
  524
  2,977
  1,851
  1,184

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/04b_an_descriptive_table_2.log
  log type:  text
 closed on:  28 Oct 2021, 11:17:07
-------------------------------------------------------------------------------
