-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_tpp_prob.log
  log type:  text
 opened on:  25 Jul 2021, 08:11:06

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. forvalues period=0/3 {
  3. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  4. stsplit cat_time, at(0,78,147,400)
  5. recode cat_time 78=1 147=2 400=3
  6. recode `outcome' .=0 
  7. tab cat_time
  8. tab cat_time `outcome'
  9. 
. keep if cat_time==`period'
 10. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 11. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 12. if _rc==0{
 13. estimates
 14. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 15.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals 
.         timer clear 
 16.         timer on 1
 17.         if e(N_fail)>0 estat phtest, d
 18.         timer off 1
 19.         timer list 
 20.         
. }
 21. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 22. 
. }
 23. 
. foreach exposure_type in  gp_number_kids {
 24. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_FULL
> YADJMODEL_ageband_`x'"
 25. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 26. if _rc==0{
 27. estimates
 28. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 29. }
 30. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 31. 
. }
 32. }
 33. }
(9,854 observations (episodes) created)
(cat_time: 9854 changes made)
(covid_tpp_prob: 9854 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       61.89       61.89
          1 |      7,379       28.54       90.43
          2 |      2,475        9.57      100.00
------------+-----------------------------------
      Total |     25,859      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,706      8,299 |    16,005 
         1 |     2,755      4,624 |     7,379 
         2 |       491      1,984 |     2,475 
-----------+----------------------+----------
     Total |    10,952     14,907 |    25,859 
(9,856 observations deleted)
   1:      5.75 /        1 =       5.7550

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,005             Number of obs    =      16,005
No. of failures      =        8,299
Time at risk         =       895768
                                                Wald chi2(42)    =       31.68
Log pseudolikelihood =   -58464.926             Prob > chi2      =      0.8769

                       (Std. Err. adjusted for 1,113 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.110907    .108124     1.08   0.280     .9179748    1.344388
 only 12-18  |   1.126077   .1297319     1.03   0.303     .8984705    1.411343
      mixed  |   1.123496   .1035994     1.26   0.207     .9377368    1.346053
             |
        age1 |   .9949398   .0039994    -1.26   0.207     .9871319     1.00281
        age2 |   1.016209     .01291     1.27   0.206     .9912182     1.04183
        age3 |   .9598145   .0350475    -1.12   0.261     .8935231    1.031024
      1.male |   .9827235   .0215013    -0.80   0.426     .9414725    1.025782
             |
   obese4cat |
Obese I ..)  |   .9437696   .0314718    -1.74   0.083     .8840586    1.007514
Obese II..)  |    .993853   .0395798    -0.15   0.877     .9192283    1.074536
Obese II..)  |    .953184    .046811    -0.98   0.329     .8657134    1.049492
             |
smoke_nomiss |
     Former  |   .9535588   .0795559    -0.57   0.569     .8097133    1.122958
    Current  |   .9501774   .0304396    -1.60   0.111     .8923513    1.011751
             |
         imd |
          4  |   1.025831   .0284223     0.92   0.357     .9716098    1.083078
5 most de..  |   .9556832   .0340929    -1.27   0.204     .8911448    1.024895
             |
tot_adults~h |
          2  |   1.347668   .2907068     1.38   0.167     .8830174     2.05682
          3  |   1.294244   .2296554     1.45   0.146     .9140626    1.832553
             |
   ethnicity |
Asian or ..  |   1.041127   .0384063     1.09   0.275     .9685094     1.11919
      Other  |   .9935928   .0371551    -0.17   0.864     .9233748    1.069151
             |
1.htdiag_o~p |    .978021   .0420533    -0.52   0.605     .8989756    1.064017
1.~y_disease |   .9874955   .0264885    -0.47   0.639     .9369201    1.040801
    1.asthma |    1.02966   .0384941     0.78   0.434     .9569104     1.10794
1.~c_disease |   1.001796   .0269723     0.07   0.947     .9503016     1.05608
             |
     diabcat |
T1DM, con..  |   1.023456   .0661609     0.36   0.720     .9016615    1.161702
T1DM, unc..  |   1.045368   .1640477     0.28   0.777     .7685844    1.421827
T2DM, con..  |   1.002109    .031509     0.07   0.947     .9422167    1.065808
T2DM, unc..  |   .9236093    .059782    -1.23   0.220     .8135663    1.048537
Diabetes,..  |   .9379403   .4167249    -0.14   0.885     .3926342    2.240589
             |
cancer_exh~t |
  Last year  |   .9072931   .1805193    -0.49   0.625     .6143114    1.340006
2-5 years..  |   1.112139   .0863372     1.37   0.171     .9551657    1.294908
   5+ years  |   1.016443   .0292959     0.57   0.571     .9606153    1.075514
             |
cancer_hae~t |
  Last year  |    1.17192   .1800691     1.03   0.302     .8671778    1.583754
2-5 years..  |   .9376257   .0923748    -0.65   0.513     .7729816    1.137339
   5+ years  |   .9876784   .0285401    -0.43   0.668     .9332954     1.04523
             |
1.~r_disease |   .9864607   .0260285    -0.52   0.605     .9367425    1.038818
1.stroke_d~a |   .9919896   .0272681    -0.29   0.770     .9399594      1.0469
1.other_ne~o |   .9828752   .0265686    -0.64   0.523     .9321572    1.036353
             |
reduced_ki~t |
Stage 3a/..  |   .7312842   .1439895    -1.59   0.112     .4971472    1.075691
      1.esrd |   1.003253   .0225079     0.14   0.885     .9600939    1.048352
1.other_tr~t |   .9786734   .0276828    -0.76   0.446     .9258927    1.034463
  1.asplenia |    1.02435    .027446     0.90   0.369     .9719449    1.079581
1.ra_sle_p~s |    .986517   .0267495    -0.50   0.617     .9354578    1.040363
1.other_im~o |    1.01136   .0263193     0.43   0.664     .9610688    1.064283
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.02394         5.83        1         0.0157
      2.kids_cat4 |      0.01377         1.68        1         0.1948
      3.kids_cat4 |      0.01997         4.14        1         0.0419
      age1        |     -0.00359         0.11        1         0.7410
      age2        |      0.00238         0.05        1         0.8253
      age3        |     -0.00051         0.00        1         0.9618
      0b.male     |            .            .        1             .
      1.male      |     -0.02031         3.56        1         0.0593
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00252         0.06        1         0.8104
      3.obese4cat |      0.00903         0.72        1         0.3952
      4.obese4cat |      0.00236         0.05        1         0.8243
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01204         1.31        1         0.2518
      3.smoke_no~s|      0.00350         0.10        1         0.7573
      1b.imd      |            .            .        1             .
      4.imd       |      0.00488         0.21        1         0.6458
      5.imd       |      0.00504         0.20        1         0.6574
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.02894         7.03        1         0.0080
      3.tot_adul~h|     -0.02766         6.14        1         0.0132
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.00582         0.29        1         0.5874
      5.ethnicity |     -0.00111         0.01        1         0.9164
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.00050         0.00        1         0.9607
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.01798         2.78        1         0.0957
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.01537         1.86        1         0.1726
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00156         0.02        1         0.8866
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.00175         0.02        1         0.8778
      3.diabcat   |     -0.00370         0.12        1         0.7243
      4.diabcat   |      0.00088         0.01        1         0.9314
      5.diabcat   |     -0.02445         5.57        1         0.0183
      6.diabcat   |      0.00237         0.05        1         0.8259
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.01591         2.43        1         0.1187
      3.cancer_e~t|      0.02458         4.74        1         0.0295
      4.cancer_e~t|     -0.00105         0.01        1         0.9222
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.01177         0.95        1         0.3308
      3.cancer_h~t|     -0.00344         0.11        1         0.7385
      4.cancer_h~t|      0.00434         0.16        1         0.6864
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.00840         0.57        1         0.4516
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00494         0.21        1         0.6474
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.01463         1.81        1         0.1780
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.00321         0.10        1         0.7574
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00066         0.00        1         0.9515
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.01267         1.46        1         0.2264
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.01153         1.13        1         0.2876
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.02398         4.85        1         0.0276
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00928         0.70        1         0.4033
      ------------+---------------------------------------------------
      global test |                     46.14       42         0.3049
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:     11.86 /        1 =      11.8630
   1:      2.26 /        1 =       2.2600

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,561             Number of obs    =       1,561
No. of failures      =          807
Time at risk         =        87873
                                                Wald chi2(41)    =     1676.65
Log pseudolikelihood =   -3780.0131             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 199 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.156835   .1248949     1.35   0.177     .9362104    1.429451
3 childre..  |   .9484771   .1198001    -0.42   0.675     .7404801    1.214899
4+ childr..  |     1.0942   .1037356     0.95   0.342     .9086536    1.317634
             |
        age1 |   .9736536    .011704    -2.22   0.026     .9509824    .9968653
        age2 |   1.106076   .0436645     2.55   0.011     1.023722    1.195055
        age3 |   .7541148   .0855741    -2.49   0.013     .6037349    .9419517
      1.male |   .9329864   .0733634    -0.88   0.378     .7997291    1.088448
             |
   obese4cat |
Obese I ..)  |   1.078202   .1178966     0.69   0.491     .8702117    1.335904
Obese II..)  |    1.22756   .1359698     1.85   0.064     .9880073    1.525196
Obese II..)  |   .9015728   .1471633    -0.63   0.526      .654726    1.241487
             |
smoke_nomiss |
     Former  |   1.043606   .3028518     0.15   0.883     .5909086    1.843118
    Current  |    .859355   .0954639    -1.36   0.172     .6912171    1.068392
             |
         imd |
          4  |   1.311402   .1228663     2.89   0.004     1.091405    1.575744
5 most de..  |   .9799133    .115793    -0.17   0.864     .7773276    1.235296
             |
tot_adults~h |
          2  |    2.52607   1.441491     1.62   0.104     .8254888    7.730004
          3  |   1.674725    .879068     0.98   0.326     .5986121    4.685346
             |
   ethnicity |
Asian or ..  |   1.090325   .1300201     0.73   0.468     .8630796    1.377402
      Other  |    1.00819   .1114192     0.07   0.941     .8118436    1.252022
             |
1.htdiag_o~p |   1.049303   .1477169     0.34   0.732     .7962918    1.382706
1.~y_disease |   1.058317     .08661     0.69   0.489     .9014788    1.242441
    1.asthma |   1.198546   .1542293     1.41   0.159      .931369    1.542366
1.~c_disease |   .8376402   .0734692    -2.02   0.043     .7053406     .994755
             |
     diabcat |
T1DM, con..  |   .8935824   .1928356    -0.52   0.602     .5853894    1.364032
T1DM, unc..  |   .3636853   .3252874    -1.13   0.258     .0630078    2.099217
T2DM, con..  |   .9672673   .0968551    -0.33   0.740     .7949015    1.177009
T2DM, unc..  |   1.015852   .2125778     0.08   0.940     .6740735    1.530923
             |
cancer_exh~t |
  Last year  |   1.394207   .7562153     0.61   0.540      .481545    4.036616
2-5 years..  |   1.804377    .353918     3.01   0.003     1.228483    2.650242
   5+ years  |   1.036085   .1036134     0.35   0.723     .8516693    1.260432
             |
cancer_hae~t |
  Last year  |   1.71e-16   1.75e-16   -35.41   0.000     2.29e-17    1.27e-15
2-5 years..  |   1.310467   .3994491     0.89   0.375     .7210534    2.381686
   5+ years  |   .9228973   .0823631    -0.90   0.369     .7747983    1.099305
             |
1.~r_disease |   1.083994   .0987877     0.88   0.376     .9066802    1.295983
1.stroke_d~a |   .9706675   .0938333    -0.31   0.758     .8031299    1.173154
1.other_ne~o |   1.050816   .0873496     0.60   0.551     .8928328    1.236754
             |
reduced_ki~t |
Stage 3a/..  |   .2087649   .2006066    -1.63   0.103     .0317482    1.372762
      1.esrd |   1.081142   .0842532     1.00   0.317     .9280014    1.259554
1.other_tr~t |   .9889244   .0949667    -0.12   0.908     .8192605    1.193725
  1.asplenia |   .9334674   .0982308    -0.65   0.513     .7594958    1.147289
1.ra_sle_p~s |   1.052865   .0947357     0.57   0.567     .8826381    1.255923
1.other_im~o |   .9779151   .0876719    -0.25   0.803     .8203313     1.16577
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_F
> ULLYADJMODEL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_FULLYADJ
> MODEL_ageband_0_timeperiod0.ster saved
(9,854 observations (episodes) created)
(cat_time: 9854 changes made)
(covid_tpp_prob: 9854 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       61.89       61.89
          1 |      7,379       28.54       90.43
          2 |      2,475        9.57      100.00
------------+-----------------------------------
      Total |     25,859      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,706      8,299 |    16,005 
         1 |     2,755      4,624 |     7,379 
         2 |       491      1,984 |     2,475 
-----------+----------------------+----------
     Total |    10,952     14,907 |    25,859 
(18,482 observations deleted)
   1:      2.99 /        1 =       2.9910

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        7,379             Number of obs    =       7,379
No. of failures      =        4,624
Time at risk         =       329189
                                                Wald chi2(42)    =       41.28
Log pseudolikelihood =   -28492.944             Prob > chi2      =      0.5022

                       (Std. Err. adjusted for 1,004 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.179868   .1275092     1.53   0.126     .9546482    1.458221
 only 12-18  |   1.060008   .1557965     0.40   0.692     .7946987    1.413892
      mixed  |   1.022992   .1042368     0.22   0.823     .8377992    1.249121
             |
        age1 |   1.011589   .0057501     2.03   0.043     1.000382    1.022922
        age2 |   .9716697   .0172376    -1.62   0.105     .9384652    1.006049
        age3 |   1.075452   .0546572     1.43   0.152     .9734881    1.188095
      1.male |     1.0291   .0302684     0.98   0.329     .9714529    1.090168
             |
   obese4cat |
Obese I ..)  |   1.003838   .0414745     0.09   0.926     .9257534    1.088508
Obese II..)  |   1.022954   .0516368     0.45   0.653     .9265932    1.129336
Obese II..)  |   1.050875    .067398     0.77   0.439     .9267427    1.191635
             |
smoke_nomiss |
     Former  |   1.005651   .0973355     0.06   0.954       .83188    1.215721
    Current  |   1.066773   .0462371     1.49   0.136     .9798927    1.161357
             |
         imd |
          4  |   .9465724    .035203    -1.48   0.140     .8800304    1.018146
5 most de..  |   1.008074   .0497512     0.16   0.871     .9151308    1.110456
             |
tot_adults~h |
          2  |   .7994507   .1993039    -0.90   0.369     .4904405    1.303158
          3  |   .8137556   .1701074    -0.99   0.324     .5402055    1.225827
             |
   ethnicity |
Asian or ..  |    .930517   .0523799    -1.28   0.201      .833315    1.039057
      Other  |   1.018716   .0509491     0.37   0.711      .923596    1.123633
             |
1.htdiag_o~p |   1.028256   .0579777     0.49   0.621     .9206753    1.148407
1.~y_disease |   .9980627   .0370111    -0.05   0.958     .9280957    1.073304
    1.asthma |   .8816139   .0542009    -2.05   0.040      .781533     .994511
1.~c_disease |   1.014307   .0375229     0.38   0.701     .9433668    1.090583
             |
     diabcat |
T1DM, con..  |   1.019735   .0961021     0.21   0.836     .8477505     1.22661
T1DM, unc..  |   1.061779   .2082175     0.31   0.760      .722955    1.559398
T2DM, con..  |   1.058546   .0423198     1.42   0.155     .9787668    1.144827
T2DM, unc..  |    .905495   .0714773    -1.26   0.209     .7757013    1.057006
Diabetes,..  |   1.072625   .7444583     0.10   0.920     .2752134    4.180484
             |
cancer_exh~t |
  Last year  |   .9207947   .1977921    -0.38   0.701     .6043934    1.402833
2-5 years..  |   .8966997   .1144438    -0.85   0.393     .6982485    1.151553
   5+ years  |    .945711   .0365014    -1.45   0.148     .8768086    1.020028
             |
cancer_hae~t |
  Last year  |   .9695272   .2450093    -0.12   0.903     .5908168    1.590989
2-5 years..  |   1.040096    .126958     0.32   0.747     .8187898    1.321217
   5+ years  |   1.061658   .0395856     1.60   0.109     .9868388    1.142149
             |
1.~r_disease |   .9672235   .0342419    -0.94   0.347      .902386     1.03672
1.stroke_d~a |   1.001323   .0389742     0.03   0.973     .9277758      1.0807
1.other_ne~o |   1.024385   .0378912     0.65   0.515      .952748    1.101409
             |
reduced_ki~t |
Stage 3a/..  |   1.212012   .2467404     0.94   0.345     .8132425    1.806316
      1.esrd |   .9811782    .029856    -0.62   0.532     .9243723    1.041475
1.other_tr~t |   .9882882    .035165    -0.33   0.741     .9217144     1.05967
  1.asplenia |   .9987883   .0373865    -0.03   0.974     .9281355    1.074819
1.ra_sle_p~s |   .9722025   .0367676    -0.75   0.456     .9027454    1.047004
1.other_im~o |   .9908311   .0345784    -0.26   0.792     .9253245    1.060975
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.02530         2.99        1         0.0838
      2.kids_cat4 |      0.02940         4.13        1         0.0420
      3.kids_cat4 |      0.02262         2.42        1         0.1197
      age1        |      0.01096         0.62        1         0.4305
      age2        |     -0.00901         0.42        1         0.5180
      age3        |      0.00821         0.35        1         0.5545
      0b.male     |            .            .        1             .
      1.male      |      0.00414         0.09        1         0.7696
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.01638         1.25        1         0.2640
      3.obese4cat |      0.01585         1.09        1         0.2955
      4.obese4cat |     -0.01187         0.68        1         0.4087
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.01851         1.39        1         0.2384
      3.smoke_no~s|     -0.00536         0.13        1         0.7139
      1b.imd      |            .            .        1             .
      4.imd       |     -0.00177         0.02        1         0.9024
      5.imd       |      0.00340         0.06        1         0.8098
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.01271         0.73        1         0.3917
      3.tot_adul~h|     -0.00108         0.01        1         0.9395
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.03647         7.57        1         0.0059
      5.ethnicity |     -0.01991         2.00        1         0.1571
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.03092         4.85        1         0.0276
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.02225         2.46        1         0.1168
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01735         1.70        1         0.1929
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00597         0.18        1         0.6728
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01445         1.02        1         0.3125
      3.diabcat   |      0.00830         0.30        1         0.5813
      4.diabcat   |     -0.01522         1.15        1         0.2844
      5.diabcat   |      0.00502         0.12        1         0.7310
      6.diabcat   |     -0.01244         1.09        1         0.2954
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00680         0.20        1         0.6511
      3.cancer_e~t|      0.00645         0.21        1         0.6500
      4.cancer_e~t|      0.00728         0.25        1         0.6202
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.01464         0.91        1         0.3390
      3.cancer_h~t|     -0.01372         0.98        1         0.3233
      4.cancer_h~t|     -0.02559         3.05        1         0.0806
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.00277         0.03        1         0.8547
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.02189         2.57        1         0.1090
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.01740         1.49        1         0.2219
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.00631         0.19        1         0.6617
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.02716         3.47        1         0.0624
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.02894         3.79        1         0.0515
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00807         0.33        1         0.5656
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00655         0.22        1         0.6427
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00628         0.17        1         0.6799
      ------------+---------------------------------------------------
      global test |                     48.60       42         0.2245
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      4.67 /        1 =       4.6710
   1:      1.27 /        1 =       1.2710

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          712             Number of obs    =         712
No. of failures      =          480
Time at risk         =        30246
                                                Wald chi2(41)    =     1895.31
Log pseudolikelihood =   -1796.5514             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 173 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .9595525   .1286598    -0.31   0.758     .7377972    1.247959
3 childre..  |   1.008994   .1527017     0.06   0.953       .75001    1.357406
4+ childr..  |   1.069312   .1192975     0.60   0.548     .8592911    1.330664
             |
        age1 |   1.023055   .0190878     1.22   0.222     .9863192    1.061159
        age2 |   .9697324   .0561645    -0.53   0.596     .8656701    1.086304
        age3 |   1.065177   .1753548     0.38   0.701     .7714231     1.47079
      1.male |   .9493621   .0929023    -0.53   0.595     .7836739    1.150081
             |
   obese4cat |
Obese I ..)  |    1.12148   .1657654     0.78   0.438     .8394137    1.498329
Obese II..)  |   .8448756   .1753886    -0.81   0.417     .5624592    1.269096
Obese II..)  |   1.118751   .2547369     0.49   0.622     .7160062    1.748034
             |
smoke_nomiss |
     Former  |   .9215067   .3761521    -0.20   0.841      .414042    2.050938
    Current  |   1.175494   .1480133     1.28   0.199      .918419    1.504528
             |
         imd |
          4  |   .8427743   .0999663    -1.44   0.149     .6679522    1.063352
5 most de..  |   .9531826   .1389224    -0.33   0.742     .7163364    1.268339
             |
tot_adults~h |
          2  |    .408132   .2216691    -1.65   0.099     .1407624    1.183354
          3  |   .3089214   .1458271    -2.49   0.013     .1224718    .7792193
             |
   ethnicity |
Asian or ..  |   .6690672   .1438988    -1.87   0.062     .4389334    1.019861
      Other  |   1.144934   .1779172     0.87   0.384     .8443218    1.552577
             |
1.htdiag_o~p |   1.092756   .1780721     0.54   0.586     .7939878    1.503946
1.~y_disease |   1.282617   .1605979     1.99   0.047       1.0035     1.63937
    1.asthma |   .6680819   .1605399    -1.68   0.093     .4171442    1.069974
1.~c_disease |   .9269684   .0986741    -0.71   0.476     .7524126     1.14202
             |
     diabcat |
T1DM, con..  |   1.154318   .2566684     0.65   0.519     .7465459     1.78482
T1DM, unc..  |    .349498   .2739634    -1.34   0.180     .0751982    1.624359
T2DM, con..  |   .9321382   .1379571    -0.47   0.635      .697432     1.24583
T2DM, unc..  |   .8522647   .2277449    -0.60   0.550     .5047934    1.438916
             |
cancer_exh~t |
  Last year  |   1.236502   .2088584     1.26   0.209     .8880097    1.721757
2-5 years..  |   .9263141   .3363229    -0.21   0.833     .4546812    1.887164
   5+ years  |   1.016814   .1222183     0.14   0.890     .8033953    1.286926
             |
cancer_hae~t |
  Last year  |   1.72e-15   1.85e-15   -31.52   0.000     2.07e-16    1.42e-14
2-5 years..  |    1.97952   .6680779     2.02   0.043     1.021607    3.835624
   5+ years  |    1.24604   .1548373     1.77   0.077     .9766948    1.589664
             |
1.~r_disease |   1.062124   .1267874     0.50   0.614      .840555    1.342099
1.stroke_d~a |   .9389339    .119702    -0.49   0.621     .7313373    1.205459
1.other_ne~o |   .8620288   .1107756    -1.16   0.248     .6700968    1.108935
             |
reduced_ki~t |
Stage 3a/..  |    3.30345   1.804582     2.19   0.029     1.132349    9.637295
      1.esrd |   .8457836   .0759357    -1.87   0.062     .7093118    1.008513
1.other_tr~t |   1.044676   .1190539     0.38   0.701     .8355583    1.306131
  1.asplenia |   .9320634   .1282637    -0.51   0.609     .7117202    1.220623
1.ra_sle_p~s |   .9771074   .1184005    -0.19   0.848     .7705456    1.239043
1.other_im~o |   .8352614   .1077578    -1.40   0.163     .6486467    1.075565
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_F
> ULLYADJMODEL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_FULLYADJ
> MODEL_ageband_0_timeperiod1.ster saved
(9,854 observations (episodes) created)
(cat_time: 9854 changes made)
(covid_tpp_prob: 9854 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       61.89       61.89
          1 |      7,379       28.54       90.43
          2 |      2,475        9.57      100.00
------------+-----------------------------------
      Total |     25,859      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,706      8,299 |    16,005 
         1 |     2,755      4,624 |     7,379 
         2 |       491      1,984 |     2,475 
-----------+----------------------+----------
     Total |    10,952     14,907 |    25,859 
(23,386 observations deleted)
   1:      1.03 /        1 =       1.0350

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,475             Number of obs    =       2,475
No. of failures      =        1,984
Time at risk         =        73483
                                                Wald chi2(42)    =       67.65
Log pseudolikelihood =   -9501.9662             Prob > chi2      =      0.0073

                         (Std. Err. adjusted for 775 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8905673     .17093    -0.60   0.546     .6113534    1.297302
 only 12-18  |   1.017184   .2558476     0.07   0.946     .6212992    1.665322
      mixed  |   .9595431   .1713806    -0.23   0.817     .6761365    1.361741
             |
        age1 |   1.005894   .0082063     0.72   0.471     .9899375    1.022107
        age2 |   .9847204   .0261058    -0.58   0.561     .9348606    1.037239
        age3 |   1.049599   .0804326     0.63   0.528     .9032212    1.219698
      1.male |   .9798621    .044481    -0.45   0.654     .8964469    1.071039
             |
   obese4cat |
Obese I ..)  |   1.000461   .0674272     0.01   0.995     .8766628    1.141742
Obese II..)  |   .9899806   .0762269    -0.13   0.896     .8513057    1.151245
Obese II..)  |     1.1472   .1063832     1.48   0.139     .9565432    1.375857
             |
smoke_nomiss |
     Former  |   1.053406   .1656517     0.33   0.741     .7740005    1.433673
    Current  |   1.082303   .0698914     1.22   0.221     .9536332    1.228335
             |
         imd |
          4  |   1.020926   .0556451     0.38   0.704     .9174874    1.136027
5 most de..  |    1.07215   .0799311     0.93   0.350     .9263964    1.240837
             |
tot_adults~h |
          2  |   .8003014   .2895879    -0.62   0.538     .3937745    1.626521
          3  |   .9273045   .2421991    -0.29   0.773     .5557767    1.547193
             |
   ethnicity |
Asian or ..  |    1.04523   .0752404     0.61   0.539     .9076917    1.203608
      Other  |   1.088757   .0839629     1.10   0.270     .9360261    1.266409
             |
1.htdiag_o~p |   1.123453   .0867007     1.51   0.131     .9657505    1.306909
1.~y_disease |   1.022801   .0554873     0.42   0.678     .9196304    1.137547
    1.asthma |   .8807467    .067521    -1.66   0.098     .7578705    1.023545
1.~c_disease |   .9754549   .0537236    -0.45   0.652     .8756427    1.086644
             |
     diabcat |
T1DM, con..  |    .832683   .1101341    -1.38   0.166     .6425343    1.079104
T1DM, unc..  |   .7545638   .2392786    -0.89   0.375     .4052964    1.404815
T2DM, con..  |   .9590448   .0602259    -0.67   0.505     .8479793    1.084657
T2DM, unc..  |   .8735629    .105442    -1.12   0.263     .6895271    1.106718
Diabetes,..  |   .4003635   .4851597    -0.76   0.450     .0372366    4.304661
             |
cancer_exh~t |
  Last year  |   .5732245   .1538735    -2.07   0.038     .3387135    .9701011
2-5 years..  |   .9335639   .1749718    -0.37   0.714       .64656    1.347967
   5+ years  |   1.134715   .0661855     2.17   0.030     1.012134    1.272142
             |
cancer_hae~t |
  Last year  |   .8650781   .2690924    -0.47   0.641     .4701965     1.59159
2-5 years..  |   .8952087   .1535145    -0.65   0.519     .6396706     1.25283
   5+ years  |   .9731656   .0594213    -0.45   0.656     .8634009    1.096885
             |
1.~r_disease |    .930485   .0480967    -1.39   0.163      .840835    1.029693
1.stroke_d~a |   1.182859   .0646572     3.07   0.002     1.062685    1.316622
1.other_ne~o |   1.044029   .0591243     0.76   0.447     .9343475    1.166587
             |
reduced_ki~t |
Stage 3a/..  |   .7101299   .2834967    -0.86   0.391     .3247302    1.552934
      1.esrd |   .8795812   .0404035    -2.79   0.005     .8038519    .9624448
1.other_tr~t |    1.05593   .0615738     0.93   0.351      .941889     1.18378
  1.asplenia |   1.084349   .0607461     1.45   0.148     .9715925    1.210192
1.ra_sle_p~s |   .9459977    .053914    -0.97   0.330     .8460162    1.057795
1.other_im~o |   .8491956   .0499673    -2.78   0.005     .7566976    .9530004
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.02772         1.72        1         0.1901
      2.kids_cat4 |      0.02763         1.73        1         0.1882
      3.kids_cat4 |      0.02476         1.40        1         0.2375
      age1        |     -0.00768         0.12        1         0.7302
      age2        |      0.00191         0.01        1         0.9301
      age3        |     -0.00082         0.00        1         0.9697
      0b.male     |            .            .        1             .
      1.male      |      0.01877         0.75        1         0.3870
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00472         0.05        1         0.8231
      3.obese4cat |      0.03606         2.40        1         0.1213
      4.obese4cat |      0.02643         1.28        1         0.2581
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00023         0.00        1         0.9913
      3.smoke_no~s|      0.02521         1.19        1         0.2753
      1b.imd      |            .            .        1             .
      4.imd       |      0.02358         1.11        1         0.2915
      5.imd       |      0.01224         0.31        1         0.5781
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.05331         6.11        1         0.0135
      3.tot_adul~h|     -0.04016         2.58        1         0.1081
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.03295         2.24        1         0.1344
      5.ethnicity |     -0.00189         0.01        1         0.9305
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.00264         0.01        1         0.9107
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.03910         2.98        1         0.0845
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.01594         0.48        1         0.4888
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.01465         0.42        1         0.5193
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.04034         2.58        1         0.1085
      3.diabcat   |      0.02144         0.78        1         0.3764
      4.diabcat   |      0.01931         0.77        1         0.3813
      5.diabcat   |      0.00076         0.00        1         0.9713
      6.diabcat   |     -0.00986         0.30        1         0.5837
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.03571         1.54        1         0.2144
      3.cancer_e~t|     -0.00038         0.00        1         0.9864
      4.cancer_e~t|     -0.00349         0.03        1         0.8722
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.02336         0.76        1         0.3823
      3.cancer_h~t|      0.01615         0.51        1         0.4746
      4.cancer_h~t|     -0.02571         1.45        1         0.2283
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.02871         1.54        1         0.2144
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.00389         0.03        1         0.8620
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00135         0.00        1         0.9508
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01526         0.54        1         0.4639
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.03852         3.08        1         0.0794
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.01268         0.35        1         0.5535
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.01146         0.27        1         0.6065
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00546         0.06        1         0.8021
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.01017         0.23        1         0.6302
      ------------+---------------------------------------------------
      global test |                     36.75       42         0.7000
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      1.59 /        1 =       1.5900
   1:      0.34 /        1 =       0.3410

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          205             Number of obs    =         205
No. of failures      =          159
Time at risk         =         6315
                                                Wald chi2(38)    =    34007.48
Log pseudolikelihood =   -358.07706             Prob > chi2      =      0.0000

                          (Std. Err. adjusted for 95 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .9656115   .2350662    -0.14   0.886     .5992223    1.556026
3 childre..  |   .8801022   .2697391    -0.42   0.677     .4826715    1.604776
4+ childr..  |   .5285954   .1137988    -2.96   0.003     .3466348    .8060735
             |
        age1 |   .9604421   .0273354    -1.42   0.156     .9083327    1.015541
        age2 |   1.080237   .1098623     0.76   0.448     .8850135    1.318523
        age3 |   .8185944   .2555191    -0.64   0.521     .4439883    1.509267
      1.male |   1.025655   .2106248     0.12   0.902     .6858063    1.533913
             |
   obese4cat |
Obese I ..)  |   1.153056   .3851805     0.43   0.670     .5991076    2.219197
Obese II..)  |   1.602655   .4252676     1.78   0.075     .9527349    2.695926
Obese II..)  |   1.301489   .6616805     0.52   0.604     .4804931     3.52528
             |
smoke_nomiss |
     Former  |   2.484847   .9190435     2.46   0.014      1.20358    5.130083
    Current  |   1.006785   .2425442     0.03   0.978     .6278767    1.614356
             |
         imd |
          4  |   .7815132    .218951    -0.88   0.379     .4512957    1.353354
5 most de..  |    1.52103     .56093     1.14   0.255     .7382934    3.133621
             |
3.tot_adul~h |   2.42e-16   1.74e-16   -49.90   0.000     5.90e-17    9.94e-16
             |
   ethnicity |
Asian or ..  |   1.120287   .3063731     0.42   0.678     .6554583    1.914757
      Other  |   1.519789   .5140631     1.24   0.216     .7831908    2.949166
             |
1.htdiag_o~p |   1.014324   .3282098     0.04   0.965      .537959    1.912512
1.~y_disease |   .7397704   .1851229    -1.20   0.228     .4529906    1.208105
    1.asthma |   .7428857   .1799301    -1.23   0.220     .4621228    1.194226
1.~c_disease |   .9721505   .2717357    -0.10   0.920     .5620895    1.681363
             |
     diabcat |
T1DM, con..  |   1.096004   .6045931     0.17   0.868     .3717578      3.2312
T1DM, unc..  |   .1424146   .0972351    -2.85   0.004     .0373583    .5429023
T2DM, con..  |   .9562152   .2912124    -0.15   0.883     .5264109    1.736946
T2DM, unc..  |   .6091234   .2656007    -1.14   0.256     .2591489     1.43173
             |
cancer_exh~t |
2-5 years..  |   .9273381   .4043771    -0.17   0.863      .394513    2.179791
   5+ years  |   1.254614   .2973878     0.96   0.339     .7883972    1.996526
             |
cancer_hae~t |
  Last year  |   .7842716   .5404504    -0.35   0.724     .2031861    3.027186
2-5 years..  |   7.228423   7.587287     1.88   0.060     .9238109    56.55931
   5+ years  |   .8941538   .2172704    -0.46   0.645     .5553653    1.439613
             |
1.~r_disease |   1.498732   .3588337     1.69   0.091     .9374007    2.396199
1.stroke_d~a |   1.029509   .2156128     0.14   0.890     .6829062    1.552028
1.other_ne~o |   .7215099   .1632403    -1.44   0.149     .4630837    1.124152
             |
reduced_ki~t |
       None  |          1  (omitted)
      1.esrd |   1.001057   .1803412     0.01   0.995     .7032574    1.424963
1.other_tr~t |    1.15751   .2513984     0.67   0.501     .7562286    1.771725
  1.asplenia |   1.073153    .269648     0.28   0.779     .6558173    1.756065
1.ra_sle_p~s |   .5810779   .1422988    -2.22   0.027     .3595718    .9390379
1.other_im~o |   .5940631   .1738565    -1.78   0.075     .3347518    1.054247
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_F
> ULLYADJMODEL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_FULLYADJ
> MODEL_ageband_0_timeperiod2.ster saved
(9,854 observations (episodes) created)
(cat_time: 9854 changes made)
(covid_tpp_prob: 9854 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       61.89       61.89
          1 |      7,379       28.54       90.43
          2 |      2,475        9.57      100.00
------------+-----------------------------------
      Total |     25,859      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,706      8,299 |    16,005 
         1 |     2,755      4,624 |     7,379 
         2 |       491      1,984 |     2,475 
-----------+----------------------+----------
     Total |    10,952     14,907 |    25,859 
(25,861 observations deleted)
   1:      0.01 /        1 =       0.0080
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_tpp_prob)
   1:      0.00 /        1 =       0.0030
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_tpp_prob)
(2,837 observations (episodes) created)
(cat_time: 2837 changes made)
(covid_tpp_prob: 2837 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       61.88       61.88
          1 |      2,120       28.49       90.37
          2 |        717        9.63      100.00
------------+-----------------------------------
      Total |      7,442      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,218      2,387 |     4,605 
         1 |       802      1,318 |     2,120 
         2 |       151        566 |       717 
-----------+----------------------+----------
     Total |     3,171      4,271 |     7,442 
(2,837 observations deleted)
   1:      2.42 /        1 =       2.4240

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,605             Number of obs    =       4,605
No. of failures      =        2,387
Time at risk         =       257405
                                                Wald chi2(42)    =       48.88
Log pseudolikelihood =   -13827.418             Prob > chi2      =      0.2163

                         (Std. Err. adjusted for 928 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.050204   .1589369     0.32   0.746     .7806449    1.412842
 only 12-18  |   1.120934   .2175235     0.59   0.556     .7663017    1.639685
      mixed  |   1.042198   .1480933     0.29   0.771     .7888551    1.376904
             |
        age1 |   1.007524    .017466     0.43   0.665     .9738662    1.042345
        age2 |   .9581712   .0883959    -0.46   0.643      .799679    1.148076
        age3 |   1.082326   .1983764     0.43   0.666     .7556905    1.550145
      1.male |   1.053281   .0416699     1.31   0.189     .9746959    1.138203
             |
   obese4cat |
Obese I ..)  |   .9838841   .0608215    -0.26   0.793     .8716147    1.110614
Obese II..)  |   .9457839   .0719756    -0.73   0.464     .8147308    1.097917
Obese II..)  |   .9537588   .0811798    -0.56   0.578     .8072128     1.12691
             |
smoke_nomiss |
     Former  |   .9411827   .1366226    -0.42   0.676     .7081301    1.250935
    Current  |   .9698343   .0614144    -0.48   0.629     .8566345    1.097993
             |
         imd |
          4  |   .9266466   .0508865    -1.39   0.165     .8320907    1.031948
5 most de..  |   1.024068   .0716147     0.34   0.734        .8929    1.174504
             |
tot_adults~h |
          2  |   1.141715   .3278216     0.46   0.644     .6503568    2.004306
          3  |    .754296   .1935173    -1.10   0.272     .4562081    1.247155
             |
   ethnicity |
Asian or ..  |    .969002   .0676558    -0.45   0.652     .8450719    1.111106
      Other  |   .8665309   .0578045    -2.15   0.032       .76033    .9875656
             |
1.htdiag_o~p |   1.018371   .0779587     0.24   0.812     .8764852    1.183226
1.~y_disease |   1.003175   .0529852     0.06   0.952     .9045204     1.11259
    1.asthma |   .9280029   .0701039    -0.99   0.323     .8002897    1.076097
1.~c_disease |   1.050652    .053466     0.97   0.332     .9509172    1.160848
             |
     diabcat |
T1DM, con..  |   1.060874   .1515797     0.41   0.679     .8017568    1.403735
T1DM, unc..  |   .5753687   .1774025    -1.79   0.073     .3144102    1.052921
T2DM, con..  |   .9727132    .049499    -0.54   0.587     .8803781    1.074732
T2DM, unc..  |   1.020431   .1172134     0.18   0.860     .8147215    1.278081
Diabetes,..  |   .3065815     .28615    -1.27   0.205      .049212    1.909945
             |
cancer_exh~t |
  Last year  |   .5736793   .2349325    -1.36   0.175     .2570905    1.280125
2-5 years..  |   1.133307   .1727794     0.82   0.412     .8405759    1.527982
   5+ years  |   .9703261   .0499117    -0.59   0.558     .8772706    1.073252
             |
cancer_hae~t |
  Last year  |    1.66148   .4437623     1.90   0.057     .9843485    2.804409
2-5 years..  |   .9907608   .1540939    -0.06   0.952     .7304335    1.343869
   5+ years  |   1.061548   .0577674     1.10   0.272     .9541553    1.181029
             |
1.~r_disease |   .9418507   .0478683    -1.18   0.238      .852552    1.040503
1.stroke_d~a |   .9734988   .0513964    -0.51   0.611     .8778003     1.07963
1.other_ne~o |   1.019744   .0507058     0.39   0.694     .9250522     1.12413
             |
reduced_ki~t |
Stage 3a/..  |   .8731744   .0880707    -1.34   0.179     .7165501    1.064034
      1.esrd |   1.004689   .0411226     0.11   0.909     .9272387    1.088609
1.other_tr~t |   1.096051   .0558502     1.80   0.072     .9918752    1.211168
  1.asplenia |    1.04358   .0559057     0.80   0.426      .939563    1.159112
1.ra_sle_p~s |   1.110309    .056245     2.07   0.039     1.005367    1.226206
1.other_im~o |   1.051034   .0521233     1.00   0.316     .9536824    1.158324
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.00048         0.00        1         0.9803
      2.kids_cat4 |      0.02924         2.10        1         0.1477
      3.kids_cat4 |      0.00880         0.20        1         0.6528
      age1        |     -0.00714         0.12        1         0.7272
      age2        |      0.00125         0.00        1         0.9504
      age3        |      0.00049         0.00        1         0.9806
      0b.male     |            .            .        1             .
      1.male      |      0.01206         0.34        1         0.5619
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.00493         0.07        1         0.7945
      3.obese4cat |     -0.00496         0.07        1         0.7962
      4.obese4cat |      0.02012         1.07        1         0.3017
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.03462         3.10        1         0.0782
      3.smoke_no~s|      0.00755         0.14        1         0.7104
      1b.imd      |            .            .        1             .
      4.imd       |      0.02025         1.12        1         0.2896
      5.imd       |      0.00663         0.12        1         0.7313
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.00397         0.03        1         0.8566
      3.tot_adul~h|     -0.01055         0.24        1         0.6244
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.03580         3.45        1         0.0634
      5.ethnicity |     -0.01334         0.40        1         0.5257
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.01602         0.65        1         0.4186
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01024         0.28        1         0.5971
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.02772         1.85        1         0.1743
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.02059         1.10        1         0.2940
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00920         0.22        1         0.6390
      3.diabcat   |     -0.00909         0.22        1         0.6421
      4.diabcat   |     -0.01810         0.74        1         0.3886
      5.diabcat   |     -0.03604         3.70        1         0.0543
      6.diabcat   |      0.02138         1.01        1         0.3137
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.00429         0.05        1         0.8281
      3.cancer_e~t|     -0.00243         0.02        1         0.9014
      4.cancer_e~t|      0.02273         1.23        1         0.2665
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.03909         4.89        1         0.0270
      3.cancer_h~t|      0.02214         1.14        1         0.2861
      4.cancer_h~t|     -0.01452         0.55        1         0.4583
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.01787         0.76        1         0.3825
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.03867         4.00        1         0.0454
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.01287         0.42        1         0.5168
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.02007         0.88        1         0.3469
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.02278         1.20        1         0.2734
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00194         0.01        1         0.9213
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00314         0.03        1         0.8695
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.02161         1.21        1         0.2723
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.04349         4.69        1         0.0303
      ------------+---------------------------------------------------
      global test |                     42.62       42         0.4443
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      3.65 /        1 =       3.6540
   1:      0.76 /        1 =       0.7640

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          455             Number of obs    =         455
No. of failures      =          237
Time at risk         =        25287
                                                Wald chi2(40)    =     6150.47
Log pseudolikelihood =   -806.96438             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 152 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .8522461   .1575555    -0.86   0.387     .5932021    1.224411
3 childre..  |   1.096687   .2031385     0.50   0.618     .7628084    1.576704
4+ childr..  |   1.077302    .177913     0.45   0.652      .779407    1.489055
             |
        age1 |   .9548615   .0652654    -0.68   0.499     .8351418    1.091743
        age2 |   1.151523   .4251403     0.38   0.702     .5584833    2.374295
        age3 |   .7815896   .5774024    -0.33   0.739     .1837174    3.325119
      1.male |   1.070007   .1401424     0.52   0.605     .8277548    1.383156
             |
   obese4cat |
Obese I ..)  |   .9701791     .16501    -0.18   0.859     .6951489    1.354023
Obese II..)  |   1.101815   .2292915     0.47   0.641     .7327748     1.65671
Obese II..)  |   1.458382   .3587348     1.53   0.125     .9005159    2.361843
             |
smoke_nomiss |
     Former  |   .9326445   .4121681    -0.16   0.875     .3922298    2.217643
    Current  |   .8038922   .2075956    -0.85   0.398      .484602    1.333554
             |
         imd |
          4  |   .9926956   .1700404    -0.04   0.966     .7095981    1.388736
5 most de..  |   .5765697   .1544767    -2.06   0.040     .3410316    .9747852
             |
tot_adults~h |
          2  |   2.28e+08          .        .       .            .           .
          3  |   1.41e+08   4.71e+07    56.16   0.000     7.32e+07    2.71e+08
             |
   ethnicity |
Asian or ..  |   .7385291   .1511636    -1.48   0.139     .4944724    1.103045
      Other  |   1.170019   .3036382     0.61   0.545     .7035465    1.945777
             |
1.htdiag_o~p |   .8671792   .2276371    -0.54   0.587     .5184012    1.450614
1.~y_disease |   .9632969   .1740722    -0.21   0.836      .675996    1.372702
    1.asthma |   1.004324   .2832557     0.02   0.988     .5778352    1.745595
1.~c_disease |    1.07658   .1652538     0.48   0.631     .7968709     1.45447
             |
     diabcat |
T1DM, con..  |   .8847591   .3743893    -0.29   0.772     .3860431     2.02775
T1DM, unc..  |   .8718711   .7290902    -0.16   0.870      .169296    4.490119
T2DM, con..  |   .8937299   .1853537    -0.54   0.588     .5952133    1.341961
T2DM, unc..  |   .8831504   .3383905    -0.32   0.746     .4167597    1.871473
Diabetes,..  |   8.02e-20          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.680825   2.108663     0.41   0.679     .1437659    19.65121
2-5 years..  |   1.771233   .8573699     1.18   0.238     .6858821    4.574062
   5+ years  |   1.091696   .1863325     0.51   0.607     .7812991    1.525409
             |
cancer_hae~t |
  Last year  |   2.532404   1.790646     1.31   0.189     .6333648     10.1254
2-5 years..  |   .8193356   .5010659    -0.33   0.745     .2471202    2.716535
   5+ years  |   .7265378   .1690207    -1.37   0.170     .4605067    1.146253
             |
1.~r_disease |   .5923742   .1188849    -2.61   0.009     .3997299    .8778609
1.stroke_d~a |   1.250536   .2035814     1.37   0.170     .9089174    1.720552
1.other_ne~o |   .8456585   .1639284    -0.86   0.387     .5783519    1.236511
             |
reduced_ki~t |
Stage 3a/..  |   .5972584   .2338091    -1.32   0.188     .2772949    1.286419
      1.esrd |   1.185989   .1654329     1.22   0.221     .9022924    1.558886
1.other_tr~t |   1.101381   .1780406     0.60   0.550     .8023038    1.511945
  1.asplenia |   .9339389   .1586439    -0.40   0.687     .6694663    1.302891
1.ra_sle_p~s |   1.209946   .2072882     1.11   0.266     .8648449    1.692755
1.other_im~o |   1.084828   .1819639     0.49   0.627     .7808802    1.507084
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_F
> ULLYADJMODEL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_FULLYADJ
> MODEL_ageband_1_timeperiod0.ster saved
(2,837 observations (episodes) created)
(cat_time: 2837 changes made)
(covid_tpp_prob: 2837 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       61.88       61.88
          1 |      2,120       28.49       90.37
          2 |        717        9.63      100.00
------------+-----------------------------------
      Total |      7,442      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,218      2,387 |     4,605 
         1 |       802      1,318 |     2,120 
         2 |       151        566 |       717 
-----------+----------------------+----------
     Total |     3,171      4,271 |     7,442 
(5,322 observations deleted)
   1:      1.00 /        1 =       0.9990

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,120             Number of obs    =       2,120
No. of failures      =        1,318
Time at risk         =        95208
                                                Wald chi2(42)    =       50.05
Log pseudolikelihood =   -6472.8528             Prob > chi2      =      0.1843

                         (Std. Err. adjusted for 753 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.030253   .2001506     0.15   0.878     .7040085    1.507681
 only 12-18  |   1.183694   .2803817     0.71   0.476     .7440723    1.883057
      mixed  |   1.115275   .1944216     0.63   0.531     .7924931    1.569527
             |
        age1 |   1.006194   .0237878     0.26   0.794     .9606348    1.053915
        age2 |   1.001714   .1249422     0.01   0.989     .7844673    1.279125
        age3 |   .9725629   .2413704    -0.11   0.911     .5979525    1.581862
      1.male |    1.04404   .0569795     0.79   0.430     .9381275    1.161909
             |
   obese4cat |
Obese I ..)  |   .9301732   .0755133    -0.89   0.373      .793344    1.090601
Obese II..)  |   .9546679   .0911404    -0.49   0.627     .7917529    1.151105
Obese II..)  |   .8482002   .0957341    -1.46   0.145     .6798694    1.058209
             |
smoke_nomiss |
     Former  |   1.162951   .2288089     0.77   0.443     .7908398    1.710149
    Current  |   1.039768   .0891733     0.45   0.649     .8788914    1.230093
             |
         imd |
          4  |   .9223492   .0620943    -1.20   0.230     .8083341    1.052446
5 most de..  |   .9981928   .1002528    -0.02   0.986     .8198314    1.215358
             |
tot_adults~h |
          2  |   .4453402   .2485447    -1.45   0.147     .1491543    1.329683
          3  |   .6757948     .23642    -1.12   0.263     .3404322    1.341526
             |
   ethnicity |
Asian or ..  |   .9451969   .0894224    -0.60   0.551     .7852221    1.137764
      Other  |   1.185213   .1029048     1.96   0.050     .9997505    1.405079
             |
1.htdiag_o~p |   .9547298   .0949108    -0.47   0.641     .7857087    1.160111
1.~y_disease |   .8947424   .0676023    -1.47   0.141     .7715879    1.037554
    1.asthma |     .91709   .0902458    -0.88   0.379      .756223    1.112177
1.~c_disease |   1.099892   .0720319     1.45   0.146     .9673975    1.250533
             |
     diabcat |
T1DM, con..  |   1.179948   .2130623     0.92   0.359     .8282514    1.680984
T1DM, unc..  |   1.444901   .3994503     1.33   0.183     .8404637    2.484031
T2DM, con..  |   .9686584   .0729543    -0.42   0.672     .8357235    1.122739
T2DM, unc..  |   1.153167   .1724454     0.95   0.341     .8602072    1.545901
Diabetes,..  |   .2237506   .2601791    -1.29   0.198     .0229076    2.185489
             |
cancer_exh~t |
  Last year  |   1.273788   .3887321     0.79   0.428     .7003725    2.316675
2-5 years..  |   .8424848   .1730714    -0.83   0.404     .5632485    1.260155
   5+ years  |   .9699357   .0703009    -0.42   0.674     .8414879     1.11799
             |
cancer_hae~t |
  Last year  |    .629913   .2817645    -1.03   0.301     .2621393    1.513662
2-5 years..  |   1.894624   .3697694     3.27   0.001     1.292397    2.777475
   5+ years  |   1.154518   .0861281     1.93   0.054     .9974708    1.336291
             |
1.~r_disease |   1.016853   .0730031     0.23   0.816     .8833804    1.170492
1.stroke_d~a |   1.085944   .0722086     1.24   0.215     .9532516    1.237106
1.other_ne~o |   .9820136   .0702788    -0.25   0.800     .8534938    1.129886
             |
reduced_ki~t |
Stage 3a/..  |   .9453655   .1272632    -0.42   0.676     .7261272    1.230798
      1.esrd |   1.094117   .0585974     1.68   0.093     .9850909     1.21521
1.other_tr~t |   1.010056   .0701207     0.14   0.885     .8815616    1.157279
  1.asplenia |    1.03615   .0729299     0.50   0.614     .9026313    1.189419
1.ra_sle_p~s |   1.062272   .0721809     0.89   0.374     .9298162    1.213597
1.other_im~o |   .9731235   .0687298    -0.39   0.700     .8473235    1.117601
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.03478         1.44        1         0.2299
      2.kids_cat4 |     -0.01285         0.17        1         0.6819
      3.kids_cat4 |     -0.02987         0.99        1         0.3195
      age1        |     -0.01494         0.30        1         0.5860
      age2        |      0.00639         0.05        1         0.8169
      age3        |     -0.00537         0.04        1         0.8455
      0b.male     |            .            .        1             .
      1.male      |     -0.02848         1.08        1         0.2976
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02823         1.17        1         0.2785
      3.obese4cat |      0.01928         0.52        1         0.4695
      4.obese4cat |      0.04499         2.68        1         0.1019
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.02908         1.37        1         0.2414
      3.smoke_no~s|      0.01569         0.34        1         0.5584
      1b.imd      |            .            .        1             .
      4.imd       |      0.02060         0.55        1         0.4596
      5.imd       |     -0.01925         0.57        1         0.4486
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.00307         0.01        1         0.9108
      3.tot_adul~h|      0.01257         0.19        1         0.6644
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.00955         0.14        1         0.7101
      5.ethnicity |     -0.00144         0.00        1         0.9561
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.01243         0.22        1         0.6429
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.07372         8.65        1         0.0033
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.00650         0.06        1         0.8068
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.05107         3.47        1         0.0625
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01072         0.15        1         0.6984
      3.diabcat   |     -0.00993         0.14        1         0.7132
      4.diabcat   |     -0.03827         2.09        1         0.1485
      5.diabcat   |     -0.02541         0.97        1         0.3245
      6.diabcat   |      0.00571         0.06        1         0.7996
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.01208         0.15        1         0.6989
      3.cancer_e~t|      0.01268         0.20        1         0.6570
      4.cancer_e~t|      0.00440         0.03        1         0.8656
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.01753         0.42        1         0.5154
      3.cancer_h~t|      0.00876         0.11        1         0.7404
      4.cancer_h~t|     -0.05921         5.29        1         0.0214
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.02358         0.82        1         0.3648
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.01126         0.18        1         0.6728
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.01412         0.30        1         0.5858
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.00450         0.03        1         0.8692
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.01818         0.43        1         0.5130
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.05006         3.54        1         0.0599
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.03074         1.28        1         0.2573
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.01480         0.29        1         0.5883
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.03666         1.94        1         0.1638
      ------------+---------------------------------------------------
      global test |                     42.77       42         0.4377
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      1.52 /        1 =       1.5200
   1:      0.14 /        1 =       0.1360

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          207             Number of obs    =         207
No. of failures      =          121
Time at risk         =         9535
                                                Wald chi2(42)    =      113.33
Log pseudolikelihood =   -307.61157             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 109 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .7072984   .2688418    -0.91   0.362     .3357869    1.489847
3 childre..  |   1.170993   .3848038     0.48   0.631     .6149476    2.229823
4+ childr..  |   1.237924   .3276936     0.81   0.420     .7368355     2.07978
             |
        age1 |   1.084495   .1026011     0.86   0.391     .9009434    1.305441
        age2 |   .5761098   .2910458    -1.09   0.275     .2140353     1.55069
        age3 |    3.10794   3.128205     1.13   0.260     .4322359    22.34726
      1.male |   1.290956   .2751042     1.20   0.231     .8501968    1.960214
             |
   obese4cat |
Obese I ..)  |   1.006352   .3444448     0.02   0.985     .5145271      1.9683
Obese II..)  |   1.077844   .4085026     0.20   0.843     .5128029    2.265484
Obese II..)  |   .9365076   .4912595    -0.13   0.900     .3349658    2.618317
             |
smoke_nomiss |
     Former  |   1.463508    .643646     0.87   0.387     .6180729    3.465379
    Current  |   1.177007   .4199256     0.46   0.648     .5849144    2.368458
             |
         imd |
          4  |    1.03892   .3119095     0.13   0.899     .5768071    1.871259
5 most de..  |   .9917138   .3211655    -0.03   0.980      .525685    1.870885
             |
tot_adults~h |
          2  |   10.19125   19.01782     1.24   0.213     .2629094     395.047
          3  |   8.693591   7.109553     2.64   0.008     1.750222    43.18226
             |
   ethnicity |
Asian or ..  |     .89767   .3606381    -0.27   0.788     .4084579    1.972814
      Other  |   .6230638   .2195608    -1.34   0.179     .3123047    1.243044
             |
1.htdiag_o~p |   .8723385   .5804036    -0.21   0.837     .2367799    3.213848
1.~y_disease |   .8343071   .2245294    -0.67   0.501     .4923227    1.413845
    1.asthma |   .7822212   .4316016    -0.45   0.656     .2652572    2.306705
1.~c_disease |   .7463158    .210398    -1.04   0.299     .4294926     1.29685
             |
     diabcat |
T1DM, con..  |   1.238339   .7081654     0.37   0.709     .4037064    3.798514
T1DM, unc..  |   16.13136   10.55533     4.25   0.000     4.474033    58.16245
T2DM, con..  |   .7105016   .2069592    -1.17   0.241     .4014412    1.257501
T2DM, unc..  |   1.314838   .6676702     0.54   0.590     .4859984    3.557209
Diabetes,..  |   .8137124    .764022    -0.22   0.826      .129196    5.124987
             |
cancer_exh~t |
  Last year  |   1.135235   .9097306     0.16   0.874     .2360302    5.460139
2-5 years..  |   1.577546   .5576093     1.29   0.197     .7890614    3.153937
   5+ years  |   1.184628   .3122474     0.64   0.520     .7066753    1.985838
             |
cancer_hae~t |
  Last year  |   3.371509   2.468014     1.66   0.097     .8030215    14.15538
2-5 years..  |      1.638   1.033563     0.78   0.434     .4755686    5.641758
   5+ years  |   .8007282   .3301898    -0.54   0.590      .356847    1.796752
             |
1.~r_disease |   .7907214   .2371928    -0.78   0.434     .4392264    1.423504
1.stroke_d~a |    1.37718   .3432261     1.28   0.199     .8449893    2.244556
1.other_ne~o |   .9918005   .2580995    -0.03   0.975     .5955433    1.651716
             |
reduced_ki~t |
Stage 3a/..  |   .8348265   .3678104    -0.41   0.682     .3520232    1.979799
      1.esrd |   1.207633   .2468499     0.92   0.356     .8089885    1.802716
1.other_tr~t |   .8316755   .2287639    -0.67   0.503     .4850864    1.425899
  1.asplenia |   1.377362   .3504888     1.26   0.208     .8364658    2.268026
1.ra_sle_p~s |   1.261008   .3114641     0.94   0.348     .7770958    2.046263
1.other_im~o |   .9482618     .27915    -0.18   0.857     .5325384    1.688518
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_F
> ULLYADJMODEL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_FULLYADJ
> MODEL_ageband_1_timeperiod1.ster saved
(2,837 observations (episodes) created)
(cat_time: 2837 changes made)
(covid_tpp_prob: 2837 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       61.88       61.88
          1 |      2,120       28.49       90.37
          2 |        717        9.63      100.00
------------+-----------------------------------
      Total |      7,442      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,218      2,387 |     4,605 
         1 |       802      1,318 |     2,120 
         2 |       151        566 |       717 
-----------+----------------------+----------
     Total |     3,171      4,271 |     7,442 
(6,725 observations deleted)
   1:      0.28 /        1 =       0.2780

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          717             Number of obs    =         717
No. of failures      =          566
Time at risk         =        21282
                                                Wald chi2(42)    =       61.38
Log pseudolikelihood =    -2007.426             Prob > chi2      =      0.0270

                         (Std. Err. adjusted for 449 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8293032   .2895017    -0.54   0.592     .4183763     1.64384
 only 12-18  |   .9374924   .3890923    -0.16   0.876     .4156131    2.114688
      mixed  |    .837529   .2783202    -0.53   0.594     .4366526    1.606437
             |
        age1 |   .9507955   .0376671    -1.27   0.203     .8797627    1.027564
        age2 |   1.225357   .2581562     0.96   0.335     .8108356    1.851792
        age3 |    .690726   .2883135    -0.89   0.375     .3047956    1.565319
      1.male |   .9606288    .088115    -0.44   0.661     .8025608    1.149829
             |
   obese4cat |
Obese I ..)  |    1.05441   .1302882     0.43   0.668       .82762    1.343348
Obese II..)  |   1.025707   .1426531     0.18   0.855     .7809805    1.347121
Obese II..)  |   1.056534   .1925087     0.30   0.763     .7392447    1.510008
             |
smoke_nomiss |
     Former  |   .6394077   .1783727    -1.60   0.109     .3701024    1.104673
    Current  |   1.281778   .1720771     1.85   0.064     .9852354    1.667576
             |
         imd |
          4  |   1.019231   .1055173     0.18   0.854     .8320527    1.248517
5 most de..  |   .7857593   .1098337    -1.72   0.085     .5974592    1.033405
             |
tot_adults~h |
          2  |   .3687609   .3480999    -1.06   0.291     .0579742    2.345606
          3  |   .3992107   .3162412    -1.16   0.246     .0845102    1.885798
             |
   ethnicity |
Asian or ..  |   .9788264   .1371068    -0.15   0.879     .7438332    1.288059
      Other  |   .7753185   .1232775    -1.60   0.109     .5677238    1.058823
             |
1.htdiag_o~p |   .9875201    .156653    -0.08   0.937     .7236317    1.347641
1.~y_disease |   .9013929   .0889879    -1.05   0.293     .7428161    1.093823
    1.asthma |   1.216247   .1867899     1.27   0.202     .9001088    1.643419
1.~c_disease |   .9469198   .1008018    -0.51   0.608     .7686009     1.16661
             |
     diabcat |
T1DM, con..  |   .9325399   .2860073    -0.23   0.820     .5112183    1.701095
T1DM, unc..  |   .4077028   .2543289    -1.44   0.150     .1200483    1.384622
T2DM, con..  |   1.158807   .1224939     1.39   0.163     .9419617    1.425571
T2DM, unc..  |   1.048148   .2588436     0.19   0.849     .6459749    1.700707
Diabetes,..  |   5.265812   3.158287     2.77   0.006     1.625318    17.06052
             |
cancer_exh~t |
  Last year  |   .5807936    .843112    -0.37   0.708     .0337575     9.99247
2-5 years..  |   1.866531   .5092824     2.29   0.022     1.093415    3.186289
   5+ years  |   1.129263   .1110489     1.24   0.216     .9313008    1.369305
             |
cancer_hae~t |
  Last year  |   .8238774    .291276    -0.55   0.584     .4120277    1.647399
2-5 years..  |   .3303258    .150888    -2.42   0.015     .1349355    .8086467
   5+ years  |   .7275182   .0914561    -2.53   0.011     .5686429    .9307822
             |
1.~r_disease |   .9268509   .0965137    -0.73   0.466     .7557421    1.136701
1.stroke_d~a |   .9496912   .1076176    -0.46   0.649     .7605461    1.185876
1.other_ne~o |    1.08717   .1210847     0.75   0.453     .8739648    1.352387
             |
reduced_ki~t |
Stage 3a/..  |   .9532054   .1967843    -0.23   0.816     .6360048    1.428606
      1.esrd |   .9872359   .0904969    -0.14   0.889      .824886    1.181539
1.other_tr~t |   1.014858   .1165755     0.13   0.898      .810268    1.271106
  1.asplenia |   1.004277   .1091654     0.04   0.969     .8115727    1.242738
1.ra_sle_p~s |     .88572   .0996096    -1.08   0.281     .7105079     1.10414
1.other_im~o |   1.071456   .1173929     0.63   0.529     .8643977    1.328114
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.07059         4.18        1         0.0408
      2.kids_cat4 |      0.08098         4.47        1         0.0344
      3.kids_cat4 |      0.06706         3.70        1         0.0543
      age1        |     -0.01121         0.10        1         0.7565
      age2        |      0.02737         0.57        1         0.4492
      age3        |     -0.03486         0.93        1         0.3345
      0b.male     |            .            .        1             .
      1.male      |      0.08934         4.88        1         0.0272
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.02699         0.48        1         0.4903
      3.obese4cat |      0.01923         0.23        1         0.6286
      4.obese4cat |     -0.03792         0.95        1         0.3305
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.07659         3.30        1         0.0691
      3.smoke_no~s|     -0.00359         0.01        1         0.9245
      1b.imd      |            .            .        1             .
      4.imd       |      0.03877         0.89        1         0.3454
      5.imd       |      0.06327         2.36        1         0.1248
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.07859         6.15        1         0.0132
      3.tot_adul~h|      0.06881         4.78        1         0.0288
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.06785         3.03        1         0.0815
      5.ethnicity |     -0.07385         3.83        1         0.0504
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.01590         0.15        1         0.6953
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.10695         7.20        1         0.0073
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.03863         1.07        1         0.3000
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.05278         1.57        1         0.2109
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.01601         0.14        1         0.7090
      3.diabcat   |     -0.02245         0.24        1         0.6259
      4.diabcat   |     -0.00503         0.02        1         0.9023
      5.diabcat   |      0.02132         0.27        1         0.6040
      6.diabcat   |      0.05341         1.47        1         0.2247
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.10289        13.92        1         0.0002
      3.cancer_e~t|      0.06015         1.74        1         0.1871
      4.cancer_e~t|      0.08855         4.33        1         0.0374
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.04992         0.58        1         0.4448
      3.cancer_h~t|      0.01909         0.15        1         0.6944
      4.cancer_h~t|     -0.07937         4.19        1         0.0407
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.02770         0.43        1         0.5129
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.10260         7.32        1         0.0068
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.06685         3.10        1         0.0784
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.02293         0.33        1         0.5681
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.02230         0.33        1         0.5633
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.01669         0.20        1         0.6564
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.02844         0.52        1         0.4702
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.02657         0.44        1         0.5077
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.03362         0.77        1         0.3798
      ------------+---------------------------------------------------
      global test |                     61.72       42         0.0253
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      0.33 /        1 =       0.3280
   1:      0.22 /        1 =       0.2180

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =           77             Number of obs    =          77
No. of failures      =           64
Time at risk         =         2299
                                                Wald chi2(35)    =     5390.48
Log pseudolikelihood =   -73.002472             Prob > chi2      =      0.0000

                          (Std. Err. adjusted for 58 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .3530793   .5742775    -0.64   0.522     .0145683    8.557307
3 childre..  |   .3935953   .2640933    -1.39   0.165     .1056607    1.466177
4+ childr..  |    .389257   .2522553    -1.46   0.145     .1093003    1.386282
             |
        age1 |   .4432764   .2671574    -1.35   0.177     .1360397    1.444387
        age2 |   28.78911    82.7796     1.17   0.243      .102731    8067.801
        age3 |   .0025869   .0141728    -1.09   0.277     5.61e-08    119.2097
      1.male |   1.177984   .9193017     0.21   0.834     .2551875    5.437751
             |
   obese4cat |
Obese I ..)  |   3.623497   3.494543     1.33   0.182     .5472923    23.99035
Obese II..)  |    .280798   .3828781    -0.93   0.352     .0193977    4.064786
Obese II..)  |   .8488253   2.152698    -0.06   0.948     .0058897    122.3327
             |
smoke_nomiss |
     Former  |   1.19e-32          .        .       .            .           .
    Current  |   .1548916   .2263438    -1.28   0.202     .0088341    2.715768
             |
         imd |
          4  |   .1259481   .0735357    -3.55   0.000     .0401062    .3955229
5 most de..  |   .0177015   .0213764    -3.34   0.001       .00166     .188765
             |
tot_adults~h |
          2  |   5.64e-13   8.49e-13   -18.73   0.000     2.95e-14    1.08e-11
          3  |   4.15e-12          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .6032315   1.003828    -0.30   0.761     .0231213    15.73821
      Other  |   1.178976   1.446216     0.13   0.893     .1065025    13.05118
             |
1.htdiag_o~p |   .0012752   .0024387    -3.48   0.000       .00003    .0541282
1.~y_disease |   1.134143   1.263461     0.11   0.910     .1277645    10.06759
    1.asthma |    9.59985   10.28948     2.11   0.035     1.174666    78.45389
1.~c_disease |   2.452676   1.457696     1.51   0.131     .7651503    7.862013
             |
     diabcat |
T1DM, con..  |   12.88445   34.04336     0.97   0.333     .0726133    2286.207
T2DM, con..  |    1.34521   .9333616     0.43   0.669     .3452959     5.24069
T2DM, unc..  |   5.111526   6.339433     1.32   0.188      .449646    58.10727
Diabetes,..  |   .7508502   3.231813    -0.07   0.947     .0001629    3461.781
             |
cancer_exh~t |
   5+ years  |   2.595562   3.564475     0.69   0.487     .1759056    38.29863
             |
cancer_hae~t |
   5+ years  |    .837147   1.146581    -0.13   0.897     .0571441    12.26399
1.~r_disease |   .5245312   .1870772    -1.81   0.070     .2607265    1.055255
1.stroke_d~a |   .1329265   .1217432    -2.20   0.028     .0220812    .8002031
1.other_ne~o |   5.491027    2.77364     3.37   0.001     2.040293    14.77796
             |
reduced_ki~t |
Stage 3a/..  |   2.594358   2.761814     0.90   0.371     .3220225    20.90131
      1.esrd |   .4779166   .4757311    -0.74   0.458     .0679271    3.362491
1.other_tr~t |   3.204608   3.138441     1.19   0.234     .4700549    21.84747
  1.asplenia |   3.068022   1.852227     1.86   0.063     .9396605    10.01719
1.ra_sle_p~s |   .3959418   .4031187    -0.91   0.363     .0538271    2.912473
1.other_im~o |   1.606901   1.241998     0.61   0.539     .3532503    7.309636
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_F
> ULLYADJMODEL_ageband_1_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_gp_number_kids_FULLYADJ
> MODEL_ageband_1_timeperiod2.ster saved
(2,837 observations (episodes) created)
(cat_time: 2837 changes made)
(covid_tpp_prob: 2837 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       61.88       61.88
          1 |      2,120       28.49       90.37
          2 |        717        9.63      100.00
------------+-----------------------------------
      Total |      7,442      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,218      2,387 |     4,605 
         1 |       802      1,318 |     2,120 
         2 |       151        566 |       717 
-----------+----------------------+----------
     Total |     3,171      4,271 |     7,442 
(7,442 observations deleted)
   1:      0.01 /        1 =       0.0060
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_tpp_prob)
   1:      0.00 /        1 =       0.0040
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_tpp_prob)

. /*SENSITIVITY ANALYSIS: 12 months FUP
> keep if has_12_m_follow_up == 1
> foreach exposure_type in kids_cat4   {
> 
> *Age spline model (not adj ethnicity)
> cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'
> basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
> if _rc==0{
> estimates
> estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x', replace
> *estat concordance /*c-statistic*/
> }
> else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome
> ')"
> }       
> }
> */
. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_tpp_prob.log
  log type:  text
 closed on:  25 Jul 2021, 08:11:51
-------------------------------------------------------------------------------
