-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission.log
  log type:  text
 opened on:  25 Jul 2021, 08:14:21

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. forvalues period=0/3 {
  3. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  4. stsplit cat_time, at(0,78,147,400)
  5. recode cat_time 78=1 147=2 400=3
  6. recode `outcome' .=0 
  7. tab cat_time
  8. tab cat_time `outcome'
  9. 
. keep if cat_time==`period'
 10. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 11. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 12. if _rc==0{
 13. estimates
 14. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 15.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals 
.         timer clear 
 16.         timer on 1
 17.         if e(N_fail)>0 estat phtest, d
 18.         timer off 1
 19.         timer list 
 20.         
. }
 21. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 22. 
. }
 23. 
. foreach exposure_type in  gp_number_kids {
 24. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_FULL
> YADJMODEL_ageband_`x'"
 25. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 26. if _rc==0{
 27. estimates
 28. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 29. }
 30. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 31. 
. }
 32. }
 33. }
(11,235 observations (episodes) created)
(cat_time: 11235 changes made)
(covidadmission: 11235 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,946       58.67       58.67
          1 |      8,030       29.54       88.21
          2 |      3,205       11.79      100.00
------------+-----------------------------------
      Total |     27,181      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,001      3,945 |    15,946 
         1 |     5,601      2,429 |     8,030 
         2 |     2,487        718 |     3,205 
-----------+----------------------+----------
     Total |    20,089      7,092 |    27,181 
(11,296 observations deleted)
   1:      7.57 /        1 =       7.5710

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,946             Number of obs    =      15,946
No. of failures      =        3,945
Time at risk         =       920803
                                                Wald chi2(42)    =       51.55
Log pseudolikelihood =   -27885.485             Prob > chi2      =      0.1484

                       (Std. Err. adjusted for 1,112 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.122737   .1366851     0.95   0.342     .8844034    1.425298
 only 12-18  |   1.056129   .1819674     0.32   0.751     .7534557    1.480389
      mixed  |   1.193903   .1350077     1.57   0.117     .9565646    1.490129
             |
        age1 |   .9995687   .0058023    -0.07   0.941     .9882608    1.011006
        age2 |   .9955626   .0184822    -0.24   0.811     .9599892    1.032454
        age3 |   1.019547   .0541118     0.36   0.715     .9188197    1.131317
      1.male |     .95512   .0299408    -1.46   0.143     .8982035    1.015643
             |
   obese4cat |
Obese I ..)  |   .9979845   .0468125    -0.04   0.966     .9103249    1.094085
Obese II..)  |     .96529   .0536349    -0.64   0.525     .8656893     1.07635
Obese II..)  |    .958493   .0703188    -0.58   0.563     .8301211    1.106717
             |
smoke_nomiss |
     Former  |   .9856981   .1135099    -0.13   0.900     .7865426    1.235281
    Current  |   .9202935   .0476529    -1.60   0.109     .8314785    1.018595
             |
         imd |
          4  |   1.050315   .0429205     1.20   0.230     .9694728    1.137898
5 most de..  |    .951447   .0544963    -0.87   0.385     .8504134    1.064484
             |
tot_adults~h |
          2  |   .6026823   .1692962    -1.80   0.071     .3475218    1.045189
          3  |   .5732503   .1181628    -2.70   0.007      .382726    .8586191
             |
   ethnicity |
Asian or ..  |   .9560492   .0549677    -0.78   0.434     .8541631    1.070089
      Other  |   .9502142    .051031    -0.95   0.342     .8552793    1.055687
             |
1.htdiag_o~p |   1.045923   .0620094     0.76   0.449      .931182    1.174802
1.~y_disease |   .9528496    .038255    -1.20   0.229     .8807453    1.030857
    1.asthma |   .9349738   .0568154    -1.11   0.269     .8299933    1.053233
1.~c_disease |    1.02176   .0427588     0.51   0.607     .9412992    1.109099
             |
     diabcat |
T1DM, con..  |   1.005758   .1029813     0.06   0.955     .8228824    1.229277
T1DM, unc..  |   .8263502   .2092831    -0.75   0.451     .5030222    1.357504
T2DM, con..  |   1.044973   .0444008     1.04   0.301     .9614743    1.135724
T2DM, unc..  |   .9857674   .0913538    -0.15   0.877     .8220368    1.182109
Diabetes,..  |   2.138689   1.084606     1.50   0.134     .7915399    5.778601
             |
cancer_exh~t |
  Last year  |   .5906182     .19312    -1.61   0.107     .3111582    1.121069
2-5 years..  |    .867232   .1126318    -1.10   0.273     .6723346    1.118627
   5+ years  |   1.085333   .0420415     2.11   0.035     1.005984    1.170942
             |
cancer_hae~t |
  Last year  |   1.125415    .314438     0.42   0.672     .6508628     1.94597
2-5 years..  |   .8445903   .1285392    -1.11   0.267     .6267593    1.138129
   5+ years  |   1.121125   .0451531     2.84   0.005      1.03603     1.21321
             |
1.~r_disease |    .982884   .0389371    -0.44   0.663     .9094561     1.06224
1.stroke_d~a |   .9601377   .0395996    -0.99   0.324     .8855781    1.040975
1.other_ne~o |   1.027105   .0401996     0.68   0.494     .9512612    1.108996
             |
reduced_ki~t |
Stage 3a/..  |   1.068465   .2436766     0.29   0.772     .6833348    1.670657
      1.esrd |   1.019095   .0332811     0.58   0.562     .9559087    1.086457
1.other_tr~t |   .9629986   .0395569    -0.92   0.359     .8885073    1.043735
  1.asplenia |   .9777897   .0394361    -0.56   0.578     .9034724     1.05822
1.ra_sle_p~s |    1.03165   .0396519     0.81   0.418     .9567883    1.112368
1.other_im~o |   1.001111    .040703     0.03   0.978     .9244301    1.084152
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.00607         0.13        1         0.7229
      2.kids_cat4 |     -0.02902         3.40        1         0.0651
      3.kids_cat4 |     -0.00292         0.03        1         0.8668
      age1        |     -0.02211         1.96        1         0.1616
      age2        |      0.01467         0.90        1         0.3431
      age3        |     -0.01165         0.57        1         0.4504
      0b.male     |            .            .        1             .
      1.male      |     -0.00121         0.01        1         0.9385
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01534         0.98        1         0.3216
      3.obese4cat |     -0.01687         1.12        1         0.2899
      4.obese4cat |     -0.01537         1.05        1         0.3048
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01507         0.93        1         0.3353
      3.smoke_no~s|      0.00194         0.02        1         0.8964
      1b.imd      |            .            .        1             .
      4.imd       |     -0.00808         0.29        1         0.5899
      5.imd       |      0.01306         0.79        1         0.3735
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.00214         0.02        1         0.8889
      3.tot_adul~h|      0.01517         0.89        1         0.3459
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.01716         1.36        1         0.2433
      5.ethnicity |      0.03280         4.46        1         0.0347
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.01380         0.78        1         0.3764
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.00138         0.01        1         0.9286
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.00491         0.10        1         0.7491
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.01080         0.55        1         0.4584
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00337         0.05        1         0.8240
      3.diabcat   |      0.00110         0.01        1         0.9397
      4.diabcat   |      0.01094         0.49        1         0.4819
      5.diabcat   |     -0.01765         1.41        1         0.2349
      6.diabcat   |      0.00620         0.17        1         0.6834
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.01971         1.59        1         0.2072
      3.cancer_e~t|      0.00949         0.36        1         0.5485
      4.cancer_e~t|     -0.00560         0.12        1         0.7306
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.01907         1.67        1         0.1958
      3.cancer_h~t|     -0.01669         1.29        1         0.2552
      4.cancer_h~t|     -0.00383         0.06        1         0.8046
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.01637         1.13        1         0.2876
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00530         0.12        1         0.7256
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00116         0.01        1         0.9406
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01328         0.73        1         0.3930
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.00675         0.19        1         0.6635
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00811         0.30        1         0.5867
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.00509         0.11        1         0.7399
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.02727         3.02        1         0.0820
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.01435         0.90        1         0.3430
      ------------+---------------------------------------------------
      global test |                     36.89       42         0.6943
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:     11.46 /        1 =      11.4550
   1:      1.31 /        1 =       1.3090

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,551             Number of obs    =       1,551
No. of failures      =          371
Time at risk         =        91293
                                                Wald chi2(41)    =    15008.92
Log pseudolikelihood =    -1744.971             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 198 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .9021681   .1535201    -0.61   0.545      .646309    1.259316
3 childre..  |   .9284682   .1709648    -0.40   0.687     .6471871       1.332
4+ childr..  |   1.007779   .1190475     0.07   0.948     .7994921     1.27033
             |
        age1 |   .9838551   .0191288    -0.84   0.403     .9470686     1.02207
        age2 |   1.036803   .0657019     0.57   0.568     .9157054    1.173915
        age3 |   .9134871   .1644089    -0.50   0.615     .6419536    1.299874
      1.male |   1.047783   .0951707     0.51   0.607     .8769128    1.251949
             |
   obese4cat |
Obese I ..)  |   .9466941   .1531495    -0.34   0.735     .6894588    1.299903
Obese II..)  |   .7237696   .1638582    -1.43   0.153     .4643999    1.127999
Obese II..)  |   1.020647   .2385768     0.09   0.930     .6455154     1.61378
             |
smoke_nomiss |
     Former  |   .8029892   .3794449    -0.46   0.642     .3180405    2.027388
    Current  |   .8048903   .1394957    -1.25   0.210     .5730794    1.130469
             |
         imd |
          4  |   .8866729   .1319132    -0.81   0.419     .6624108     1.18686
5 most de..  |   .7537817   .1443645    -1.48   0.140     .5178729    1.097155
             |
tot_adults~h |
          2  |   .6216974   .6399115    -0.46   0.644     .0826875    4.674321
          3  |   1.104677   .7800096     0.14   0.888     .2768242    4.408253
             |
   ethnicity |
Asian or ..  |   1.088803    .217649     0.43   0.670     .7358614    1.611025
      Other  |    .941884   .1610918    -0.35   0.726     .6736204    1.316981
             |
1.htdiag_o~p |   .9313798   .1626623    -0.41   0.684     .6614048    1.311554
1.~y_disease |   1.040406   .1475396     0.28   0.780     .7879416    1.373761
    1.asthma |   .9908172   .2098836    -0.04   0.965     .6541608     1.50073
1.~c_disease |   1.013566   .1557676     0.09   0.930     .7499577    1.369831
             |
     diabcat |
T1DM, con..  |   1.098204   .3366532     0.31   0.760     .6022106     2.00271
T1DM, unc..  |   3.72e-15   2.03e-15   -60.80   0.000     1.27e-15    1.09e-14
T2DM, con..  |   1.236609   .1877824     1.40   0.162     .9182802    1.665289
T2DM, unc..  |   1.517846   .3617702     1.75   0.080     .9513683    2.421625
             |
cancer_exh~t |
  Last year  |   4.17e-15   2.01e-15   -68.68   0.000     1.62e-15    1.07e-14
2-5 years..  |   .3751334   .2147493    -1.71   0.087     .1221535    1.152035
   5+ years  |   1.090939   .1361641     0.70   0.486     .8541991    1.393292
             |
cancer_hae~t |
  Last year  |   6.74e-15   7.50e-15   -29.33   0.000     7.61e-16    5.96e-14
2-5 years..  |   2.038548   .8239562     1.76   0.078     .9231569    4.501593
   5+ years  |   1.411364   .1782584     2.73   0.006      1.10187    1.807789
             |
1.~r_disease |   .9027172   .1174495    -0.79   0.431     .6995275    1.164927
1.stroke_d~a |   .9567616   .1430294    -0.30   0.767     .7137643    1.282486
1.other_ne~o |    .905392   .1472751    -0.61   0.541     .6582281    1.245366
             |
reduced_ki~t |
Stage 3a/..  |   1.702161   1.193483     0.76   0.448     .4306993    6.727087
      1.esrd |   1.067242   .1177671     0.59   0.555     .8596773    1.324923
1.other_tr~t |   1.009287   .1363991     0.07   0.945     .7744262    1.315375
  1.asplenia |     .91083   .1133682    -0.75   0.453     .7136592    1.162475
1.ra_sle_p~s |   1.095311    .137119     0.73   0.467     .8569942      1.3999
1.other_im~o |   .9888246   .1343992    -0.08   0.934     .7575748    1.290663
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_F
> ULLYADJMODEL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_FULLYADJ
> MODEL_ageband_0_timeperiod0.ster saved
(11,235 observations (episodes) created)
(cat_time: 11235 changes made)
(covidadmission: 11235 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,946       58.67       58.67
          1 |      8,030       29.54       88.21
          2 |      3,205       11.79      100.00
------------+-----------------------------------
      Total |     27,181      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,001      3,945 |    15,946 
         1 |     5,601      2,429 |     8,030 
         2 |     2,487        718 |     3,205 
-----------+----------------------+----------
     Total |    20,089      7,092 |    27,181 
(19,212 observations deleted)
   1:      3.03 /        1 =       3.0260

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        8,030             Number of obs    =       8,030
No. of failures      =        2,429
Time at risk         =       378677
                                                Wald chi2(42)    =      321.89
Log pseudolikelihood =   -15299.195             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,003 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.001692   .1662384     0.01   0.992     .7235536    1.386748
 only 12-18  |   .9910265   .2193584    -0.04   0.968      .642209    1.529305
      mixed  |   .9555867   .1475254    -0.29   0.769     .7060897    1.293243
             |
        age1 |   .9950347    .007421    -0.67   0.504     .9805955    1.009686
        age2 |   1.013081   .0242517     0.54   0.587      .966646    1.061746
        age3 |   .9576754   .0660184    -0.63   0.530     .8366424    1.096218
      1.male |   .9886313   .0409533    -0.28   0.783     .9115364    1.072247
             |
   obese4cat |
Obese I ..)  |   .9623287   .0565361    -0.65   0.513     .8576617    1.079769
Obese II..)  |   1.041366    .076194     0.55   0.580     .9022424    1.201942
Obese II..)  |   .9183158   .0872716    -0.90   0.370     .7622521    1.106332
             |
smoke_nomiss |
     Former  |   1.457937   .1765822     3.11   0.002     1.149855    1.848564
    Current  |   1.103885   .0621493     1.76   0.079     .9885545     1.23267
             |
         imd |
          4  |   .9623434   .0504325    -0.73   0.464     .8684045    1.066444
5 most de..  |   1.019778    .070433     0.28   0.777     .8906676    1.167604
             |
tot_adults~h |
          2  |   .6933268   .3314387    -0.77   0.444     .2716619    1.769487
          3  |   1.370399   .5309752     0.81   0.416     .6412693    2.928558
             |
   ethnicity |
Asian or ..  |   1.146304   .0769612     2.03   0.042     1.004966     1.30752
      Other  |    .887239   .0636564    -1.67   0.095     .7708499    1.021201
             |
1.htdiag_o~p |   1.179882   .0943065     2.07   0.038     1.008796    1.379984
1.~y_disease |   .9550878   .0461641    -0.95   0.342     .8687614    1.049992
    1.asthma |   .9742314   .0766833    -0.33   0.740     .8349543    1.136741
1.~c_disease |   1.006379   .0512216     0.12   0.901     .9108315    1.111949
             |
     diabcat |
T1DM, con..  |   .9896968    .126777    -0.08   0.936     .7699561     1.27215
T1DM, unc..  |   1.169607   .2824945     0.65   0.517     .7285342    1.877718
T2DM, con..  |   .9851456   .0579547    -0.25   0.799     .8778603    1.105542
T2DM, unc..  |   .9421403   .1066743    -0.53   0.599     .7546366    1.176233
Diabetes,..  |   7.289766    .965596    15.00   0.000     5.622949    9.450678
             |
cancer_exh~t |
  Last year  |   .6163955   .2716845    -1.10   0.272      .259825    1.462305
2-5 years..  |   .9083964   .1342431    -0.65   0.516     .6799618    1.213574
   5+ years  |   .9269146   .0509119    -1.38   0.167     .8323126    1.032269
             |
cancer_hae~t |
  Last year  |   .7967403   .2875935    -0.63   0.529     .3927036    1.616474
2-5 years..  |   1.078461   .1831108     0.44   0.656     .7731784    1.504281
   5+ years  |   1.055307   .0552272     1.03   0.304     .9524303    1.169297
             |
1.~r_disease |   1.041313   .0534545     0.79   0.430     .9416427    1.151534
1.stroke_d~a |   .9699619   .0506088    -0.58   0.559     .8756737    1.074403
1.other_ne~o |   .9641967    .049466    -0.71   0.477     .8719602     1.06619
             |
reduced_ki~t |
Stage 3a/..  |   .8565291    .254048    -0.52   0.602     .4789325    1.531828
      1.esrd |   1.048199   .0435716     1.13   0.257     .9661868    1.137173
1.other_tr~t |   .9584523   .0499395    -0.81   0.415     .8654046    1.061504
  1.asplenia |   1.066802   .0558244     1.24   0.217     .9628116    1.182023
1.ra_sle_p~s |   .9181386   .0446746    -1.76   0.079     .8346236     1.01001
1.other_im~o |   .9714981   .0487488    -0.58   0.564     .8805003      1.0719
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.01261         0.45        1         0.5022
      2.kids_cat4 |      0.03194         3.01        1         0.0827
      3.kids_cat4 |      0.01966         1.09        1         0.2963
      age1        |      0.00772         0.15        1         0.6969
      age2        |     -0.00616         0.10        1         0.7534
      age3        |      0.00457         0.05        1         0.8147
      0b.male     |            .            .        1             .
      1.male      |      0.02016         1.07        1         0.2999
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.02176         1.17        1         0.2795
      3.obese4cat |     -0.01078         0.32        1         0.5738
      4.obese4cat |      0.00793         0.17        1         0.6786
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.01265         0.38        1         0.5365
      3.smoke_no~s|      0.01670         0.66        1         0.4158
      1b.imd      |            .            .        1             .
      4.imd       |      0.00860         0.19        1         0.6603
      5.imd       |     -0.00595         0.10        1         0.7573
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.00975         0.23        1         0.6312
      3.tot_adul~h|      0.00369         0.04        1         0.8495
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.01107         0.33        1         0.5677
      5.ethnicity |      0.02881         2.13        1         0.1441
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.01238         0.40        1         0.5275
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.02005         0.94        1         0.3322
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.03297         3.09        1         0.0789
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00279         0.02        1         0.8853
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01417         0.53        1         0.4660
      3.diabcat   |     -0.01367         0.48        1         0.4881
      4.diabcat   |     -0.01671         0.80        1         0.3710
      5.diabcat   |      0.03030         2.37        1         0.1235
      6.diabcat   |      0.01039         0.07        1         0.7880
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.05183         8.07        1         0.0045
      3.cancer_e~t|      0.01837         0.77        1         0.3798
      4.cancer_e~t|      0.00490         0.06        1         0.8023
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.03621         2.59        1         0.1078
      3.cancer_h~t|     -0.02884         2.39        1         0.1225
      4.cancer_h~t|     -0.02057         1.03        1         0.3098
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.04043         4.33        1         0.0375
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00903         0.22        1         0.6370
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00960         0.24        1         0.6261
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.00279         0.02        1         0.8883
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.01057         0.28        1         0.5986
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.02634         1.90        1         0.1686
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.03213         2.93        1         0.0868
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.01801         0.77        1         0.3811
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.01039         0.27        1         0.6062
      ------------+---------------------------------------------------
      global test |                     43.59       42         0.4036
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      5.09 /        1 =       5.0920
   1:      0.74 /        1 =       0.7420

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          795             Number of obs    =         795
No. of failures      =          245
Time at risk         =        37012
                                                Wald chi2(41)    =     6333.49
Log pseudolikelihood =   -967.18689             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 176 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.006465   .1863504     0.03   0.972     .7001576    1.446777
3 childre..  |   1.002616   .1786784     0.01   0.988     .7070338    1.421769
4+ childr..  |   .8362016   .1555454    -0.96   0.336     .5807315    1.204056
             |
        age1 |   .9717613   .0267712    -1.04   0.298     .9206822    1.025674
        age2 |   1.118667     .09807     1.28   0.201       .94206    1.328382
        age3 |   .7159604   .1736944    -1.38   0.168     .4450252    1.151843
      1.male |    .738908   .0879378    -2.54   0.011     .5851787    .9330229
             |
   obese4cat |
Obese I ..)  |   .9952238   .1933474    -0.02   0.980     .6800694    1.456425
Obese II..)  |   1.142258   .2680052     0.57   0.571     .7211891    1.809171
Obese II..)  |   1.020729    .339475     0.06   0.951     .5318845    1.958862
             |
smoke_nomiss |
     Former  |   1.313175   .5973071     0.60   0.549      .538453    3.202563
    Current  |   .9471878   .1771257    -0.29   0.772     .6565381    1.366508
             |
         imd |
          4  |   .9673148   .1955649    -0.16   0.869     .6508455    1.437665
5 most de..  |   1.062864   .2286759     0.28   0.777     .6971737     1.62037
             |
tot_adults~h |
          2  |   .9292185   1.159914    -0.06   0.953     .0804618    10.73114
          3  |   .7974019   .8977913    -0.20   0.841     .0877634     7.24505
             |
   ethnicity |
Asian or ..  |   1.377869   .3309766     1.33   0.182     .8604819    2.206349
      Other  |   .8223235   .2021278    -0.80   0.426     .5079449    1.331278
             |
1.htdiag_o~p |     1.2273   .3073709     0.82   0.413     .7512279    2.005071
1.~y_disease |   .9505066   .1646914    -0.29   0.770     .6768151    1.334874
    1.asthma |   1.399627   .3893145     1.21   0.227     .8114196    2.414232
1.~c_disease |   1.031405   .1541488     0.21   0.836     .7695069    1.382438
             |
     diabcat |
T1DM, con..  |   .7826925   .2646734    -0.72   0.469     .4034139    1.518558
T1DM, unc..  |   1.599824   .8746661     0.86   0.390     .5478954    4.671395
T2DM, con..  |   .8529007   .2274174    -0.60   0.551     .5057479    1.438344
T2DM, unc..  |   .7836106   .3600723    -0.53   0.596     .3183975     1.92855
             |
cancer_exh~t |
  Last year  |   4.51e-15   2.64e-15   -56.35   0.000     1.43e-15    1.42e-14
2-5 years..  |   1.069642    .361304     0.20   0.842     .5517204    2.073755
   5+ years  |    .897022   .1716416    -0.57   0.570     .6164942      1.3052
             |
cancer_hae~t |
  Last year  |   7.30e-15   8.06e-15   -29.48   0.000     8.38e-16    6.35e-14
2-5 years..  |     1.5102   1.066368     0.58   0.559     .3784357    6.026662
   5+ years  |   1.018823   .1879222     0.10   0.919     .7097316    1.462524
             |
1.~r_disease |   1.008889    .174741     0.05   0.959     .7184792    1.416683
1.stroke_d~a |   1.023871   .1694857     0.14   0.887     .7401881    1.416277
1.other_ne~o |   .9394983   .1577223    -0.37   0.710     .6760781    1.305555
             |
reduced_ki~t |
Stage 3a/..  |   2.475016   1.015654     2.21   0.027      1.10733    5.531962
      1.esrd |   1.130219   .1618361     0.85   0.393     .8536481    1.496394
1.other_tr~t |   1.209483   .1791024     1.28   0.199     .9047996    1.616766
  1.asplenia |   .9755199   .1698876    -0.14   0.887     .6934236    1.372378
1.ra_sle_p~s |   .9460562   .1514641    -0.35   0.729     .6912564    1.294776
1.other_im~o |   1.103652   .1792713     0.61   0.544     .8027264    1.517389
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_F
> ULLYADJMODEL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_FULLYADJ
> MODEL_ageband_0_timeperiod1.ster saved
(11,235 observations (episodes) created)
(cat_time: 11235 changes made)
(covidadmission: 11235 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,946       58.67       58.67
          1 |      8,030       29.54       88.21
          2 |      3,205       11.79      100.00
------------+-----------------------------------
      Total |     27,181      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,001      3,945 |    15,946 
         1 |     5,601      2,429 |     8,030 
         2 |     2,487        718 |     3,205 
-----------+----------------------+----------
     Total |    20,089      7,092 |    27,181 
(24,037 observations deleted)
   1:      0.85 /        1 =       0.8470

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,205             Number of obs    =       3,205
No. of failures      =          718
Time at risk         =        76671
                                                Wald chi2(41)    =       35.49
Log pseudolikelihood =   -3938.3733             Prob > chi2      =      0.7133

                         (Std. Err. adjusted for 860 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.065154   .3005888     0.22   0.823     .6126347    1.851925
 only 12-18  |   1.348582   .5021675     0.80   0.422      .650007     2.79793
      mixed  |   1.078818   .2880452     0.28   0.776     .6392586    1.820621
             |
        age1 |   1.006039   .0141523     0.43   0.669     .9786795    1.034163
        age2 |   .9793134   .0441117    -0.46   0.643     .8965626    1.069702
        age3 |   1.053964   .1365567     0.41   0.685     .8175985    1.358663
      1.male |   .9495691   .0750433    -0.65   0.513      .813312    1.108654
             |
   obese4cat |
Obese I ..)  |    .981552   .1082319    -0.17   0.866     .7907782     1.21835
Obese II..)  |   1.042647   .1360041     0.32   0.749     .8074313    1.346384
Obese II..)  |   .9845624   .1642092    -0.09   0.926     .7100297    1.365243
             |
smoke_nomiss |
     Former  |   1.149879   .3000009     0.54   0.592     .6895653     1.91747
    Current  |   1.117942   .1180446     1.06   0.291     .9089503    1.374987
             |
         imd |
          4  |   1.115019   .1029584     1.18   0.238     .9304312    1.336227
5 most de..  |   1.163245   .1378426     1.28   0.202     .9221578    1.467362
             |
tot_adults~h |
          2  |   1.060461   .7842138     0.08   0.937     .2489025    4.518148
          3  |   1.218665   .8125665     0.30   0.767     .3298605    4.502338
             |
   ethnicity |
Asian or ..  |   1.008502   .1337549     0.06   0.949     .7776506    1.307885
      Other  |   1.227475   .1391333     1.81   0.071     .9829463    1.532836
             |
1.htdiag_o~p |   1.178806   .1811959     1.07   0.285     .8721734    1.593242
1.~y_disease |   .9927433   .0936764    -0.08   0.938     .8251191    1.194421
    1.asthma |   .9102224   .1263377    -0.68   0.498     .6934287    1.194795
1.~c_disease |   1.032975   .0933718     0.36   0.720     .8652641    1.233193
             |
     diabcat |
T1DM, con..  |   1.628003   .3399189     2.33   0.020     1.081256    2.451218
T1DM, unc..  |   1.199019   .5252624     0.41   0.679     .5080828    2.829552
T2DM, con..  |   .9510474   .0972952    -0.49   0.624     .7782543    1.162205
T2DM, unc..  |   1.106062   .2250659     0.50   0.620     .7422902    1.648107
             |
cancer_exh~t |
  Last year  |   .4772759   .3378202    -1.05   0.296     .1192014    1.910987
2-5 years..  |   .7846035    .216919    -0.88   0.380     .4563719    1.348906
   5+ years  |   .9067679   .0954239    -0.93   0.352     .7377679    1.114481
             |
cancer_hae~t |
  Last year  |    1.77116   .7039262     1.44   0.150      .812752    3.859736
2-5 years..  |   1.021615   .3073742     0.07   0.943     .5664812    1.842422
   5+ years  |   1.111121   .1079286     1.08   0.278     .9185017    1.344134
             |
1.~r_disease |   .9688314   .0937624    -0.33   0.744     .8014379    1.171188
1.stroke_d~a |   .9977799   .0942307    -0.02   0.981     .8291765    1.200667
1.other_ne~o |    1.07753   .0969551     0.83   0.407     .9033151    1.285345
             |
reduced_ki~t |
Stage 3a/..  |   1.536112   .5471664     1.21   0.228     .7642286    3.087612
      1.esrd |   .9232802   .0758818    -0.97   0.331     .7859151    1.084654
1.other_tr~t |   .9833138   .0858539    -0.19   0.847     .8286536     1.16684
  1.asplenia |   .8881061   .0910928    -1.16   0.247     .7263691    1.085856
1.ra_sle_p~s |   1.181831   .1090329     1.81   0.070     .9863378    1.416072
1.other_im~o |   1.096361   .0985378     1.02   0.306     .9192851    1.307547
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.06395         3.15        1         0.0761
      2.kids_cat4 |     -0.03734         1.30        1         0.2544
      3.kids_cat4 |     -0.05676         2.63        1         0.1051
      age1        |     -0.05322         2.40        1         0.1210
      age2        |      0.05817         2.93        1         0.0868
      age3        |     -0.05985         3.09        1         0.0787
      0b.male     |            .            .        1             .
      1.male      |     -0.02947         0.79        1         0.3736
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02124         0.37        1         0.5437
      3.obese4cat |      0.00176         0.00        1         0.9615
      4.obese4cat |      0.04095         1.43        1         0.2325
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.01953         0.28        1         0.5964
      3.smoke_no~s|      0.00426         0.01        1         0.9075
      1b.imd      |            .            .        1             .
      4.imd       |      0.01687         0.23        1         0.6286
      5.imd       |      0.02098         0.34        1         0.5611
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.05377         2.65        1         0.1039
      3.tot_adul~h|      0.04870         2.44        1         0.1182
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.00927         0.07        1         0.7902
      5.ethnicity |      0.07122         3.75        1         0.0528
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.03672         1.22        1         0.2702
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.03442         0.99        1         0.3200
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.03471         0.88        1         0.3488
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.02627         0.55        1         0.4568
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02456         0.52        1         0.4712
      3.diabcat   |     -0.01221         0.11        1         0.7411
      4.diabcat   |      0.01277         0.13        1         0.7145
      5.diabcat   |     -0.04204         1.51        1         0.2191
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.02865         0.69        1         0.4050
      3.cancer_e~t|     -0.00564         0.02        1         0.8794
      4.cancer_e~t|     -0.00318         0.01        1         0.9254
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.03491         0.74        1         0.3893
      3.cancer_h~t|     -0.00930         0.07        1         0.7851
      4.cancer_h~t|      0.03645         1.12        1         0.2909
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.02917         0.76        1         0.3822
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.04173         1.52        1         0.2179
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.02208         0.36        1         0.5463
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.07262         3.64        1         0.0565
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.01383         0.17        1         0.6793
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.04751         1.73        1         0.1887
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.08411         6.24        1         0.0125
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.01191         0.12        1         0.7294
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.02669         0.56        1         0.4540
      ------------+---------------------------------------------------
      global test |                     37.11       41         0.6442
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      1.26 /        1 =       1.2580
   1:      0.26 /        1 =       0.2630

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          304             Number of obs    =         304
No. of failures      =           68
Time at risk         =         7396
                                                Wald chi2(39)    =     8010.96
Log pseudolikelihood =   -201.60597             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 134 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .9421192   .3718858    -0.15   0.880     .4346186    2.042224
3 childre..  |   .9157129   .5182241    -0.16   0.876     .3020256    2.776354
4+ childr..  |   1.348774   .4743276     0.85   0.395     .6770094    2.687101
             |
        age1 |   1.074871   .0590844     1.31   0.189     .9650881    1.197143
        age2 |   .7293203   .1274945    -1.81   0.071     .5177467    1.027352
        age3 |   2.649594    1.29161     2.00   0.046     1.019155    6.888402
      1.male |   .9531272   .2680168    -0.17   0.864     .5492819    1.653889
             |
   obese4cat |
Obese I ..)  |   1.209619   .4694017     0.49   0.624     .5653709    2.587997
Obese II..)  |   2.077979   1.090355     1.39   0.163     .7430178    5.811429
Obese II..)  |   1.036082   .4914222     0.07   0.940     .4089427     2.62498
             |
smoke_nomiss |
     Former  |   1.565301   1.075839     0.65   0.514     .4069703    6.020503
    Current  |   1.296388   .5765763     0.58   0.559      .542198    3.099645
             |
         imd |
          4  |   .9576204   .3296718    -0.13   0.900     .4877054    1.880309
5 most de..  |   .7245548   .3865326    -0.60   0.546     .2546687    2.061422
             |
tot_adults~h |
          2  |   2.36e+08          .        .       .            .           .
          3  |   2.59e+08   3.27e+08    15.36   0.000     2.19e+07    3.07e+09
             |
   ethnicity |
Asian or ..  |   .7398898   .3966103    -0.56   0.574     .2587553    2.115655
      Other  |   1.102386   .5505156     0.20   0.845     .4142441    2.933671
             |
1.htdiag_o~p |   .9475366   .4657166    -0.11   0.913     .3615999    2.482925
1.~y_disease |   1.244885   .3798168     0.72   0.473     .6845825    2.263771
    1.asthma |   1.179053   .6139484     0.32   0.752     .4249146    3.271637
1.~c_disease |   .6152516   .2341952    -1.28   0.202     .2917718    1.297365
             |
     diabcat |
T1DM, con..  |    5.44284    4.15571     2.22   0.026     1.218757    24.30714
T1DM, unc..  |   1.84e-15   2.16e-15   -28.97   0.000     1.86e-16    1.83e-14
T2DM, con..  |   .8898035   .3041205    -0.34   0.733     .4553728    1.738686
T2DM, unc..  |   .5575656   .5107785    -0.64   0.524     .0925809    3.357921
             |
cancer_exh~t |
  Last year  |   4.93e-15   7.02e-15   -23.13   0.000     3.02e-16    8.04e-14
2-5 years..  |   .7785016   .4509186    -0.43   0.666     .2501682    2.422629
   5+ years  |     .97292   .3329983    -0.08   0.936     .4974381    1.902897
             |
cancer_hae~t |
  Last year  |   1.163094   .8152463     0.22   0.829     .2944308    4.594588
2-5 years..  |   4.62e-15   3.64e-15   -41.95   0.000     9.89e-16    2.16e-14
   5+ years  |   1.346846   .4987734     0.80   0.421     .6517711    2.783177
             |
1.~r_disease |   .9417035   .4287348    -0.13   0.895     .3858182    2.298506
1.stroke_d~a |   .8641345   .3031559    -0.42   0.677     .4344728      1.7187
1.other_ne~o |   .4308884    .176272    -2.06   0.040     .1932623    .9606885
             |
reduced_ki~t |
       None  |          1  (omitted)
      1.esrd |   1.053039    .278797     0.20   0.845     .6267364     1.76931
1.other_tr~t |   1.309567   .4034303     0.88   0.381     .7159837    2.395257
  1.asplenia |   1.043417   .3711332     0.12   0.905     .5196293    2.095183
1.ra_sle_p~s |   1.676107   .5491339     1.58   0.115      .881916    3.185491
1.other_im~o |   .5103562    .200143    -1.72   0.086     .2366264    1.100737
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_F
> ULLYADJMODEL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_FULLYADJ
> MODEL_ageband_0_timeperiod2.ster saved
(11,235 observations (episodes) created)
(cat_time: 11235 changes made)
(covidadmission: 11235 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,946       58.67       58.67
          1 |      8,030       29.54       88.21
          2 |      3,205       11.79      100.00
------------+-----------------------------------
      Total |     27,181      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,001      3,945 |    15,946 
         1 |     5,601      2,429 |     8,030 
         2 |     2,487        718 |     3,205 
-----------+----------------------+----------
     Total |    20,089      7,092 |    27,181 
(27,242 observations deleted)
   1:      0.00 /        1 =       0.0030
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covidadmission)
   1:      0.00 /        1 =       0.0030
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covidadmission)
(3,162 observations (episodes) created)
(cat_time: 3162 changes made)
(covidadmission: 3162 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,589       59.21       59.21
          1 |      2,271       29.30       88.50
          2 |        891       11.50      100.00
------------+-----------------------------------
      Total |      7,751      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,404      1,185 |     4,589 
         1 |     1,575        696 |     2,271 
         2 |       686        205 |       891 
-----------+----------------------+----------
     Total |     5,665      2,086 |     7,751 
(3,178 observations deleted)
   1:      1.33 /        1 =       1.3280

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,589             Number of obs    =       4,589
No. of failures      =        1,185
Time at risk         =       262734
                                                Wald chi2(42)    =       33.52
Log pseudolikelihood =   -6897.8384             Prob > chi2      =      0.8218

                         (Std. Err. adjusted for 927 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.117997   .2611974     0.48   0.633      .707253    1.767285
 only 12-18  |   1.563528   .4871927     1.43   0.151     .8489312    2.879643
      mixed  |   1.201017   .2662755     0.83   0.409     .7777335    1.854674
             |
        age1 |   1.009921   .0264445     0.38   0.706     .9593985    1.063105
        age2 |   .9366177   .1303674    -0.47   0.638     .7129909    1.230384
        age3 |   1.129767   .3112462     0.44   0.658     .6583949    1.938615
      1.male |   .9915722   .0591444    -0.14   0.887     .8821706    1.114541
             |
   obese4cat |
Obese I ..)  |   .9577865   .0845228    -0.49   0.625     .8056601    1.138638
Obese II..)  |    .923267   .0978362    -0.75   0.451     .7501147    1.136389
Obese II..)  |   1.002252   .1199584     0.02   0.985      .792679    1.267232
             |
smoke_nomiss |
     Former  |   .9601628   .1770311    -0.22   0.825     .6689653    1.378117
    Current  |   .9477404   .0885849    -0.57   0.566     .7890925    1.138285
             |
         imd |
          4  |   1.015275   .0740937     0.21   0.835      .879962    1.171396
5 most de..  |   .9217674   .0966965    -0.78   0.437     .7504598    1.132179
             |
tot_adults~h |
          2  |   .7127781   .3537964    -0.68   0.495     .2694323    1.885641
          3  |   .6420871   .2629394    -1.08   0.279     .2877535     1.43274
             |
   ethnicity |
Asian or ..  |   .9712683    .093316    -0.30   0.762     .8045607    1.172518
      Other  |   .9978546   .0933974    -0.02   0.982     .8306084    1.198776
             |
1.htdiag_o~p |   .9479522   .1037016    -0.49   0.625     .7650132    1.174638
1.~y_disease |     1.0385   .0756678     0.52   0.604     .9002966    1.197918
    1.asthma |   .8936225   .1009895    -1.00   0.320     .7160753    1.115192
1.~c_disease |   1.000047    .076034     0.00   1.000     .8615953    1.160747
             |
     diabcat |
T1DM, con..  |   .7771847   .1742937    -1.12   0.261      .500762    1.206194
T1DM, unc..  |   .7720237   .2882213    -0.69   0.488     .3714066    1.604765
T2DM, con..  |   1.079941     .08583     0.97   0.333     .9241654    1.261975
T2DM, unc..  |    1.30955   .1857658     1.90   0.057     .9916883    1.729295
Diabetes,..  |   .8880515   .9311792    -0.11   0.910     .1137361    6.933904
             |
cancer_exh~t |
  Last year  |   .8992997   .3724876    -0.26   0.798     .3993365     2.02521
2-5 years..  |   1.342534   .2299239     1.72   0.085      .959727    1.878033
   5+ years  |   .8958518   .0695261    -1.42   0.156      .769441    1.043031
             |
cancer_hae~t |
  Last year  |   1.678119   .5146618     1.69   0.091     .9199584      3.0611
2-5 years..  |   1.204329   .2453364     0.91   0.361     .8078768    1.795334
   5+ years  |   .9088088   .0753991    -1.15   0.249     .7724187    1.069282
             |
1.~r_disease |    1.04979   .0757121     0.67   0.500     .9114079    1.209183
1.stroke_d~a |   1.038271   .0736939     0.53   0.597     .9034304    1.193238
1.other_ne~o |   1.114527   .0771602     1.57   0.117     .9731077    1.276499
             |
reduced_ki~t |
Stage 3a/..  |   .8942354   .1358076    -0.74   0.462     .6640179     1.20427
      1.esrd |   1.049805    .063156     0.81   0.419     .9330403    1.181181
1.other_tr~t |   1.021654   .0737627     0.30   0.767     .8868453    1.176956
  1.asplenia |   .9724236   .0696768    -0.39   0.696     .8450153    1.119042
1.ra_sle_p~s |   .9216858   .0683319    -1.10   0.271     .7970335    1.065833
1.other_im~o |   1.001791   .0733114     0.02   0.980     .8679328    1.156295
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.01337         0.25        1         0.6140
      2.kids_cat4 |     -0.01728         0.49        1         0.4833
      3.kids_cat4 |      0.00761         0.08        1         0.7718
      age1        |      0.00405         0.02        1         0.8812
      age2        |      0.00308         0.01        1         0.9092
      age3        |     -0.00565         0.04        1         0.8347
      0b.male     |            .            .        1             .
      1.male      |      0.00410         0.02        1         0.8847
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01539         0.32        1         0.5716
      3.obese4cat |     -0.03012         1.18        1         0.2773
      4.obese4cat |     -0.02861         1.08        1         0.2995
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.05298         3.34        1         0.0676
      3.smoke_no~s|      0.02572         0.91        1         0.3389
      1b.imd      |            .            .        1             .
      4.imd       |     -0.00363         0.02        1         0.8946
      5.imd       |      0.01546         0.33        1         0.5661
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.00051         0.00        1         0.9850
      3.tot_adul~h|      0.02189         0.66        1         0.4177
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.02885         1.10        1         0.2949
      5.ethnicity |     -0.05418         3.76        1         0.0524
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.04237         2.51        1         0.1133
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.04056         2.17        1         0.1409
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.03572         1.69        1         0.1932
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.04871         3.29        1         0.0696
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.02830         1.03        1         0.3113
      3.diabcat   |      0.01225         0.19        1         0.6643
      4.diabcat   |      0.02474         0.90        1         0.3420
      5.diabcat   |      0.00426         0.02        1         0.8781
      6.diabcat   |     -0.01313         0.24        1         0.6244
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.05155         2.87        1         0.0902
      3.cancer_e~t|      0.05884         3.73        1         0.0536
      4.cancer_e~t|     -0.03640         1.79        1         0.1811
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.03116         1.24        1         0.2657
      3.cancer_h~t|      0.00069         0.00        1         0.9803
      4.cancer_h~t|     -0.01608         0.37        1         0.5434
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.03632         1.74        1         0.1877
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.04144         2.12        1         0.1451
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.01650         0.33        1         0.5652
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.02422         0.72        1         0.3952
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.01571         0.31        1         0.5771
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.02490         0.84        1         0.3599
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.01732         0.35        1         0.5519
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.00709         0.06        1         0.7989
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.01612         0.34        1         0.5590
      ------------+---------------------------------------------------
      global test |                     42.17       42         0.4637
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      2.23 /        1 =       2.2350
   1:      0.41 /        1 =       0.4140

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          452             Number of obs    =         452
No. of failures      =          109
Time at risk         =        25967
                                                Wald chi2(41)    =     5942.20
Log pseudolikelihood =   -368.58832             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 151 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .5919778   .1823953    -1.70   0.089     .3236237    1.082856
3 childre..  |   1.118304   .3347839     0.37   0.709      .621925    2.010861
4+ childr..  |   .8001717   .1902725    -0.94   0.348      .502084    1.275235
             |
        age1 |   1.046657   .0893069     0.53   0.593     .8854717    1.237182
        age2 |   .7427722   .3547185    -0.62   0.533     .2913101    1.893894
        age3 |   1.736399   1.657487     0.58   0.563     .2673816    11.27633
      1.male |   1.152379   .2333557     0.70   0.484     .7748679    1.713811
             |
   obese4cat |
Obese I ..)  |   1.450406    .431134     1.25   0.211      .809971    2.597226
Obese II..)  |   .7125317   .2565485    -0.94   0.347     .3518255    1.443049
Obese II..)  |    .723685   .3138286    -0.75   0.456     .3093307    1.693075
             |
smoke_nomiss |
     Former  |   1.165672   .6944112     0.26   0.797      .362661    3.746727
    Current  |   .9482144   .3884382    -0.13   0.897     .4248248    2.116427
             |
         imd |
          4  |   1.349858   .3792939     1.07   0.286     .7782351    2.341346
5 most de..  |   1.441859   .4527639     1.17   0.244     .7791727    2.668161
             |
tot_adults~h |
          2  |   5.47e+08          .        .       .            .           .
          3  |   2.45e+08   1.57e+08    30.03   0.000     6.94e+07    8.63e+08
             |
   ethnicity |
Asian or ..  |   .5758409   .2459953    -1.29   0.196     .2492729     1.33024
      Other  |   .5160831   .2173852    -1.57   0.116     .2260348    1.178322
             |
1.htdiag_o~p |   .6347792   .3202995    -0.90   0.368     .2361129    1.706576
1.~y_disease |   1.429722   .3647683     1.40   0.161     .8671267    2.357331
    1.asthma |   1.488407   .6489154     0.91   0.362     .6333082    3.498069
1.~c_disease |   1.044277   .2788048     0.16   0.871     .6188119     1.76227
             |
     diabcat |
T1DM, con..  |   .8785876   .6818412    -0.17   0.868     .1919541    4.021359
T1DM, unc..  |   .8701836   .6008853    -0.20   0.840     .2248191    3.368128
T2DM, con..  |   .5909644   .1977577    -1.57   0.116     .3067037    1.138685
T2DM, unc..  |   1.050411   .5450094     0.09   0.924     .3799356    2.904077
Diabetes,..  |   6.48e-15   6.00e-15   -35.27   0.000     1.05e-15    3.98e-14
             |
cancer_exh~t |
  Last year  |   1.364467   .9110459     0.47   0.642     .3686558    5.050157
2-5 years..  |   .9243303   .6312137    -0.12   0.908     .2424109    3.524538
   5+ years  |   .6522115    .196928    -1.42   0.157     .3608923    1.178689
             |
cancer_hae~t |
  Last year  |    4.05133   3.144654     1.80   0.071     .8848964    18.54824
2-5 years..  |   .3938448   .3359859    -1.09   0.275     .0739898    2.096421
   5+ years  |   .6901024   .2352301    -1.09   0.277     .3538106    1.346035
             |
1.~r_disease |   1.114152   .2842634     0.42   0.672     .6757249    1.837042
1.stroke_d~a |   .7879423   .2264765    -0.83   0.407     .4485754    1.384055
1.other_ne~o |   1.271333   .3139242     0.97   0.331     .7835667     2.06273
             |
reduced_ki~t |
Stage 3a/..  |   1.227731    .629542     0.40   0.689     .4494006    3.354075
      1.esrd |    1.03198   .1848374     0.18   0.860     .7264625    1.465985
1.other_tr~t |    .534124   .1536661    -2.18   0.029      .303916    .9387082
  1.asplenia |   .9266897   .2720162    -0.26   0.795     .5212866    1.647374
1.ra_sle_p~s |   .9854807   .2737535    -0.05   0.958     .5717361    1.698637
1.other_im~o |   1.017321   .2806905     0.06   0.950     .5923819    1.747086
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_F
> ULLYADJMODEL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_FULLYADJ
> MODEL_ageband_1_timeperiod0.ster saved
(3,162 observations (episodes) created)
(cat_time: 3162 changes made)
(covidadmission: 3162 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,589       59.21       59.21
          1 |      2,271       29.30       88.50
          2 |        891       11.50      100.00
------------+-----------------------------------
      Total |      7,751      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,404      1,185 |     4,589 
         1 |     1,575        696 |     2,271 
         2 |       686        205 |       891 
-----------+----------------------+----------
     Total |     5,665      2,086 |     7,751 
(5,496 observations deleted)
   1:      1.57 /        1 =       1.5710

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,271             Number of obs    =       2,271
No. of failures      =          696
Time at risk         =       106248
                                                Wald chi2(42)    =     2865.85
Log pseudolikelihood =   -3488.5031             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 761 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.672507   .4857412     1.77   0.077      .946577    2.955152
 only 12-18  |   1.824085   .7227092     1.52   0.129     .8390657    3.965466
      mixed  |   1.737333   .4768328     2.01   0.044     1.014519     2.97513
             |
        age1 |   1.013558   .0334391     0.41   0.683     .9500924    1.081263
        age2 |   .9063326   .1586174    -0.56   0.574     .6431595    1.277193
        age3 |   1.229742   .4249904     0.60   0.550     .6246612    2.420937
      1.male |   1.006912   .0776679     0.09   0.929     .8656339    1.171247
             |
   obese4cat |
Obese I ..)  |   1.117854   .1238302     1.01   0.315     .8996912    1.388919
Obese II..)  |   .9702191   .1310086    -0.22   0.823     .7446157    1.264176
Obese II..)  |   1.004452    .156283     0.03   0.977      .740441    1.362599
             |
smoke_nomiss |
     Former  |   1.299038   .2895137     1.17   0.240     .8392984    2.010607
    Current  |   1.038124   .1259331     0.31   0.758     .8184481    1.316761
             |
         imd |
          4  |   1.091169   .1043023     0.91   0.361     .9047482    1.316002
5 most de..  |   .8692422   .1112754    -1.09   0.274     .6763551    1.117138
             |
tot_adults~h |
          2  |    1.13752   .8616773     0.17   0.865     .2577324     5.02052
          3  |   .9495091    .596821    -0.08   0.934     .2769938    3.254829
             |
   ethnicity |
Asian or ..  |   1.089675   .1287976     0.73   0.467     .8643434    1.373749
      Other  |   1.001636   .1216393     0.01   0.989     .7894771    1.270809
             |
1.htdiag_o~p |   1.478442   .2516819     2.30   0.022     1.059011    2.063993
1.~y_disease |   1.022798   .1040712     0.22   0.825     .8378747    1.248536
    1.asthma |   1.015651    .137898     0.11   0.909     .7783493    1.325302
1.~c_disease |   .9947996   .0938541    -0.06   0.956     .8268548    1.196856
             |
     diabcat |
T1DM, con..  |   1.091421   .2971962     0.32   0.748     .6400418    1.861128
T1DM, unc..  |   1.843332   .5629729     2.00   0.045     1.013066     3.35405
T2DM, con..  |   .8967196   .0943719    -1.04   0.300     .7295838    1.102143
T2DM, unc..  |   1.158361   .2467114     0.69   0.490     .7630484    1.758472
Diabetes,..  |   1.39e-14   8.82e-15   -50.27   0.000     4.00e-15    4.82e-14
             |
cancer_exh~t |
  Last year  |   .2642958   .2826489    -1.24   0.213     .0324923    2.149811
2-5 years..  |   1.461422   .3511107     1.58   0.114      .912582    2.340341
   5+ years  |   1.198242   .1157073     1.87   0.061     .9916282    1.447905
             |
cancer_hae~t |
  Last year  |   1.573682   .7634624     0.93   0.350     .6080816    4.072605
2-5 years..  |   .5694145   .2257006    -1.42   0.155     .2618395    1.238289
   5+ years  |   1.129939   .1131221     1.22   0.222     .9286208    1.374902
             |
1.~r_disease |   1.213013   .1145485     2.04   0.041     1.008054    1.459644
1.stroke_d~a |   .9856354   .0965086    -0.15   0.883     .8135249    1.194158
1.other_ne~o |   1.032926   .1015657     0.33   0.742     .8518677    1.252467
             |
reduced_ki~t |
Stage 3a/..  |   1.178556   .2096659     0.92   0.356     .8316122    1.670242
      1.esrd |   .9340704   .0796087    -0.80   0.424     .7903757     1.10389
1.other_tr~t |   1.034404    .095039     0.37   0.713     .8639401    1.238503
  1.asplenia |   1.043642   .1038599     0.43   0.668     .8587022    1.268412
1.ra_sle_p~s |   1.188898   .1103124     1.86   0.062     .9912096    1.426014
1.other_im~o |   1.025205   .0959688     0.27   0.790      .853356    1.231661
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.03326         0.74        1         0.3901
      2.kids_cat4 |      0.01038         0.07        1         0.7891
      3.kids_cat4 |      0.01087         0.07        1         0.7845
      age1        |     -0.03750         1.09        1         0.2955
      age2        |      0.03820         1.13        1         0.2874
      age3        |     -0.03664         1.03        1         0.3094
      0b.male     |            .            .        1             .
      1.male      |      0.04937         1.82        1         0.1768
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02716         0.62        1         0.4306
      3.obese4cat |     -0.04926         1.89        1         0.1693
      4.obese4cat |     -0.02255         0.38        1         0.5366
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.03270         0.78        1         0.3776
      3.smoke_no~s|     -0.03178         0.82        1         0.3646
      1b.imd      |            .            .        1             .
      4.imd       |     -0.03733         1.26        1         0.2626
      5.imd       |      0.05675         2.24        1         0.1347
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.00629         0.03        1         0.8522
      3.tot_adul~h|     -0.01860         0.28        1         0.5951
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.00807         0.05        1         0.8236
      5.ethnicity |      0.00338         0.01        1         0.9253
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.07191         4.44        1         0.0351
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.04608         1.90        1         0.1680
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.01612         0.21        1         0.6462
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.04345         1.51        1         0.2198
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00871         0.06        1         0.8114
      3.diabcat   |      0.03896         1.03        1         0.3109
      4.diabcat   |      0.02444         0.53        1         0.4672
      5.diabcat   |      0.00775         0.05        1         0.8216
      6.diabcat   |      0.01496         0.02        1         0.8957
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.03132         0.91        1         0.3414
      3.cancer_e~t|      0.05292         1.78        1         0.1822
      4.cancer_e~t|      0.01501         0.19        1         0.6663
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.00521         0.02        1         0.8891
      3.cancer_h~t|      0.00165         0.00        1         0.9641
      4.cancer_h~t|     -0.04524         1.73        1         0.1887
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.02124         0.36        1         0.5475
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.05534         2.49        1         0.1146
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.00717         0.04        1         0.8375
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.05475         2.43        1         0.1188
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.02512         0.52        1         0.4710
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00200         0.00        1         0.9578
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.05299         2.37        1         0.1235
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.02444         0.52        1         0.4726
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.05887         2.66        1         0.1027
      ------------+---------------------------------------------------
      global test |                     40.96       42         0.5166
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      0.94 /        1 =       0.9450
   1:      0.34 /        1 =       0.3420

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          214             Number of obs    =         214
No. of failures      =           66
Time at risk         =        10160
                                                Wald chi2(37)    =     1639.89
Log pseudolikelihood =   -154.75387             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 111 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .4525546   .2273215    -1.58   0.114     .1690854    1.211256
3 childre..  |   .9284133   .3981795    -0.17   0.863     .4005683    2.151821
4+ childr..  |   .6302349   .2302119    -1.26   0.206     .3080179    1.289523
             |
        age1 |   1.002198   .1292179     0.02   0.986     .7784026    1.290336
        age2 |   1.263078   .9096208     0.32   0.746     .3079124    5.181233
        age3 |   .4929319    .708568    -0.49   0.623     .0294593     8.24806
      1.male |    .868668   .2798589    -0.44   0.662     .4619789    1.633374
             |
   obese4cat |
Obese I ..)  |   1.732186   .6872492     1.38   0.166     .7959357    3.769735
Obese II..)  |   1.116749   .6317542     0.20   0.845     .3684884    3.384444
Obese II..)  |   .4459073   .2703942    -1.33   0.183     .1358575    1.463543
             |
smoke_nomiss |
     Former  |   1.490639   2.094843     0.28   0.776      .094875    23.42034
    Current  |   1.569504   .6407208     1.10   0.270     .7051398     3.49341
             |
         imd |
          4  |   2.133047   .9196067     1.76   0.079     .9162781    4.965619
5 most de..  |   1.304063   .6624336     0.52   0.601     .4818455    3.529304
             |
tot_adults~h |
          2  |   1.27e+10          .        .       .            .           .
          3  |   3.43e+09   2.93e+09    25.74   0.000     6.45e+08    1.83e+10
             |
   ethnicity |
Asian or ..  |   1.137296   .5257784     0.28   0.781     .4595765    2.814419
      Other  |   .6567799   .3826519    -0.72   0.471     .2096498    2.057526
             |
1.htdiag_o~p |   .7188093   .4537001    -0.52   0.601     .2086171    2.476723
1.~y_disease |   2.128975   .9503169     1.69   0.090     .8875996    5.106507
    1.asthma |    1.50501   .8501676     0.72   0.469     .4973963    4.553822
1.~c_disease |    1.37007   .5467284     0.79   0.430     .6267139    2.995132
             |
     diabcat |
T1DM, con..  |   2.596275   2.692191     0.92   0.358     .3401754    19.81521
T1DM, unc..  |   19.95464   26.17401     2.28   0.022     1.525963     260.942
T2DM, con..  |   .7970608   .3141253    -0.58   0.565     .3681535    1.725655
T2DM, unc..  |   1.002598   .6651966     0.00   0.997     .2731352    3.680238
Diabetes,..  |   4.76e-20          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   6.39e-20          .        .       .            .           .
2-5 years..  |   1.138847   .9195313     0.16   0.872     .2339839    5.543002
   5+ years  |   1.015937   .4298009     0.04   0.970     .4433621    2.327957
             |
cancer_hae~t |
  Last year  |   2.68e-20          .        .       .            .           .
2-5 years..  |   1.08e-20          .        .       .            .           .
   5+ years  |   1.865151   .7114582     1.63   0.102     .8831307    3.939156
             |
1.~r_disease |   1.969115    .969816     1.38   0.169     .7499677    5.170106
1.stroke_d~a |   1.235957   .4736344     0.55   0.580     .5831928    2.619357
1.other_ne~o |   1.193165   .5131953     0.41   0.681     .5135562    2.772126
             |
reduced_ki~t |
Stage 3a/..  |   .5557364    .565645    -0.58   0.564     .0755946    4.085517
      1.esrd |   .4628061    .143913    -2.48   0.013     .2516005    .8513077
1.other_tr~t |   .9030776   .3048508    -0.30   0.763     .4660001    1.750105
  1.asplenia |   .9002398   .3241407    -0.29   0.770     .4445026    1.823233
1.ra_sle_p~s |   2.169431   .7200145     2.33   0.020     1.131982    4.157688
1.other_im~o |   .6656721   .2264246    -1.20   0.232     .3417661    1.296557
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_F
> ULLYADJMODEL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_gp_number_kids_FULLYADJ
> MODEL_ageband_1_timeperiod1.ster saved
(3,162 observations (episodes) created)
(cat_time: 3162 changes made)
(covidadmission: 3162 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,589       59.21       59.21
          1 |      2,271       29.30       88.50
          2 |        891       11.50      100.00
------------+-----------------------------------
      Total |      7,751      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,404      1,185 |     4,589 
         1 |     1,575        696 |     2,271 
         2 |       686        205 |       891 
-----------+----------------------+----------
     Total |     5,665      2,086 |     7,751 
(6,876 observations deleted)
   1:      0.64 /        1 =       0.6390

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          891             Number of obs    =         891
No. of failures      =          205
Time at risk         =        21410
                                                Wald chi2(41)    =     6762.33
Log pseudolikelihood =   -833.07883             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 528 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9522695   .4644992    -0.10   0.920     .3660663    2.477194
 only 12-18  |   3.125506   2.137516     1.67   0.096     .8180659    11.94132
      mixed  |   1.113179   .4698866     0.25   0.799     .4867013    2.546055
             |
        age1 |   1.141405   .0791073     1.91   0.056     .9964269    1.307476
        age2 |   .5477262   .1903241    -1.73   0.083     .2771965    1.082279
        age3 |   3.181272   2.147471     1.71   0.086     .8472462    11.94516
      1.male |   .7467403   .1125885    -1.94   0.053     .5556882    1.003478
             |
   obese4cat |
Obese I ..)  |   .9111982   .1970485    -0.43   0.667     .5964015    1.392153
Obese II..)  |   .9841744   .2691104    -0.06   0.953     .5758661    1.681987
Obese II..)  |   1.278726   .3632813     0.87   0.387     .7327476     2.23152
             |
smoke_nomiss |
     Former  |   2.875321   1.194479     2.54   0.011     1.273727    6.490772
    Current  |   1.100922   .2566142     0.41   0.680     .6971874    1.738454
             |
         imd |
          4  |   1.142072   .2152671     0.70   0.481     .7893184    1.652476
5 most de..  |   1.210282   .2621702     0.88   0.378     .7915899    1.850432
             |
tot_adults~h |
          2  |   2.23e+09          .        .       .            .           .
          3  |   2.93e+09   3.09e+09    20.69   0.000     3.72e+08    2.31e+10
             |
   ethnicity |
Asian or ..  |   .8294039   .1986978    -0.78   0.435     .5186164    1.326435
      Other  |   1.113453   .2361522     0.51   0.612     .7347521    1.687343
             |
1.htdiag_o~p |   .6867224   .1623576    -1.59   0.112     .4320528    1.091505
1.~y_disease |   1.148843   .2347151     0.68   0.497     .7697596    1.714612
    1.asthma |   .6065499   .1886067    -1.61   0.108     .3297504    1.115701
1.~c_disease |   .6744125   .1362754    -1.95   0.051     .4538656     1.00213
             |
     diabcat |
T1DM, con..  |   2.026647   1.023975     1.40   0.162     .7528415    5.455726
T1DM, unc..  |   4.576994   4.759496     1.46   0.144     .5962633    35.13359
T2DM, con..  |   1.465325   .2696265     2.08   0.038     1.021666    2.101643
T2DM, unc..  |   .6868972   .3295692    -0.78   0.434     .2682195    1.759111
Diabetes,..  |   5.43e-15   5.92e-15   -30.12   0.000     6.40e-16    4.60e-14
             |
cancer_exh~t |
  Last year  |   2.010297   2.119808     0.66   0.508      .254501    15.87928
2-5 years..  |   4.32e-15   2.24e-15   -63.87   0.000     1.56e-15    1.19e-14
   5+ years  |   1.237244   .2161847     1.22   0.223     .8784648    1.742555
             |
cancer_hae~t |
  Last year  |   2.520157   1.070847     2.18   0.030     1.095825    5.795809
2-5 years..  |   .4780689   .3485005    -1.01   0.311     .1145475    1.995242
   5+ years  |   .9929372   .2028628    -0.03   0.972     .6652983    1.481928
             |
1.~r_disease |   .7920039   .1772562    -1.04   0.297     .5107663    1.228096
1.stroke_d~a |   .7629552   .1610832    -1.28   0.200     .5044108    1.154021
1.other_ne~o |   .9038172   .1653283    -0.55   0.580     .6315051    1.293553
             |
reduced_ki~t |
Stage 3a/..  |   .6118213   .2626836    -1.14   0.252     .2637326    1.419336
      1.esrd |   .7398618   .1147577    -1.94   0.052     .5459129    1.002716
1.other_tr~t |   1.177663   .1963526     0.98   0.327     .8493754    1.632836
  1.asplenia |   1.439784   .2540649     2.07   0.039     1.018811    2.034701
1.ra_sle_p~s |   .7757289   .1526938    -1.29   0.197     .5274244    1.140932
1.other_im~o |   .7854925   .1510236    -1.26   0.209      .538871    1.144984
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.10878         3.68        1         0.0552
      2.kids_cat4 |     -0.03237         0.44        1         0.5066
      3.kids_cat4 |     -0.06584         1.31        1         0.2528
      age1        |      0.05841         1.02        1         0.3133
      age2        |     -0.06774         1.35        1         0.2450
      age3        |      0.06782         1.33        1         0.2480
      0b.male     |            .            .        1             .
      1.male      |      0.07340         1.65        1         0.1984
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.07587         1.65        1         0.1986
      3.obese4cat |     -0.03321         0.36        1         0.5480
      4.obese4cat |     -0.13033         5.54        1         0.0185
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.06021         0.92        1         0.3378
      3.smoke_no~s|      0.00015         0.00        1         0.9980
      1b.imd      |            .            .        1             .
      4.imd       |      0.03388         0.46        1         0.4996
      5.imd       |      0.13216         4.96        1         0.0259
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|            .            .        1             .
      3.tot_adul~h|      0.03449         0.44        1         0.5062
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.14023         4.82        1         0.0281
      5.ethnicity |     -0.01870         0.10        1         0.7511
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.16461         9.07        1         0.0026
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.16801        10.95        1         0.0009
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.00995         0.03        1         0.8627
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00741         0.02        1         0.8967
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02281         0.09        1         0.7683
      3.diabcat   |     -0.04167         0.42        1         0.5166
      4.diabcat   |     -0.15820        10.11        1         0.0015
      5.diabcat   |     -0.07797         1.39        1         0.2381
      6.diabcat   |     -0.00137         0.00        1         0.9926
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.08870         2.43        1         0.1192
      3.cancer_e~t|      0.18382         2.19        1         0.1386
      4.cancer_e~t|      0.02619         0.20        1         0.6570
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.02365         0.14        1         0.7046
      3.cancer_h~t|      0.09992         3.10        1         0.0783
      4.cancer_h~t|     -0.04386         0.54        1         0.4638
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.15816         9.06        1         0.0026
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.02859         0.23        1         0.6300
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.05485         0.78        1         0.3769
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.06170         1.06        1         0.3035
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.00434         0.01        1         0.9433
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.01305         0.05        1         0.8244
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.18762        10.80        1         0.0010
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.01864         0.11        1         0.7451
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00564         0.01        1         0.9217
      ------------+---------------------------------------------------
      global test |                     56.18       41         0.0574
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      0.23 /        1 =       0.2330
   1:      6.79 /        1 =       6.7900
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covidadmission)
(3,162 observations (episodes) created)
(cat_time: 3162 changes made)
(covidadmission: 3162 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,589       59.21       59.21
          1 |      2,271       29.30       88.50
          2 |        891       11.50      100.00
------------+-----------------------------------
      Total |      7,751      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,404      1,185 |     4,589 
         1 |     1,575        696 |     2,271 
         2 |       686        205 |       891 
-----------+----------------------+----------
     Total |     5,665      2,086 |     7,751 
(7,767 observations deleted)
   1:      0.00 /        1 =       0.0040
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covidadmission)
   1:      0.00 /        1 =       0.0030
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covidadmission)

. /*SENSITIVITY ANALYSIS: 12 months FUP
> keep if has_12_m_follow_up == 1
> foreach exposure_type in kids_cat4   {
> 
> *Age spline model (not adj ethnicity)
> cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'
> basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
> if _rc==0{
> estimates
> estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x', replace
> *estat concordance /*c-statistic*/
> }
> else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome
> ')"
> }       
> }
> */
. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission.log
  log type:  text
 closed on:  25 Jul 2021, 08:15:09
-------------------------------------------------------------------------------
