-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_tpp_prob_1st
> VaccCensor.log
  log type:  text
 opened on:  28 Oct 2021, 11:26:34

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. forvalues period=0/4 {
  3. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  4. 
. /*Censor at date of second vacc_7ds
> gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
> replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>seco
> nd_vacc_plus_7d
> stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)*/
.         
. *Censor at date of first vacc_7ds
. gen second_vacc_plus_7d=covid_vacc_date+7
  5. replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>s
> econd_vacc_plus_7d
  6. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  8. stsplit cat_time, at(0,85,154, 216, 263, 400)
  9. recode cat_time 85=1 154=2 216=3 263=4 
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. }
 14. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 15. stsplit cat_time, at(0,92,161,222,270, 400)
 16. recode cat_time 92=1 161=2 222=3 270=4
 17. recode `outcome' .=0 
 18. tab cat_time
 19. tab cat_time `outcome'
 20. }
 21. 
. keep if cat_time==`period'
 22. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 23. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 24. if _rc==0{
 25. estimates
 26. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_1stVaccCensor", replace
 27.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 28. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 29. 
. }
 30. }
 31. }
(8,043 missing values generated)
(4,293 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        199  observations end on or before enter()
------------------------------------------------------------------------------
     15,883  observations remaining, representing
     15,883  subjects
     14,990  failures in single-failure-per-subject data
  1,508,226  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(12,444 observations (episodes) created)
(cat_time: 12444 changes made)
(covid_tpp_prob: 12444 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,883       56.07       56.07
          1 |      7,417       26.18       82.25
          2 |      3,336       11.78       94.03
          3 |      1,191        4.20       98.23
          4 |        500        1.77      100.00
------------+-----------------------------------
      Total |     28,327      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,771      8,112 |    15,883 
         1 |     3,546      3,871 |     7,417 
         2 |     1,331      2,005 |     3,336 
         3 |       536        655 |     1,191 
         4 |       153        347 |       500 
-----------+----------------------+----------
     Total |    13,337     14,990 |    28,327 
(12,643 observations deleted)
   1:      8.20 /        1 =       8.1970

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,883             Number of obs    =      15,883
No. of failures      =        8,112
Time at risk         =       963367
                                                Wald chi2(42)    =       38.23
Log pseudolikelihood =   -57113.021             Prob > chi2      =      0.6371

                       (Std. Err. adjusted for 1,115 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.202159   .1026869     2.16   0.031     1.016842     1.42125
 only 12-18  |   1.113744   .1205347     1.00   0.320     .9008747    1.376913
      mixed  |   1.178242   .0953321     2.03   0.043     1.005457     1.38072
             |
        age1 |   1.004433   .0040304     1.10   0.270     .9965644    1.012363
        age2 |    .982922   .0124283    -1.36   0.173     .9588624    1.007585
        age3 |   1.052036   .0383538     1.39   0.164     .9794865    1.129959
      1.male |   .9549553   .0209107    -2.10   0.035     .9148381    .9968317
             |
   obese4cat |
Obese I ..)  |   .9869009   .0314724    -0.41   0.679     .9271043    1.050554
Obese II..)  |   .9501314    .037978    -1.28   0.201     .8785369     1.02756
Obese II..)  |   .9888802   .0485522    -0.23   0.820     .8981548     1.08877
             |
smoke_nomiss |
     Former  |   1.032796   .0801085     0.42   0.677     .8871378    1.202368
    Current  |   .9767892   .0322467    -0.71   0.477     .9155882    1.042081
             |
         imd |
          4  |   1.006407   .0275354     0.23   0.815       .95386    1.061848
5 most de..  |   1.004811   .0384593     0.13   0.900     .9321903    1.083089
             |
tot_adults~h |
          2  |   .9369623   .1789727    -0.34   0.733     .6443634    1.362427
          3  |   .8852525   .1378917    -0.78   0.434     .6523481     1.20131
             |
   ethnicity |
Asian or ..  |   .9919705   .0375234    -0.21   0.831     .9210861     1.06831
      Other  |   .9469683   .0368236    -1.40   0.161     .8774771    1.021963
             |
1.htdiag_o~p |   1.010822   .0239603     0.45   0.650     .9649346    1.058891
1.~y_disease |   1.009103   .0272554     0.34   0.737     .9570723    1.063961
    1.asthma |   1.032696   .0411881     0.81   0.420     .9550433    1.116662
1.~c_disease |   .9860523   .0280441    -0.49   0.621     .9325908    1.042579
             |
     diabcat |
T1DM, con..  |    .967127    .067446    -0.48   0.632     .8435717    1.108779
T1DM, unc..  |   .9563244   .1517905    -0.28   0.778     .7006485      1.3053
T2DM, con..  |    1.01008   .0302754     0.33   0.738      .952451    1.071197
T2DM, unc..  |   1.080696   .0607218     1.38   0.167     .9680029    1.206509
Diabetes,..  |   .8552921   .3191269    -0.42   0.675     .4116365    1.777113
             |
cancer_exh~t |
  Last year  |      1.199   .2364092     0.92   0.357     .8146785    1.764625
2-5 years..  |   1.019819   .0852946     0.23   0.814     .8656273    1.201475
   5+ years  |   .9821419   .0295194    -0.60   0.549      .925956    1.041737
             |
cancer_hae~t |
  Last year  |   .8264845   .1771846    -0.89   0.374     .5429393    1.258109
2-5 years..  |   .9665753   .0899048    -0.37   0.715      .805494    1.159869
   5+ years  |   .9924748   .0277817    -0.27   0.787     .9394904    1.048447
             |
1.~r_disease |   .9974444   .0272305    -0.09   0.925     .9454763    1.052269
1.stroke_d~a |   .9869242   .0261444    -0.50   0.619     .9369897     1.03952
1.other_ne~o |   1.075156   .0308398     2.53   0.012     1.016379    1.137333
             |
reduced_ki~t |
Stage 3a/..  |   1.106455   .1985957     0.56   0.573     .7783106    1.572948
      1.esrd |   .9951931   .0226597    -0.21   0.832     .9517572    1.040611
1.other_tr~t |   1.021956   .0274369     0.81   0.419     .9695709    1.077171
  1.asplenia |   1.002961   .0283267     0.10   0.917     .9489506    1.060046
1.ra_sle_p~s |   .9408583   .0266835    -2.15   0.032     .8899866    .9946378
1.other_im~o |   1.005961   .0273569     0.22   0.827     .9537462    1.061034
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod0_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod0_1stVaccCensor.ster saved
(8,043 missing values generated)
(4,293 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        199  observations end on or before enter()
------------------------------------------------------------------------------
     15,883  observations remaining, representing
     15,883  subjects
     14,990  failures in single-failure-per-subject data
  1,508,226  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(12,444 observations (episodes) created)
(cat_time: 12444 changes made)
(covid_tpp_prob: 12444 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,883       56.07       56.07
          1 |      7,417       26.18       82.25
          2 |      3,336       11.78       94.03
          3 |      1,191        4.20       98.23
          4 |        500        1.77      100.00
------------+-----------------------------------
      Total |     28,327      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,771      8,112 |    15,883 
         1 |     3,546      3,871 |     7,417 
         2 |     1,331      2,005 |     3,336 
         3 |       536        655 |     1,191 
         4 |       153        347 |       500 
-----------+----------------------+----------
     Total |    13,337     14,990 |    28,327 
(21,109 observations deleted)
   1:      3.60 /        1 =       3.6040

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        7,417             Number of obs    =       7,417
No. of failures      =        3,871
Time at risk         =       360828
                                                Wald chi2(42)    =       53.76
Log pseudolikelihood =   -24248.253             Prob > chi2      =      0.1055

                       (Std. Err. adjusted for 1,002 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.082366     .11328     0.76   0.449     .8816328    1.328803
 only 12-18  |   .9535476    .138876    -0.33   0.744     .7167573    1.268565
      mixed  |   .9927772   .0925084    -0.08   0.938     .8270573    1.191703
             |
        age1 |    1.00098   .0059358     0.17   0.869     .9894137    1.012682
        age2 |   .9961004   .0187039    -0.21   0.835     .9601079    1.033442
        age3 |   1.015325   .0548087     0.28   0.778     .9133894    1.128637
      1.male |   .9504049   .0307879    -1.57   0.116     .8919374    1.012705
             |
   obese4cat |
Obese I ..)  |   .9593446   .0456627    -0.87   0.383     .8738951    1.053149
Obese II..)  |   .9130449   .0546489    -1.52   0.129      .811979     1.02669
Obese II..)  |   .9808788    .071192    -0.27   0.790     .8508153    1.130825
             |
smoke_nomiss |
     Former  |   .8681139   .1062882    -1.16   0.248     .6829033    1.103556
    Current  |   1.008586   .0489714     0.18   0.860     .9170293    1.109283
             |
         imd |
          4  |   1.032102   .0429514     0.76   0.448     .9512602    1.119813
5 most de..  |   1.003403   .0525491     0.06   0.948     .9055179    1.111868
             |
tot_adults~h |
          2  |     .82253   .2247566    -0.71   0.475     .4814604    1.405215
          3  |   .7388504   .1469001    -1.52   0.128     .5004014    1.090924
             |
   ethnicity |
Asian or ..  |   1.058398   .0561347     1.07   0.285     .9539013    1.174342
      Other  |   1.099317   .0566712     1.84   0.066     .9936702    1.216195
             |
1.htdiag_o~p |   1.071574   .0364577     2.03   0.042     1.002449    1.145466
1.~y_disease |   .9505668   .0380727    -1.27   0.206     .8787995    1.028195
    1.asthma |   1.043128   .0673197     0.65   0.513     .9191879     1.18378
1.~c_disease |    1.00514   .0398194     0.13   0.897     .9300482    1.086294
             |
     diabcat |
T1DM, con..  |   1.011621   .1089573     0.11   0.915      .819103    1.249387
T1DM, unc..  |   .9213594   .2412984    -0.31   0.754      .551448    1.539407
T2DM, con..  |   .9616463   .0428836    -0.88   0.380     .8811645    1.049479
T2DM, unc..  |   .9877772   .0852151    -0.14   0.887     .8341156    1.169746
Diabetes,..  |   1.504622   .4705967     1.31   0.191      .815078    2.777509
             |
cancer_exh~t |
  Last year  |   1.107523    .414136     0.27   0.785     .5321855    2.304849
2-5 years..  |   1.216401   .1330678     1.79   0.073     .9816567    1.507279
   5+ years  |   1.019753   .0414792     0.48   0.631     .9416111    1.104379
             |
cancer_hae~t |
  Last year  |   1.678489   .2993963     2.90   0.004      1.18328    2.380946
2-5 years..  |   1.049338   .1322872     0.38   0.702     .8196089    1.343458
   5+ years  |   1.048678   .0459742     1.08   0.278     .9623325     1.14277
             |
1.~r_disease |    1.01501    .041173     0.37   0.713     .9374369    1.099002
1.stroke_d~a |   1.020616     .04033     0.52   0.606     .9445537    1.102802
1.other_ne~o |    .984833   .0399123    -0.38   0.706     .9096325     1.06625
             |
reduced_ki~t |
Stage 3a/..  |   1.104332   .2653816     0.41   0.680      .689521    1.768689
      1.esrd |   .9793032   .0322664    -0.63   0.526     .9180609    1.044631
1.other_tr~t |   1.042409   .0400104     1.08   0.279     .9668673    1.123853
  1.asplenia |   .9788606   .0356093    -0.59   0.557     .9114976    1.051202
1.ra_sle_p~s |   1.109733   .0442786     2.61   0.009     1.026255    1.200001
1.other_im~o |   .9490869   .0384788    -1.29   0.197     .8765885    1.027581
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod1_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod1_1stVaccCensor.ster saved
(8,043 missing values generated)
(4,293 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        199  observations end on or before enter()
------------------------------------------------------------------------------
     15,883  observations remaining, representing
     15,883  subjects
     14,990  failures in single-failure-per-subject data
  1,508,226  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(12,444 observations (episodes) created)
(cat_time: 12444 changes made)
(covid_tpp_prob: 12444 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,883       56.07       56.07
          1 |      7,417       26.18       82.25
          2 |      3,336       11.78       94.03
          3 |      1,191        4.20       98.23
          4 |        500        1.77      100.00
------------+-----------------------------------
      Total |     28,327      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,771      8,112 |    15,883 
         1 |     3,546      3,871 |     7,417 
         2 |     1,331      2,005 |     3,336 
         3 |       536        655 |     1,191 
         4 |       153        347 |       500 
-----------+----------------------+----------
     Total |    13,337     14,990 |    28,327 
(25,190 observations deleted)
   1:      2.04 /        1 =       2.0400

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,336             Number of obs    =       3,336
No. of failures      =        2,005
Time at risk         =       133416
                                                Wald chi2(42)    =       60.95
Log pseudolikelihood =   -10788.092             Prob > chi2      =      0.0294

                         (Std. Err. adjusted for 851 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.062225   .1810528     0.35   0.723     .7605574    1.483546
 only 12-18  |   .9895432   .2003704    -0.05   0.959     .6653909     1.47161
      mixed  |   .9691586   .1536599    -0.20   0.843     .7102922    1.322369
             |
        age1 |   1.005876   .0086088     0.68   0.494     .9891435    1.022891
        age2 |   .9931064   .0262787    -0.26   0.794     .9429138    1.045971
        age3 |   1.002412   .0757371     0.03   0.975     .8644378    1.162408
      1.male |    .986473   .0440265    -0.31   0.760      .903849     1.07665
             |
   obese4cat |
Obese I ..)  |   1.123859   .0747995     1.75   0.079     .9864138    1.280455
Obese II..)  |   1.001537   .0765941     0.02   0.984     .8621248    1.163494
Obese II..)  |   .9147292   .0870698    -0.94   0.349     .7590488     1.10234
             |
smoke_nomiss |
     Former  |   1.020101   .1478415     0.14   0.891     .7678563    1.355209
    Current  |   1.169288   .0784699     2.33   0.020     1.025176    1.333659
             |
         imd |
          4  |   .9969267   .0553021    -0.06   0.956      .894221    1.111429
5 most de..  |   1.028641   .0727709     0.40   0.690     .8954588     1.18163
             |
tot_adults~h |
          2  |   1.438184   .7027095     0.74   0.457     .5519626    3.747305
          3  |   1.104436   .4129608     0.27   0.790     .5307222     2.29834
             |
   ethnicity |
Asian or ..  |   1.017761   .0759524     0.24   0.813     .8792724    1.178063
      Other  |   .9614791   .0741837    -0.51   0.611     .8265416    1.118446
             |
1.htdiag_o~p |   .9766182   .0470502    -0.49   0.623     .8886215    1.073329
1.~y_disease |   1.042671   .0581562     0.75   0.454     .9346962    1.163119
    1.asthma |   1.109813   .0977708     1.18   0.237     .9338167    1.318978
1.~c_disease |   .9870618   .0551205    -0.23   0.816     .8847299     1.10123
             |
     diabcat |
T1DM, con..  |   1.159075   .1460974     1.17   0.242     .9053582    1.483893
T1DM, unc..  |   .9218853   .3281242    -0.23   0.819     .4588925    1.852008
T2DM, con..  |   .9818502   .0566996    -0.32   0.751     .8767793    1.099512
T2DM, unc..  |   1.117569   .1265626     0.98   0.326     .8951122    1.395312
Diabetes,..  |   1.574555   1.054603     0.68   0.498     .4236829    5.851599
             |
cancer_exh~t |
  Last year  |   2.966373   .8991606     3.59   0.000     1.637613    5.373288
2-5 years..  |   1.036655   .1911484     0.20   0.845     .7222397    1.487945
   5+ years  |   1.035585   .0610166     0.59   0.553     .9226418    1.162354
             |
cancer_hae~t |
  Last year  |   .6633549   .3544029    -0.77   0.442     .2328008    1.890199
2-5 years..  |   .9559642   .1658327    -0.26   0.795     .6804282    1.343077
   5+ years  |   .8587536   .0530865    -2.46   0.014     .7607621     .969367
             |
1.~r_disease |   .9717858   .0561122    -0.50   0.620     .8678029    1.088228
1.stroke_d~a |   .8881736   .0505039    -2.09   0.037     .7945043    .9928862
1.other_ne~o |   1.057259   .0611107     0.96   0.335     .9440199    1.184082
             |
reduced_ki~t |
Stage 3a/..  |   .8339093    .372344    -0.41   0.684     .3475792    2.000709
      1.esrd |   1.096449   .0498788     2.02   0.043      1.00292      1.1987
1.other_tr~t |   1.020251    .059061     0.35   0.729     .9108189    1.142831
  1.asplenia |   .8957599   .0494312    -1.99   0.046      .803932    .9980768
1.ra_sle_p~s |   1.038251   .0583552     0.67   0.504     .9299512    1.159162
1.other_im~o |   .9167039   .0561233    -1.42   0.155     .8130477    1.033575
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod2_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod2_1stVaccCensor.ster saved
(8,043 missing values generated)
(4,293 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        199  observations end on or before enter()
------------------------------------------------------------------------------
     15,883  observations remaining, representing
     15,883  subjects
     14,990  failures in single-failure-per-subject data
  1,508,226  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(12,444 observations (episodes) created)
(cat_time: 12444 changes made)
(covid_tpp_prob: 12444 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,883       56.07       56.07
          1 |      7,417       26.18       82.25
          2 |      3,336       11.78       94.03
          3 |      1,191        4.20       98.23
          4 |        500        1.77      100.00
------------+-----------------------------------
      Total |     28,327      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,771      8,112 |    15,883 
         1 |     3,546      3,871 |     7,417 
         2 |     1,331      2,005 |     3,336 
         3 |       536        655 |     1,191 
         4 |       153        347 |       500 
-----------+----------------------+----------
     Total |    13,337     14,990 |    28,327 
(27,335 observations deleted)
   1:      0.88 /        1 =       0.8790

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,191             Number of obs    =       1,191
No. of failures      =          655
Time at risk         =        38424
                                                Wald chi2(41)    =      136.99
Log pseudolikelihood =    -2870.395             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 611 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .7422413   .2210733    -1.00   0.317     .4140173    1.330674
 only 12-18  |    .712946   .2633566    -0.92   0.360     .3456444    1.470563
      mixed  |   .6862028    .188323    -1.37   0.170     .4007254    1.175055
             |
        age1 |   1.029326   .0150428     1.98   0.048     1.000261    1.059236
        age2 |   .9040044   .0406419    -2.24   0.025     .8277563     .987276
        age3 |   1.320367   .1686681     2.18   0.030      1.02792    1.696016
      1.male |   1.062332   .0849363     0.76   0.449     .9082475    1.242556
             |
   obese4cat |
Obese I ..)  |   1.105652   .1261312     0.88   0.379     .8841266    1.382682
Obese II..)  |   .7978673   .1093713    -1.65   0.099     .6098855     1.04379
Obese II..)  |   .9905667   .1636128    -0.06   0.954     .7166217    1.369233
             |
smoke_nomiss |
     Former  |   .7770015   .2230881    -0.88   0.380     .4426188    1.363998
    Current  |    1.22342   .1596265     1.55   0.122     .9473584    1.579925
             |
         imd |
          4  |    1.01173   .0996936     0.12   0.906      .834044     1.22727
5 most de..  |   1.148964   .1634692     0.98   0.329     .8693639    1.518488
             |
tot_adults~h |
          2  |   .6548651   .5038146    -0.55   0.582     .1449731    2.958123
          3  |   .7855196   .4191793    -0.45   0.651     .2760118     2.23556
             |
   ethnicity |
Asian or ..  |   1.176144   .1586603     1.20   0.229     .9028893    1.532098
      Other  |   1.191245   .1561228     1.34   0.182     .9213908    1.540133
             |
1.htdiag_o~p |   1.076109   .0915647     0.86   0.389     .9108113    1.271405
1.~y_disease |   1.122283   .1077341     1.20   0.229     .9298029    1.354609
    1.asthma |   .7919122   .1378902    -1.34   0.180     .5629415    1.114014
1.~c_disease |   .9999006   .0996955    -0.00   0.999     .8224081      1.2157
             |
     diabcat |
T1DM, con..  |   1.011963    .266786     0.05   0.964     .6036158    1.696558
T1DM, unc..  |   1.480813   .7812578     0.74   0.457     .5265228    4.164695
T2DM, con..  |   .9911777   .1147843    -0.08   0.939     .7899095    1.243729
T2DM, unc..  |   1.610832   .2894449     2.65   0.008     1.132663    2.290866
Diabetes,..  |   6.697405   2.173052     5.86   0.000     3.545881    12.64995
             |
cancer_exh~t |
2-5 years..  |   2.655536   .7551733     3.43   0.001     1.520863    4.636756
   5+ years  |   1.140287   .1187616     1.26   0.207     .9297388    1.398516
             |
cancer_hae~t |
  Last year  |   .7058883    .719439    -0.34   0.733     .0957622    5.203287
2-5 years..  |   1.193897   .3610089     0.59   0.558     .6600573    2.159494
   5+ years  |    1.16597   .1146908     1.56   0.119     .9615214    1.413891
             |
1.~r_disease |   1.152158   .1198167     1.36   0.173      .939708     1.41264
1.stroke_d~a |   .9191131   .0914309    -0.85   0.396     .7562993    1.116977
1.other_ne~o |   1.132226   .1092609     1.29   0.198     .9371112    1.367964
             |
reduced_ki~t |
Stage 3a/..  |   .7763094   .6110058    -0.32   0.748     .1659908     3.63066
      1.esrd |   .9600152   .0825092    -0.47   0.635      .811187    1.136149
1.other_tr~t |   1.158481   .1114247     1.53   0.126     .9594427    1.398811
  1.asplenia |   .9473796   .0903646    -0.57   0.571     .7858384    1.142128
1.ra_sle_p~s |    .954329   .0944796    -0.47   0.637     .7860104    1.158692
1.other_im~o |   1.129393   .1162073     1.18   0.237     .9231281    1.381746
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod3_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod3_1stVaccCensor.ster saved
(8,043 missing values generated)
(4,293 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        199  observations end on or before enter()
------------------------------------------------------------------------------
     15,883  observations remaining, representing
     15,883  subjects
     14,990  failures in single-failure-per-subject data
  1,508,226  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(12,444 observations (episodes) created)
(cat_time: 12444 changes made)
(covid_tpp_prob: 12444 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,883       56.07       56.07
          1 |      7,417       26.18       82.25
          2 |      3,336       11.78       94.03
          3 |      1,191        4.20       98.23
          4 |        500        1.77      100.00
------------+-----------------------------------
      Total |     28,327      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,771      8,112 |    15,883 
         1 |     3,546      3,871 |     7,417 
         2 |     1,331      2,005 |     3,336 
         3 |       536        655 |     1,191 
         4 |       153        347 |       500 
-----------+----------------------+----------
     Total |    13,337     14,990 |    28,327 
(28,026 observations deleted)
   1:      0.22 /        1 =       0.2210

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          500             Number of obs    =         500
No. of failures      =          347
Time at risk         =        12191
                                                Wald chi2(40)    =       90.55
Log pseudolikelihood =   -1146.9754             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 382 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.448846   .6619761     0.81   0.417     .5917104    3.547605
 only 12-18  |     1.1843   .6993667     0.29   0.775     .3722201    3.768107
      mixed  |   .6978444   .3024263    -0.83   0.406     .2984499     1.63172
             |
        age1 |   .9690039   .0195162    -1.56   0.118      .931498     1.00802
        age2 |   1.098333   .0757926     1.36   0.174     .9593896    1.257398
        age3 |   .7745398   .1580245    -1.25   0.210     .5192523    1.155338
      1.male |    .898977   .1016999    -0.94   0.347     .7202006    1.122131
             |
   obese4cat |
Obese I ..)  |   .9302139   .1703433    -0.40   0.693     .6496934    1.331856
Obese II..)  |   1.148879   .2200429     0.72   0.469     .7893053    1.672259
Obese II..)  |   1.181767   .2397702     0.82   0.410      .794018    1.758867
             |
smoke_nomiss |
     Former  |   1.092963   .3463976     0.28   0.779     .5872599    2.034139
    Current  |   .9369536   .1702679    -0.36   0.720     .6561958    1.337835
             |
         imd |
          4  |   .7434202   .1248755    -1.77   0.078     .5348775    1.033271
5 most de..  |   1.229189   .2286912     1.11   0.267     .8535959    1.770048
             |
tot_adults~h |
          2  |   .4790595   .3250593    -1.08   0.278     .1267122    1.811176
          3  |   .8327007   .4296683    -0.35   0.723     .3028826    2.289305
             |
   ethnicity |
Asian or ..  |   .9749336   .2065616    -0.12   0.905      .643619    1.476799
      Other  |   1.281541   .2526063     1.26   0.208     .8708656     1.88588
             |
1.htdiag_o~p |   1.250965   .1458177     1.92   0.055     .9954641    1.572045
1.~y_disease |   .9670985   .1450671    -0.22   0.824     .7207563    1.297636
    1.asthma |   1.215076   .3033711     0.78   0.435     .7448725    1.982098
1.~c_disease |   .9894389   .1225629    -0.09   0.932     .7761572    1.261329
             |
     diabcat |
T1DM, con..  |   .4658731   .1804329    -1.97   0.049     .2180704    .9952645
T1DM, unc..  |    1.21474    .876842     0.27   0.788     .2951589    4.999315
T2DM, con..  |   1.312182   .1877917     1.90   0.058     .9912316    1.737053
T2DM, unc..  |   1.119129   .3777861     0.33   0.739     .5774825    2.168811
             |
cancer_exh~t |
2-5 years..  |   1.494236   .6782917     0.88   0.376     .6137981     3.63758
   5+ years  |   .9273363   .1446149    -0.48   0.629     .6831174    1.258865
             |
cancer_hae~t |
  Last year  |   .4532799   .4420514    -0.81   0.417     .0670271    3.065366
2-5 years..  |   1.825061    .872814     1.26   0.208     .7148256    4.659663
   5+ years  |   1.072635   .1477009     0.51   0.611     .8189211    1.404952
             |
1.~r_disease |    .847227    .125686    -1.12   0.264     .6334672    1.133119
1.stroke_d~a |   1.269655   .1628474     1.86   0.063     .9874379    1.632533
1.other_ne~o |   1.010652   .1713066     0.06   0.950      .724973    1.408903
             |
reduced_ki~t |
Stage 3a/..  |   1.065793   .4552603     0.15   0.881     .4613993    2.461892
      1.esrd |   1.221078   .1421036     1.72   0.086     .9720408    1.533919
1.other_tr~t |    .940821   .1469136    -0.39   0.696      .692768    1.277692
  1.asplenia |   .8360443    .120646    -1.24   0.215     .6300804    1.109335
1.ra_sle_p~s |   .5090629   .0839689    -4.09   0.000     .3684406    .7033565
1.other_im~o |   1.085519   .1482572     0.60   0.548     .8305819    1.418705
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod4_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod4_1stVaccCensor.ster saved
(2,302 missing values generated)
(1,149 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         51  observations end on or before enter()
------------------------------------------------------------------------------
      4,500  observations remaining, representing
      4,500  subjects
      4,247  failures in single-failure-per-subject data
    422,670  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(3,495 observations (episodes) created)
(cat_time: 3495 changes made)
(covid_tpp_prob: 3495 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,500       56.29       56.29
          1 |      2,058       25.74       82.03
          2 |        947       11.84       93.87
          3 |        352        4.40       98.27
          4 |        138        1.73      100.00
------------+-----------------------------------
      Total |      7,995      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,152      2,348 |     4,500 
         1 |     1,007      1,051 |     2,058 
         2 |       398        549 |       947 
         3 |       160        192 |       352 
         4 |        31        107 |       138 
-----------+----------------------+----------
     Total |     3,748      4,247 |     7,995 
(3,546 observations deleted)
   1:      8.21 /        1 =       8.2150

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,500             Number of obs    =       4,500
No. of failures      =        2,348
Time at risk         =       270047
                                                Wald chi2(42)    =     4154.84
Log pseudolikelihood =   -13534.508             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 923 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9373786   .1446431    -0.42   0.675     .6927388    1.268412
 only 12-18  |   .8560574   .1834255    -0.73   0.468     .5624939     1.30283
      mixed  |   .9746891   .1411909    -0.18   0.860     .7337756    1.294699
             |
        age1 |   1.004613   .0204801     0.23   0.821     .9652646    1.045566
        age2 |   .9613566   .1035066    -0.37   0.714     .7784631    1.187219
        age3 |   1.100381   .2517508     0.42   0.676       .70275       1.723
      1.male |   1.012229   .0445076     0.28   0.782     .9286492    1.103332
             |
   obese4cat |
Obese I ..)  |   .9392214   .0573773    -1.03   0.305     .8332357    1.058688
Obese II..)  |   1.023183   .0764263     0.31   0.759     .8838395    1.184496
Obese II..)  |   1.084373   .0978435     0.90   0.369     .9086031    1.294145
             |
smoke_nomiss |
     Former  |   .9728463   .1493767    -0.18   0.858     .7200217    1.314446
    Current  |   1.050451    .061362     0.84   0.399     .9368134    1.177874
             |
         imd |
          4  |    1.11098   .0556626     2.10   0.036     1.007069    1.225613
5 most de..  |   1.002204   .0672662     0.03   0.974     .8786681    1.143108
             |
tot_adults~h |
          2  |   .8048303    .342659    -0.51   0.610     .3493836    1.853984
          3  |   1.293087   .3697055     0.90   0.369     .7383484    2.264613
             |
   ethnicity |
Asian or ..  |   1.129051   .0781596     1.75   0.080     .9857994     1.29312
      Other  |    .965908   .0657858    -0.51   0.611     .8452057    1.103848
             |
1.htdiag_o~p |   1.011587    .044677     0.26   0.794     .9277051    1.103054
1.~y_disease |    .945216   .0500868    -1.06   0.288     .8519734    1.048663
    1.asthma |   1.085884   .0804956     1.11   0.266     .9390407    1.255689
1.~c_disease |   .9555867   .0489359    -0.89   0.375     .8643304    1.056478
             |
     diabcat |
T1DM, con..  |    1.18797   .1371732     1.49   0.136     .9473672    1.489678
T1DM, unc..  |   .8656958   .2486141    -0.50   0.616     .4930759    1.519907
T2DM, con..  |    1.02454   .0562207     0.44   0.659     .9200685    1.140875
T2DM, unc..  |   1.011548   .1121981     0.10   0.918     .8139052    1.257186
Diabetes,..  |   3.85e-14   1.94e-14   -61.19   0.000     1.43e-14    1.04e-13
             |
cancer_exh~t |
  Last year  |   .9544497   .2912227    -0.15   0.879     .5248479    1.735692
2-5 years..  |   1.015376   .1611527     0.10   0.923     .7439276    1.385872
   5+ years  |   1.036717   .0545347     0.69   0.493     .9351566    1.149308
             |
cancer_hae~t |
  Last year  |   .9570196    .230475    -0.18   0.855     .5969385    1.534306
2-5 years..  |   .7857748   .1497078    -1.27   0.206     .5409101    1.141487
   5+ years  |   .9941803   .0549835    -0.11   0.916     .8920498    1.108004
             |
1.~r_disease |   1.080713   .0540842     1.55   0.121      .979743    1.192089
1.stroke_d~a |   1.118681   .0583479     2.15   0.032     1.009973    1.239091
1.other_ne~o |   .9025431   .0488135    -1.90   0.058     .8117666    1.003471
             |
reduced_ki~t |
Stage 3a/..  |   1.206525   .1230068     1.84   0.066     .9879958    1.473389
      1.esrd |   .9247682   .0399974    -1.81   0.071     .8496055     1.00658
1.other_tr~t |   1.048552   .0560083     0.89   0.375     .9443288    1.164278
  1.asplenia |    1.07244   .0561039     1.34   0.181     .9679278    1.188237
1.ra_sle_p~s |   1.063796   .0554886     1.19   0.236     .9604151    1.178306
1.other_im~o |   1.117865   .0541378     2.30   0.021     1.016637    1.229172
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod0_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod0_1stVaccCensor.ster saved
(2,302 missing values generated)
(1,149 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         51  observations end on or before enter()
------------------------------------------------------------------------------
      4,500  observations remaining, representing
      4,500  subjects
      4,247  failures in single-failure-per-subject data
    422,670  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(3,495 observations (episodes) created)
(cat_time: 3495 changes made)
(covid_tpp_prob: 3495 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,500       56.29       56.29
          1 |      2,058       25.74       82.03
          2 |        947       11.84       93.87
          3 |        352        4.40       98.27
          4 |        138        1.73      100.00
------------+-----------------------------------
      Total |      7,995      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,152      2,348 |     4,500 
         1 |     1,007      1,051 |     2,058 
         2 |       398        549 |       947 
         3 |       160        192 |       352 
         4 |        31        107 |       138 
-----------+----------------------+----------
     Total |     3,748      4,247 |     7,995 
(5,988 observations deleted)
   1:      1.14 /        1 =       1.1360

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,058             Number of obs    =       2,058
No. of failures      =        1,051
Time at risk         =        99986
                                                Wald chi2(42)    =       65.31
Log pseudolikelihood =   -5228.4511             Prob > chi2      =      0.0121

                         (Std. Err. adjusted for 770 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5235186   .1025062    -3.31   0.001     .3566686    .7684212
 only 12-18  |   .7292644   .1828363    -1.26   0.208     .4461465    1.192045
      mixed  |   .5358604   .0982575    -3.40   0.001     .3740865    .7675936
             |
        age1 |   .9687984   .0285354    -1.08   0.282     .9144537    1.026373
        age2 |   1.131055   .1774805     0.78   0.433     .8316045    1.538335
        age3 |   .8105661   .2736995    -0.62   0.534     .4181844    1.571119
      1.male |   .9262428   .0572866    -1.24   0.215     .8205015    1.045611
             |
   obese4cat |
Obese I ..)  |   1.044487   .0848602     0.54   0.592     .8907305    1.224784
Obese II..)  |   .9243965   .1079043    -0.67   0.501     .7353566    1.162033
Obese II..)  |   1.011153   .1612631     0.07   0.945     .7397139    1.382198
             |
smoke_nomiss |
     Former  |    1.06769    .246709     0.28   0.777     .6788277    1.679309
    Current  |   1.055354   .1004987     0.57   0.572     .8756697    1.271909
             |
         imd |
          4  |   .8294274   .0702322    -2.21   0.027     .7025907    .9791615
5 most de..  |   1.007583   .1057973     0.07   0.943     .8201702    1.237822
             |
tot_adults~h |
          2  |   1.557404   .5986034     1.15   0.249     .7332192    3.308026
          3  |   1.778443   .5917819     1.73   0.084     .9264035    3.414127
             |
   ethnicity |
Asian or ..  |   1.314393   .1462356     2.46   0.014     1.056874     1.63466
      Other  |   1.008588   .1020122     0.08   0.933      .827218    1.229723
             |
1.htdiag_o~p |   1.013113   .0685099     0.19   0.847     .8873536    1.156694
1.~y_disease |   .8125734   .0654655    -2.58   0.010     .6938811    .9515688
    1.asthma |   .8735673   .0992755    -1.19   0.234     .6991375    1.091516
1.~c_disease |    .965964   .0739536    -0.45   0.651     .8313682     1.12235
             |
     diabcat |
T1DM, con..  |   1.095559   .2186282     0.46   0.647     .7409198    1.619945
T1DM, unc..  |   .4089844   .2260457    -1.62   0.106     .1384356    1.208275
T2DM, con..  |   1.007071   .0880653     0.08   0.936     .8484478     1.19535
T2DM, unc..  |    1.17603   .1796476     1.06   0.288     .8717481    1.586522
Diabetes,..  |   1.173719    1.03182     0.18   0.855     .2095418    6.574427
             |
cancer_exh~t |
  Last year  |   .9475084   .3568194    -0.14   0.886     .4529305    1.982141
2-5 years..  |   1.062837   .2872576     0.23   0.822     .6257617    1.805197
   5+ years  |   .8897106   .0718357    -1.45   0.148     .7594903    1.042258
             |
cancer_hae~t |
  Last year  |   .5913921   .3021888    -1.03   0.304     .2172349    1.609983
2-5 years..  |   .8936994    .191382    -0.52   0.600     .5873679    1.359793
   5+ years  |   .9285364   .0819194    -0.84   0.401     .7810923    1.103813
             |
1.~r_disease |   1.071418   .0834682     0.89   0.376     .9197009    1.248163
1.stroke_d~a |   1.007987   .0757792     0.11   0.916     .8698863    1.168011
1.other_ne~o |   .9578143   .0717035    -0.58   0.565      .827102    1.109184
             |
reduced_ki~t |
Stage 3a/..  |   .8893802   .1594729    -0.65   0.513     .6258356    1.263906
      1.esrd |   1.053826   .0691812     0.80   0.425     .9265938    1.198528
1.other_tr~t |   .9488753   .0748532    -0.67   0.506     .8129448    1.107534
  1.asplenia |    .977775   .0759683    -0.29   0.772     .8396625    1.138605
1.ra_sle_p~s |   1.133021   .0906773     1.56   0.119     .9685345    1.325442
1.other_im~o |   1.147197   .0923546     1.71   0.088      .979743    1.343271
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod1_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod1_1stVaccCensor.ster saved
(2,302 missing values generated)
(1,149 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         51  observations end on or before enter()
------------------------------------------------------------------------------
      4,500  observations remaining, representing
      4,500  subjects
      4,247  failures in single-failure-per-subject data
    422,670  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(3,495 observations (episodes) created)
(cat_time: 3495 changes made)
(covid_tpp_prob: 3495 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,500       56.29       56.29
          1 |      2,058       25.74       82.03
          2 |        947       11.84       93.87
          3 |        352        4.40       98.27
          4 |        138        1.73      100.00
------------+-----------------------------------
      Total |      7,995      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,152      2,348 |     4,500 
         1 |     1,007      1,051 |     2,058 
         2 |       398        549 |       947 
         3 |       160        192 |       352 
         4 |        31        107 |       138 
-----------+----------------------+----------
     Total |     3,748      4,247 |     7,995 
(7,099 observations deleted)
   1:      0.55 /        1 =       0.5510

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          947             Number of obs    =         947
No. of failures      =          549
Time at risk         =        38296
                                                Wald chi2(42)    =       61.53
Log pseudolikelihood =   -2256.4416             Prob > chi2      =      0.0263

                         (Std. Err. adjusted for 551 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.801546   .8048789     1.32   0.188     .7505043    4.324518
 only 12-18  |   1.084284   .5428215     0.16   0.872     .4064516    2.892526
      mixed  |   1.528808   .6633332     0.98   0.328     .6531692    3.578327
             |
        age1 |   .9835364    .042004    -0.39   0.697     .9045615    1.069406
        age2 |   1.117345   .2489762     0.50   0.619     .7219634    1.729255
        age3 |   .7685808   .3649882    -0.55   0.579     .3030162    1.949455
      1.male |    1.03817   .0865333     0.45   0.653     .8816974    1.222413
             |
   obese4cat |
Obese I ..)  |   1.012156   .1232945     0.10   0.921     .7971853    1.285095
Obese II..)  |   1.052217   .1664637     0.32   0.748     .7716898    1.434722
Obese II..)  |   1.198805   .2597293     0.84   0.403     .7840255     1.83302
             |
smoke_nomiss |
     Former  |   .5671408    .210136    -1.53   0.126     .2743502    1.172402
    Current  |   1.198778    .152501     1.43   0.154     .9342313    1.538237
             |
         imd |
          4  |   .8164373   .0933966    -1.77   0.076     .6524532    1.021636
5 most de..  |   .8966286   .1453531    -0.67   0.501     .6525649    1.231974
             |
tot_adults~h |
          2  |   1.288919   .7060191     0.46   0.643     .4405257    3.771207
          3  |   .6166337   .2454451    -1.21   0.224     .2826277    1.345364
             |
   ethnicity |
Asian or ..  |   1.159933   .1873667     0.92   0.358     .8451551     1.59195
      Other  |   .7306072   .1180914    -1.94   0.052     .5322312    1.002923
             |
1.htdiag_o~p |   1.025808   .0964728     0.27   0.786     .8531279    1.233439
1.~y_disease |   1.053894   .1087379     0.51   0.611     .8609391    1.290095
    1.asthma |   1.324799   .2062651     1.81   0.071     .9763868    1.797538
1.~c_disease |   .9425575   .1022392    -0.55   0.585     .7620405    1.165837
             |
     diabcat |
T1DM, con..  |   1.478726   .4013559     1.44   0.150      .868669    2.517218
T1DM, unc..  |   1.376491   .6828815     0.64   0.520     .5205823    3.639629
T2DM, con..  |   1.027241   .1267891     0.22   0.828      .806513    1.308379
T2DM, unc..  |    .610841   .1823672    -1.65   0.099     .3402523    1.096618
Diabetes,..  |   1.757544    .461189     2.15   0.032     1.050864     2.93945
             |
cancer_exh~t |
  Last year  |   1.350971   .6852098     0.59   0.553     .4999403     3.65068
2-5 years..  |   .5579746   .2743095    -1.19   0.235     .2128873    1.462443
   5+ years  |   1.087667   .1241394     0.74   0.462     .8696515    1.360337
             |
cancer_hae~t |
  Last year  |   1.101614   .5232597     0.20   0.839     .4342245    2.794762
2-5 years..  |    .510452   .2186545    -1.57   0.116     .2204646    1.181874
   5+ years  |   .9468958   .1128031    -0.46   0.647     .7497199    1.195929
             |
1.~r_disease |   .9539761   .1142439    -0.39   0.694     .7543995    1.206351
1.stroke_d~a |   1.058137   .1143848     0.52   0.601     .8561044    1.307847
1.other_ne~o |   1.048599   .1149404     0.43   0.665     .8458754    1.299907
             |
reduced_ki~t |
Stage 3a/..  |   1.209176   .2520133     0.91   0.362     .8036822     1.81926
      1.esrd |   .9187131   .0876891    -0.89   0.374     .7619643    1.107708
1.other_tr~t |   .8586067   .1011229    -1.29   0.196     .6816218    1.081546
  1.asplenia |   .9665098   .1056621    -0.31   0.755     .7800996    1.197464
1.ra_sle_p~s |   .9461592   .1090606    -0.48   0.631     .7548298    1.185986
1.other_im~o |   .8224474   .0979441    -1.64   0.101      .651238    1.038667
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod2_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod2_1stVaccCensor.ster saved
(2,302 missing values generated)
(1,149 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         51  observations end on or before enter()
------------------------------------------------------------------------------
      4,500  observations remaining, representing
      4,500  subjects
      4,247  failures in single-failure-per-subject data
    422,670  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(3,495 observations (episodes) created)
(cat_time: 3495 changes made)
(covid_tpp_prob: 3495 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,500       56.29       56.29
          1 |      2,058       25.74       82.03
          2 |        947       11.84       93.87
          3 |        352        4.40       98.27
          4 |        138        1.73      100.00
------------+-----------------------------------
      Total |      7,995      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,152      2,348 |     4,500 
         1 |     1,007      1,051 |     2,058 
         2 |       398        549 |       947 
         3 |       160        192 |       352 
         4 |        31        107 |       138 
-----------+----------------------+----------
     Total |     3,748      4,247 |     7,995 
(7,694 observations deleted)
   1:      0.67 /        1 =       0.6720

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          352             Number of obs    =         352
No. of failures      =          192
Time at risk         =        11484
                                                Wald chi2(41)    =     4396.88
Log pseudolikelihood =   -595.65837             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 283 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .4888185   .1982323    -1.76   0.078     .2207785    1.082277
 only 12-18  |   .3659154    .269387    -1.37   0.172     .0864422    1.548943
      mixed  |   .2810879    .110354    -3.23   0.001     .1302158    .6067649
             |
        age1 |    1.09252    .080286     1.20   0.229     .9459695    1.261774
        age2 |   .6658028   .2530822    -1.07   0.285     .3160752    1.402493
        age3 |   2.186731   1.763215     0.97   0.332      .450247    10.62038
      1.male |   1.030715   .1608361     0.19   0.846     .7591269    1.399468
             |
   obese4cat |
Obese I ..)  |   .6576656   .1601013    -1.72   0.085     .4081217    1.059792
Obese II..)  |   1.032495   .2689214     0.12   0.902     .6197062    1.720244
Obese II..)  |   .6463066   .2590163    -1.09   0.276     .2946509    1.417651
             |
smoke_nomiss |
     Former  |   .8443209   .4190721    -0.34   0.733     .3191687    2.233546
    Current  |   1.036429    .291717     0.13   0.899     .5969766    1.799375
             |
         imd |
          4  |   1.357583   .2539213     1.63   0.102     .9409322     1.95873
5 most de..  |   1.032499   .2949531     0.11   0.911     .5898308    1.807389
             |
tot_adults~h |
          2  |   8.08e-17   1.54e-16   -19.42   0.000     1.92e-18    3.40e-15
          3  |   1.747737   3.205018     0.30   0.761     .0480324    63.59429
             |
   ethnicity |
Asian or ..  |    .940239   .3253555    -0.18   0.859     .4771917    1.852609
      Other  |   1.003556   .2309178     0.02   0.988      .639264    1.575443
             |
1.htdiag_o~p |    1.00825   .1841992     0.04   0.964     .7047909    1.442367
1.~y_disease |   1.054933   .1848337     0.31   0.760     .7483192    1.487179
    1.asthma |   1.094734   .3387739     0.29   0.770     .5968944    2.007795
1.~c_disease |   .8061579   .1481329    -1.17   0.241     .5623547    1.155659
             |
     diabcat |
T1DM, con..  |   1.258577   .5504302     0.53   0.599     .5340878    2.965836
T1DM, unc..  |   2.43e-16   2.65e-16   -32.91   0.000     2.85e-17    2.06e-15
T2DM, con..  |   .9557686    .214027    -0.20   0.840     .6162284    1.482395
T2DM, unc..  |   1.162666   .4393588     0.40   0.690      .554364    2.438455
             |
cancer_exh~t |
  Last year  |   2.506149   1.305698     1.76   0.078     .9026784    6.957944
2-5 years..  |   2.173057    .649861     2.60   0.009     1.209249    3.905046
   5+ years  |    .983091   .2212903    -0.08   0.940     .6323992    1.528256
             |
cancer_hae~t |
  Last year  |   1.49e-16   1.36e-16   -40.07   0.000     2.51e-17    8.87e-16
2-5 years..  |   .6412572   .2978679    -0.96   0.339     .2580144    1.593752
   5+ years  |   1.112249   .2229006     0.53   0.596       .75096    1.647356
             |
1.~r_disease |    .981641   .1788194    -0.10   0.919     .6869017    1.402848
1.stroke_d~a |   1.027805   .2018375     0.14   0.889     .6994461    1.510314
1.other_ne~o |   .7373528   .1483327    -1.51   0.130     .4970954    1.093732
             |
reduced_ki~t |
Stage 3a/..  |   .4981955   .3085622    -1.12   0.261     .1479789    1.677257
      1.esrd |   1.082151   .1789115     0.48   0.633     .7826347    1.496293
1.other_tr~t |   1.004011   .1921954     0.02   0.983     .6899143    1.461107
  1.asplenia |   .9568039   .1879224    -0.22   0.822     .6510907    1.406062
1.ra_sle_p~s |   .9688135   .2314592    -0.13   0.894     .6065682    1.547393
1.other_im~o |   .9936872   .1959746    -0.03   0.974     .6751124    1.462592
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod3_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod3_1stVaccCensor.ster saved
(2,302 missing values generated)
(1,149 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         51  observations end on or before enter()
------------------------------------------------------------------------------
      4,500  observations remaining, representing
      4,500  subjects
      4,247  failures in single-failure-per-subject data
    422,670  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(3,495 observations (episodes) created)
(cat_time: 3495 changes made)
(covid_tpp_prob: 3495 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,500       56.29       56.29
          1 |      2,058       25.74       82.03
          2 |        947       11.84       93.87
          3 |        352        4.40       98.27
          4 |        138        1.73      100.00
------------+-----------------------------------
      Total |      7,995      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,152      2,348 |     4,500 
         1 |     1,007      1,051 |     2,058 
         2 |       398        549 |       947 
         3 |       160        192 |       352 
         4 |        31        107 |       138 
-----------+----------------------+----------
     Total |     3,748      4,247 |     7,995 
(7,908 observations deleted)
   1:      0.48 /        1 =       0.4850

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          138             Number of obs    =         138
No. of failures      =          107
Time at risk         =         2857
                                                Wald chi2(37)    =       66.34
Log pseudolikelihood =   -199.34106             Prob > chi2      =      0.0022

                         (Std. Err. adjusted for 130 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .0378724   .0433829    -2.86   0.004     .0040112    .3575815
 only 12-18  |   .0781835   .0859954    -2.32   0.020     .0090545    .6750978
      mixed  |   .0421118   .0435278    -3.06   0.002     .0055537    .3193206
             |
        age1 |   .9766981   .1326439    -0.17   0.862     .7484451    1.274561
        age2 |   .9319786   .6843662    -0.10   0.924     .2209814    3.930577
        age3 |   1.235962   1.930204     0.14   0.892     .0579006     26.3832
      1.male |   1.056576   .2815781     0.21   0.836     .6266932    1.781339
             |
   obese4cat |
Obese I ..)  |   1.243841   .4128214     0.66   0.511     .6490188    2.383813
Obese II..)  |   1.696748   .9735993     0.92   0.357     .5510555    5.224436
Obese II..)  |   1.610228   .6429564     1.19   0.233     .7362184    3.521828
             |
smoke_nomiss |
     Former  |   1.242213    .994267     0.27   0.786     .2587587    5.963449
    Current  |   1.297278   .4484711     0.75   0.452     .6588265    2.554434
             |
         imd |
          4  |   .7798523   .1944038    -1.00   0.319     .4784343    1.271166
5 most de..  |   1.778046    .699289     1.46   0.143     .8225709    3.843374
             |
3.tot_adul~h |          1  (omitted)
             |
   ethnicity |
Asian or ..  |   .9427096   .4393756    -0.13   0.899     .3781396    2.350194
      Other  |   .6700803   .2797562    -0.96   0.338     .2956332      1.5188
             |
1.htdiag_o~p |   1.254114   .3588488     0.79   0.429     .7157753    2.197342
1.~y_disease |   1.151217   .3643853     0.44   0.656     .6190613    2.140825
    1.asthma |   .7244962   .3744309    -0.62   0.533     .2631007    1.995034
1.~c_disease |   2.606354   .7777379     3.21   0.001     1.452226    4.677702
             |
     diabcat |
T1DM, con..  |   .2379095   .1923286    -1.78   0.076     .0487855    1.160198
T1DM, unc..  |   1.04e-19          .        .       .            .           .
T2DM, con..  |   1.851735   .6167529     1.85   0.064     .9639873    3.557022
T2DM, unc..  |    .908801   .5069127    -0.17   0.864     .3045679    2.711774
             |
cancer_exh~t |
2-5 years..  |   1.519985   1.220177     0.52   0.602     .3151604    7.330721
   5+ years  |   .6076626   .2407568    -1.26   0.209     .2795215    1.321021
             |
cancer_hae~t |
  Last year  |    2.95067   2.094066     1.52   0.127     .7342267    11.85799
2-5 years..  |   2.003605   1.502238     0.93   0.354     .4609021    8.709948
   5+ years  |   1.174483   .4379291     0.43   0.666     .5655349    2.439125
             |
1.~r_disease |   .9477509   .2923738    -0.17   0.862     .5177321    1.734935
1.stroke_d~a |   1.389531   .4371388     1.05   0.296     .7500409    2.574255
1.other_ne~o |   1.066875   .2833017     0.24   0.807       .63399    1.795331
             |
reduced_ki~t |
Stage 3a/..  |   2.530615   1.315554     1.79   0.074     .9135338    7.010156
      1.esrd |   .7214935   .2821031    -0.83   0.404     .3352846     1.55257
1.other_tr~t |   .9384203   .3923131    -0.15   0.879     .4135678    2.129355
  1.asplenia |   1.053103   .3311761     0.16   0.869     .5685755    1.950535
1.ra_sle_p~s |   2.187927   .6847261     2.50   0.012     1.184797    4.040378
1.other_im~o |   .6497807   .2640585    -1.06   0.289     .2929913    1.441049
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod4_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod4_1stVaccCensor.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_tpp_prob_1st
> VaccCensor.log
  log type:  text
 closed on:  28 Oct 2021, 11:27:09
-------------------------------------------------------------------------------
