-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_icu.log
  log type:  text
 opened on:  25 Jul 2021, 08:14:10

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. forvalues period=0/3 {
  3. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  4. stsplit cat_time, at(0,78,147,400)
  5. recode cat_time 78=1 147=2 400=3
  6. recode `outcome' .=0 
  7. tab cat_time
  8. tab cat_time `outcome'
  9. 
. keep if cat_time==`period'
 10. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 11. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 12. if _rc==0{
 13. estimates
 14. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 15.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals 
.         timer clear 
 16.         timer on 1
 17.         if e(N_fail)>0 estat phtest, d
 18.         timer off 1
 19.         timer list 
 20.         
. }
 21. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 22. 
. }
 23. 
. foreach exposure_type in  gp_number_kids {
 24. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_FULL
> YADJMODEL_ageband_`x'"
 25. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 26. if _rc==0{
 27. estimates
 28. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 29. }
 30. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 31. 
. }
 32. }
 33. }
(11,234 observations (episodes) created)
(cat_time: 11234 changes made)
(covid_icu: 11234 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       58.76       58.76
          1 |      8,043       29.53       88.29
          2 |      3,191       11.71      100.00
------------+-----------------------------------
      Total |     27,239      100.00

           |   Failure/censoring
           |     indicator for
observatio |  outcome: covid icu
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,122      6,883 |    16,005 
         1 |     4,072      3,971 |     8,043 
         2 |     1,627      1,564 |     3,191 
-----------+----------------------+----------
     Total |    14,821     12,418 |    27,239 
(11,236 observations deleted)
   1:      4.51 /        1 =       4.5060

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,005             Number of obs    =      16,005
No. of failures      =        6,883
Time at risk         =       923753
                                                Wald chi2(42)    =       50.67
Log pseudolikelihood =   -48712.839             Prob > chi2      =      0.1687

                       (Std. Err. adjusted for 1,113 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9329492   .0872259    -0.74   0.458     .7767389    1.120575
 only 12-18  |   .8206354   .0934074    -1.74   0.082     .6565438    1.025739
      mixed  |   .9376467   .0799467    -0.76   0.450     .7933469    1.108193
             |
        age1 |   .9954751   .0042171    -1.07   0.284     .9872441    1.003775
        age2 |   1.017674   .0136369     1.31   0.191     .9912937    1.044755
        age3 |   .9524942    .036813    -1.26   0.208     .8830071    1.027449
      1.male |   1.003692   .0240765     0.15   0.878     .9575951    1.052008
             |
   obese4cat |
Obese I ..)  |   .9913901   .0342792    -0.25   0.803     .9264302    1.060905
Obese II..)  |   .9571041   .0427147    -0.98   0.326     .8769418    1.044594
Obese II..)  |     1.0616   .0535686     1.18   0.236     .9616326     1.17196
             |
smoke_nomiss |
     Former  |   1.044922   .0902168     0.51   0.611     .8822518    1.237585
    Current  |   1.024602   .0372699     0.67   0.504     .9540972    1.100316
             |
         imd |
          4  |    .995458   .0317519    -0.14   0.887     .9351309    1.059677
5 most de..  |   .9797792   .0390515    -0.51   0.608      .906153    1.059388
             |
tot_adults~h |
          2  |   1.131715   .2700315     0.52   0.604     .7089851    1.806496
          3  |    1.29481   .2439297     1.37   0.170     .8950511    1.873114
             |
   ethnicity |
Asian or ..  |   1.016431   .0417381     0.40   0.691     .9378315    1.101618
      Other  |   1.037246   .0395793     0.96   0.338     .9625021    1.117795
             |
1.htdiag_o~p |    1.03901   .0465972     0.85   0.393     .9515801    1.134473
1.~y_disease |    1.00951   .0300813     0.32   0.751     .9522407    1.070224
    1.asthma |   1.037172    .046625     0.81   0.417     .9496994    1.132702
1.~c_disease |   .9830358    .029578    -0.57   0.570     .9267402    1.042751
             |
     diabcat |
T1DM, con..  |   .8928722   .0716608    -1.41   0.158     .7629093    1.044974
T1DM, unc..  |   .9242681   .1685893    -0.43   0.666     .6464519    1.321477
T2DM, con..  |   1.068288   .0371105     1.90   0.057      .997974    1.143557
T2DM, unc..  |   .9426524   .0655084    -0.85   0.395     .8226185    1.080201
Diabetes,..  |   .6323296   .3762305    -0.77   0.441     .1970091    2.029555
             |
cancer_exh~t |
  Last year  |   1.344243   .2504818     1.59   0.112       .93297    1.936814
2-5 years..  |    1.17889   .1073411     1.81   0.071     .9862091    1.409216
   5+ years  |   .9846246   .0323177    -0.47   0.637     .9232776    1.050048
             |
cancer_hae~t |
  Last year  |   1.018655    .200555     0.09   0.925     .6925339    1.498351
2-5 years..  |   1.125872   .1104887     1.21   0.227     .9288713    1.364655
   5+ years  |   .9980541   .0327024    -0.06   0.953     .9359732    1.064253
             |
1.~r_disease |   .9605295   .0285889    -1.35   0.176     .9060992    1.018229
1.stroke_d~a |   1.022979   .0314545     0.74   0.460     .9631501    1.086524
1.other_ne~o |   .9791099   .0298665    -0.69   0.489      .922288    1.039432
             |
reduced_ki~t |
Stage 3a/..  |   .5528341    .120691    -2.71   0.007     .3603846    .8480537
      1.esrd |   1.034189   .0261053     1.33   0.183     .9842684    1.086641
1.other_tr~t |   .9482369   .0286956    -1.76   0.079     .8936301    1.006181
  1.asplenia |   .9973287   .0290395    -0.09   0.927      .942006      1.0559
1.ra_sle_p~s |    .945651   .0283157    -1.87   0.062     .8917503     1.00281
1.other_im~o |   1.017931   .0297426     0.61   0.543     .9612741    1.077927
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMOD
> EL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMODEL_ageb
> and_0_timeperiod0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.01335         1.32        1         0.2505
      2.kids_cat4 |      0.01185         0.84        1         0.3605
      3.kids_cat4 |      0.00639         0.29        1         0.5924
      age1        |     -0.00730         0.34        1         0.5597
      age2        |      0.01193         0.91        1         0.3389
      age3        |     -0.01293         1.10        1         0.2944
      0b.male     |            .            .        1             .
      1.male      |     -0.02290         3.80        1         0.0513
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.01782         2.25        1         0.1340
      3.obese4cat |      0.01789         2.36        1         0.1242
      4.obese4cat |     -0.00307         0.06        1         0.8011
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00743         0.39        1         0.5310
      3.smoke_no~s|      0.01852         2.47        1         0.1158
      1b.imd      |            .            .        1             .
      4.imd       |     -0.00533         0.23        1         0.6288
      5.imd       |     -0.00685         0.33        1         0.5681
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.02403         4.29        1         0.0382
      3.tot_adul~h|     -0.01683         1.99        1         0.1586
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.00758         0.42        1         0.5152
      5.ethnicity |      0.00074         0.00        1         0.9522
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.00852         0.51        1         0.4731
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.02301         3.73        1         0.0534
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.00536         0.22        1         0.6378
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00119         0.01        1         0.9205
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01229         1.11        1         0.2932
      3.diabcat   |     -0.02087         3.29        1         0.0699
      4.diabcat   |      0.01129         1.07        1         0.3020
      5.diabcat   |     -0.02019         3.08        1         0.0792
      6.diabcat   |     -0.00536         0.22        1         0.6412
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.00741         0.42        1         0.5155
      3.cancer_e~t|      0.00670         0.34        1         0.5612
      4.cancer_e~t|     -0.01885         2.64        1         0.1042
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.00305         0.06        1         0.8025
      3.cancer_h~t|      0.00452         0.15        1         0.6959
      4.cancer_h~t|      0.00799         0.48        1         0.4865
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.00910         0.59        1         0.4425
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01139         0.98        1         0.3216
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.00284         0.06        1         0.8081
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.01309         1.04        1         0.3070
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.02414         4.29        1         0.0383
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.01309         1.20        1         0.2724
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00121         0.01        1         0.9199
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.00939         0.61        1         0.4333
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.02146         3.23        1         0.0723
      ------------+---------------------------------------------------
      global test |                     50.01       42         0.1853
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:     12.11 /        1 =      12.1070
   1:      2.11 /        1 =       2.1130

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,561             Number of obs    =       1,561
No. of failures      =          671
Time at risk         =        90901
                                                Wald chi2(41)    =    14197.55
Log pseudolikelihood =   -3158.3969             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 199 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .8412467   .0908416    -1.60   0.109       .68078    1.039537
3 childre..  |   .8900132   .1087502    -0.95   0.340     .7004684    1.130848
4+ childr..  |   .9436262   .0986314    -0.56   0.579      .768828    1.158166
             |
        age1 |   .9947786   .0135378    -0.38   0.700     .9685957    1.021669
        age2 |   1.044281   .0467241     0.97   0.333     .9566039    1.139994
        age3 |   .8415606   .1104156    -1.31   0.189      .650736    1.088343
      1.male |   1.003329   .0723035     0.05   0.963     .8711696    1.155538
             |
   obese4cat |
Obese I ..)  |   1.103342    .131307     0.83   0.409     .8737958     1.39319
Obese II..)  |   1.285338   .1558791     2.07   0.038     1.013416    1.630221
Obese II..)  |   1.263147   .2013194     1.47   0.143     .9242509    1.726306
             |
smoke_nomiss |
     Former  |   1.244346   .4242994     0.64   0.521     .6378184    2.427647
    Current  |   .9670633   .1165785    -0.28   0.781     .7635605    1.224803
             |
         imd |
          4  |   1.042511   .1083139     0.40   0.689     .8504394    1.277962
5 most de..  |   .9279426   .1338249    -0.52   0.604     .6994611    1.231058
             |
tot_adults~h |
          2  |   .4142816   .2261175    -1.61   0.106     .1421362    1.207499
          3  |   .4771119   .1853671    -1.90   0.057     .2227985    1.021712
             |
   ethnicity |
Asian or ..  |   1.218825   .1327508     1.82   0.069     .9845347     1.50887
      Other  |    1.19677   .1403108     1.53   0.125     .9510746    1.505936
             |
1.htdiag_o~p |   1.078254    .159118     0.51   0.610     .8074384    1.439902
1.~y_disease |   .9262182   .0879069    -0.81   0.419     .7689997    1.115579
    1.asthma |   1.330821    .200607     1.90   0.058     .9903991    1.788254
1.~c_disease |   .9579803   .0969598    -0.42   0.671     .7856048    1.168178
             |
     diabcat |
T1DM, con..  |   .6030955   .1725629    -1.77   0.077     .3442175     1.05667
T1DM, unc..  |   4.68e-15   2.41e-15   -64.10   0.000     1.71e-15    1.28e-14
T2DM, con..  |   1.163805   .1212711     1.46   0.145     .9488181    1.427504
T2DM, unc..  |    1.44052     .26966     1.95   0.051      .998108    2.079031
             |
cancer_exh~t |
  Last year  |   .8753504   .6199584    -0.19   0.851     .2184373    3.507819
2-5 years..  |   1.367138   .3976598     1.08   0.282     .7730776    2.417695
   5+ years  |   .9432229   .1099671    -0.50   0.616     .7505431    1.185367
             |
cancer_hae~t |
  Last year  |   2.83e-15   2.97e-15   -31.88   0.000     3.61e-16    2.22e-14
2-5 years..  |   2.094658   .5672257     2.73   0.006     1.232001    3.561356
   5+ years  |   1.118109   .1104041     1.13   0.258      .921372    1.356855
             |
1.~r_disease |   .9983913   .1012703    -0.02   0.987     .8183903    1.217983
1.stroke_d~a |    .968795   .1039477    -0.30   0.768     .7850575    1.195535
1.other_ne~o |   .8984958   .0897722    -1.07   0.284      .738702    1.092856
             |
reduced_ki~t |
Stage 3a/..  |   5.94e-15   2.64e-15   -73.63   0.000     2.48e-15    1.42e-14
      1.esrd |   1.018525   .0918831     0.20   0.839     .8534599    1.215515
1.other_tr~t |   .9122595   .0992405    -0.84   0.399     .7370893    1.129059
  1.asplenia |   1.123777   .1038033     1.26   0.206     .9376796    1.346807
1.ra_sle_p~s |    .812552   .0822693    -2.05   0.040     .6662982    .9909088
1.other_im~o |   1.024435   .1032182     0.24   0.811     .8408541    1.248097
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYA
> DJMODEL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYADJMODEL
> _ageband_0_timeperiod0.ster saved
(11,234 observations (episodes) created)
(cat_time: 11234 changes made)
(covid_icu: 11234 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       58.76       58.76
          1 |      8,043       29.53       88.29
          2 |      3,191       11.71      100.00
------------+-----------------------------------
      Total |     27,239      100.00

           |   Failure/censoring
           |     indicator for
observatio |  outcome: covid icu
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,122      6,883 |    16,005 
         1 |     4,072      3,971 |     8,043 
         2 |     1,627      1,564 |     3,191 
-----------+----------------------+----------
     Total |    14,821     12,418 |    27,239 
(19,198 observations deleted)
   1:      3.63 /        1 =       3.6280

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        8,043             Number of obs    =       8,043
No. of failures      =        3,971
Time at risk         =       378553
                                                Wald chi2(42)    =       24.37
Log pseudolikelihood =   -25062.196             Prob > chi2      =      0.9865

                       (Std. Err. adjusted for 1,016 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.068262     .14601     0.48   0.629     .8172141    1.396433
 only 12-18  |   .8489252   .1675135    -0.83   0.407     .5766426    1.249776
      mixed  |   1.115016   .1441854     0.84   0.400     .8653867    1.436653
             |
        age1 |   1.001707   .0056361     0.30   0.762     .9907207    1.012814
        age2 |   .9893007   .0176734    -0.60   0.547     .9552609    1.024553
        age3 |    1.03179   .0528628     0.61   0.541     .9332133     1.14078
      1.male |   1.016322   .0331736     0.50   0.620     .9533393    1.083466
             |
   obese4cat |
Obese I ..)  |   1.007312   .0471349     0.16   0.876     .9190388    1.104063
Obese II..)  |   .9841979   .0569779    -0.28   0.783      .878626    1.102455
Obese II..)  |   .9770318   .0705458    -0.32   0.748     .8481026    1.125561
             |
smoke_nomiss |
     Former  |   1.035512   .1227571     0.29   0.768     .8208189    1.306359
    Current  |   .9940986   .0500544    -0.12   0.906     .9006792    1.097207
             |
         imd |
          4  |   1.022938   .0403281     0.58   0.565     .9468729    1.105114
5 most de..  |   .9790755   .0545224    -0.38   0.704     .8778387    1.091987
             |
tot_adults~h |
          2  |     .70786   .2030029    -1.20   0.228     .4034935    1.241819
          3  |   .8007942   .1845633    -0.96   0.335     .5097298    1.258061
             |
   ethnicity |
Asian or ..  |   1.036463   .0560667     0.66   0.508     .9321986    1.152388
      Other  |   1.132409   .0573774     2.45   0.014     1.025355     1.25064
             |
1.htdiag_o~p |   .9954417   .0573818    -0.08   0.937     .8890961    1.114507
1.~y_disease |   .9446213    .038135    -1.41   0.158     .8727587    1.022401
    1.asthma |   1.009442    .059115     0.16   0.873     .8999812    1.132217
1.~c_disease |   1.014149   .0419398     0.34   0.734     .9351921    1.099773
             |
     diabcat |
T1DM, con..  |   .9127114   .0930068    -0.90   0.370     .7474715     1.11448
T1DM, unc..  |   .9836144   .2025965    -0.08   0.936     .6569037    1.472815
T2DM, con..  |   .9375674   .0410372    -1.47   0.141     .8604893     1.02155
T2DM, unc..  |   .9559582   .0851299    -0.51   0.613     .8028563    1.138256
Diabetes,..  |   .7265157   .3803598    -0.61   0.542     .2603797    2.027136
             |
cancer_exh~t |
  Last year  |   .7242319   .2209838    -1.06   0.290     .3982463    1.317054
2-5 years..  |   .9861135   .1226199    -0.11   0.910     .7728279    1.258262
   5+ years  |   1.016717   .0413178     0.41   0.683     .9388762     1.10101
             |
cancer_hae~t |
  Last year  |   .9485592   .2550969    -0.20   0.844      .559951    1.606863
2-5 years..  |   .9094479   .1387398    -0.62   0.534     .6744097    1.226399
   5+ years  |    1.05059   .0427408     1.21   0.225     .9700725    1.137791
             |
1.~r_disease |   .9895388   .0376524    -0.28   0.782     .9184261    1.066158
1.stroke_d~a |   .9544217     .03947    -1.13   0.259      .880114    1.035003
1.other_ne~o |   .9697071   .0383867    -0.78   0.437     .8973151    1.047939
             |
reduced_ki~t |
Stage 3a/..  |   1.082426   .2230087     0.38   0.701     .7228162    1.620945
      1.esrd |   .9971392   .0324961    -0.09   0.930     .9354395    1.062908
1.other_tr~t |   .9855508   .0394639    -0.36   0.716     .9111603    1.066015
  1.asplenia |   1.004395   .0381308     0.12   0.908     .9323733    1.081981
1.ra_sle_p~s |     1.0148   .0426675     0.35   0.727     .9345265    1.101969
1.other_im~o |   1.014962   .0407525     0.37   0.711     .9381502    1.098062
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMOD
> EL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMODEL_ageb
> and_0_timeperiod1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.00990         0.45        1         0.5046
      2.kids_cat4 |     -0.00447         0.11        1         0.7414
      3.kids_cat4 |     -0.00837         0.32        1         0.5706
      age1        |      0.00076         0.00        1         0.9626
      age2        |     -0.00166         0.01        1         0.9181
      age3        |      0.00193         0.01        1         0.9048
      0b.male     |            .            .        1             .
      1.male      |      0.00113         0.01        1         0.9407
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01838         1.43        1         0.2310
      3.obese4cat |      0.00811         0.28        1         0.5985
      4.obese4cat |      0.01518         0.98        1         0.3221
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01969         1.75        1         0.1859
      3.smoke_no~s|      0.00182         0.01        1         0.9040
      1b.imd      |            .            .        1             .
      4.imd       |     -0.00712         0.21        1         0.6495
      5.imd       |      0.00059         0.00        1         0.9682
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.01067         0.47        1         0.4933
      3.tot_adul~h|      0.00422         0.08        1         0.7811
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.00178         0.01        1         0.9080
      5.ethnicity |      0.04573         8.64        1         0.0033
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.00561         0.13        1         0.7188
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.01847         1.41        1         0.2353
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.00951         0.36        1         0.5482
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.03784         6.50        1         0.0108
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00217         0.02        1         0.8872
      3.diabcat   |     -0.00042         0.00        1         0.9790
      4.diabcat   |      0.00078         0.00        1         0.9603
      5.diabcat   |     -0.02443         2.58        1         0.1080
      6.diabcat   |      0.02171         1.60        1         0.2062
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00989         0.38        1         0.5388
      3.cancer_e~t|      0.00930         0.34        1         0.5577
      4.cancer_e~t|      0.03344         4.41        1         0.0357
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.00309         0.04        1         0.8478
      3.cancer_h~t|     -0.02002         1.83        1         0.1763
      4.cancer_h~t|      0.03374         4.64        1         0.0312
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.02914         3.28        1         0.0701
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.01955         1.67        1         0.1962
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.00437         0.08        1         0.7786
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.00822         0.27        1         0.6061
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.01660         1.14        1         0.2856
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.01308         0.74        1         0.3881
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.02148         1.78        1         0.1822
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.01867         1.68        1         0.1952
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00014         0.00        1         0.9928
      ------------+---------------------------------------------------
      global test |                     48.84       42         0.2173
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      4.47 /        1 =       4.4680
   1:      0.28 /        1 =       0.2790

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          782             Number of obs    =         782
No. of failures      =          375
Time at risk         =        36798
                                                Wald chi2(41)    =       73.07
Log pseudolikelihood =    -1480.698             Prob > chi2      =      0.0015

                         (Std. Err. adjusted for 172 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.047479   .1665427     0.29   0.770     .7670253    1.430478
3 childre..  |   .9259813   .1489137    -0.48   0.633     .6756384    1.269083
4+ childr..  |    1.08006   .1612171     0.52   0.606     .8061056    1.447119
             |
        age1 |   .9853721   .0173118    -0.84   0.402     .9520192    1.019894
        age2 |   1.058218   .0566386     1.06   0.290     .9528326    1.175259
        age3 |   .8328433   .1281589    -1.19   0.235     .6159982    1.126023
      1.male |   1.098906   .1146071     0.90   0.366     .8957499    1.348137
             |
   obese4cat |
Obese I ..)  |   1.191956   .1920676     1.09   0.276     .8691613    1.634631
Obese II..)  |   1.127923   .2291878     0.59   0.554     .7573906    1.679728
Obese II..)  |   .8251871   .2459436    -0.64   0.519     .4601033    1.479958
             |
smoke_nomiss |
     Former  |   1.128124   .4253048     0.32   0.749      .538831    2.361899
    Current  |   .9548484   .1455831    -0.30   0.762     .7081969    1.287404
             |
         imd |
          4  |   .9521152   .1319997    -0.35   0.723     .7255716    1.249392
5 most de..  |   1.111057    .211262     0.55   0.580     .7653931    1.612828
             |
tot_adults~h |
          2  |   .3872563   .4892242    -0.75   0.453     .0325588    4.606051
          3  |    .511689   .6092448    -0.56   0.574     .0496043    5.278287
             |
   ethnicity |
Asian or ..  |   .7843851   .1704515    -1.12   0.264       .51234    1.200882
      Other  |    1.17423   .2128457     0.89   0.376     .8231162    1.675119
             |
1.htdiag_o~p |   1.134255   .2082431     0.69   0.493     .7914709    1.625499
1.~y_disease |   .8501314   .1148596    -1.20   0.229     .6523519    1.107874
    1.asthma |   .9027717   .2025048    -0.46   0.648     .5816223    1.401247
1.~c_disease |   1.028415   .1283628     0.22   0.822      .805239    1.313446
             |
     diabcat |
T1DM, con..  |   .5507926   .1628586    -2.02   0.044      .308535    .9832675
T1DM, unc..  |   .9148219   .6280804    -0.13   0.897     .2381965    3.513482
T2DM, con..  |   .8108655   .1408377    -1.21   0.227     .5769062    1.139705
T2DM, unc..  |    1.44002   .4694426     1.12   0.263     .7601143    2.728085
             |
cancer_exh~t |
  Last year  |   2.642781   .9791113     2.62   0.009     1.278508    5.462843
2-5 years..  |   .7318922   .2993689    -0.76   0.445     .3283043    1.631615
   5+ years  |   1.074017   .1459335     0.53   0.599      .822911    1.401746
             |
cancer_hae~t |
  Last year  |   1.306572   .4567876     0.76   0.444      .658486    2.592507
2-5 years..  |   1.007276   .4302368     0.02   0.986     .4360897    2.326598
   5+ years  |   1.032354   .1519641     0.22   0.829     .7736248    1.377612
             |
1.~r_disease |   .7695909   .1331003    -1.51   0.130     .5483338    1.080127
1.stroke_d~a |   1.069607   .1427378     0.50   0.614     .8234412    1.389365
1.other_ne~o |   .9249708   .1328421    -0.54   0.587     .6980403    1.225676
             |
reduced_ki~t |
Stage 3a/..  |   .4162266   .4866399    -0.75   0.453     .0420853    4.116514
      1.esrd |   .9307952   .0979703    -0.68   0.496     .7572887    1.144055
1.other_tr~t |   1.178994   .1565446     1.24   0.215      .908847    1.529441
  1.asplenia |    1.02802   .1480895     0.19   0.848     .7751451    1.363389
1.ra_sle_p~s |    1.25662   .1859319     1.54   0.123     .9402834    1.679382
1.other_im~o |   .9989615   .1288032    -0.01   0.994     .7758849    1.286175
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYA
> DJMODEL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYADJMODEL
> _ageband_0_timeperiod1.ster saved
(11,234 observations (episodes) created)
(cat_time: 11234 changes made)
(covid_icu: 11234 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       58.76       58.76
          1 |      8,043       29.53       88.29
          2 |      3,191       11.71      100.00
------------+-----------------------------------
      Total |     27,239      100.00

           |   Failure/censoring
           |     indicator for
observatio |  outcome: covid icu
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,122      6,883 |    16,005 
         1 |     4,072      3,971 |     8,043 
         2 |     1,627      1,564 |     3,191 
-----------+----------------------+----------
     Total |    14,821     12,418 |    27,239 
(24,050 observations deleted)
   1:      2.61 /        1 =       2.6070

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,191             Number of obs    =       3,191
No. of failures      =        1,564
Time at risk         =       113995
                                                Wald chi2(42)    =     2791.79
Log pseudolikelihood =   -8204.5882             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 858 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.331244   .2604643     1.46   0.144     .9072273    1.953437
 only 12-18  |    1.40002   .3517811     1.34   0.181      .855567    2.290944
      mixed  |   1.462296   .2712135     2.05   0.040     1.016628    2.103336
             |
        age1 |   .9814342   .0092659    -1.98   0.047     .9634404     .999764
        age2 |    1.06626   .0321907     2.13   0.034     1.004998    1.131257
        age3 |   .8277524   .0713365    -2.19   0.028     .6991061    .9800715
      1.male |   .8987765   .0464707    -2.06   0.039     .8121587    .9946323
             |
   obese4cat |
Obese I ..)  |   .9370115   .0677415    -0.90   0.368     .8132181     1.07965
Obese II..)  |   .7574145    .075354    -2.79   0.005     .6232308    .9204885
Obese II..)  |    1.00492   .1131438     0.04   0.965     .8059249    1.253049
             |
smoke_nomiss |
     Former  |   1.026159   .2036179     0.13   0.896     .6955254    1.513966
    Current  |   1.050767   .0754287     0.69   0.490     .9128581     1.20951
             |
         imd |
          4  |    .985481   .0637448    -0.23   0.821     .8681388    1.118684
5 most de..  |   .9739072   .0806609    -0.32   0.750     .8279791    1.145554
             |
tot_adults~h |
          2  |   .7437388   .2772523    -0.79   0.427     .3581855    1.544304
          3  |   .5489396   .1679555    -1.96   0.050     .3013616    .9999106
             |
   ethnicity |
Asian or ..  |   1.017727    .092596     0.19   0.847     .8515036      1.2164
      Other  |   .8316091   .0796078    -1.93   0.054     .6893438    1.003235
             |
1.htdiag_o~p |   .8224831    .068263    -2.35   0.019     .6990052    .9677731
1.~y_disease |   .9411835   .0615027    -0.93   0.354     .8280405    1.069786
    1.asthma |   .9852375   .0943433    -0.16   0.877     .8166435    1.188637
1.~c_disease |   1.018475   .0667314     0.28   0.780     .8957337    1.158035
             |
     diabcat |
T1DM, con..  |    1.05238   .1494411     0.36   0.719     .7967079    1.390099
T1DM, unc..  |   1.409656   .3387235     1.43   0.153     .8801962    2.257598
T2DM, con..  |   1.037563   .0701904     0.55   0.586     .9087227    1.184671
T2DM, unc..  |   .9067489    .130825    -0.68   0.497     .6834022    1.203089
Diabetes,..  |   3.07e-14   1.92e-14   -49.83   0.000     9.04e-15    1.05e-13
             |
cancer_exh~t |
  Last year  |   .1183821   .1221672    -2.07   0.039     .0156628     .894753
2-5 years..  |   1.276664   .2121883     1.47   0.142     .9217275    1.768279
   5+ years  |   1.150433   .0776723     2.08   0.038      1.00784      1.3132
             |
cancer_hae~t |
  Last year  |   .5680141   .2759824    -1.16   0.244     .2191714     1.47209
2-5 years..  |   .7123496   .1632311    -1.48   0.139     .4546163    1.116199
   5+ years  |    1.02748   .0692554     0.40   0.688     .9003257    1.172592
             |
1.~r_disease |   1.097031   .0652071     1.56   0.119     .9763914    1.232577
1.stroke_d~a |   1.093874   .0688528     1.43   0.154     .9669171      1.2375
1.other_ne~o |   1.028804    .066895     0.44   0.662     .9057031    1.168637
             |
reduced_ki~t |
Stage 3a/..  |   .9097224   .2563249    -0.34   0.737     .5236883    1.580319
      1.esrd |   .9976398   .0528032    -0.04   0.964     .8993346    1.106691
1.other_tr~t |   1.025873   .0647781     0.40   0.686     .9064522    1.161027
  1.asplenia |   .8963349   .0612302    -1.60   0.109      .784013    1.024749
1.ra_sle_p~s |   .9183473   .0619579    -1.26   0.207     .8045983    1.048177
1.other_im~o |    .997776   .0612497    -0.04   0.971     .8846694    1.125343
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMOD
> EL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMODEL_ageb
> and_0_timeperiod2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.00399         0.02        1         0.8756
      2.kids_cat4 |      0.00201         0.01        1         0.9342
      3.kids_cat4 |     -0.00495         0.04        1         0.8450
      age1        |     -0.02746         1.31        1         0.2519
      age2        |      0.02508         1.08        1         0.2985
      age3        |     -0.02280         0.88        1         0.3491
      0b.male     |            .            .        1             .
      1.male      |     -0.00561         0.05        1         0.8165
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.00866         0.12        1         0.7341
      3.obese4cat |     -0.01259         0.28        1         0.5985
      4.obese4cat |      0.00323         0.02        1         0.8977
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.04131         3.43        1         0.0639
      3.smoke_no~s|      0.06845         7.27        1         0.0070
      1b.imd      |            .            .        1             .
      4.imd       |      0.04001         2.73        1         0.0987
      5.imd       |     -0.03124         1.57        1         0.2101
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.01529         0.33        1         0.5646
      3.tot_adul~h|     -0.01415         0.27        1         0.6003
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.01592         0.46        1         0.4957
      5.ethnicity |      0.00447         0.03        1         0.8534
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.02207         0.73        1         0.3941
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.00892         0.14        1         0.7107
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.00410         0.03        1         0.8651
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00184         0.01        1         0.9378
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01551         0.37        1         0.5406
      3.diabcat   |      0.05443         3.35        1         0.0674
      4.diabcat   |     -0.00141         0.00        1         0.9550
      5.diabcat   |     -0.03973         2.93        1         0.0867
      6.diabcat   |     -0.01193         0.02        1         0.8839
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.01747         0.57        1         0.4490
      3.cancer_e~t|      0.02186         0.70        1         0.4018
      4.cancer_e~t|      0.00209         0.01        1         0.9315
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.00020         0.00        1         0.9935
      3.cancer_h~t|      0.00836         0.10        1         0.7488
      4.cancer_h~t|     -0.00355         0.02        1         0.8862
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.04188         2.78        1         0.0957
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.01222         0.26        1         0.6111
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.00414         0.03        1         0.8578
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.04889         2.78        1         0.0952
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.00897         0.14        1         0.7121
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.01080         0.21        1         0.6469
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.06629         8.07        1         0.0045
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.03356         1.98        1         0.1597
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.02382         0.93        1         0.3336
      ------------+---------------------------------------------------
      global test |                     44.19       42         0.3792
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      1.37 /        1 =       1.3740
   1:      0.39 /        1 =       0.3910

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          312             Number of obs    =         312
No. of failures      =          151
Time at risk         =        11558
                                                Wald chi2(39)    =     4601.80
Log pseudolikelihood =   -432.42106             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 125 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .9977454   .2147059    -0.01   0.992     .6544082    1.521215
3 childre..  |   .9920155   .2491468    -0.03   0.975     .6063696    1.622929
4+ childr..  |   .8242164     .16178    -0.98   0.325     .5610022    1.210927
             |
        age1 |   .9836133    .037335    -0.44   0.663     .9130937    1.059579
        age2 |   1.049233   .1383981     0.36   0.716     .8102048    1.358779
        age3 |   .8496554   .3282161    -0.42   0.673     .3985011    1.811574
      1.male |   .7362421   .1388603    -1.62   0.104     .5087193    1.065524
             |
   obese4cat |
Obese I ..)  |   1.218211   .3080482     0.78   0.435     .7421292    1.999702
Obese II..)  |   .6770793   .2515755    -1.05   0.294     .3268641    1.402529
Obese II..)  |   .8443919   .4876616    -0.29   0.770     .2722386    2.619018
             |
smoke_nomiss |
     Former  |   .4757384   .5078663    -0.70   0.486     .0587061    3.855259
    Current  |   1.011598   .2542633     0.05   0.963     .6181022    1.655602
             |
         imd |
          4  |   1.106904   .2699487     0.42   0.677     .6863113    1.785248
5 most de..  |   1.620726   .5401313     1.45   0.147     .8434007    3.114478
             |
tot_adults~h |
          2  |   .0697894   .0589446    -3.15   0.002     .0133309    .3653589
          3  |   .0450875    .027744    -5.04   0.000     .0134984    .1506022
             |
   ethnicity |
Asian or ..  |   .6522505   .2174663    -1.28   0.200     .3393252    1.253755
      Other  |   .9857969   .4465415    -0.03   0.975     .4057087    2.395304
             |
1.htdiag_o~p |   .6942201   .1594935    -1.59   0.112     .4425252    1.089071
1.~y_disease |   1.134443     .24225     0.59   0.555     .7464765    1.724047
    1.asthma |    .828936   .3068357    -0.51   0.612     .4012764    1.712373
1.~c_disease |   .9880894   .2547304    -0.05   0.963     .5961501    1.637709
             |
     diabcat |
T1DM, con..  |   1.054167   .4858052     0.11   0.909     .4272081    2.601234
T1DM, unc..  |   1.457507   1.354703     0.41   0.685      .235748    9.011007
T2DM, con..  |   1.565755   .3852952     1.82   0.068     .9666364    2.536205
T2DM, unc..  |   2.90e-15   2.01e-15   -48.26   0.000     7.44e-16    1.13e-14
             |
cancer_exh~t |
2-5 years..  |   1.242851   .7129101     0.38   0.705     .4037967    3.825389
   5+ years  |   .8315919   .2058565    -0.74   0.456     .5119169    1.350893
             |
cancer_hae~t |
2-5 years..  |   5.17e-15   6.34e-15   -26.86   0.000     4.69e-16    5.71e-14
   5+ years  |    1.47087   .3216561     1.76   0.078     .9581423    2.257973
             |
1.~r_disease |   .9644871   .2188184    -0.16   0.873     .6182722    1.504572
1.stroke_d~a |   .8748229   .2182526    -0.54   0.592     .5364887    1.426526
1.other_ne~o |     1.5988   .3608277     2.08   0.038     1.027281    2.488278
             |
reduced_ki~t |
Stage 3a/..  |   1.118481   .5108133     0.25   0.806     .4569642    2.737629
      1.esrd |   .7159371   .1215538    -1.97   0.049     .5132814     .998606
1.other_tr~t |   1.263697   .2543623     1.16   0.245     .8517449    1.874893
  1.asplenia |   .8481818   .1938657    -0.72   0.471     .5419173    1.327532
1.ra_sle_p~s |   .7651383   .1826149    -1.12   0.262     .4792746    1.221506
1.other_im~o |   .9846692   .2099876    -0.07   0.942     .6482846    1.495599
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYA
> DJMODEL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYADJMODEL
> _ageband_0_timeperiod2.ster saved
(11,234 observations (episodes) created)
(cat_time: 11234 changes made)
(covid_icu: 11234 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       58.76       58.76
          1 |      8,043       29.53       88.29
          2 |      3,191       11.71      100.00
------------+-----------------------------------
      Total |     27,239      100.00

           |   Failure/censoring
           |     indicator for
observatio |  outcome: covid icu
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,122      6,883 |    16,005 
         1 |     4,072      3,971 |     8,043 
         2 |     1,627      1,564 |     3,191 
-----------+----------------------+----------
     Total |    14,821     12,418 |    27,239 
(27,241 observations deleted)
   1:      0.00 /        1 =       0.0040
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_icu)
   1:      0.01 /        1 =       0.0050
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_icu)
(3,259 observations (episodes) created)
(cat_time: 3259 changes made)
(covid_icu: 3259 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       58.56       58.56
          1 |      2,314       29.43       87.98
          2 |        945       12.02      100.00
------------+-----------------------------------
      Total |      7,864      100.00

           |   Failure/censoring
           |     indicator for
observatio |  outcome: covid icu
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,609      1,996 |     4,605 
         1 |     1,199      1,115 |     2,314 
         2 |       468        477 |       945 
-----------+----------------------+----------
     Total |     4,276      3,588 |     7,864 
(3,259 observations deleted)
   1:      1.85 /        1 =       1.8490

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,605             Number of obs    =       4,605
No. of failures      =        1,996
Time at risk         =       266199
                                                Wald chi2(42)    =       40.62
Log pseudolikelihood =   -11622.705             Prob > chi2      =      0.5317

                         (Std. Err. adjusted for 928 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.092883   .2003313     0.48   0.628     .7630342    1.565321
 only 12-18  |   1.228354    .259388     0.97   0.330     .8120411    1.858101
      mixed  |    1.10437   .1943857     0.56   0.573     .7821505    1.559333
             |
        age1 |   1.009936   .0199709     0.50   0.617     .9715422    1.049846
        age2 |   .9326821   .0950475    -0.68   0.494     .7638174    1.138879
        age3 |   1.150904   .2311508     0.70   0.484     .7763926     1.70607
      1.male |   1.033843   .0454314     0.76   0.449     .9485262    1.126834
             |
   obese4cat |
Obese I ..)  |   1.075122    .068768     1.13   0.257     .9484459    1.218718
Obese II..)  |   .9823931   .0746764    -0.23   0.815     .8464112    1.140221
Obese II..)  |    1.01326   .0932237     0.14   0.886     .8460719    1.213486
             |
smoke_nomiss |
     Former  |   1.064795   .1635711     0.41   0.683     .7879649    1.438883
    Current  |   1.060057   .0742869     0.83   0.405     .9240137    1.216129
             |
         imd |
          4  |   .9919897   .0576744    -0.14   0.890     .8851527    1.111722
5 most de..  |   .9394429   .0720458    -0.81   0.415     .8083358    1.091815
             |
tot_adults~h |
          2  |   .7915218   .2589035    -0.71   0.475     .4169062    1.502752
          3  |   .5950734   .1784793    -1.73   0.084     .3305759    1.071198
             |
   ethnicity |
Asian or ..  |   1.051703   .0809577     0.65   0.513     .9044186    1.222972
      Other  |   1.016753   .0716369     0.24   0.814      .885611    1.167316
             |
1.htdiag_o~p |   1.017111    .088304     0.20   0.845     .8579626    1.205781
1.~y_disease |   1.047085   .0577659     0.83   0.404     .9397721    1.166652
    1.asthma |   .8480133   .0730039    -1.92   0.055     .7163484    1.003878
1.~c_disease |     .92667   .0545316    -1.29   0.196     .8257233    1.039958
             |
     diabcat |
T1DM, con..  |   .8562744   .1393316    -0.95   0.340     .6224534    1.177929
T1DM, unc..  |   .7464211   .2371131    -0.92   0.357     .4004844    1.391176
T2DM, con..  |   1.010805   .0592206     0.18   0.854     .9011507    1.133802
T2DM, unc..  |    1.08173   .1337753     0.64   0.525     .8488925    1.378432
Diabetes,..  |   1.157386   .7750671     0.22   0.827     .3114973    4.300338
             |
cancer_exh~t |
  Last year  |   .1904303   .1351647    -2.34   0.019     .0473768    .7654324
2-5 years..  |   .8240439   .1565842    -1.02   0.308     .5678134      1.1959
   5+ years  |   .9808714    .058242    -0.33   0.745     .8731112    1.101931
             |
cancer_hae~t |
  Last year  |   1.220799   .3489912     0.70   0.485     .6971239    2.137854
2-5 years..  |   .6798509   .1388059    -1.89   0.059     .4556412    1.014389
   5+ years  |   .9179588   .0556909    -1.41   0.158     .8150464    1.033866
             |
1.~r_disease |   1.024976   .0580491     0.44   0.663     .9172889    1.145305
1.stroke_d~a |   1.000731   .0540557     0.01   0.989     .9001989    1.112489
1.other_ne~o |   1.002311   .0553179     0.04   0.967     .8995481    1.116813
             |
reduced_ki~t |
Stage 3a/..  |   1.079219   .1115359     0.74   0.461     .8813306    1.321539
      1.esrd |   1.135648   .0529838     2.73   0.006     1.036408     1.24439
1.other_tr~t |   .9993635    .055238    -0.01   0.991     .8967572     1.11371
  1.asplenia |   .9835422    .056378    -0.29   0.772     .8790244    1.100487
1.ra_sle_p~s |   1.024012   .0568581     0.43   0.669     .9184216    1.141742
1.other_im~o |   .9449995   .0551876    -0.97   0.333     .8427946    1.059599
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMOD
> EL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMODEL_ageb
> and_1_timeperiod0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.01388         0.49        1         0.4841
      2.kids_cat4 |      0.02291         1.18        1         0.2777
      3.kids_cat4 |      0.02042         1.11        1         0.2915
      age1        |     -0.03744         3.22        1         0.0727
      age2        |      0.03003         1.98        1         0.1599
      age3        |     -0.02887         1.80        1         0.1794
      0b.male     |            .            .        1             .
      1.male      |      0.00465         0.04        1         0.8322
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.01899         0.76        1         0.3845
      3.obese4cat |      0.00227         0.01        1         0.9205
      4.obese4cat |      0.01762         0.66        1         0.4152
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01952         0.85        1         0.3573
      3.smoke_no~s|      0.01998         0.88        1         0.3481
      1b.imd      |            .            .        1             .
      4.imd       |     -0.00548         0.07        1         0.7973
      5.imd       |      0.00321         0.02        1         0.8841
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.04389         3.95        1         0.0470
      3.tot_adul~h|      0.01984         0.90        1         0.3430
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.01677         0.69        1         0.4048
      5.ethnicity |     -0.00754         0.11        1         0.7347
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.01262         0.37        1         0.5430
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.00381         0.03        1         0.8604
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.01125         0.28        1         0.5963
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00854         0.16        1         0.6885
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02036         0.89        1         0.3459
      3.diabcat   |     -0.01034         0.24        1         0.6223
      4.diabcat   |     -0.00982         0.20        1         0.6513
      5.diabcat   |     -0.02272         1.20        1         0.2730
      6.diabcat   |     -0.00345         0.02        1         0.8799
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.00253         0.01        1         0.9083
      3.cancer_e~t|     -0.00315         0.02        1         0.8781
      4.cancer_e~t|     -0.01556         0.53        1         0.4682
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.02405         1.41        1         0.2356
      3.cancer_h~t|     -0.00019         0.00        1         0.9928
      4.cancer_h~t|     -0.05764         7.19        1         0.0073
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.01629         0.57        1         0.4497
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.02803         1.55        1         0.2128
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.01262         0.35        1         0.5560
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.04438         3.86        1         0.0493
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.01805         0.70        1         0.4015
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.00952         0.19        1         0.6669
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00222         0.01        1         0.9182
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.00192         0.01        1         0.9279
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.00665         0.10        1         0.7517
      ------------+---------------------------------------------------
      global test |                     33.65       42         0.8175
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      3.22 /        1 =       3.2230
   1:      0.65 /        1 =       0.6490

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          455             Number of obs    =         455
No. of failures      =          195
Time at risk         =        26141
                                                Wald chi2(41)    =    12100.42
Log pseudolikelihood =   -669.41072             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 152 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .8931514   .2368743    -0.43   0.670     .5311001    1.502013
3 childre..  |   .9339699   .1909817    -0.33   0.738     .6255701    1.394408
4+ childr..  |   .9680268   .2064375    -0.15   0.879     .6373288    1.470318
             |
        age1 |   .9709873   .0648062    -0.44   0.659     .8519266    1.106687
        age2 |   1.215675    .438708     0.54   0.588     .5992935    2.466015
        age3 |   .6936647   .4976024    -0.51   0.610     .1700348    2.829837
      1.male |   .9977601   .1490309    -0.02   0.988     .7445365    1.337107
             |
   obese4cat |
Obese I ..)  |   1.039254   .2190307     0.18   0.855     .6875823    1.570793
Obese II..)  |   1.073001   .2457912     0.31   0.758     .6848832    1.681063
Obese II..)  |   1.263236   .3617788     0.82   0.415      .720624    2.214423
             |
smoke_nomiss |
     Former  |   1.566373   .8890231     0.79   0.429     .5149683    4.764418
    Current  |   1.027232   .2609264     0.11   0.916     .6243891     1.68998
             |
         imd |
          4  |   1.229354   .2285373     1.11   0.267     .8539617    1.769765
5 most de..  |   .8371449   .2283194    -0.65   0.515     .4905096    1.428742
             |
tot_adults~h |
          2  |   4.38e+08          .        .       .            .           .
          3  |   2.34e+08   9.56e+07    47.18   0.000     1.05e+08    5.21e+08
             |
   ethnicity |
Asian or ..  |   1.531931   .3406898     1.92   0.055     .9906917    2.368863
      Other  |   1.313149   .3511427     1.02   0.308     .7774966    2.217837
             |
1.htdiag_o~p |   2.115069   .9091059     1.74   0.081     .9108739    4.911236
1.~y_disease |   1.295979   .2574105     1.31   0.192     .8780718    1.912783
    1.asthma |   .5587633   .1717846    -1.89   0.058       .30587    1.020749
1.~c_disease |    .880797   .1791416    -0.62   0.533      .591226    1.312194
             |
     diabcat |
T1DM, con..  |   1.371261   .7518349     0.58   0.565     .4681911    4.016214
T1DM, unc..  |   1.411093   1.077066     0.45   0.652     .3161158    6.298903
T2DM, con..  |   .8373794   .1809903    -0.82   0.412     .5482068    1.279087
T2DM, unc..  |   1.196022   .5477071     0.39   0.696     .4874605    2.934533
Diabetes,..  |   1.858332   1.988086     0.58   0.562     .2282911    15.12718
             |
cancer_exh~t |
  Last year  |   2.93e-16   2.48e-16   -42.29   0.000     5.59e-17    1.54e-15
2-5 years..  |    1.08737   .6090309     0.15   0.881      .362763    3.259353
   5+ years  |   .8063383   .1740728    -1.00   0.319     .5281525    1.231049
             |
cancer_hae~t |
  Last year  |   1.13e-16   1.05e-16   -39.40   0.000     1.82e-17    7.01e-16
2-5 years..  |   .6244024   .5045034    -0.58   0.560     .1281482    3.042403
   5+ years  |   .9032337   .2123876    -0.43   0.665     .5697017    1.432032
             |
1.~r_disease |   .9576474   .2027175    -0.20   0.838     .6324423    1.450075
1.stroke_d~a |   .9343751   .1472912    -0.43   0.667      .686027    1.272628
1.other_ne~o |   1.210154   .2181825     1.06   0.290     .8499133    1.723084
             |
reduced_ki~t |
Stage 3a/..  |    .717031   .2673002    -0.89   0.372     .3453191    1.488865
      1.esrd |    1.55601    .239819     2.87   0.004     1.150328    2.104763
1.other_tr~t |   1.092823   .1933047     0.50   0.616     .7726534    1.545665
  1.asplenia |   1.159197   .2154553     0.79   0.427     .8052816    1.668655
1.ra_sle_p~s |   .8446586   .1769239    -0.81   0.420     .5602564    1.273431
1.other_im~o |   1.026177   .2101515     0.13   0.900     .6869165    1.532994
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYA
> DJMODEL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYADJMODEL
> _ageband_1_timeperiod0.ster saved
(3,259 observations (episodes) created)
(cat_time: 3259 changes made)
(covid_icu: 3259 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       58.56       58.56
          1 |      2,314       29.43       87.98
          2 |        945       12.02      100.00
------------+-----------------------------------
      Total |      7,864      100.00

           |   Failure/censoring
           |     indicator for
observatio |  outcome: covid icu
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,609      1,996 |     4,605 
         1 |     1,199      1,115 |     2,314 
         2 |       468        477 |       945 
-----------+----------------------+----------
     Total |     4,276      3,588 |     7,864 
(5,550 observations deleted)
   1:      0.90 /        1 =       0.8950

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,314             Number of obs    =       2,314
No. of failures      =        1,115
Time at risk         =       110238
                                                Wald chi2(42)    =       47.10
Log pseudolikelihood =   -5638.0931             Prob > chi2      =      0.2717

                         (Std. Err. adjusted for 775 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8814741   .1818645    -0.61   0.541     .5882892    1.320773
 only 12-18  |   1.153391   .3087323     0.53   0.594     .6825469     1.94904
      mixed  |   .9842801    .181853    -0.09   0.932     .6852561    1.413789
             |
        age1 |   .9946745   .0270654    -0.20   0.844      .943017    1.049162
        age2 |   1.104669   .1578167     0.70   0.486     .8348852    1.461631
        age3 |   .7835774   .2221203    -0.86   0.390     .4495647    1.365751
      1.male |   .9847465   .0601301    -0.25   0.801     .8736728    1.109941
             |
   obese4cat |
Obese I ..)  |   1.010386   .0978351     0.11   0.915     .8357298    1.221543
Obese II..)  |   1.000241   .1049819     0.00   0.998     .8142643    1.228694
Obese II..)  |   .9025144   .1110643    -0.83   0.405     .7090951    1.148692
             |
smoke_nomiss |
     Former  |   1.320764   .2727177     1.35   0.178     .8811805    1.979636
    Current  |   1.148067   .1097272     1.44   0.149     .9519476     1.38459
             |
         imd |
          4  |    .935001   .0755207    -0.83   0.405     .7981047    1.095379
5 most de..  |   .9002361   .0971428    -0.97   0.330     .7286263    1.112264
             |
tot_adults~h |
          2  |   2.568114   1.354432     1.79   0.074     .9134562    7.220059
          3  |   1.262065   .6032464     0.49   0.626     .4945627    3.220639
             |
   ethnicity |
Asian or ..  |   1.127973   .1108699     1.23   0.221     .9303217    1.367617
      Other  |   1.188122    .112521     1.82   0.069     .9868432    1.430455
             |
1.htdiag_o~p |   .9539515   .1056155    -0.43   0.670     .7678681     1.18513
1.~y_disease |   1.021272   .0773476     0.28   0.781     .8803888      1.1847
    1.asthma |   1.004103   .1131911     0.04   0.971     .8050516    1.252372
1.~c_disease |   1.082626   .0796364     1.08   0.280     .9372716    1.250523
             |
     diabcat |
T1DM, con..  |   .8047115   .1640377    -1.07   0.286     .5396668    1.199927
T1DM, unc..  |   .8767967   .2709071    -0.43   0.670       .47852    1.606563
T2DM, con..  |   .8372046   .0664144    -2.24   0.025     .7166495    .9780395
T2DM, unc..  |   1.179129   .1784487     1.09   0.276     .8764777    1.586287
Diabetes,..  |   .7504242   .7940673    -0.27   0.786     .0943194    5.970525
             |
cancer_exh~t |
  Last year  |   1.361804   .3823274     1.10   0.271      .785487    2.360967
2-5 years..  |   1.050908   .1949985     0.27   0.789     .7305029    1.511844
   5+ years  |   .9145475   .0696857    -1.17   0.241     .7876756    1.061855
             |
cancer_hae~t |
  Last year  |   1.274837   .3910712     0.79   0.429     .6987767    2.325791
2-5 years..  |   1.073241   .2380503     0.32   0.750     .6948582     1.65767
   5+ years  |   .9702624   .0759991    -0.39   0.700     .8321774     1.13126
             |
1.~r_disease |   .9422267   .0777606    -0.72   0.471     .8015063    1.107653
1.stroke_d~a |   .9908687   .0752525    -0.12   0.904     .8538288    1.149904
1.other_ne~o |   .9718864   .0705886    -0.39   0.695     .8429315    1.120569
             |
reduced_ki~t |
Stage 3a/..  |   1.031221   .1683698     0.19   0.851     .7488139    1.420134
      1.esrd |   1.046012   .0654217     0.72   0.472     .9253353    1.182426
1.other_tr~t |   1.025453   .0833522     0.31   0.757     .8744347    1.202553
  1.asplenia |   1.049549   .0836506     0.61   0.544     .8977605       1.227
1.ra_sle_p~s |   .8833683   .0733761    -1.49   0.135     .7506503    1.039551
1.other_im~o |   .9729574   .0767361    -0.35   0.728     .8336053    1.135605
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMOD
> EL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMODEL_ageb
> and_1_timeperiod1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.01481         0.25        1         0.6175
      2.kids_cat4 |      0.01187         0.15        1         0.6978
      3.kids_cat4 |     -0.00364         0.01        1         0.9062
      age1        |      0.01343         0.21        1         0.6431
      age2        |     -0.00294         0.01        1         0.9187
      age3        |     -0.00127         0.00        1         0.9647
      0b.male     |            .            .        1             .
      1.male      |     -0.02611         0.82        1         0.3665
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.06168         5.12        1         0.0236
      3.obese4cat |     -0.03355         1.41        1         0.2352
      4.obese4cat |      0.00200         0.00        1         0.9463
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.03731         1.85        1         0.1734
      3.smoke_no~s|      0.00966         0.12        1         0.7338
      1b.imd      |            .            .        1             .
      4.imd       |     -0.02823         1.06        1         0.3037
      5.imd       |     -0.05077         3.33        1         0.0680
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.02751         0.88        1         0.3473
      3.tot_adul~h|     -0.02157         0.59        1         0.4427
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.04738         2.83        1         0.0923
      5.ethnicity |     -0.02800         0.95        1         0.3286
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.00229         0.01        1         0.9362
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.02888         1.02        1         0.3113
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.00397         0.02        1         0.8858
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.04134         2.05        1         0.1522
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.04483         2.22        1         0.1364
      3.diabcat   |      0.03507         1.22        1         0.2701
      4.diabcat   |      0.06679         4.97        1         0.0257
      5.diabcat   |      0.02891         1.05        1         0.3053
      6.diabcat   |      0.02117         0.62        1         0.4324
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.03975         1.46        1         0.2270
      3.cancer_e~t|      0.02544         0.65        1         0.4218
      4.cancer_e~t|     -0.00928         0.10        1         0.7490
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.05493         2.76        1         0.0966
      3.cancer_h~t|      0.01083         0.15        1         0.7001
      4.cancer_h~t|      0.02213         0.59        1         0.4436
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.05025         3.35        1         0.0671
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.00728         0.06        1         0.8015
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.04517         2.44        1         0.1179
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.04105         2.16        1         0.1418
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.01335         0.23        1         0.6335
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.04076         2.31        1         0.1286
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.01952         0.54        1         0.4623
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.04884         3.51        1         0.0611
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.03876         1.96        1         0.1610
      ------------+---------------------------------------------------
      global test |                     48.79       42         0.2188
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      1.17 /        1 =       1.1740
   1:      0.33 /        1 =       0.3330

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          225             Number of obs    =         225
No. of failures      =           99
Time at risk         =        10690
                                                Wald chi2(41)    =       97.98
Log pseudolikelihood =   -245.83335             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 112 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .3313638   .1729205    -2.12   0.034     .1191544    .9215103
3 childre..  |    .471355   .1534195    -2.31   0.021     .2490542     .892077
4+ childr..  |   .7195519   .2332003    -1.02   0.310     .3812373    1.358091
             |
        age1 |    .744642    .075904    -2.89   0.004     .6097918    .9093132
        age2 |   4.295231   2.468751     2.54   0.011     1.392339    13.25037
        age3 |   .0661933   .0771766    -2.33   0.020     .0067356    .6505081
      1.male |   .9498878   .2517972    -0.19   0.846     .5649824    1.597017
             |
   obese4cat |
Obese I ..)  |   .7839058   .3576192    -0.53   0.594     .3205858     1.91683
Obese II..)  |   .8161795   .3116858    -0.53   0.595     .3861228    1.725226
Obese II..)  |   1.922637   1.058953     1.19   0.235     .6532372    5.658789
             |
smoke_nomiss |
     Former  |   2.277311   1.068296     1.75   0.079     .9080714    5.711164
    Current  |   .6186893   .3813013    -0.78   0.436     .1848727    2.070486
             |
         imd |
          4  |   1.065803     .40618     0.17   0.867     .5049893    2.249426
5 most de..  |   1.569524   .5394742     1.31   0.190     .8001925    3.078517
             |
tot_adults~h |
          2  |   .5713137   1.103052    -0.29   0.772     .0129848    25.13703
          3  |    1.09956   .8235926     0.13   0.899     .2533098    4.772941
             |
   ethnicity |
Asian or ..  |   .7965041   .3200518    -0.57   0.571     .3623745    1.750727
      Other  |   .5881351   .2647763    -1.18   0.238     .2433712    1.421297
             |
1.htdiag_o~p |   .4958459   .2407127    -1.45   0.148     .1914801    1.284014
1.~y_disease |   .9254484   .2882714    -0.25   0.804     .5025835    1.704104
    1.asthma |   2.141102    .996356     1.64   0.102     .8600681    5.330178
1.~c_disease |   .8283037    .251496    -0.62   0.535     .4568159     1.50189
             |
     diabcat |
T1DM, con..  |   3.32e-20          .        .       .            .           .
T1DM, unc..  |      2.809   1.696606     1.71   0.087     .8598744    9.176318
T2DM, con..  |   1.384748   .3525527     1.28   0.201     .8407318    2.280784
T2DM, unc..  |   .8221998   .5695429    -0.28   0.777     .2115168    3.196024
Diabetes,..  |   32.51949   30.92633     3.66   0.000     5.042473     209.722
             |
cancer_exh~t |
  Last year  |   13.49015   11.05578     3.17   0.001     2.706572    67.23791
2-5 years..  |   4.831216   2.405713     3.16   0.002     1.820535    12.82076
   5+ years  |   .7891308   .2632645    -0.71   0.478     .4103712    1.517474
             |
cancer_hae~t |
  Last year  |   1.603036   2.374766     0.32   0.750     .0878938    29.23669
2-5 years..  |   3.058759   2.068438     1.65   0.098     .8127062    11.51217
   5+ years  |   2.346736   1.192675     1.68   0.093     .8666831    6.354304
             |
1.~r_disease |   .9869622   .3083124    -0.04   0.966     .5350542    1.820553
1.stroke_d~a |   1.626395    .464289     1.70   0.088     .9294641      2.8459
1.other_ne~o |   .5332361   .1732685    -1.94   0.053     .2820538    1.008108
             |
reduced_ki~t |
Stage 3a/..  |   .9352716   .5977045    -0.10   0.917      .267276    3.272771
      1.esrd |   1.784493   .4508243     2.29   0.022     1.087607    2.927909
1.other_tr~t |   2.200007   .7400445     2.34   0.019     1.137875     4.25357
  1.asplenia |   .9956803   .3197964    -0.01   0.989     .5305518    1.868582
1.ra_sle_p~s |    .505905   .1533673    -2.25   0.025     .2792695     .916462
1.other_im~o |   1.180876    .377813     0.52   0.603     .6307664    2.210754
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYA
> DJMODEL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYADJMODEL
> _ageband_1_timeperiod1.ster saved
(3,259 observations (episodes) created)
(cat_time: 3259 changes made)
(covid_icu: 3259 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       58.56       58.56
          1 |      2,314       29.43       87.98
          2 |        945       12.02      100.00
------------+-----------------------------------
      Total |      7,864      100.00

           |   Failure/censoring
           |     indicator for
observatio |  outcome: covid icu
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,609      1,996 |     4,605 
         1 |     1,199      1,115 |     2,314 
         2 |       468        477 |       945 
-----------+----------------------+----------
     Total |     4,276      3,588 |     7,864 
(6,919 observations deleted)
   1:      0.62 /        1 =       0.6190

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          945             Number of obs    =         945
No. of failures      =          477
Time at risk         =        34352
                                                Wald chi2(42)    =       94.82
Log pseudolikelihood =   -1923.9486             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 539 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.009964   .7444609     1.88   0.059      .972559    4.153945
 only 12-18  |   2.090454   1.066774     1.44   0.148     .7688931    5.683491
      mixed  |   2.222505   .7921813     2.24   0.025     1.105208    4.469324
             |
        age1 |   .9744522   .0440319    -0.57   0.567     .8918625     1.06469
        age2 |   1.281665   .2902163     1.10   0.273     .8223016    1.997644
        age3 |   .5965599   .2637323    -1.17   0.243     .2508116    1.418928
      1.male |    .990708   .0960111    -0.10   0.923     .8193216    1.197945
             |
   obese4cat |
Obese I ..)  |   1.037158   .1528667     0.25   0.804     .7769382    1.384534
Obese II..)  |   1.166523   .1743922     1.03   0.303     .8702438    1.563673
Obese II..)  |   1.160282   .2088171     0.83   0.409     .8154027    1.651031
             |
smoke_nomiss |
     Former  |   1.762634   .5064081     1.97   0.049     1.003714     3.09538
    Current  |   1.144224   .1726407     0.89   0.372     .8512979    1.537944
             |
         imd |
          4  |   .8863096   .1069145    -1.00   0.317     .6996906    1.122703
5 most de..  |   1.234124   .1779925     1.46   0.145     .9302371    1.637284
             |
tot_adults~h |
          2  |   .6388242   .5613667    -0.51   0.610     .1141269    3.575811
          3  |   .1716928   .1242683    -2.43   0.015     .0415592    .7093118
             |
   ethnicity |
Asian or ..  |     1.3271   .1988915     1.89   0.059     .9893156    1.780216
      Other  |   1.138309   .1889252     0.78   0.435     .8222163    1.575919
             |
1.htdiag_o~p |   .9828991   .1668006    -0.10   0.919     .7047868    1.370756
1.~y_disease |   .9097149   .1137499    -0.76   0.449     .7119867    1.162355
    1.asthma |   .7605149   .1350445    -1.54   0.123     .5369824    1.077098
1.~c_disease |   1.054755   .1363976     0.41   0.680       .81861    1.359022
             |
     diabcat |
T1DM, con..  |   1.585376   .4125153     1.77   0.077     .9520269    2.640068
T1DM, unc..  |    1.17105    .430102     0.43   0.667     .5700951    2.405492
T2DM, con..  |   .9976328    .119782    -0.02   0.984     .7884427    1.262325
T2DM, unc..  |   .8462836    .261499    -0.54   0.589     .4618461    1.550724
Diabetes,..  |   16.07357   9.628859     4.64   0.000     4.968217    52.00247
             |
cancer_exh~t |
  Last year  |   2.032976   1.003407     1.44   0.151     .7726958    5.348796
2-5 years..  |   1.967875   .5250407     2.54   0.011     1.166519    3.319732
   5+ years  |   1.029337   .1254498     0.24   0.812      .810621    1.307065
             |
cancer_hae~t |
  Last year  |   .3913468   .3722952    -0.99   0.324     .0606455     2.52537
2-5 years..  |   1.417198   .3664094     1.35   0.177      .853801    2.352363
   5+ years  |   1.054576   .1301598     0.43   0.667     .8279787    1.343187
             |
1.~r_disease |   1.039773   .1194526     0.34   0.734     .8301372    1.302349
1.stroke_d~a |    .864437   .1021297    -1.23   0.218     .6857524    1.089681
1.other_ne~o |   1.103476   .1345378     0.81   0.419     .8689263    1.401338
             |
reduced_ki~t |
Stage 3a/..  |   1.016892   .2720313     0.06   0.950     .6019598    1.717836
      1.esrd |   .9194289   .0974463    -0.79   0.428     .7469697    1.131705
1.other_tr~t |   .9993127   .1209506    -0.01   0.995     .7882741    1.266851
  1.asplenia |   1.022215   .1187364     0.19   0.850     .8140855    1.283555
1.ra_sle_p~s |   .9485942   .1141503    -0.44   0.661     .7492902    1.200911
1.other_im~o |   1.001532   .1274597     0.01   0.990     .7804351    1.285265
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMOD
> EL_ageband_1_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_kids_cat4_FULLYADJMODEL_ageb
> and_1_timeperiod2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.00142         0.00        1         0.9783
      2.kids_cat4 |      0.00095         0.00        1         0.9839
      3.kids_cat4 |     -0.01357         0.07        1         0.7979
      age1        |      0.02989         0.57        1         0.4519
      age2        |     -0.02179         0.28        1         0.5940
      age3        |      0.01868         0.21        1         0.6504
      0b.male     |            .            .        1             .
      1.male      |      0.00720         0.03        1         0.8617
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.04913         1.39        1         0.2385
      3.obese4cat |     -0.08875         4.19        1         0.0407
      4.obese4cat |     -0.03613         0.73        1         0.3937
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.00648         0.02        1         0.8806
      3.smoke_no~s|      0.08206         3.55        1         0.0597
      1b.imd      |            .            .        1             .
      4.imd       |      0.00726         0.03        1         0.8590
      5.imd       |      0.04173         1.02        1         0.3116
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.05672         1.99        1         0.1585
      3.tot_adul~h|      0.03474         0.79        1         0.3753
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.03262         0.59        1         0.4425
      5.ethnicity |     -0.05507         1.91        1         0.1673
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.02959         0.48        1         0.4867
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01381         0.11        1         0.7422
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.07381         3.12        1         0.0775
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.06558         2.87        1         0.0901
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.06443         2.12        1         0.1452
      3.diabcat   |      0.06340         1.12        1         0.2897
      4.diabcat   |     -0.01790         0.18        1         0.6716
      5.diabcat   |      0.00063         0.00        1         0.9877
      6.diabcat   |      0.01119         0.03        1         0.8630
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.03494         0.62        1         0.4294
      3.cancer_e~t|      0.03650         0.56        1         0.4559
      4.cancer_e~t|      0.02475         0.37        1         0.5418
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.05596         1.44        1         0.2297
      3.cancer_h~t|      0.07397         2.16        1         0.1417
      4.cancer_h~t|      0.03720         0.81        1         0.3675
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.00548         0.02        1         0.8965
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.03226         0.51        1         0.4746
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.05318         1.71        1         0.1915
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.09141         5.71        1         0.0169
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.03889         0.85        1         0.3569
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.04047         0.95        1         0.3306
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.00855         0.04        1         0.8431
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.01461         0.11        1         0.7374
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.07980         4.86        1         0.0274
      ------------+---------------------------------------------------
      global test |                     40.63       42         0.5312
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      0.39 /        1 =       0.3940
   1:      0.15 /        1 =       0.1530

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects      =           96             Number of obs    =          96
No. of failures      =           48
Time at risk         =         3579
                                                Wald chi2(36)    =      194.20
Log pseudolikelihood =    -62.81704             Prob > chi2      =      0.0000

                          (Std. Err. adjusted for 71 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |    3.98726   3.909041     1.41   0.158     .5836751    27.23816
3 childre..  |   .7851368   .6353962    -0.30   0.765     .1607253    3.835363
4+ childr..  |   1.328734   .9570316     0.39   0.693     .3238568    5.451588
             |
        age1 |   .5781482   .1897988    -1.67   0.095     .3038089    1.100216
        age2 |   10.09666   16.62594     1.40   0.160      .400427    254.5846
        age3 |   .0171034   .0535594    -1.30   0.194     .0000369    7.918052
      1.male |   2.526428   1.779608     1.32   0.188     .6352183    10.04826
             |
   obese4cat |
Obese I ..)  |   .5791681   .6318805    -0.50   0.617     .0682546    4.914479
Obese II..)  |    1.43535   1.044248     0.50   0.619     .3448976    5.973449
Obese II..)  |   .4950242    .704394    -0.49   0.621     .0304376    8.050861
             |
smoke_nomiss |
    Current  |   .2731071    .181039    -1.96   0.050     .0744874    1.001343
             |
         imd |
          4  |   3.163325    4.11328     0.89   0.376      .247357    40.45418
5 most de..  |   .8941971   .8091747    -0.12   0.902      .151763    5.268665
             |
3.tot_adul~h |   25.80423   57.18001     1.47   0.142     .3353513    1985.555
             |
   ethnicity |
Asian or ..  |   .1719992   .1937793    -1.56   0.118     .0189033    1.565002
      Other  |   18.82623    18.5153     2.98   0.003     2.739176    129.3917
             |
1.htdiag_o~p |   1.290738   1.059878     0.31   0.756     .2581553    6.453494
1.~y_disease |   1.192428   .8378092     0.25   0.802     .3008646    4.725992
    1.asthma |   .4034999   .5442996    -0.67   0.501     .0286826    5.676341
1.~c_disease |   1.113612     .70216     0.17   0.864     .3236161    3.832107
             |
     diabcat |
T1DM, con..  |    .100345   .1536616    -1.50   0.133     .0049891    2.018223
T1DM, unc..  |   38.43633   101.7626     1.38   0.168     .2143538    6892.117
T2DM, con..  |   1.227726   .9052688     0.28   0.781     .2893772    5.208809
T2DM, unc..  |   1.258183   1.931784     0.15   0.881     .0620625    25.50695
             |
cancer_exh~t |
   5+ years  |   .4326906   .2230192    -1.63   0.104     .1575606    1.188248
             |
cancer_hae~t |
  Last year  |   1.34e-17          .        .       .            .           .
2-5 years..  |   12.51295   15.62296     2.02   0.043     1.082923    144.5845
   5+ years  |   3.008399   2.507821     1.32   0.186      .587176    15.41355
             |
1.~r_disease |   .9305881   .7941146    -0.08   0.933     .1747379    4.955961
1.stroke_d~a |   .2392443   .1958813    -1.75   0.081     .0480751    1.190592
1.other_ne~o |   .3763494   .3273126    -1.12   0.261     .0684381    2.069592
             |
reduced_ki~t |
Stage 3a/..  |    6.85231    9.02872     1.46   0.144       .51794    90.65559
      1.esrd |   .1853142   .2305712    -1.35   0.175     .0161744    2.123189
1.other_tr~t |   1.028979   .7955096     0.04   0.971     .2261192    4.682474
  1.asplenia |    7.40185   6.023801     2.46   0.014     1.501801    36.48113
1.ra_sle_p~s |   1.111413   .8241701     0.14   0.887      .259816    4.754286
1.other_im~o |   .3377351   .4147141    -0.88   0.377     .0304342    3.747916
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYA
> DJMODEL_ageband_1_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_icu_gp_number_kids_FULLYADJMODEL
> _ageband_1_timeperiod2.ster saved
(3,259 observations (episodes) created)
(cat_time: 3259 changes made)
(covid_icu: 3259 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       58.56       58.56
          1 |      2,314       29.43       87.98
          2 |        945       12.02      100.00
------------+-----------------------------------
      Total |      7,864      100.00

           |   Failure/censoring
           |     indicator for
observatio |  outcome: covid icu
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,609      1,996 |     4,605 
         1 |     1,199      1,115 |     2,314 
         2 |       468        477 |       945 
-----------+----------------------+----------
     Total |     4,276      3,588 |     7,864 
(7,864 observations deleted)
   1:      0.01 /        1 =       0.0060
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_icu)
   1:      0.00 /        1 =       0.0040
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_icu)

. /*SENSITIVITY ANALYSIS: 12 months FUP
> keep if has_12_m_follow_up == 1
> foreach exposure_type in kids_cat4   {
> 
> *Age spline model (not adj ethnicity)
> cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'
> basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
> if _rc==0{
> estimates
> estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x', replace
> *estat concordance /*c-statistic*/
> }
> else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome
> ')"
> }       
> }
> */
. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_icu.log
  log type:  text
 closed on:  25 Jul 2021, 08:14:53
-------------------------------------------------------------------------------
