-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission.log
  log type:  text
 opened on:  28 Oct 2021, 11:29:47

. 
. 
. *****************************************************************************
> ********
. 
. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 19. 
. *Age spline model (not adj ethnicity)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id)
 20. if _rc==0{
 21. estimates
 22. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 23.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 24. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 25. 
. }
 26. drop cat_time
 27. }
 28. }
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -6966.0636
Iteration 1:   log pseudolikelihood = -6951.0661
Iteration 2:   log pseudolikelihood = -6950.6559
Iteration 3:   log pseudolikelihood = -6950.6544
Iteration 4:   log pseudolikelihood = -6950.6544
Refining estimates:
Iteration 0:   log pseudolikelihood = -6950.6544

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,065             Number of obs    =      16,065
No. of failures      =          964
Time at risk         =      1263881
                                                Wald chi2(42)    =       34.48
Log pseudolikelihood =   -6950.6544             Prob > chi2      =      0.7886

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.142582   .2797162     0.54   0.586     .7071378    1.846165
 only 12-18  |     1.2589   .4191664     0.69   0.489      .655501    2.417739
      mixed  |   1.241245   .2857282     0.94   0.348     .7905248    1.948946
             |
        age1 |   1.012773    .012388     1.04   0.299     .9887818    1.037347
        age2 |   .9717089   .0376314    -0.74   0.459     .9006823    1.048336
        age3 |   1.065018   .1162701     0.58   0.564     .8598641     1.31912
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    1.05229   .0703155     0.76   0.446     .9231174    1.199538
             |
   obese4cat |
Obese I ..)  |   1.028067   .0972306     0.29   0.770     .8541187    1.237442
Obese II..)  |   1.028824    .115529     0.25   0.800     .8255768    1.282107
Obese II..)  |   .9437549   .1381996    -0.40   0.693     .7082928    1.257493
             |
smoke_nomiss |
     Former  |   1.499332   .2913558     2.08   0.037     1.024446    2.194353
    Current  |   .9312475   .0952279    -0.70   0.486     .7621186    1.137909
             |
         imd |
          4  |    .967642   .0801132    -0.40   0.691     .8227006    1.138119
5 most de..  |    .936333   .1062606    -0.58   0.562     .7496023    1.169579
             |
tot_adults~h |
          2  |   .8307717   .4166387    -0.37   0.712     .3108832    2.220067
          3  |   .5883684   .2305808    -1.35   0.176     .2729384    1.268335
             |
   ethnicity |
Asian or ..  |   1.022413   .1163757     0.19   0.846     .8179725     1.27795
      Other  |   1.025021   .1127454     0.22   0.822     .8262406    1.271626
             |
1.htdiag_o~p |   1.069653   .0753163     0.96   0.339     .9317689    1.227941
1.~y_disease |   .9820341   .0824704    -0.22   0.829     .8329969    1.157737
    1.asthma |   .9507005   .1213547    -0.40   0.692     .7402695    1.220949
1.~c_disease |   .9517525   .0804125    -0.59   0.558     .8065049    1.123159
             |
     diabcat |
T1DM, con..  |   1.001207   .1957112     0.01   0.995     .6825505    1.468631
T1DM, unc..  |   1.697407   .6007616     1.49   0.135     .8482448    3.396651
T2DM, con..  |   .9014763   .0806501    -1.16   0.246     .7564879    1.074253
T2DM, unc..  |   1.070254   .1736333     0.42   0.676     .7787386    1.470896
Diabetes,..  |   1.818849   1.299479     0.84   0.402     .4483885       7.378
             |
cancer_exh~t |
  Last year  |   1.278352    .756366     0.42   0.678     .4008828     4.07646
2-5 years..  |   .5499715    .186254    -1.77   0.077     .2831856    1.068093
   5+ years  |   .9312757   .0811264    -0.82   0.414     .7851044    1.104661
             |
cancer_hae~t |
  Last year  |   .5514174   .3909751    -0.84   0.401     .1373875    2.213164
2-5 years..  |   .9695872   .2525745    -0.12   0.906     .5819042    1.615557
   5+ years  |    .854758   .0742257    -1.81   0.071     .7209851    1.013351
             |
1.~r_disease |   .9879049   .0795576    -0.15   0.880      .843658    1.156815
1.stroke_d~a |   .8719961   .0730229    -1.64   0.102     .7400023    1.027534
1.other_ne~o |    1.04912   .0796337     0.63   0.528     .9040962    1.217407
             |
reduced_ki~t |
Stage 3a/..  |   .9120096    .542742    -0.15   0.877     .2840826    2.927886
      1.esrd |   1.015927   .0693114     0.23   0.817     .8887701    1.161276
1.other_tr~t |   .9501874   .0766916    -0.63   0.527      .811161    1.113042
  1.asplenia |   .9901553   .0809257    -0.12   0.904     .8435956    1.162177
1.ra_sle_p~s |   1.132374   .0834339     1.69   0.092     .9801054    1.308298
1.other_im~o |   .9924491   .0810452    -0.09   0.926     .8456635    1.164713
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,065             Number of obs    =      16,065
No. of failures      =          964
Time at risk         =      1263881
                                                Wald chi2(42)    =       34.48
Log pseudolikelihood =   -6950.6544             Prob > chi2      =      0.7886

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.142582   .2797162     0.54   0.586     .7071378    1.846165
 only 12-18  |     1.2589   .4191664     0.69   0.489      .655501    2.417739
      mixed  |   1.241245   .2857282     0.94   0.348     .7905248    1.948946
             |
        age1 |   1.012773    .012388     1.04   0.299     .9887818    1.037347
        age2 |   .9717089   .0376314    -0.74   0.459     .9006823    1.048336
        age3 |   1.065018   .1162701     0.58   0.564     .8598641     1.31912
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    1.05229   .0703155     0.76   0.446     .9231174    1.199538
             |
   obese4cat |
Obese I ..)  |   1.028067   .0972306     0.29   0.770     .8541187    1.237442
Obese II..)  |   1.028824    .115529     0.25   0.800     .8255768    1.282107
Obese II..)  |   .9437549   .1381996    -0.40   0.693     .7082928    1.257493
             |
smoke_nomiss |
     Former  |   1.499332   .2913558     2.08   0.037     1.024446    2.194353
    Current  |   .9312475   .0952279    -0.70   0.486     .7621186    1.137909
             |
         imd |
          4  |    .967642   .0801132    -0.40   0.691     .8227006    1.138119
5 most de..  |    .936333   .1062606    -0.58   0.562     .7496023    1.169579
             |
tot_adults~h |
          2  |   .8307717   .4166387    -0.37   0.712     .3108832    2.220067
          3  |   .5883684   .2305808    -1.35   0.176     .2729384    1.268335
             |
   ethnicity |
Asian or ..  |   1.022413   .1163757     0.19   0.846     .8179725     1.27795
      Other  |   1.025021   .1127454     0.22   0.822     .8262406    1.271626
             |
1.htdiag_o~p |   1.069653   .0753163     0.96   0.339     .9317689    1.227941
1.~y_disease |   .9820341   .0824704    -0.22   0.829     .8329969    1.157737
    1.asthma |   .9507005   .1213547    -0.40   0.692     .7402695    1.220949
1.~c_disease |   .9517525   .0804125    -0.59   0.558     .8065049    1.123159
             |
     diabcat |
T1DM, con..  |   1.001207   .1957112     0.01   0.995     .6825505    1.468631
T1DM, unc..  |   1.697407   .6007616     1.49   0.135     .8482448    3.396651
T2DM, con..  |   .9014763   .0806501    -1.16   0.246     .7564879    1.074253
T2DM, unc..  |   1.070254   .1736333     0.42   0.676     .7787386    1.470896
Diabetes,..  |   1.818849   1.299479     0.84   0.402     .4483885       7.378
             |
cancer_exh~t |
  Last year  |   1.278352    .756366     0.42   0.678     .4008828     4.07646
2-5 years..  |   .5499715    .186254    -1.77   0.077     .2831856    1.068093
   5+ years  |   .9312757   .0811264    -0.82   0.414     .7851044    1.104661
             |
cancer_hae~t |
  Last year  |   .5514174   .3909751    -0.84   0.401     .1373875    2.213164
2-5 years..  |   .9695872   .2525745    -0.12   0.906     .5819042    1.615557
   5+ years  |    .854758   .0742257    -1.81   0.071     .7209851    1.013351
             |
1.~r_disease |   .9879049   .0795576    -0.15   0.880      .843658    1.156815
1.stroke_d~a |   .8719961   .0730229    -1.64   0.102     .7400023    1.027534
1.other_ne~o |    1.04912   .0796337     0.63   0.528     .9040962    1.217407
             |
reduced_ki~t |
Stage 3a/..  |   .9120096    .542742    -0.15   0.877     .2840826    2.927886
      1.esrd |   1.015927   .0693114     0.23   0.817     .8887701    1.161276
1.other_tr~t |   .9501874   .0766916    -0.63   0.527      .811161    1.113042
  1.asplenia |   .9901553   .0809257    -0.12   0.904     .8435956    1.162177
1.ra_sle_p~s |   1.132374   .0834339     1.69   0.092     .9801054    1.308298
1.other_im~o |   .9924491   .0810452    -0.09   0.926     .8456635    1.164713
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod0.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -3652.3094
Iteration 1:   log pseudolikelihood = -3629.4482
Iteration 2:   log pseudolikelihood = -3625.6429
Iteration 3:   log pseudolikelihood = -3625.0867
Iteration 4:   log pseudolikelihood = -3624.9308
Iteration 5:   log pseudolikelihood = -3624.8737
Iteration 6:   log pseudolikelihood = -3624.8527
Iteration 7:   log pseudolikelihood =  -3624.845
Iteration 8:   log pseudolikelihood = -3624.8422
Iteration 9:   log pseudolikelihood = -3624.8411
Iteration 10:  log pseudolikelihood = -3624.8407
Iteration 11:  log pseudolikelihood = -3624.8406
Iteration 12:  log pseudolikelihood = -3624.8405
Iteration 13:  log pseudolikelihood = -3624.8405
Iteration 14:  log pseudolikelihood = -3624.8405
Iteration 15:  log pseudolikelihood = -3624.8405
Iteration 16:  log pseudolikelihood = -3624.8405
Iteration 17:  log pseudolikelihood = -3624.8405
Iteration 18:  log pseudolikelihood = -3624.8405
Iteration 19:  log pseudolikelihood = -3624.8405
Iteration 20:  log pseudolikelihood = -3624.8405
Iteration 21:  log pseudolikelihood = -3624.8405
Iteration 22:  log pseudolikelihood = -3624.8405
Iteration 23:  log pseudolikelihood = -3624.8405
Iteration 24:  log pseudolikelihood = -3624.8405
Iteration 25:  log pseudolikelihood = -3624.8405
Iteration 26:  log pseudolikelihood = -3624.8405
Iteration 27:  log pseudolikelihood = -3624.8405
Iteration 28:  log pseudolikelihood = -3624.8405
Iteration 29:  log pseudolikelihood = -3624.8405
Iteration 30:  log pseudolikelihood = -3624.8405
Iteration 31:  log pseudolikelihood = -3624.8405
Iteration 32:  log pseudolikelihood = -3624.8405
Iteration 33:  log pseudolikelihood = -3624.8405
Iteration 34:  log pseudolikelihood = -3624.8405
Refining estimates:
Iteration 0:   log pseudolikelihood = -3624.8405
Iteration 1:   log pseudolikelihood = -3624.8405
Iteration 2:   log pseudolikelihood = -3624.8405
Iteration 3:   log pseudolikelihood = -3624.8405
Iteration 4:   log pseudolikelihood = -3624.8405

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       11,439             Number of obs    =      11,439
No. of failures      =          529
Time at risk         =       684674
                                                Wald chi2(42)    =    97824.67
Log pseudolikelihood =   -3624.8405             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,069 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.360961   .4279968     0.98   0.327     .7347825    2.520767
 only 12-18  |   1.419696   .5651921     0.88   0.379     .6506169    3.097885
      mixed  |   1.406719   .4175834     1.15   0.250     .7861922    2.517015
             |
        age1 |   .9981689   .0155391    -0.12   0.906     .9681727    1.029094
        age2 |   .9838033   .0499466    -0.32   0.748     .8906225    1.086733
        age3 |   1.083746   .1576187     0.55   0.580      .814948    1.441203
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.113488   .0953518     1.26   0.209     .9414436    1.316973
             |
   obese4cat |
Obese I ..)  |   1.214947   .1440428     1.64   0.101     .9630301    1.532763
Obese II..)  |    .753279   .1291054    -1.65   0.098     .5383533    1.054009
Obese II..)  |   .9380597   .1926726    -0.31   0.756     .6271884    1.403017
             |
smoke_nomiss |
     Former  |   .7094259   .2513007    -0.97   0.332     .3543112     1.42046
    Current  |   .8056471     .11907    -1.46   0.144     .6030345    1.076335
             |
         imd |
          4  |    .944571   .1062481    -0.51   0.612     .7576855    1.177552
5 most de..  |   1.036282   .1463921     0.25   0.801     .7856542    1.366861
             |
tot_adults~h |
          2  |   2.334859   1.517803     1.30   0.192     .6530207     8.34823
          3  |   .7465718   .4531032    -0.48   0.630     .2272309    2.452877
             |
   ethnicity |
Asian or ..  |   .7804645   .1243986    -1.56   0.120     .5710574    1.066661
      Other  |   .8888615   .1443256    -0.73   0.468     .6465816    1.221926
             |
1.htdiag_o~p |   .8378887    .079363    -1.87   0.062      .695925    1.008812
1.~y_disease |    .936715   .1071495    -0.57   0.568     .7485825    1.172129
    1.asthma |   .6651417    .128717    -2.11   0.035     .4551885    .9719348
1.~c_disease |   .9457634   .1049677    -0.50   0.615     .7608691    1.175588
             |
     diabcat |
T1DM, con..  |   1.274409   .2967306     1.04   0.298     .8074522     2.01141
T1DM, unc..  |   2.97e-17   5.35e-18  -211.15   0.000     2.09e-17    4.23e-17
T2DM, con..  |    .925315   .1123312    -0.64   0.523     .7293829     1.17388
T2DM, unc..  |   1.035319   .2457706     0.15   0.884      .650145    1.648685
Diabetes,..  |   3.00e-17   1.01e-17  -113.08   0.000     1.55e-17    5.81e-17
             |
cancer_exh~t |
  Last year  |   2.329874   1.321938     1.49   0.136     .7662535    7.084225
2-5 years..  |   1.104331   .3524251     0.31   0.756     .5908198    2.064159
   5+ years  |   .9436447   .1110329    -0.49   0.622     .7492949    1.188404
             |
cancer_hae~t |
  Last year  |   .5074011   .5095579    -0.68   0.499     .0708813    3.632211
2-5 years..  |     1.1166   .3535701     0.35   0.728     .6002959    2.076967
   5+ years  |   .9420526   .1118976    -0.50   0.615     .7463953    1.188999
             |
1.~r_disease |   1.071032    .116048     0.63   0.527     .8661109    1.324438
1.stroke_d~a |   1.074294   .1124359     0.68   0.494     .8750566    1.318895
1.other_ne~o |   1.012273   .1109193     0.11   0.911     .8166347     1.25478
             |
reduced_ki~t |
Stage 3a/..  |   3.52e-17   6.97e-18  -191.29   0.000     2.39e-17    5.19e-17
      1.esrd |   .9499817   .0831448    -0.59   0.558      .800232    1.127755
1.other_tr~t |   .9222758   .0985195    -0.76   0.449     .7480552    1.137072
  1.asplenia |    1.01924   .1092351     0.18   0.859      .826134    1.257484
1.ra_sle_p~s |   .8069224   .0893916    -1.94   0.053     .6494339    1.002602
1.other_im~o |    .822957   .0957254    -1.68   0.094     .6551886    1.033684
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       11,439             Number of obs    =      11,439
No. of failures      =          529
Time at risk         =       684674
                                                Wald chi2(42)    =    97824.67
Log pseudolikelihood =   -3624.8405             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,069 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.360961   .4279968     0.98   0.327     .7347825    2.520767
 only 12-18  |   1.419696   .5651921     0.88   0.379     .6506169    3.097885
      mixed  |   1.406719   .4175834     1.15   0.250     .7861922    2.517015
             |
        age1 |   .9981689   .0155391    -0.12   0.906     .9681727    1.029094
        age2 |   .9838033   .0499466    -0.32   0.748     .8906225    1.086733
        age3 |   1.083746   .1576187     0.55   0.580      .814948    1.441203
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.113488   .0953518     1.26   0.209     .9414436    1.316973
             |
   obese4cat |
Obese I ..)  |   1.214947   .1440428     1.64   0.101     .9630301    1.532763
Obese II..)  |    .753279   .1291054    -1.65   0.098     .5383533    1.054009
Obese II..)  |   .9380597   .1926726    -0.31   0.756     .6271884    1.403017
             |
smoke_nomiss |
     Former  |   .7094259   .2513007    -0.97   0.332     .3543112     1.42046
    Current  |   .8056471     .11907    -1.46   0.144     .6030345    1.076335
             |
         imd |
          4  |    .944571   .1062481    -0.51   0.612     .7576855    1.177552
5 most de..  |   1.036282   .1463921     0.25   0.801     .7856542    1.366861
             |
tot_adults~h |
          2  |   2.334859   1.517803     1.30   0.192     .6530207     8.34823
          3  |   .7465718   .4531032    -0.48   0.630     .2272309    2.452877
             |
   ethnicity |
Asian or ..  |   .7804645   .1243986    -1.56   0.120     .5710574    1.066661
      Other  |   .8888615   .1443256    -0.73   0.468     .6465816    1.221926
             |
1.htdiag_o~p |   .8378887    .079363    -1.87   0.062      .695925    1.008812
1.~y_disease |    .936715   .1071495    -0.57   0.568     .7485825    1.172129
    1.asthma |   .6651417    .128717    -2.11   0.035     .4551885    .9719348
1.~c_disease |   .9457634   .1049677    -0.50   0.615     .7608691    1.175588
             |
     diabcat |
T1DM, con..  |   1.274409   .2967306     1.04   0.298     .8074522     2.01141
T1DM, unc..  |   2.97e-17   5.35e-18  -211.15   0.000     2.09e-17    4.23e-17
T2DM, con..  |    .925315   .1123312    -0.64   0.523     .7293829     1.17388
T2DM, unc..  |   1.035319   .2457706     0.15   0.884      .650145    1.648685
Diabetes,..  |   3.00e-17   1.01e-17  -113.08   0.000     1.55e-17    5.81e-17
             |
cancer_exh~t |
  Last year  |   2.329874   1.321938     1.49   0.136     .7662535    7.084225
2-5 years..  |   1.104331   .3524251     0.31   0.756     .5908198    2.064159
   5+ years  |   .9436447   .1110329    -0.49   0.622     .7492949    1.188404
             |
cancer_hae~t |
  Last year  |   .5074011   .5095579    -0.68   0.499     .0708813    3.632211
2-5 years..  |     1.1166   .3535701     0.35   0.728     .6002959    2.076967
   5+ years  |   .9420526   .1118976    -0.50   0.615     .7463953    1.188999
             |
1.~r_disease |   1.071032    .116048     0.63   0.527     .8661109    1.324438
1.stroke_d~a |   1.074294   .1124359     0.68   0.494     .8750566    1.318895
1.other_ne~o |   1.012273   .1109193     0.11   0.911     .8166347     1.25478
             |
reduced_ki~t |
Stage 3a/..  |   3.52e-17   6.97e-18  -191.29   0.000     2.39e-17    5.19e-17
      1.esrd |   .9499817   .0831448    -0.59   0.558      .800232    1.127755
1.other_tr~t |   .9222758   .0985195    -0.76   0.449     .7480552    1.137072
  1.asplenia |    1.01924   .1092351     0.18   0.859      .826134    1.257484
1.ra_sle_p~s |   .8069224   .0893916    -1.94   0.053     .6494339    1.002602
1.other_im~o |    .822957   .0957254    -1.68   0.094     .6551886    1.033684
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod1.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2386.9024
Iteration 1:   log pseudolikelihood = -2364.8698
Iteration 2:   log pseudolikelihood =  -2359.484
Iteration 3:   log pseudolikelihood = -2359.4179
Iteration 4:   log pseudolikelihood = -2359.4176
Refining estimates:
Iteration 0:   log pseudolikelihood = -2359.4176

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        8,402             Number of obs    =       8,402
No. of failures      =          363
Time at risk         =       434977
                                                Wald chi2(42)    =       73.64
Log pseudolikelihood =   -2359.4176             Prob > chi2      =      0.0018

                       (Std. Err. adjusted for 1,019 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.755117   .7353778     1.34   0.179      .772077    3.989805
 only 12-18  |   3.662552   1.595005     2.98   0.003      1.55989    8.599508
      mixed  |   1.688541   .6698306     1.32   0.187     .7759737    3.674315
             |
        age1 |   .9818539    .019544    -0.92   0.358     .9442859    1.020917
        age2 |   1.071646   .0685316     1.08   0.279      .945403    1.214746
        age3 |    .813386   .1494983    -1.12   0.261      .567346    1.166126
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.167963   .1218664     1.49   0.137     .9519489    1.432993
             |
   obese4cat |
Obese I ..)  |   .9599043   .1490717    -0.26   0.792     .7080071    1.301422
Obese II..)  |   1.052784   .1949761     0.28   0.781     .7323121    1.513499
Obese II..)  |   1.012452   .2294135     0.05   0.956     .6493797    1.578519
             |
smoke_nomiss |
     Former  |   .8282081    .336209    -0.46   0.642      .373763    1.835197
    Current  |   .6359663    .113986    -2.53   0.012     .4475803    .9036438
             |
         imd |
          4  |   1.044356   .1356202     0.33   0.738     .8096764    1.347056
5 most de..  |   .8794798   .1589986    -0.71   0.477     .6170774    1.253465
             |
tot_adults~h |
          2  |    4.54432   4.902311     1.40   0.161     .5485442    37.64663
          3  |   1.319628   1.349286     0.27   0.786     .1778769    9.790016
             |
   ethnicity |
Asian or ..  |   .8506776   .1642895    -0.84   0.402     .5826052    1.242097
      Other  |   1.079808   .1883212     0.44   0.660     .7671762    1.519841
             |
1.htdiag_o~p |   .9640548   .1093984    -0.32   0.747     .7718086    1.204187
1.~y_disease |   .9724849   .1295202    -0.21   0.834     .7490585    1.262554
    1.asthma |   1.016438   .1991678     0.08   0.934     .6922944    1.492352
1.~c_disease |   .9780017   .1325121    -0.16   0.870     .7499081    1.275473
             |
     diabcat |
T1DM, con..  |   .9599819   .3129657    -0.13   0.900     .5067118    1.818717
T1DM, unc..  |    .636038   .6243547    -0.46   0.645     .0928789     4.35561
T2DM, con..  |   .9309904   .1374319    -0.48   0.628     .6970945    1.243365
T2DM, unc..  |   1.271052    .302549     1.01   0.314     .7971709    2.026633
Diabetes,..  |   6.938204   5.150243     2.61   0.009     1.619565    29.72321
             |
cancer_exh~t |
  Last year  |   1.008852   .9265859     0.01   0.992     .1667387    6.104055
2-5 years..  |   2.181287   .6281576     2.71   0.007     1.240474    3.835643
   5+ years  |    1.15154   .1548634     1.05   0.294      .884721    1.498828
             |
cancer_hae~t |
  Last year  |    .763434   .7494558    -0.27   0.783     .1114693     5.22863
2-5 years..  |    1.15751   .4856627     0.35   0.727     .5086064    2.634317
   5+ years  |   1.254106   .1610807     1.76   0.078     .9749975    1.613113
             |
1.~r_disease |   1.034417   .1364358     0.26   0.798     .7987764    1.339572
1.stroke_d~a |   .8547051   .1157159    -1.16   0.246      .655503    1.114443
1.other_ne~o |   .8990485   .1200806    -0.80   0.426     .6919794    1.168081
             |
reduced_ki~t |
Stage 3a/..  |   .7696624   .7521828    -0.27   0.789     .1133522    5.226012
      1.esrd |   .8500406   .0954074    -1.45   0.148     .6821847    1.059199
1.other_tr~t |   .9145666   .1225996    -0.67   0.505     .7032502     1.18938
  1.asplenia |   1.400601   .1682812     2.80   0.005     1.106733    1.772497
1.ra_sle_p~s |   .9111764   .1153138    -0.74   0.462      .711015    1.167686
1.other_im~o |    1.13117   .1495737     0.93   0.351      .872919    1.465823
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        8,402             Number of obs    =       8,402
No. of failures      =          363
Time at risk         =       434977
                                                Wald chi2(42)    =       73.64
Log pseudolikelihood =   -2359.4176             Prob > chi2      =      0.0018

                       (Std. Err. adjusted for 1,019 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.755117   .7353778     1.34   0.179      .772077    3.989805
 only 12-18  |   3.662552   1.595005     2.98   0.003      1.55989    8.599508
      mixed  |   1.688541   .6698306     1.32   0.187     .7759737    3.674315
             |
        age1 |   .9818539    .019544    -0.92   0.358     .9442859    1.020917
        age2 |   1.071646   .0685316     1.08   0.279      .945403    1.214746
        age3 |    .813386   .1494983    -1.12   0.261      .567346    1.166126
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.167963   .1218664     1.49   0.137     .9519489    1.432993
             |
   obese4cat |
Obese I ..)  |   .9599043   .1490717    -0.26   0.792     .7080071    1.301422
Obese II..)  |   1.052784   .1949761     0.28   0.781     .7323121    1.513499
Obese II..)  |   1.012452   .2294135     0.05   0.956     .6493797    1.578519
             |
smoke_nomiss |
     Former  |   .8282081    .336209    -0.46   0.642      .373763    1.835197
    Current  |   .6359663    .113986    -2.53   0.012     .4475803    .9036438
             |
         imd |
          4  |   1.044356   .1356202     0.33   0.738     .8096764    1.347056
5 most de..  |   .8794798   .1589986    -0.71   0.477     .6170774    1.253465
             |
tot_adults~h |
          2  |    4.54432   4.902311     1.40   0.161     .5485442    37.64663
          3  |   1.319628   1.349286     0.27   0.786     .1778769    9.790016
             |
   ethnicity |
Asian or ..  |   .8506776   .1642895    -0.84   0.402     .5826052    1.242097
      Other  |   1.079808   .1883212     0.44   0.660     .7671762    1.519841
             |
1.htdiag_o~p |   .9640548   .1093984    -0.32   0.747     .7718086    1.204187
1.~y_disease |   .9724849   .1295202    -0.21   0.834     .7490585    1.262554
    1.asthma |   1.016438   .1991678     0.08   0.934     .6922944    1.492352
1.~c_disease |   .9780017   .1325121    -0.16   0.870     .7499081    1.275473
             |
     diabcat |
T1DM, con..  |   .9599819   .3129657    -0.13   0.900     .5067118    1.818717
T1DM, unc..  |    .636038   .6243547    -0.46   0.645     .0928789     4.35561
T2DM, con..  |   .9309904   .1374319    -0.48   0.628     .6970945    1.243365
T2DM, unc..  |   1.271052    .302549     1.01   0.314     .7971709    2.026633
Diabetes,..  |   6.938204   5.150243     2.61   0.009     1.619565    29.72321
             |
cancer_exh~t |
  Last year  |   1.008852   .9265859     0.01   0.992     .1667387    6.104055
2-5 years..  |   2.181287   .6281576     2.71   0.007     1.240474    3.835643
   5+ years  |    1.15154   .1548634     1.05   0.294      .884721    1.498828
             |
cancer_hae~t |
  Last year  |    .763434   .7494558    -0.27   0.783     .1114693     5.22863
2-5 years..  |    1.15751   .4856627     0.35   0.727     .5086064    2.634317
   5+ years  |   1.254106   .1610807     1.76   0.078     .9749975    1.613113
             |
1.~r_disease |   1.034417   .1364358     0.26   0.798     .7987764    1.339572
1.stroke_d~a |   .8547051   .1157159    -1.16   0.246      .655503    1.114443
1.other_ne~o |   .8990485   .1200806    -0.80   0.426     .6919794    1.168081
             |
reduced_ki~t |
Stage 3a/..  |   .7696624   .7521828    -0.27   0.789     .1133522    5.226012
      1.esrd |   .8500406   .0954074    -1.45   0.148     .6821847    1.059199
1.other_tr~t |   .9145666   .1225996    -0.67   0.505     .7032502     1.18938
  1.asplenia |   1.400601   .1682812     2.80   0.005     1.106733    1.772497
1.ra_sle_p~s |   .9111764   .1153138    -0.74   0.462      .711015    1.167686
1.other_im~o |    1.13117   .1495737     0.93   0.351      .872919    1.465823
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod2.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1264.5024
Iteration 1:   log pseudolikelihood = -1235.2809
Iteration 2:   log pseudolikelihood = -1232.6188
Iteration 3:   log pseudolikelihood = -1232.4425
Iteration 4:   log pseudolikelihood = -1232.3946
Iteration 5:   log pseudolikelihood =  -1232.377
Iteration 6:   log pseudolikelihood = -1232.3705
Iteration 7:   log pseudolikelihood = -1232.3681
Iteration 8:   log pseudolikelihood = -1232.3672
Iteration 9:   log pseudolikelihood = -1232.3669
Iteration 10:  log pseudolikelihood = -1232.3668
Iteration 11:  log pseudolikelihood = -1232.3667
Iteration 12:  log pseudolikelihood = -1232.3667
Iteration 13:  log pseudolikelihood = -1232.3667
Iteration 14:  log pseudolikelihood = -1232.3667
Iteration 15:  log pseudolikelihood = -1232.3667
Iteration 16:  log pseudolikelihood = -1232.3667
Iteration 17:  log pseudolikelihood = -1232.3667
Iteration 18:  log pseudolikelihood = -1232.3667
Iteration 19:  log pseudolikelihood = -1232.3667
Iteration 20:  log pseudolikelihood = -1232.3667
Iteration 21:  log pseudolikelihood = -1232.3667
Iteration 22:  log pseudolikelihood = -1232.3667
Iteration 23:  log pseudolikelihood = -1232.3667
Iteration 24:  log pseudolikelihood = -1232.3667
Iteration 25:  log pseudolikelihood = -1232.3667
Iteration 26:  log pseudolikelihood = -1232.3667
Iteration 27:  log pseudolikelihood = -1232.3667
Iteration 28:  log pseudolikelihood = -1232.3667
Iteration 29:  log pseudolikelihood = -1232.3667
Iteration 30:  log pseudolikelihood = -1232.3667
Iteration 31:  log pseudolikelihood = -1232.3667
Refining estimates:
Iteration 0:   log pseudolikelihood = -1232.3667
Iteration 1:   log pseudolikelihood = -1232.3667
Iteration 2:   log pseudolikelihood = -1232.3667

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,790             Number of obs    =       5,790
No. of failures      =          204
Time at risk         =       233836
                                                Wald chi2(42)    =    30125.76
Log pseudolikelihood =   -1232.3667             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 960 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.140808   .5414363     0.28   0.781     .4500138    2.892007
 only 12-18  |   1.029423   .6733589     0.04   0.965     .2856354    3.710016
      mixed  |   .8240746   .3677807    -0.43   0.665     .3436205    1.976305
             |
        age1 |   1.002984   .0277333     0.11   0.914     .9500745     1.05884
        age2 |    .969347   .0870812    -0.35   0.729     .8128524    1.155971
        age3 |   1.149802   .2943724     0.55   0.586     .6961427    1.899099
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8871445    .137028    -0.78   0.438     .6554175      1.2008
             |
   obese4cat |
Obese I ..)  |    1.09116   .2226182     0.43   0.669     .7315204     1.62761
Obese II..)  |   .9549591   .2651576    -0.17   0.868     .5541622    1.645632
Obese II..)  |   .5517701   .2106557    -1.56   0.119     .2610868    1.166088
             |
smoke_nomiss |
     Former  |   1.806115   .6762953     1.58   0.114     .8669917    3.762493
    Current  |   1.130968   .2409314     0.58   0.563     .7449342    1.717049
             |
         imd |
          4  |   .9284593   .1804406    -0.38   0.703     .6343616    1.358904
5 most de..  |   1.032788   .2419255     0.14   0.890     .6525611     1.63456
             |
tot_adults~h |
          2  |   .8894702   .8829041    -0.12   0.906     .1271199     6.22371
          3  |   .5818289   .4857142    -0.65   0.517     .1132941    2.988018
             |
   ethnicity |
Asian or ..  |   .6180302   .1712991    -1.74   0.083     .3589902    1.063988
      Other  |   .6144718   .1721763    -1.74   0.082     .3548081    1.064169
             |
1.htdiag_o~p |   .6484532   .1082574    -2.59   0.009     .4674908    .8994649
1.~y_disease |   1.059673   .1948207     0.32   0.753     .7390583    1.519376
    1.asthma |   .7822394   .2294255    -0.84   0.402     .4402386    1.389925
1.~c_disease |   1.002493   .1829164     0.01   0.989      .701084    1.433485
             |
     diabcat |
T1DM, con..  |   1.365111   .5046284     0.84   0.400     .6614728    2.817241
T1DM, unc..  |   1.382621   1.355337     0.33   0.741     .2024409     9.44295
T2DM, con..  |   1.110752   .2184282     0.53   0.593     .7554908     1.63307
T2DM, unc..  |   .4353952   .2549711    -1.42   0.156     .1381697    1.372001
Diabetes,..  |   3.92e-15   2.94e-15   -44.26   0.000     9.03e-16    1.70e-14
             |
cancer_exh~t |
  Last year  |   4.21e-15   1.41e-15   -98.82   0.000     2.18e-15    8.12e-15
2-5 years..  |   2.128516   .8037695     2.00   0.045     1.015422    4.461772
   5+ years  |    .561164   .1262234    -2.57   0.010     .3611004    .8720707
             |
cancer_hae~t |
  Last year  |   4.66e-15   1.27e-15  -120.86   0.000     2.73e-15    7.95e-15
2-5 years..  |   1.951079   .8118934     1.61   0.108     .8631146    4.410435
   5+ years  |   .9919542   .1900369    -0.04   0.966     .6814279    1.443987
             |
1.~r_disease |   1.129684   .1836006     0.75   0.453     .8215168    1.553451
1.stroke_d~a |   .7525994   .1462896    -1.46   0.144     .5141716    1.101589
1.other_ne~o |   .7230784   .1327736    -1.77   0.077     .5045282      1.0363
             |
reduced_ki~t |
Stage 3a/..  |   1.117455   1.216214     0.10   0.919     .1323735    9.433203
      1.esrd |   .8677348   .1299375    -0.95   0.343     .6470313    1.163721
1.other_tr~t |   1.442187   .2322776     2.27   0.023     1.051786    1.977495
  1.asplenia |   .7336684   .1453865    -1.56   0.118     .4975337    1.081875
1.ra_sle_p~s |   1.188231   .2043628     1.00   0.316     .8482103    1.664556
1.other_im~o |   .8517741   .1504539    -0.91   0.364     .6025203    1.204141
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,790             Number of obs    =       5,790
No. of failures      =          204
Time at risk         =       233836
                                                Wald chi2(42)    =    30125.76
Log pseudolikelihood =   -1232.3667             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 960 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.140808   .5414363     0.28   0.781     .4500138    2.892007
 only 12-18  |   1.029423   .6733589     0.04   0.965     .2856354    3.710016
      mixed  |   .8240746   .3677807    -0.43   0.665     .3436205    1.976305
             |
        age1 |   1.002984   .0277333     0.11   0.914     .9500745     1.05884
        age2 |    .969347   .0870812    -0.35   0.729     .8128524    1.155971
        age3 |   1.149802   .2943724     0.55   0.586     .6961427    1.899099
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8871445    .137028    -0.78   0.438     .6554175      1.2008
             |
   obese4cat |
Obese I ..)  |    1.09116   .2226182     0.43   0.669     .7315204     1.62761
Obese II..)  |   .9549591   .2651576    -0.17   0.868     .5541622    1.645632
Obese II..)  |   .5517701   .2106557    -1.56   0.119     .2610868    1.166088
             |
smoke_nomiss |
     Former  |   1.806115   .6762953     1.58   0.114     .8669917    3.762493
    Current  |   1.130968   .2409314     0.58   0.563     .7449342    1.717049
             |
         imd |
          4  |   .9284593   .1804406    -0.38   0.703     .6343616    1.358904
5 most de..  |   1.032788   .2419255     0.14   0.890     .6525611     1.63456
             |
tot_adults~h |
          2  |   .8894702   .8829041    -0.12   0.906     .1271199     6.22371
          3  |   .5818289   .4857142    -0.65   0.517     .1132941    2.988018
             |
   ethnicity |
Asian or ..  |   .6180302   .1712991    -1.74   0.083     .3589902    1.063988
      Other  |   .6144718   .1721763    -1.74   0.082     .3548081    1.064169
             |
1.htdiag_o~p |   .6484532   .1082574    -2.59   0.009     .4674908    .8994649
1.~y_disease |   1.059673   .1948207     0.32   0.753     .7390583    1.519376
    1.asthma |   .7822394   .2294255    -0.84   0.402     .4402386    1.389925
1.~c_disease |   1.002493   .1829164     0.01   0.989      .701084    1.433485
             |
     diabcat |
T1DM, con..  |   1.365111   .5046284     0.84   0.400     .6614728    2.817241
T1DM, unc..  |   1.382621   1.355337     0.33   0.741     .2024409     9.44295
T2DM, con..  |   1.110752   .2184282     0.53   0.593     .7554908     1.63307
T2DM, unc..  |   .4353952   .2549711    -1.42   0.156     .1381697    1.372001
Diabetes,..  |   3.92e-15   2.94e-15   -44.26   0.000     9.03e-16    1.70e-14
             |
cancer_exh~t |
  Last year  |   4.21e-15   1.41e-15   -98.82   0.000     2.18e-15    8.12e-15
2-5 years..  |   2.128516   .8037695     2.00   0.045     1.015422    4.461772
   5+ years  |    .561164   .1262234    -2.57   0.010     .3611004    .8720707
             |
cancer_hae~t |
  Last year  |   4.66e-15   1.27e-15  -120.86   0.000     2.73e-15    7.95e-15
2-5 years..  |   1.951079   .8118934     1.61   0.108     .8631146    4.410435
   5+ years  |   .9919542   .1900369    -0.04   0.966     .6814279    1.443987
             |
1.~r_disease |   1.129684   .1836006     0.75   0.453     .8215168    1.553451
1.stroke_d~a |   .7525994   .1462896    -1.46   0.144     .5141716    1.101589
1.other_ne~o |   .7230784   .1327736    -1.77   0.077     .5045282      1.0363
             |
reduced_ki~t |
Stage 3a/..  |   1.117455   1.216214     0.10   0.919     .1323735    9.433203
      1.esrd |   .8677348   .1299375    -0.95   0.343     .6470313    1.163721
1.other_tr~t |   1.442187   .2322776     2.27   0.023     1.051786    1.977495
  1.asplenia |   .7336684   .1453865    -1.56   0.118     .4975337    1.081875
1.ra_sle_p~s |   1.188231   .2043628     1.00   0.316     .8482103    1.664556
1.other_im~o |   .8517741   .1504539    -0.91   0.364     .6025203    1.204141
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod3.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod3.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -618.16006
Iteration 1:   log pseudolikelihood = -611.06408
Iteration 2:   log pseudolikelihood = -603.78912
Iteration 3:   log pseudolikelihood = -602.73082
Iteration 4:   log pseudolikelihood = -602.60893
Iteration 5:   log pseudolikelihood = -602.57725
Iteration 6:   log pseudolikelihood = -602.56565
Iteration 7:   log pseudolikelihood = -602.56138
Iteration 8:   log pseudolikelihood = -602.55981
Iteration 9:   log pseudolikelihood = -602.55923
Iteration 10:  log pseudolikelihood = -602.55902
Iteration 11:  log pseudolikelihood = -602.55894
Iteration 12:  log pseudolikelihood = -602.55891
Iteration 13:  log pseudolikelihood =  -602.5589
Iteration 14:  log pseudolikelihood = -602.55889
Iteration 15:  log pseudolikelihood = -602.55889
Iteration 16:  log pseudolikelihood = -602.55889
Iteration 17:  log pseudolikelihood = -602.55889
Iteration 18:  log pseudolikelihood = -602.55889
Iteration 19:  log pseudolikelihood = -602.55889
Iteration 20:  log pseudolikelihood = -602.55889
Iteration 21:  log pseudolikelihood = -602.55889
Iteration 22:  log pseudolikelihood = -602.55889
Iteration 23:  log pseudolikelihood = -602.55889
Iteration 24:  log pseudolikelihood = -602.55889
Iteration 25:  log pseudolikelihood = -602.55889
Iteration 26:  log pseudolikelihood = -602.55889
Iteration 27:  log pseudolikelihood = -602.55889
Iteration 28:  log pseudolikelihood = -602.55889
Iteration 29:  log pseudolikelihood = -602.55889
Iteration 30:  log pseudolikelihood = -602.55889
Iteration 31:  log pseudolikelihood = -602.55889
Iteration 32:  log pseudolikelihood = -602.55889
Iteration 33:  log pseudolikelihood = -602.55889
Refining estimates:
Iteration 0:   log pseudolikelihood = -602.55889
Iteration 1:   log pseudolikelihood = -602.55889

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,942             Number of obs    =       3,942
No. of failures      =          106
Time at risk         =       119706
                                                Wald chi2(42)    =    53493.36
Log pseudolikelihood =   -602.55889             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 882 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8369169   .5394535    -0.28   0.782     .2366036    2.960352
 only 12-18  |   .6214478   .6646779    -0.44   0.656     .0763819    5.056135
      mixed  |   .9265759   .5297423    -0.13   0.894     .3021564    2.841386
             |
        age1 |   .9984793    .036988    -0.04   0.967     .9285534    1.073671
        age2 |   .9764715   .1141378    -0.20   0.839     .7765409    1.227877
        age3 |   1.079243   .3596296     0.23   0.819     .5616666    2.073767
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.375396   .2864238     1.53   0.126     .9144634    2.068659
             |
   obese4cat |
Obese I ..)  |   1.109743   .3001271     0.39   0.700     .6531564    1.885505
Obese II..)  |   1.014135    .355342     0.04   0.968      .510322    2.015337
Obese II..)  |   1.281489   .4567319     0.70   0.486     .6372954    2.576851
             |
smoke_nomiss |
     Former  |   .4963247   .5195965    -0.67   0.503     .0637754    3.862592
    Current  |   1.250614   .3490986     0.80   0.423     .7236318    2.161371
             |
         imd |
          4  |   .7548157   .2013163    -1.05   0.292     .4475254    1.273105
5 most de..  |   1.244708   .3691284     0.74   0.460     .6960441    2.225862
             |
tot_adults~h |
          2  |   3.38e-16   2.43e-16   -49.55   0.000     8.25e-17    1.38e-15
          3  |   .2547396   .1952584    -1.78   0.074     .0567086    1.144311
             |
   ethnicity |
Asian or ..  |   .6949359   .2519996    -1.00   0.316     .3414127    1.414522
      Other  |   .6581056   .2687365    -1.02   0.306     .2956029    1.465152
             |
1.htdiag_o~p |   1.019952   .2221468     0.09   0.928     .6655598    1.563049
1.~y_disease |   .9140296   .2443747    -0.34   0.737     .5412317    1.543609
    1.asthma |   .9926029   .3696499    -0.02   0.984     .4783923    2.059524
1.~c_disease |   .8396783   .2153438    -0.68   0.496     .5079417    1.388072
             |
     diabcat |
T1DM, con..  |   .7599015   .5521615    -0.38   0.706     .1829175     3.15689
T1DM, unc..  |   2.340073   2.165618     0.92   0.358     .3814922    14.35401
T2DM, con..  |   .9546594     .26796    -0.17   0.869      .550716     1.65489
T2DM, unc..  |   .7450323   .4337034    -0.51   0.613     .2380497    2.331753
Diabetes,..  |   1.36e-15   1.26e-15   -36.95   0.000     2.21e-16    8.34e-15
             |
cancer_exh~t |
  Last year  |   1.36e-15   6.41e-16   -72.84   0.000     5.43e-16    3.43e-15
2-5 years..  |   1.20e-15   2.45e-16  -167.44   0.000     8.00e-16    1.79e-15
   5+ years  |   .6137991   .1842797    -1.63   0.104     .3407781    1.105556
             |
cancer_hae~t |
  Last year  |   3.492087   2.599903     1.68   0.093     .8116234    15.02503
2-5 years..  |   .7325497   .7321721    -0.31   0.756     .1032938    5.195171
   5+ years  |   .6836252   .1912083    -1.36   0.174     .3951292    1.182761
             |
1.~r_disease |   1.020164   .2614272     0.08   0.938     .6173638    1.685772
1.stroke_d~a |   .6230096   .1710454    -1.72   0.085     .3637474    1.067062
1.other_ne~o |   .9940508   .2424125    -0.02   0.980     .6163561    1.603192
             |
reduced_ki~t |
Stage 3a/..  |   2.61e-15   1.17e-15   -74.69   0.000     1.08e-15    6.31e-15
      1.esrd |   .9949689   .2048801    -0.02   0.980     .6645588    1.489655
1.other_tr~t |   1.279476   .3244186     0.97   0.331     .7784042    2.103097
  1.asplenia |   1.005842   .2441406     0.02   0.981     .6250629    1.618585
1.ra_sle_p~s |   1.060408   .2675184     0.23   0.816     .6467445    1.738653
1.other_im~o |    .941758   .2487488    -0.23   0.820     .5611894    1.580408
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,942             Number of obs    =       3,942
No. of failures      =          106
Time at risk         =       119706
                                                Wald chi2(42)    =    53493.36
Log pseudolikelihood =   -602.55889             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 882 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8369169   .5394535    -0.28   0.782     .2366036    2.960352
 only 12-18  |   .6214478   .6646779    -0.44   0.656     .0763819    5.056135
      mixed  |   .9265759   .5297423    -0.13   0.894     .3021564    2.841386
             |
        age1 |   .9984793    .036988    -0.04   0.967     .9285534    1.073671
        age2 |   .9764715   .1141378    -0.20   0.839     .7765409    1.227877
        age3 |   1.079243   .3596296     0.23   0.819     .5616666    2.073767
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.375396   .2864238     1.53   0.126     .9144634    2.068659
             |
   obese4cat |
Obese I ..)  |   1.109743   .3001271     0.39   0.700     .6531564    1.885505
Obese II..)  |   1.014135    .355342     0.04   0.968      .510322    2.015337
Obese II..)  |   1.281489   .4567319     0.70   0.486     .6372954    2.576851
             |
smoke_nomiss |
     Former  |   .4963247   .5195965    -0.67   0.503     .0637754    3.862592
    Current  |   1.250614   .3490986     0.80   0.423     .7236318    2.161371
             |
         imd |
          4  |   .7548157   .2013163    -1.05   0.292     .4475254    1.273105
5 most de..  |   1.244708   .3691284     0.74   0.460     .6960441    2.225862
             |
tot_adults~h |
          2  |   3.38e-16   2.43e-16   -49.55   0.000     8.25e-17    1.38e-15
          3  |   .2547396   .1952584    -1.78   0.074     .0567086    1.144311
             |
   ethnicity |
Asian or ..  |   .6949359   .2519996    -1.00   0.316     .3414127    1.414522
      Other  |   .6581056   .2687365    -1.02   0.306     .2956029    1.465152
             |
1.htdiag_o~p |   1.019952   .2221468     0.09   0.928     .6655598    1.563049
1.~y_disease |   .9140296   .2443747    -0.34   0.737     .5412317    1.543609
    1.asthma |   .9926029   .3696499    -0.02   0.984     .4783923    2.059524
1.~c_disease |   .8396783   .2153438    -0.68   0.496     .5079417    1.388072
             |
     diabcat |
T1DM, con..  |   .7599015   .5521615    -0.38   0.706     .1829175     3.15689
T1DM, unc..  |   2.340073   2.165618     0.92   0.358     .3814922    14.35401
T2DM, con..  |   .9546594     .26796    -0.17   0.869      .550716     1.65489
T2DM, unc..  |   .7450323   .4337034    -0.51   0.613     .2380497    2.331753
Diabetes,..  |   1.36e-15   1.26e-15   -36.95   0.000     2.21e-16    8.34e-15
             |
cancer_exh~t |
  Last year  |   1.36e-15   6.41e-16   -72.84   0.000     5.43e-16    3.43e-15
2-5 years..  |   1.20e-15   2.45e-16  -167.44   0.000     8.00e-16    1.79e-15
   5+ years  |   .6137991   .1842797    -1.63   0.104     .3407781    1.105556
             |
cancer_hae~t |
  Last year  |   3.492087   2.599903     1.68   0.093     .8116234    15.02503
2-5 years..  |   .7325497   .7321721    -0.31   0.756     .1032938    5.195171
   5+ years  |   .6836252   .1912083    -1.36   0.174     .3951292    1.182761
             |
1.~r_disease |   1.020164   .2614272     0.08   0.938     .6173638    1.685772
1.stroke_d~a |   .6230096   .1710454    -1.72   0.085     .3637474    1.067062
1.other_ne~o |   .9940508   .2424125    -0.02   0.980     .6163561    1.603192
             |
reduced_ki~t |
Stage 3a/..  |   2.61e-15   1.17e-15   -74.69   0.000     1.08e-15    6.31e-15
      1.esrd |   .9949689   .2048801    -0.02   0.980     .6645588    1.489655
1.other_tr~t |   1.279476   .3244186     0.97   0.331     .7784042    2.103097
  1.asplenia |   1.005842   .2441406     0.02   0.981     .6250629    1.618585
1.ra_sle_p~s |   1.060408   .2675184     0.23   0.816     .6467445    1.738653
1.other_im~o |    .941758   .2487488    -0.23   0.820     .5611894    1.580408
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod4.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod4.ster saved
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1557.2082
Iteration 1:   log pseudolikelihood =  -1537.421
Iteration 2:   log pseudolikelihood =  -1536.409
Iteration 3:   log pseudolikelihood = -1536.2498
Iteration 4:   log pseudolikelihood =  -1536.193
Iteration 5:   log pseudolikelihood = -1536.1721
Iteration 6:   log pseudolikelihood = -1536.1645
Iteration 7:   log pseudolikelihood = -1536.1616
Iteration 8:   log pseudolikelihood = -1536.1606
Iteration 9:   log pseudolikelihood = -1536.1602
Iteration 10:  log pseudolikelihood = -1536.1601
Iteration 11:  log pseudolikelihood =   -1536.16
Iteration 12:  log pseudolikelihood =   -1536.16
Iteration 13:  log pseudolikelihood =   -1536.16
Iteration 14:  log pseudolikelihood =   -1536.16
Iteration 15:  log pseudolikelihood =   -1536.16
Iteration 16:  log pseudolikelihood =   -1536.16
Iteration 17:  log pseudolikelihood =   -1536.16
Iteration 18:  log pseudolikelihood =   -1536.16
Iteration 19:  log pseudolikelihood =   -1536.16
Iteration 20:  log pseudolikelihood =   -1536.16
Iteration 21:  log pseudolikelihood =   -1536.16
Iteration 22:  log pseudolikelihood =   -1536.16
Iteration 23:  log pseudolikelihood =   -1536.16
Iteration 24:  log pseudolikelihood =   -1536.16
Iteration 25:  log pseudolikelihood =   -1536.16
Iteration 26:  log pseudolikelihood =   -1536.16
Iteration 27:  log pseudolikelihood =   -1536.16
Iteration 28:  log pseudolikelihood =   -1536.16
Iteration 29:  log pseudolikelihood =   -1536.16
Iteration 30:  log pseudolikelihood =   -1536.16
Iteration 31:  log pseudolikelihood =   -1536.16
Iteration 32:  log pseudolikelihood =   -1536.16
Iteration 33:  log pseudolikelihood =   -1536.16
Iteration 34:  log pseudolikelihood =   -1536.16
Iteration 35:  log pseudolikelihood =   -1536.16
Iteration 36:  log pseudolikelihood =   -1536.16
Refining estimates:
Iteration 0:   log pseudolikelihood =   -1536.16
Iteration 1:   log pseudolikelihood =   -1536.16

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,546             Number of obs    =       4,546
No. of failures      =          261
Time at risk         =       353856
                                                Wald chi2(42)    =    29807.34
Log pseudolikelihood =     -1536.16             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.344373   .7734822     0.51   0.607      .435294    4.151995
 only 12-18  |   .9963411   .6392554    -0.01   0.995     .2833183    3.503817
      mixed  |   1.222258   .6709469     0.37   0.715     .4167774    3.584445
             |
        age1 |    .924938   .0530814    -1.36   0.174     .8265382    1.035052
        age2 |   1.500528   .4664836     1.31   0.192     .8158733    2.759722
        age3 |   .4108859   .2759631    -1.32   0.185     .1101613    1.532546
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8475646   .1083546    -1.29   0.196     .6597103    1.088911
             |
   obese4cat |
Obese I ..)  |   .8213954   .1567247    -1.03   0.302     .5651198    1.193889
Obese II..)  |   .7044855   .1840882    -1.34   0.180     .4221296    1.175705
Obese II..)  |   1.180737   .3101168     0.63   0.527     .7056471    1.975688
             |
smoke_nomiss |
     Former  |    1.96762   .6571492     2.03   0.043     1.022482    3.786405
    Current  |   1.027134   .1920358     0.14   0.886     .7120068    1.481734
             |
         imd |
          4  |   .7381288   .1298263    -1.73   0.084     .5228992    1.041949
5 most de..  |   1.102485   .2332597     0.46   0.645     .7282473     1.66904
             |
tot_adults~h |
          2  |   2.034561    1.86621     0.77   0.439     .3370561    12.28115
          3  |   .7912464   .6183743    -0.30   0.764     .1710336    3.660515
             |
   ethnicity |
Asian or ..  |   .9305689    .201038    -0.33   0.739     .6093362    1.421151
      Other  |   .9977777   .2022421    -0.01   0.991     .6706588    1.484451
             |
1.htdiag_o~p |   .7391887   .1088407    -2.05   0.040     .5538873    .9864821
1.~y_disease |   .9019101   .1469402    -0.63   0.526     .6553669    1.241201
    1.asthma |   1.095659   .2348353     0.43   0.670     .7198385     1.66769
1.~c_disease |   1.065611   .1557783     0.43   0.664     .8001368    1.419166
             |
     diabcat |
T1DM, con..  |   .9927954   .3743162    -0.02   0.985     .4741646    2.078694
T1DM, unc..  |   7.93e-17   2.07e-17  -142.03   0.000     4.75e-17    1.32e-16
T2DM, con..  |   1.053396   .1744588     0.31   0.753     .7614115     1.45735
T2DM, unc..  |    .906661   .3107675    -0.29   0.775     .4631128     1.77502
Diabetes,..  |   6.70e-17   3.69e-17   -67.63   0.000     2.28e-17    1.97e-16
             |
cancer_exh~t |
  Last year  |   .8236854   .8045864    -0.20   0.843     .1214218    5.587608
2-5 years..  |   .7169729   .4174093    -0.57   0.568     .2290593     2.24418
   5+ years  |   .9025811    .158102    -0.59   0.558      .640301    1.272296
             |
cancer_hae~t |
  Last year  |   1.183438   .8687737     0.23   0.819     .2807179    4.989087
2-5 years..  |   1.163938   .5087103     0.35   0.728     .4942012    2.741294
   5+ years  |   1.162253   .1802634     0.97   0.332     .8575925    1.575145
             |
1.~r_disease |   .7634881   .1334025    -1.54   0.122     .5420929    1.075303
1.stroke_d~a |   .9760989   .1602755    -0.15   0.883     .7075001     1.34667
1.other_ne~o |   1.050467   .1698992     0.30   0.761      .765089    1.442292
             |
reduced_ki~t |
Stage 3a/..  |   .4619596   .2120268    -1.68   0.092     .1878996    1.135749
      1.esrd |   1.127692   .1443376     0.94   0.348     .8774895    1.449236
1.other_tr~t |   .8102843   .1328987    -1.28   0.200     .5875268    1.117499
  1.asplenia |   1.113829   .1754333     0.68   0.494     .8179941    1.516655
1.ra_sle_p~s |   .8090372   .1395257    -1.23   0.219     .5769938    1.134399
1.other_im~o |   1.202334    .176211     1.26   0.209     .9021422    1.602415
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,546             Number of obs    =       4,546
No. of failures      =          261
Time at risk         =       353856
                                                Wald chi2(42)    =    29807.34
Log pseudolikelihood =     -1536.16             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.344373   .7734822     0.51   0.607      .435294    4.151995
 only 12-18  |   .9963411   .6392554    -0.01   0.995     .2833183    3.503817
      mixed  |   1.222258   .6709469     0.37   0.715     .4167774    3.584445
             |
        age1 |    .924938   .0530814    -1.36   0.174     .8265382    1.035052
        age2 |   1.500528   .4664836     1.31   0.192     .8158733    2.759722
        age3 |   .4108859   .2759631    -1.32   0.185     .1101613    1.532546
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8475646   .1083546    -1.29   0.196     .6597103    1.088911
             |
   obese4cat |
Obese I ..)  |   .8213954   .1567247    -1.03   0.302     .5651198    1.193889
Obese II..)  |   .7044855   .1840882    -1.34   0.180     .4221296    1.175705
Obese II..)  |   1.180737   .3101168     0.63   0.527     .7056471    1.975688
             |
smoke_nomiss |
     Former  |    1.96762   .6571492     2.03   0.043     1.022482    3.786405
    Current  |   1.027134   .1920358     0.14   0.886     .7120068    1.481734
             |
         imd |
          4  |   .7381288   .1298263    -1.73   0.084     .5228992    1.041949
5 most de..  |   1.102485   .2332597     0.46   0.645     .7282473     1.66904
             |
tot_adults~h |
          2  |   2.034561    1.86621     0.77   0.439     .3370561    12.28115
          3  |   .7912464   .6183743    -0.30   0.764     .1710336    3.660515
             |
   ethnicity |
Asian or ..  |   .9305689    .201038    -0.33   0.739     .6093362    1.421151
      Other  |   .9977777   .2022421    -0.01   0.991     .6706588    1.484451
             |
1.htdiag_o~p |   .7391887   .1088407    -2.05   0.040     .5538873    .9864821
1.~y_disease |   .9019101   .1469402    -0.63   0.526     .6553669    1.241201
    1.asthma |   1.095659   .2348353     0.43   0.670     .7198385     1.66769
1.~c_disease |   1.065611   .1557783     0.43   0.664     .8001368    1.419166
             |
     diabcat |
T1DM, con..  |   .9927954   .3743162    -0.02   0.985     .4741646    2.078694
T1DM, unc..  |   7.93e-17   2.07e-17  -142.03   0.000     4.75e-17    1.32e-16
T2DM, con..  |   1.053396   .1744588     0.31   0.753     .7614115     1.45735
T2DM, unc..  |    .906661   .3107675    -0.29   0.775     .4631128     1.77502
Diabetes,..  |   6.70e-17   3.69e-17   -67.63   0.000     2.28e-17    1.97e-16
             |
cancer_exh~t |
  Last year  |   .8236854   .8045864    -0.20   0.843     .1214218    5.587608
2-5 years..  |   .7169729   .4174093    -0.57   0.568     .2290593     2.24418
   5+ years  |   .9025811    .158102    -0.59   0.558      .640301    1.272296
             |
cancer_hae~t |
  Last year  |   1.183438   .8687737     0.23   0.819     .2807179    4.989087
2-5 years..  |   1.163938   .5087103     0.35   0.728     .4942012    2.741294
   5+ years  |   1.162253   .1802634     0.97   0.332     .8575925    1.575145
             |
1.~r_disease |   .7634881   .1334025    -1.54   0.122     .5420929    1.075303
1.stroke_d~a |   .9760989   .1602755    -0.15   0.883     .7075001     1.34667
1.other_ne~o |   1.050467   .1698992     0.30   0.761      .765089    1.442292
             |
reduced_ki~t |
Stage 3a/..  |   .4619596   .2120268    -1.68   0.092     .1878996    1.135749
      1.esrd |   1.127692   .1443376     0.94   0.348     .8774895    1.449236
1.other_tr~t |   .8102843   .1328987    -1.28   0.200     .5875268    1.117499
  1.asplenia |   1.113829   .1754333     0.68   0.494     .8179941    1.516655
1.ra_sle_p~s |   .8090372   .1395257    -1.23   0.219     .5769938    1.134399
1.other_im~o |   1.202334    .176211     1.26   0.209     .9021422    1.602415
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod0.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -797.54704
Iteration 1:   log pseudolikelihood = -778.92119
Iteration 2:   log pseudolikelihood = -767.10553
Iteration 3:   log pseudolikelihood = -765.83346
Iteration 4:   log pseudolikelihood =  -765.6959
Iteration 5:   log pseudolikelihood = -765.65438
Iteration 6:   log pseudolikelihood = -765.63913
Iteration 7:   log pseudolikelihood = -765.63353
Iteration 8:   log pseudolikelihood = -765.63147
Iteration 9:   log pseudolikelihood = -765.63071
Iteration 10:  log pseudolikelihood = -765.63043
Iteration 11:  log pseudolikelihood = -765.63032
Iteration 12:  log pseudolikelihood = -765.63029
Iteration 13:  log pseudolikelihood = -765.63027
Iteration 14:  log pseudolikelihood = -765.63027
Iteration 15:  log pseudolikelihood = -765.63027
Iteration 16:  log pseudolikelihood = -765.63027
Iteration 17:  log pseudolikelihood = -765.63027
Iteration 18:  log pseudolikelihood = -765.63027
Iteration 19:  log pseudolikelihood = -765.63027
Iteration 20:  log pseudolikelihood = -765.63026
Iteration 21:  log pseudolikelihood = -765.63026
Iteration 22:  log pseudolikelihood = -765.63026
Iteration 23:  log pseudolikelihood = -765.63026
Iteration 24:  log pseudolikelihood = -765.63026
Iteration 25:  log pseudolikelihood = -765.63026
Iteration 26:  log pseudolikelihood = -765.63026
Iteration 27:  log pseudolikelihood = -765.63026
Iteration 28:  log pseudolikelihood = -765.63026
Iteration 29:  log pseudolikelihood = -765.63026
Iteration 30:  log pseudolikelihood = -765.63026
Iteration 31:  log pseudolikelihood = -765.63026
Iteration 32:  log pseudolikelihood = -765.63026
Iteration 33:  log pseudolikelihood = -765.63026
Iteration 34:  log pseudolikelihood = -765.63026
Iteration 35:  log pseudolikelihood = -765.63026
Iteration 36:  log pseudolikelihood = -765.63026
Iteration 37:  log pseudolikelihood = -765.63026
Iteration 38:  log pseudolikelihood = -765.63026
Iteration 39:  log pseudolikelihood = -765.63026
Iteration 40:  log pseudolikelihood = -765.63026
Iteration 41:  log pseudolikelihood = -765.63026
Iteration 42:  log pseudolikelihood = -765.63026
Iteration 43:  log pseudolikelihood = -765.63026
Iteration 44:  log pseudolikelihood = -765.63026
Iteration 45:  log pseudolikelihood = -765.63026
Refining estimates:
Iteration 0:   log pseudolikelihood = -765.63026

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,195             Number of obs    =       3,195
No. of failures      =          142
Time at risk         =       190938
                                                Wald chi2(38)    =       93.12
Log pseudolikelihood =   -765.63026             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 865 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.42275   1.111247     0.45   0.652     .3078172     6.57604
 only 12-18  |   1.223781    1.18977     0.21   0.835     .1820367    8.227139
      mixed  |   2.061162    1.60375     0.93   0.353     .4485478    9.471427
             |
        age1 |   1.021025   .0773381     0.27   0.784       .88016    1.184435
        age2 |    .998605   .3869629    -0.00   0.997      .467251    2.134211
        age3 |    .927967   .7652662    -0.09   0.928       .18432     4.67189
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9022626   .1560252    -0.59   0.552     .6428913    1.266276
             |
   obese4cat |
Obese I ..)  |   1.157015   .2458956     0.69   0.493      .762846    1.754856
Obese II..)  |    .463377   .1845193    -1.93   0.053     .2123153    1.011318
Obese II..)  |   1.533863   .5204367     1.26   0.207     .7888156    2.982618
             |
smoke_nomiss |
     Former  |   4.588197   1.564567     4.47   0.000     2.351711    8.951591
    Current  |   .7282525   .2177005    -1.06   0.289     .4053476    1.308387
             |
         imd |
          4  |   1.383369   .2988394     1.50   0.133     .9058559    2.112599
5 most de..  |   .9507988   .2852149    -0.17   0.866     .5281415    1.711697
             |
tot_adults~h |
          2  |   2.395772   2.306926     0.91   0.364     .3629195    15.81542
          3  |   .6255817   .5602441    -0.52   0.600     .1081395    3.618958
             |
   ethnicity |
Asian or ..  |    1.13379   .3004085     0.47   0.636     .6745255    1.905753
      Other  |   1.161014   .3337396     0.52   0.604     .6609295    2.039482
             |
1.htdiag_o~p |   1.371705   .2462029     1.76   0.078     .9648978    1.950025
1.~y_disease |   .9607197   .2046659    -0.19   0.851     .6327934    1.458584
    1.asthma |   1.598712   .3974318     1.89   0.059     .9821227    2.602404
1.~c_disease |   2.050307   .3791328     3.88   0.000     1.426983    2.945906
             |
     diabcat |
T1DM, con..  |   1.181775      .6392     0.31   0.757     .4093886    3.411409
T1DM, unc..  |   3.63e-20          .        .       .            .           .
T2DM, con..  |   1.294608   .2867012     1.17   0.244     .8387508    1.998222
T2DM, unc..  |   .9292765   .4109193    -0.17   0.868     .3906159    2.210752
Diabetes,..  |   4.51e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.03e-19          .        .       .            .           .
2-5 years..  |   .8640947   .6494431    -0.19   0.846     .1980654    3.769763
   5+ years  |   1.291952   .2535748     1.31   0.192     .8793842    1.898077
             |
cancer_hae~t |
  Last year  |   7.98e-20          .        .       .            .           .
2-5 years..  |   .8536001   .6155448    -0.22   0.826     .2077013    3.508081
   5+ years  |   .6755038   .1698283    -1.56   0.119     .4126933    1.105677
             |
1.~r_disease |   .9550783   .2180035    -0.20   0.840      .610585    1.493936
1.stroke_d~a |   .6732096   .1656256    -1.61   0.108     .4156564     1.09035
1.other_ne~o |   .9698613   .2115698    -0.14   0.888     .6324479    1.487286
             |
reduced_ki~t |
Stage 3a/..  |   1.259454   .4402675     0.66   0.509     .6347867    2.498832
      1.esrd |   1.093805   .1935842     0.51   0.612     .7732008    1.547346
1.other_tr~t |   1.241393   .2425791     1.11   0.268     .8464024    1.820713
  1.asplenia |   .9784566   .2111448    -0.10   0.920     .6409994     1.49357
1.ra_sle_p~s |   .9911091   .2140126    -0.04   0.967     .6491117    1.513295
1.other_im~o |   .9857267   .2078597    -0.07   0.946     .6520247    1.490215
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,195             Number of obs    =       3,195
No. of failures      =          142
Time at risk         =       190938
                                                Wald chi2(38)    =       93.12
Log pseudolikelihood =   -765.63026             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 865 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.42275   1.111247     0.45   0.652     .3078172     6.57604
 only 12-18  |   1.223781    1.18977     0.21   0.835     .1820367    8.227139
      mixed  |   2.061162    1.60375     0.93   0.353     .4485478    9.471427
             |
        age1 |   1.021025   .0773381     0.27   0.784       .88016    1.184435
        age2 |    .998605   .3869629    -0.00   0.997      .467251    2.134211
        age3 |    .927967   .7652662    -0.09   0.928       .18432     4.67189
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9022626   .1560252    -0.59   0.552     .6428913    1.266276
             |
   obese4cat |
Obese I ..)  |   1.157015   .2458956     0.69   0.493      .762846    1.754856
Obese II..)  |    .463377   .1845193    -1.93   0.053     .2123153    1.011318
Obese II..)  |   1.533863   .5204367     1.26   0.207     .7888156    2.982618
             |
smoke_nomiss |
     Former  |   4.588197   1.564567     4.47   0.000     2.351711    8.951591
    Current  |   .7282525   .2177005    -1.06   0.289     .4053476    1.308387
             |
         imd |
          4  |   1.383369   .2988394     1.50   0.133     .9058559    2.112599
5 most de..  |   .9507988   .2852149    -0.17   0.866     .5281415    1.711697
             |
tot_adults~h |
          2  |   2.395772   2.306926     0.91   0.364     .3629195    15.81542
          3  |   .6255817   .5602441    -0.52   0.600     .1081395    3.618958
             |
   ethnicity |
Asian or ..  |    1.13379   .3004085     0.47   0.636     .6745255    1.905753
      Other  |   1.161014   .3337396     0.52   0.604     .6609295    2.039482
             |
1.htdiag_o~p |   1.371705   .2462029     1.76   0.078     .9648978    1.950025
1.~y_disease |   .9607197   .2046659    -0.19   0.851     .6327934    1.458584
    1.asthma |   1.598712   .3974318     1.89   0.059     .9821227    2.602404
1.~c_disease |   2.050307   .3791328     3.88   0.000     1.426983    2.945906
             |
     diabcat |
T1DM, con..  |   1.181775      .6392     0.31   0.757     .4093886    3.411409
T1DM, unc..  |   3.63e-20          .        .       .            .           .
T2DM, con..  |   1.294608   .2867012     1.17   0.244     .8387508    1.998222
T2DM, unc..  |   .9292765   .4109193    -0.17   0.868     .3906159    2.210752
Diabetes,..  |   4.51e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.03e-19          .        .       .            .           .
2-5 years..  |   .8640947   .6494431    -0.19   0.846     .1980654    3.769763
   5+ years  |   1.291952   .2535748     1.31   0.192     .8793842    1.898077
             |
cancer_hae~t |
  Last year  |   7.98e-20          .        .       .            .           .
2-5 years..  |   .8536001   .6155448    -0.22   0.826     .2077013    3.508081
   5+ years  |   .6755038   .1698283    -1.56   0.119     .4126933    1.105677
             |
1.~r_disease |   .9550783   .2180035    -0.20   0.840      .610585    1.493936
1.stroke_d~a |   .6732096   .1656256    -1.61   0.108     .4156564     1.09035
1.other_ne~o |   .9698613   .2115698    -0.14   0.888     .6324479    1.487286
             |
reduced_ki~t |
Stage 3a/..  |   1.259454   .4402675     0.66   0.509     .6347867    2.498832
      1.esrd |   1.093805   .1935842     0.51   0.612     .7732008    1.547346
1.other_tr~t |   1.241393   .2425791     1.11   0.268     .8464024    1.820713
  1.asplenia |   .9784566   .2111448    -0.10   0.920     .6409994     1.49357
1.ra_sle_p~s |   .9911091   .2140126    -0.04   0.967     .6491117    1.513295
1.other_im~o |   .9857267   .2078597    -0.07   0.946     .6520247    1.490215
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod1.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood =  -612.4298
Iteration 1:   log pseudolikelihood = -590.22915
Iteration 2:   log pseudolikelihood = -588.10628
Iteration 3:   log pseudolikelihood = -587.50566
Iteration 4:   log pseudolikelihood = -587.28706
Iteration 5:   log pseudolikelihood = -587.20657
Iteration 6:   log pseudolikelihood = -587.17696
Iteration 7:   log pseudolikelihood = -587.16606
Iteration 8:   log pseudolikelihood = -587.16205
Iteration 9:   log pseudolikelihood = -587.16058
Iteration 10:  log pseudolikelihood = -587.16003
Iteration 11:  log pseudolikelihood = -587.15983
Iteration 12:  log pseudolikelihood = -587.15976
Iteration 13:  log pseudolikelihood = -587.15973
Iteration 14:  log pseudolikelihood = -587.15972
Iteration 15:  log pseudolikelihood = -587.15972
Iteration 16:  log pseudolikelihood = -587.15972
Iteration 17:  log pseudolikelihood = -587.15972
Iteration 18:  log pseudolikelihood = -587.15972
Iteration 19:  log pseudolikelihood = -587.15972
Iteration 20:  log pseudolikelihood = -587.15972
Iteration 21:  log pseudolikelihood = -587.15972
Iteration 22:  log pseudolikelihood = -587.15972
Iteration 23:  log pseudolikelihood = -587.15972
Iteration 24:  log pseudolikelihood = -587.15972
Iteration 25:  log pseudolikelihood = -587.15972
Iteration 26:  log pseudolikelihood = -587.15972
Iteration 27:  log pseudolikelihood = -587.15972
Iteration 28:  log pseudolikelihood = -587.15972
Iteration 29:  log pseudolikelihood = -587.15972
Iteration 30:  log pseudolikelihood = -587.15972
Iteration 31:  log pseudolikelihood = -587.15972
Iteration 32:  log pseudolikelihood = -587.15972
Iteration 33:  log pseudolikelihood = -587.15972
Iteration 34:  log pseudolikelihood = -587.15972
Iteration 35:  log pseudolikelihood = -587.15972
Refining estimates:
Iteration 0:   log pseudolikelihood = -587.15972
Iteration 1:   log pseudolikelihood = -587.15972
Iteration 2:   log pseudolikelihood = -587.15972
Iteration 3:   log pseudolikelihood = -587.15972
Iteration 4:   log pseudolikelihood = -587.15972
Iteration 5:   log pseudolikelihood = -587.15972
Iteration 6:   log pseudolikelihood = -587.15972

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,366             Number of obs    =       2,366
No. of failures      =          115
Time at risk         =       122287
                                                Wald chi2(41)    =    71078.43
Log pseudolikelihood =   -587.15972             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 804 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.569512   2.648173     0.92   0.360     .3408716    19.36914
 only 12-18  |   3.997328   4.454773     1.24   0.214     .4499444    35.51246
      mixed  |   2.126805      2.118     0.76   0.449     .3020303    14.97632
             |
        age1 |   .9527092   .0751096    -0.61   0.539     .8163069    1.111904
        age2 |   1.234599   .5358331     0.49   0.627      .527342    2.890408
        age3 |   .6002854   .5655795    -0.54   0.588     .0947042    3.804929
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9514917   .1723057    -0.27   0.784     .6672074    1.356904
             |
   obese4cat |
Obese I ..)  |   .6670804   .2088111    -1.29   0.196     .3611877    1.232036
Obese II..)  |    1.30943   .3846298     0.92   0.359     .7362944    2.328696
Obese II..)  |   1.045578   .4413921     0.11   0.916     .4571102    2.391621
             |
smoke_nomiss |
     Former  |   1.40e-18   3.40e-19  -169.73   0.000     8.74e-19    2.26e-18
    Current  |   .7121983   .2300281    -1.05   0.293     .3781614    1.341296
             |
         imd |
          4  |   .6331527   .1719109    -1.68   0.092     .3718723    1.078011
5 most de..  |   .6377403   .2259562    -1.27   0.204     .3184613    1.277118
             |
tot_adults~h |
          2  |   .0692166   .0452427    -4.09   0.000     .0192235    .2492234
          3  |   3.53e+16          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .7258806   .2582518    -0.90   0.368     .3614323    1.457818
      Other  |   .9612148   .2907224    -0.13   0.896     .5313392    1.738878
             |
1.htdiag_o~p |   .7682528   .1708904    -1.19   0.236     .4967784     1.18808
1.~y_disease |    .621704   .1661845    -1.78   0.075     .3681743    1.049818
    1.asthma |   .9791037   .3455477    -0.06   0.952     .4902533    1.955405
1.~c_disease |   1.352214   .2823358     1.45   0.148     .8980871    2.035974
             |
     diabcat |
T1DM, con..  |   1.321828   .6815833     0.54   0.588     .4811315    3.631498
T1DM, unc..  |   2.38e-18   1.10e-18   -87.55   0.000     9.59e-19    5.90e-18
T2DM, con..  |   .9261599   .2361414    -0.30   0.764     .5618967    1.526565
T2DM, unc..  |    .921965   .4731107    -0.16   0.874     .3372223     2.52065
Diabetes,..  |   1.11e-18   7.72e-19   -59.52   0.000     2.85e-19    4.34e-18
             |
cancer_exh~t |
  Last year  |   2.560113   2.527582     0.95   0.341     .3697209    17.72737
2-5 years..  |   .4571182   .4667451    -0.77   0.443     .0617875    3.381865
   5+ years  |   .7158159   .2047288    -1.17   0.242     .4086498    1.253867
             |
cancer_hae~t |
  Last year  |   1.51e-18   5.32e-19  -116.25   0.000     7.55e-19    3.01e-18
2-5 years..  |   1.32e-18   3.59e-19  -151.15   0.000     7.73e-19    2.25e-18
   5+ years  |   1.031456   .2465258     0.13   0.897     .6456649    1.647761
             |
1.~r_disease |   1.215044   .2851508     0.83   0.407     .7670597    1.924664
1.stroke_d~a |   .7982329   .1907932    -0.94   0.346     .4996615    1.275215
1.other_ne~o |   1.055714   .2446994     0.23   0.815     .6702703     1.66281
             |
reduced_ki~t |
Stage 3a/..  |   1.608005   .7481052     1.02   0.307     .6460648      4.0022
      1.esrd |   .6952918   .1471666    -1.72   0.086     .4591984    1.052771
1.other_tr~t |   .9154308   .2071099    -0.39   0.696     .5875531    1.426277
  1.asplenia |   .7845412   .2034173    -0.94   0.349     .4719702    1.304118
1.ra_sle_p~s |   1.396965   .3167593     1.47   0.140     .8957296    2.178682
1.other_im~o |   .9072099   .2296463    -0.38   0.700     .5523815    1.489966
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,366             Number of obs    =       2,366
No. of failures      =          115
Time at risk         =       122287
                                                Wald chi2(41)    =    71078.43
Log pseudolikelihood =   -587.15972             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 804 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.569512   2.648173     0.92   0.360     .3408716    19.36914
 only 12-18  |   3.997328   4.454773     1.24   0.214     .4499444    35.51246
      mixed  |   2.126805      2.118     0.76   0.449     .3020303    14.97632
             |
        age1 |   .9527092   .0751096    -0.61   0.539     .8163069    1.111904
        age2 |   1.234599   .5358331     0.49   0.627      .527342    2.890408
        age3 |   .6002854   .5655795    -0.54   0.588     .0947042    3.804929
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9514917   .1723057    -0.27   0.784     .6672074    1.356904
             |
   obese4cat |
Obese I ..)  |   .6670804   .2088111    -1.29   0.196     .3611877    1.232036
Obese II..)  |    1.30943   .3846298     0.92   0.359     .7362944    2.328696
Obese II..)  |   1.045578   .4413921     0.11   0.916     .4571102    2.391621
             |
smoke_nomiss |
     Former  |   1.40e-18   3.40e-19  -169.73   0.000     8.74e-19    2.26e-18
    Current  |   .7121983   .2300281    -1.05   0.293     .3781614    1.341296
             |
         imd |
          4  |   .6331527   .1719109    -1.68   0.092     .3718723    1.078011
5 most de..  |   .6377403   .2259562    -1.27   0.204     .3184613    1.277118
             |
tot_adults~h |
          2  |   .0692166   .0452427    -4.09   0.000     .0192235    .2492234
          3  |   3.53e+16          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .7258806   .2582518    -0.90   0.368     .3614323    1.457818
      Other  |   .9612148   .2907224    -0.13   0.896     .5313392    1.738878
             |
1.htdiag_o~p |   .7682528   .1708904    -1.19   0.236     .4967784     1.18808
1.~y_disease |    .621704   .1661845    -1.78   0.075     .3681743    1.049818
    1.asthma |   .9791037   .3455477    -0.06   0.952     .4902533    1.955405
1.~c_disease |   1.352214   .2823358     1.45   0.148     .8980871    2.035974
             |
     diabcat |
T1DM, con..  |   1.321828   .6815833     0.54   0.588     .4811315    3.631498
T1DM, unc..  |   2.38e-18   1.10e-18   -87.55   0.000     9.59e-19    5.90e-18
T2DM, con..  |   .9261599   .2361414    -0.30   0.764     .5618967    1.526565
T2DM, unc..  |    .921965   .4731107    -0.16   0.874     .3372223     2.52065
Diabetes,..  |   1.11e-18   7.72e-19   -59.52   0.000     2.85e-19    4.34e-18
             |
cancer_exh~t |
  Last year  |   2.560113   2.527582     0.95   0.341     .3697209    17.72737
2-5 years..  |   .4571182   .4667451    -0.77   0.443     .0617875    3.381865
   5+ years  |   .7158159   .2047288    -1.17   0.242     .4086498    1.253867
             |
cancer_hae~t |
  Last year  |   1.51e-18   5.32e-19  -116.25   0.000     7.55e-19    3.01e-18
2-5 years..  |   1.32e-18   3.59e-19  -151.15   0.000     7.73e-19    2.25e-18
   5+ years  |   1.031456   .2465258     0.13   0.897     .6456649    1.647761
             |
1.~r_disease |   1.215044   .2851508     0.83   0.407     .7670597    1.924664
1.stroke_d~a |   .7982329   .1907932    -0.94   0.346     .4996615    1.275215
1.other_ne~o |   1.055714   .2446994     0.23   0.815     .6702703     1.66281
             |
reduced_ki~t |
Stage 3a/..  |   1.608005   .7481052     1.02   0.307     .6460648      4.0022
      1.esrd |   .6952918   .1471666    -1.72   0.086     .4591984    1.052771
1.other_tr~t |   .9154308   .2071099    -0.39   0.696     .5875531    1.426277
  1.asplenia |   .7845412   .2034173    -0.94   0.349     .4719702    1.304118
1.ra_sle_p~s |   1.396965   .3167593     1.47   0.140     .8957296    2.178682
1.other_im~o |   .9072099   .2296463    -0.38   0.700     .5523815    1.489966
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod2.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -352.69518
Iteration 1:   log pseudolikelihood = -351.04755
Iteration 2:   log pseudolikelihood = -327.03391
Iteration 3:   log pseudolikelihood = -326.11893
Iteration 4:   log pseudolikelihood = -325.84669
Iteration 5:   log pseudolikelihood = -325.74609
Iteration 6:   log pseudolikelihood = -325.70899
Iteration 7:   log pseudolikelihood = -325.69533
Iteration 8:   log pseudolikelihood = -325.69031
Iteration 9:   log pseudolikelihood = -325.68846
Iteration 10:  log pseudolikelihood = -325.68778
Iteration 11:  log pseudolikelihood = -325.68753
Iteration 12:  log pseudolikelihood = -325.68744
Iteration 13:  log pseudolikelihood =  -325.6874
Iteration 14:  log pseudolikelihood = -325.68739
Iteration 15:  log pseudolikelihood = -325.68738
Iteration 16:  log pseudolikelihood = -325.68738
Iteration 17:  log pseudolikelihood = -325.68738
Iteration 18:  log pseudolikelihood = -325.68738
Iteration 19:  log pseudolikelihood = -325.68738
Iteration 20:  log pseudolikelihood = -325.68738
Iteration 21:  log pseudolikelihood = -325.68738
Iteration 22:  log pseudolikelihood = -325.68738
Iteration 23:  log pseudolikelihood = -325.68738
Iteration 24:  log pseudolikelihood = -325.68738
Iteration 25:  log pseudolikelihood = -325.68738
Iteration 26:  log pseudolikelihood = -325.68738
Iteration 27:  log pseudolikelihood = -325.68738
Iteration 28:  log pseudolikelihood = -325.68738
Iteration 29:  log pseudolikelihood = -325.68738
Iteration 30:  log pseudolikelihood = -325.68738
Iteration 31:  log pseudolikelihood = -325.68738
Iteration 32:  log pseudolikelihood = -325.68738
Iteration 33:  log pseudolikelihood = -325.68738
Iteration 34:  log pseudolikelihood = -325.68738
Iteration 35:  log pseudolikelihood = -325.68738
Iteration 36:  log pseudolikelihood = -325.68738
Iteration 37:  log pseudolikelihood = -325.68738
Iteration 38:  log pseudolikelihood = -325.68738
Iteration 39:  log pseudolikelihood = -325.68738
Iteration 40:  log pseudolikelihood = -325.68738
Refining estimates:
Iteration 0:   log pseudolikelihood = -325.68738
Iteration 1:   log pseudolikelihood = -325.68738

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,648             Number of obs    =       1,648
No. of failures      =           71
Time at risk         =        66414
                                                Wald chi2(41)    =    41693.17
Log pseudolikelihood =   -325.68738             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 706 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.37e+09   1.02e+09    28.24   0.000     3.18e+08    5.90e+09
 only 12-18  |   2.99e+09          .        .       .            .           .
      mixed  |   1.15e+09   7.82e+08    30.60   0.000     3.02e+08    4.36e+09
             |
        age1 |   1.249181   .1414439     1.96   0.049     1.000563    1.559576
        age2 |   .4006707   .2275577    -1.61   0.107     .1316299    1.219609
        age3 |   5.652649   6.766033     1.45   0.148     .5412425    59.03534
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.100138   .2762251     0.38   0.704     .6725518     1.79957
             |
   obese4cat |
Obese I ..)  |   1.122001   .4047845     0.32   0.750     .5532291    2.275524
Obese II..)  |   1.046792   .4977467     0.10   0.923     .4122078    2.658303
Obese II..)  |   3.215873   1.373462     2.74   0.006      1.39239    7.427405
             |
smoke_nomiss |
     Former  |   1.15e-18   7.39e-19   -64.17   0.000     3.25e-19    4.05e-18
    Current  |   .9378314   .3546721    -0.17   0.865     .4469044    1.968045
             |
         imd |
          4  |   .4526275   .1550675    -2.31   0.021     .2312727    .8858444
5 most de..  |   .3220824    .187265    -1.95   0.051     .1030533    1.006635
             |
tot_adults~h |
          2  |   5.97e-19   7.76e-19   -32.30   0.000     4.68e-20    7.62e-18
          3  |   .1844449   .2167059    -1.44   0.150     .0184409    1.844806
             |
   ethnicity |
Asian or ..  |   1.276788   .4933986     0.63   0.527     .5986637    2.723046
      Other  |   .9515256   .3894048    -0.12   0.903     .4266508    2.122112
             |
1.htdiag_o~p |   1.005525   .2539607     0.02   0.983     .6129269    1.649593
1.~y_disease |   .9465948   .2685203    -0.19   0.847     .5428802    1.650533
    1.asthma |    1.44918   .5957119     0.90   0.367     .6474711    3.243578
1.~c_disease |   1.214733   .3597115     0.66   0.511     .6798599    2.170411
             |
     diabcat |
T1DM, con..  |     .35553   .3893033    -0.94   0.345     .0415734    3.040445
T1DM, unc..  |   1.06e-18   8.14e-19   -54.09   0.000     2.38e-19    4.77e-18
T2DM, con..  |   .6372811   .2437125    -1.18   0.239     .3011688    1.348504
T2DM, unc..  |   .7071273   .4689303    -0.52   0.601     .1927634    2.594003
Diabetes,..  |   2.60e-18   1.92e-18   -54.72   0.000     6.09e-19    1.11e-17
             |
cancer_exh~t |
  Last year  |   32.04517   23.17077     4.80   0.000     7.767616    132.2018
2-5 years..  |   1.534344   1.090564     0.60   0.547     .3809911    6.179174
   5+ years  |   .9505517   .3281395    -0.15   0.883     .4832067    1.869901
             |
cancer_hae~t |
  Last year  |   2.25e-18   1.14e-18   -80.08   0.000     8.32e-19    6.08e-18
2-5 years..  |   1.70e-18   6.29e-19  -110.70   0.000     8.24e-19    3.51e-18
   5+ years  |   1.170244   .3765316     0.49   0.625      .622871    2.198642
             |
1.~r_disease |   .5817049   .1973633    -1.60   0.110       .29916    1.131103
1.stroke_d~a |   1.135914   .3299152     0.44   0.661     .6428682    2.007098
1.other_ne~o |   .6129259   .2123376    -1.41   0.158     .3108307    1.208626
             |
reduced_ki~t |
Stage 3a/..  |   .7628685   .5782926    -0.36   0.721     .1726618    3.370568
      1.esrd |   .9210703   .2398199    -0.32   0.752      .552923    1.534337
1.other_tr~t |   1.054331   .3381737     0.16   0.869     .5622852    1.976958
  1.asplenia |   .6206546   .2159074    -1.37   0.170     .3138645     1.22732
1.ra_sle_p~s |   .9029913   .2903203    -0.32   0.751      .480855    1.695716
1.other_im~o |    .956293   .3076373    -0.14   0.890      .509051    1.796473
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,648             Number of obs    =       1,648
No. of failures      =           71
Time at risk         =        66414
                                                Wald chi2(41)    =    41693.17
Log pseudolikelihood =   -325.68738             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 706 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.37e+09   1.02e+09    28.24   0.000     3.18e+08    5.90e+09
 only 12-18  |   2.99e+09          .        .       .            .           .
      mixed  |   1.15e+09   7.82e+08    30.60   0.000     3.02e+08    4.36e+09
             |
        age1 |   1.249181   .1414439     1.96   0.049     1.000563    1.559576
        age2 |   .4006707   .2275577    -1.61   0.107     .1316299    1.219609
        age3 |   5.652649   6.766033     1.45   0.148     .5412425    59.03534
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.100138   .2762251     0.38   0.704     .6725518     1.79957
             |
   obese4cat |
Obese I ..)  |   1.122001   .4047845     0.32   0.750     .5532291    2.275524
Obese II..)  |   1.046792   .4977467     0.10   0.923     .4122078    2.658303
Obese II..)  |   3.215873   1.373462     2.74   0.006      1.39239    7.427405
             |
smoke_nomiss |
     Former  |   1.15e-18   7.39e-19   -64.17   0.000     3.25e-19    4.05e-18
    Current  |   .9378314   .3546721    -0.17   0.865     .4469044    1.968045
             |
         imd |
          4  |   .4526275   .1550675    -2.31   0.021     .2312727    .8858444
5 most de..  |   .3220824    .187265    -1.95   0.051     .1030533    1.006635
             |
tot_adults~h |
          2  |   5.97e-19   7.76e-19   -32.30   0.000     4.68e-20    7.62e-18
          3  |   .1844449   .2167059    -1.44   0.150     .0184409    1.844806
             |
   ethnicity |
Asian or ..  |   1.276788   .4933986     0.63   0.527     .5986637    2.723046
      Other  |   .9515256   .3894048    -0.12   0.903     .4266508    2.122112
             |
1.htdiag_o~p |   1.005525   .2539607     0.02   0.983     .6129269    1.649593
1.~y_disease |   .9465948   .2685203    -0.19   0.847     .5428802    1.650533
    1.asthma |    1.44918   .5957119     0.90   0.367     .6474711    3.243578
1.~c_disease |   1.214733   .3597115     0.66   0.511     .6798599    2.170411
             |
     diabcat |
T1DM, con..  |     .35553   .3893033    -0.94   0.345     .0415734    3.040445
T1DM, unc..  |   1.06e-18   8.14e-19   -54.09   0.000     2.38e-19    4.77e-18
T2DM, con..  |   .6372811   .2437125    -1.18   0.239     .3011688    1.348504
T2DM, unc..  |   .7071273   .4689303    -0.52   0.601     .1927634    2.594003
Diabetes,..  |   2.60e-18   1.92e-18   -54.72   0.000     6.09e-19    1.11e-17
             |
cancer_exh~t |
  Last year  |   32.04517   23.17077     4.80   0.000     7.767616    132.2018
2-5 years..  |   1.534344   1.090564     0.60   0.547     .3809911    6.179174
   5+ years  |   .9505517   .3281395    -0.15   0.883     .4832067    1.869901
             |
cancer_hae~t |
  Last year  |   2.25e-18   1.14e-18   -80.08   0.000     8.32e-19    6.08e-18
2-5 years..  |   1.70e-18   6.29e-19  -110.70   0.000     8.24e-19    3.51e-18
   5+ years  |   1.170244   .3765316     0.49   0.625      .622871    2.198642
             |
1.~r_disease |   .5817049   .1973633    -1.60   0.110       .29916    1.131103
1.stroke_d~a |   1.135914   .3299152     0.44   0.661     .6428682    2.007098
1.other_ne~o |   .6129259   .2123376    -1.41   0.158     .3108307    1.208626
             |
reduced_ki~t |
Stage 3a/..  |   .7628685   .5782926    -0.36   0.721     .1726618    3.370568
      1.esrd |   .9210703   .2398199    -0.32   0.752      .552923    1.534337
1.other_tr~t |   1.054331   .3381737     0.16   0.869     .5622852    1.976958
  1.asplenia |   .6206546   .2159074    -1.37   0.170     .3138645     1.22732
1.ra_sle_p~s |   .9029913   .2903203    -0.32   0.751      .480855    1.695716
1.other_im~o |    .956293   .3076373    -0.14   0.890      .509051    1.796473
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod3.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod3.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -130.67699
Iteration 1:   log pseudolikelihood = -114.98221
Iteration 2:   log pseudolikelihood = -110.80382
Iteration 3:   log pseudolikelihood = -110.39682
Iteration 4:   log pseudolikelihood = -110.30061
Iteration 5:   log pseudolikelihood = -110.26618
Iteration 6:   log pseudolikelihood = -110.25353
Iteration 7:   log pseudolikelihood = -110.24888
Iteration 8:   log pseudolikelihood = -110.24717
Iteration 9:   log pseudolikelihood = -110.24654
Iteration 10:  log pseudolikelihood = -110.24631
Iteration 11:  log pseudolikelihood = -110.24622
Iteration 12:  log pseudolikelihood = -110.24619
Iteration 13:  log pseudolikelihood = -110.24618
Iteration 14:  log pseudolikelihood = -110.24618
Iteration 15:  log pseudolikelihood = -110.24618
Iteration 16:  log pseudolikelihood = -110.24618
Iteration 17:  log pseudolikelihood = -110.24618
Iteration 18:  log pseudolikelihood = -110.24618
Iteration 19:  log pseudolikelihood = -110.24617
Iteration 20:  log pseudolikelihood = -110.24617
Iteration 21:  log pseudolikelihood = -110.24617
Iteration 22:  log pseudolikelihood = -110.24617
Iteration 23:  log pseudolikelihood = -110.24617
Iteration 24:  log pseudolikelihood = -110.24617
Iteration 25:  log pseudolikelihood = -110.24617
Iteration 26:  log pseudolikelihood = -110.24617
Iteration 27:  log pseudolikelihood = -110.24617
Iteration 28:  log pseudolikelihood = -110.24617
Iteration 29:  log pseudolikelihood = -110.24617
Iteration 30:  log pseudolikelihood = -110.24617
Iteration 31:  log pseudolikelihood = -110.24617
Iteration 32:  log pseudolikelihood = -110.24617
Iteration 33:  log pseudolikelihood = -110.24617
Iteration 34:  log pseudolikelihood = -110.24617
Iteration 35:  log pseudolikelihood = -110.24617
Iteration 36:  log pseudolikelihood = -110.24617
Iteration 37:  log pseudolikelihood = -110.24617
Iteration 38:  log pseudolikelihood = -110.24617
Iteration 39:  log pseudolikelihood = -110.24617
Iteration 40:  log pseudolikelihood = -110.24617
Iteration 41:  log pseudolikelihood = -110.24617
Iteration 42:  log pseudolikelihood = -110.24617
Iteration 43:  log pseudolikelihood = -110.24617
Iteration 44:  log pseudolikelihood = -110.24617
Refining estimates:
Iteration 0:   log pseudolikelihood = -110.24617
Iteration 1:   log pseudolikelihood = -110.24617

Stratified Cox regr. -- no ties

No. of subjects      =        1,108             Number of obs    =       1,108
No. of failures      =           29
Time at risk         =        33205
                                                Wald chi2(32)    =      104.95
Log pseudolikelihood =   -110.24617             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 593 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5041216   .5338236    -0.65   0.518     .0632677    4.016874
 only 12-18  |   2.54e-20          .        .       .            .           .
      mixed  |   .4102533   .4071906    -0.90   0.369     .0586415    2.870113
             |
        age1 |   .8441898   .1681398    -0.85   0.395      .571352    1.247316
        age2 |   2.546004   2.566208     0.93   0.354     .3531041    18.35758
        age3 |   .1451553   .3050924    -0.92   0.359     .0023591    8.931359
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.060695   .3824532     0.16   0.870     .5232076    2.150339
             |
   obese4cat |
Obese I ..)  |   .7068844   .4464194    -0.55   0.583     .2050162    2.437298
Obese II..)  |    .989868   .6452695    -0.02   0.988     .2758677    3.551842
Obese II..)  |    1.25319   1.103542     0.26   0.798     .2230801    7.040009
             |
smoke_nomiss |
     Former  |   3.92e-20          .        .       .            .           .
    Current  |   .5386601   .3870583    -0.86   0.389     .1317278    2.202684
             |
         imd |
          4  |   1.571662   .6806959     1.04   0.297       .67251    3.672987
5 most de..  |   .7222894   .5217749    -0.45   0.652     .1753119     2.97585
             |
tot_adults~h |
          2  |   .0028534          .        .       .            .           .
          3  |   3.88e+16          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .2768988   .2560621    -1.39   0.165     .0452036    1.696171
      Other  |   1.192587   .6500603     0.32   0.747      .409745    3.471095
             |
1.htdiag_o~p |   1.374416   .5151111     0.85   0.396     .6593259    2.865076
1.~y_disease |   .8230715   .3827376    -0.42   0.675     .3308409    2.047651
    1.asthma |   3.539847   2.230624     2.01   0.045     1.029443    12.17213
1.~c_disease |   .9129587   .4788944    -0.17   0.862     .3265514    2.552412
             |
     diabcat |
T1DM, con..  |   .7092089   .4648952    -0.52   0.600     .1962461    2.562993
T1DM, unc..  |   2.86e-19          .        .       .            .           .
T2DM, con..  |   .4105926   .3119423    -1.17   0.241     .0926237     1.82012
T2DM, unc..  |   4.222778   2.514985     2.42   0.016     1.314144    13.56918
Diabetes,..  |   9.66e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   8.69e-19          .        .       .            .           .
2-5 years..  |   1.54e-19          .        .       .            .           .
   5+ years  |    1.08621   .6033046     0.15   0.882     .3657111    3.226188
             |
cancer_hae~t |
  Last year  |    5.09103   5.570334     1.49   0.137     .5963019    43.46554
2-5 years..  |   1.55e-19          .        .       .            .           .
   5+ years  |   .8115501   .4459536    -0.38   0.704     .2764222    2.382636
             |
1.~r_disease |    1.25556   .6967241     0.41   0.682      .423152    3.725449
1.stroke_d~a |   1.599804   .6797379     1.11   0.269     .6956663    3.679021
1.other_ne~o |   2.213424   .9531331     1.85   0.065     .9517536    5.147597
             |
reduced_ki~t |
Stage 3a/..  |   6.04e-20          .        .       .            .           .
      1.esrd |   1.191569   .5055999     0.41   0.680      .518731    2.737135
1.other_tr~t |   .4478933   .3163962    -1.14   0.256     .1121702    1.788428
  1.asplenia |   .2787851   .2132094    -1.67   0.095     .0622712    1.248107
1.ra_sle_p~s |   2.372403   1.108059     1.85   0.064      .949784     5.92587
1.other_im~o |   .3721434   .2756132    -1.33   0.182     .0871569    1.588981
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects      =        1,108             Number of obs    =       1,108
No. of failures      =           29
Time at risk         =        33205
                                                Wald chi2(32)    =      104.95
Log pseudolikelihood =   -110.24617             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 593 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5041216   .5338236    -0.65   0.518     .0632677    4.016874
 only 12-18  |   2.54e-20          .        .       .            .           .
      mixed  |   .4102533   .4071906    -0.90   0.369     .0586415    2.870113
             |
        age1 |   .8441898   .1681398    -0.85   0.395      .571352    1.247316
        age2 |   2.546004   2.566208     0.93   0.354     .3531041    18.35758
        age3 |   .1451553   .3050924    -0.92   0.359     .0023591    8.931359
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.060695   .3824532     0.16   0.870     .5232076    2.150339
             |
   obese4cat |
Obese I ..)  |   .7068844   .4464194    -0.55   0.583     .2050162    2.437298
Obese II..)  |    .989868   .6452695    -0.02   0.988     .2758677    3.551842
Obese II..)  |    1.25319   1.103542     0.26   0.798     .2230801    7.040009
             |
smoke_nomiss |
     Former  |   3.92e-20          .        .       .            .           .
    Current  |   .5386601   .3870583    -0.86   0.389     .1317278    2.202684
             |
         imd |
          4  |   1.571662   .6806959     1.04   0.297       .67251    3.672987
5 most de..  |   .7222894   .5217749    -0.45   0.652     .1753119     2.97585
             |
tot_adults~h |
          2  |   .0028534          .        .       .            .           .
          3  |   3.88e+16          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .2768988   .2560621    -1.39   0.165     .0452036    1.696171
      Other  |   1.192587   .6500603     0.32   0.747      .409745    3.471095
             |
1.htdiag_o~p |   1.374416   .5151111     0.85   0.396     .6593259    2.865076
1.~y_disease |   .8230715   .3827376    -0.42   0.675     .3308409    2.047651
    1.asthma |   3.539847   2.230624     2.01   0.045     1.029443    12.17213
1.~c_disease |   .9129587   .4788944    -0.17   0.862     .3265514    2.552412
             |
     diabcat |
T1DM, con..  |   .7092089   .4648952    -0.52   0.600     .1962461    2.562993
T1DM, unc..  |   2.86e-19          .        .       .            .           .
T2DM, con..  |   .4105926   .3119423    -1.17   0.241     .0926237     1.82012
T2DM, unc..  |   4.222778   2.514985     2.42   0.016     1.314144    13.56918
Diabetes,..  |   9.66e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   8.69e-19          .        .       .            .           .
2-5 years..  |   1.54e-19          .        .       .            .           .
   5+ years  |    1.08621   .6033046     0.15   0.882     .3657111    3.226188
             |
cancer_hae~t |
  Last year  |    5.09103   5.570334     1.49   0.137     .5963019    43.46554
2-5 years..  |   1.55e-19          .        .       .            .           .
   5+ years  |   .8115501   .4459536    -0.38   0.704     .2764222    2.382636
             |
1.~r_disease |    1.25556   .6967241     0.41   0.682      .423152    3.725449
1.stroke_d~a |   1.599804   .6797379     1.11   0.269     .6956663    3.679021
1.other_ne~o |   2.213424   .9531331     1.85   0.065     .9517536    5.147597
             |
reduced_ki~t |
Stage 3a/..  |   6.04e-20          .        .       .            .           .
      1.esrd |   1.191569   .5055999     0.41   0.680      .518731    2.737135
1.other_tr~t |   .4478933   .3163962    -1.14   0.256     .1121702    1.788428
  1.asplenia |   .2787851   .2132094    -1.67   0.095     .0622712    1.248107
1.ra_sle_p~s |   2.372403   1.108059     1.85   0.064      .949784     5.92587
1.other_im~o |   .3721434   .2756132    -1.33   0.182     .0871569    1.588981
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod4.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission.log
  log type:  text
 closed on:  28 Oct 2021, 11:30:56
-------------------------------------------------------------------------------
