-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death.log
  log type:  text
 opened on:  25 Jul 2021, 08:10:58

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. forvalues period=0/3 {
  3. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  4. stsplit cat_time, at(0,78,147,400)
  5. recode cat_time 78=1 147=2 400=3
  6. recode `outcome' .=0 
  7. tab cat_time
  8. tab cat_time `outcome'
  9. 
. keep if cat_time==`period'
 10. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 11. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 12. if _rc==0{
 13. estimates
 14. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 15.         *  Proportional Hazards test 
.         * Based on Schoenfeld residuals 
.         timer clear 
 16.         timer on 1
 17.         if e(N_fail)>0 estat phtest, d
 18.         timer off 1
 19.         timer list 
 20.         
. }
 21. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 22. 
. }
 23. 
. foreach exposure_type in  gp_number_kids {
 24. *Age spline model (not adj ethnicity)
. cap erase "./output/an_multivariate_cox_models_`outcome'_`exposure_type'_FULL
> YADJMODEL_ageband_`x'"
 25. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 26. if _rc==0{
 27. estimates
 28. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 29. }
 30. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 31. 
. }
 32. }
 33. }
(18,407 observations (episodes) created)
(cat_time: 18407 changes made)
(covid_death: 18407 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       46.51       46.51
          1 |     11,270       32.75       79.26
          2 |      7,137       20.74      100.00
------------+-----------------------------------
      Total |     34,412      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,190      2,815 |    16,005 
         1 |     8,752      2,518 |    11,270 
         2 |     4,998      2,139 |     7,137 
-----------+----------------------+----------
     Total |    26,940      7,472 |    34,412 
(18,409 observations deleted)
   1:      8.12 /        1 =       8.1230

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,005             Number of obs    =      16,005
No. of failures      =        2,815
Time at risk         =      1066391
                                                Wald chi2(42)    =     8328.23
Log pseudolikelihood =   -20283.849             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,113 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.123627   .1757579     0.75   0.456     .8269462    1.526748
 only 12-18  |   1.264061   .2532282     1.17   0.242     .8535866    1.871925
      mixed  |   1.157135   .1705107     0.99   0.322     .8668709    1.544591
             |
        age1 |   .9883503   .0070223    -1.65   0.099     .9746822     1.00221
        age2 |   1.025396   .0230591     1.12   0.265     .9811822    1.071602
        age3 |    .948218   .0607046    -0.83   0.406     .8364009    1.074984
      1.male |   .9789013   .0353103    -0.59   0.554     .9120841    1.050613
             |
   obese4cat |
Obese I ..)  |   .9627545   .0526978    -0.69   0.488     .8648161    1.071784
Obese II..)  |   .9645361   .0697542    -0.50   0.618     .8370675    1.111416
Obese II..)  |   .9042913   .0786621    -1.16   0.247     .7625431    1.072389
             |
smoke_nomiss |
     Former  |   .9056028   .1397021    -0.64   0.520     .6693109    1.225315
    Current  |   1.011683   .0575171     0.20   0.838     .9050055    1.130935
             |
         imd |
          4  |   1.045394   .0477376     0.97   0.331      .955895    1.143273
5 most de..  |   .9868868   .0623174    -0.21   0.834     .8720027    1.116907
             |
tot_adults~h |
          2  |   .9581955   .3186971    -0.13   0.898      .499279    1.838929
          3  |   .8641733   .2387317    -0.53   0.597     .5028664    1.485077
             |
   ethnicity |
Asian or ..  |   1.057656    .065957     0.90   0.369     .9359704    1.195161
      Other  |   1.038379    .064477     0.61   0.544     .9193941    1.172764
             |
1.htdiag_o~p |   1.007194   .0715036     0.10   0.920     .8763625    1.157557
1.~y_disease |   1.048213   .0494694     1.00   0.318     .9556041    1.149797
    1.asthma |   1.088781   .0743244     1.25   0.213     .9524328    1.244649
1.~c_disease |   .9422584   .0454995    -1.23   0.218      .857171    1.035792
             |
     diabcat |
T1DM, con..  |    1.09509   .1191284     0.84   0.404     .8848157    1.355336
T1DM, unc..  |   .6425928   .2175401    -1.31   0.191     .3309592    1.247663
T2DM, con..  |   1.076643   .0545206     1.46   0.145     .9749167    1.188985
T2DM, unc..  |   .9303265   .1026277    -0.65   0.513     .7494389    1.154874
Diabetes,..  |   9.18e-14   3.18e-14   -86.73   0.000     4.66e-14    1.81e-13
             |
cancer_exh~t |
  Last year  |   1.267575   .3606243     0.83   0.405     .7257837    2.213808
2-5 years..  |   1.144828     .16806     0.92   0.357     .8585869    1.526497
   5+ years  |   1.009611   .0502282     0.19   0.848     .9158129    1.113016
             |
cancer_hae~t |
  Last year  |   1.744502    .436374     2.22   0.026     1.068439    2.848349
2-5 years..  |   .8343318   .1479157    -1.02   0.307     .5894301    1.180988
   5+ years  |   .9785461   .0499787    -0.42   0.671      .885333    1.081573
             |
1.~r_disease |   .9838565   .0462466    -0.35   0.729     .8972648    1.078805
1.stroke_d~a |    1.02402   .0497211     0.49   0.625     .9310622     1.12626
1.other_ne~o |   .9207543   .0436449    -1.74   0.082     .8390653    1.010396
             |
reduced_ki~t |
Stage 3a/..  |    .376908   .1667226    -2.21   0.027     .1583844    .8969296
      1.esrd |   1.039437   .0411282     0.98   0.328     .9618733    1.123254
1.other_tr~t |   .9335264   .0444311    -1.45   0.148     .8503815    1.024801
  1.asplenia |    1.01462   .0466071     0.32   0.752     .9272636    1.110207
1.ra_sle_p~s |   .9644548   .0467583    -0.75   0.455     .8770295    1.060595
1.other_im~o |   .9868796   .0457254    -0.29   0.776     .9012083    1.080695
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.00296         0.03        1         0.8706
      2.kids_cat4 |     -0.02294         1.62        1         0.2031
      3.kids_cat4 |     -0.00362         0.04        1         0.8418
      age1        |      0.00285         0.03        1         0.8700
      age2        |      0.00302         0.03        1         0.8633
      age3        |     -0.00621         0.12        1         0.7255
      0b.male     |            .            .        1             .
      1.male      |     -0.02408         1.63        1         0.2013
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.01136         0.38        1         0.5392
      3.obese4cat |      0.01180         0.48        1         0.4893
      4.obese4cat |     -0.02344         1.67        1         0.1957
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00276         0.03        1         0.8697
      3.smoke_no~s|      0.01214         0.43        1         0.5129
      1b.imd      |            .            .        1             .
      4.imd       |      0.01620         0.76        1         0.3846
      5.imd       |     -0.01407         0.62        1         0.4314
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.01347         0.52        1         0.4702
      3.tot_adul~h|     -0.01880         1.04        1         0.3088
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.00884         0.24        1         0.6277
      5.ethnicity |      0.01071         0.35        1         0.5543
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.00346         0.04        1         0.8465
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.01456         0.68        1         0.4111
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.01705         0.91        1         0.3411
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00697         0.15        1         0.6968
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.00839         0.20        1         0.6579
      3.diabcat   |     -0.02851         2.48        1         0.1154
      4.diabcat   |     -0.00040         0.00        1         0.9826
      5.diabcat   |     -0.03092         3.04        1         0.0814
      6.diabcat   |     -0.00816         0.02        1         0.8864
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.01455         0.65        1         0.4210
      3.cancer_e~t|     -0.03360         3.78        1         0.0517
      4.cancer_e~t|      0.00440         0.06        1         0.8071
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.01348         0.54        1         0.4642
      3.cancer_h~t|     -0.03200         3.29        1         0.0696
      4.cancer_h~t|      0.00144         0.01        1         0.9353
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.00225         0.02        1         0.9023
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01342         0.60        1         0.4373
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.00021         0.00        1         0.9912
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|      0.02922         2.60        1         0.1067
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.01945         1.20        1         0.2742
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00939         0.26        1         0.6108
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.01184         0.40        1         0.5250
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.01345         0.57        1         0.4500
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.02002         1.15        1         0.2841
      ------------+---------------------------------------------------
      global test |                     33.92       42         0.8084
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:     11.18 /        1 =      11.1830
   1:      1.52 /        1 =       1.5180

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,561             Number of obs    =       1,561
No. of failures      =          271
Time at risk         =       104849
                                                Wald chi2(41)    =    14774.83
Log pseudolikelihood =   -1303.1979             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 199 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.008958   .1930253     0.05   0.963     .6934714    1.467972
3 childre..  |   .8955938   .1676292    -0.59   0.556     .6205701    1.292502
4+ childr..  |   .9555235   .1470686    -0.30   0.768     .7066908    1.291973
             |
        age1 |   .9692479   .0227906    -1.33   0.184     .9255928    1.014962
        age2 |   1.108145   .0845118     1.35   0.178       .95429    1.286805
        age3 |    .743895   .1668493    -1.32   0.187     .4792857    1.154593
      1.male |   .9114514   .1065888    -0.79   0.428     .7247539    1.146242
             |
   obese4cat |
Obese I ..)  |   1.129479   .2049673     0.67   0.502     .7914251     1.61193
Obese II..)  |    1.33743   .2774776     1.40   0.161     .8905772    2.008494
Obese II..)  |   1.019001   .2804216     0.07   0.945     .5941967    1.747507
             |
smoke_nomiss |
     Former  |   1.019049   .6664286     0.03   0.977     .2828356    3.671608
    Current  |    1.11061   .1823365     0.64   0.523     .8050336    1.532178
             |
         imd |
          4  |   1.264985   .2124079     1.40   0.162      .910243    1.757978
5 most de..  |   1.244177    .236094     1.15   0.250     .8577464    1.804702
             |
tot_adults~h |
          2  |   .6888178   .4949427    -0.52   0.604     .1684545    2.816607
          3  |   .4931805   .3019426    -1.15   0.248     .1485491    1.637351
             |
   ethnicity |
Asian or ..  |   1.349305   .2829549     1.43   0.153     .8945605    2.035217
      Other  |   1.249953   .2324359     1.20   0.230     .8681761    1.799614
             |
1.htdiag_o~p |   .8302907   .1749895    -0.88   0.378     .5493303    1.254951
1.~y_disease |   1.234563   .1920071     1.35   0.175     .9101838    1.674548
    1.asthma |   1.444354   .2942908     1.80   0.071      .968811    2.153318
1.~c_disease |   .6050537   .1093099    -2.78   0.005     .4246338    .8621309
             |
     diabcat |
T1DM, con..  |   1.010737   .3511554     0.03   0.975     .5115752    1.996949
T1DM, unc..  |   1.78e-15   9.43e-16   -64.24   0.000     6.33e-16    5.03e-15
T2DM, con..  |   .9802816   .1681677    -0.12   0.908      .700369    1.372065
T2DM, unc..  |   1.279709   .3581538     0.88   0.378     .7394081    2.214818
             |
cancer_exh~t |
  Last year  |   2.009168   1.450154     0.97   0.334     .4882537    8.267741
2-5 years..  |   .9092985   .5056612    -0.17   0.864     .3057405    2.704332
   5+ years  |   1.112294    .183343     0.65   0.519     .8052182    1.536477
             |
cancer_hae~t |
  Last year  |   9.30e-16   1.07e-15   -30.05   0.000     9.74e-17    8.89e-15
2-5 years..  |   2.330182   1.009135     1.95   0.051     .9971464    5.445287
   5+ years  |   1.091397   .1532362     0.62   0.533     .8288408    1.437125
             |
1.~r_disease |   1.039149   .1709281     0.23   0.815     .7527742    1.434467
1.stroke_d~a |   .9040922    .155638    -0.59   0.558     .6451783     1.26691
1.other_ne~o |   .7607885   .1413487    -1.47   0.141     .5285879    1.094991
             |
reduced_ki~t |
Stage 3a/..  |   2.12e-15   9.98e-16   -71.75   0.000     8.42e-16    5.34e-15
      1.esrd |   .9536608   .1261385    -0.36   0.720     .7358808    1.235892
1.other_tr~t |   .7915402    .120634    -1.53   0.125     .5871463    1.067087
  1.asplenia |   .9371701   .1546588    -0.39   0.694     .6781829     1.29506
1.ra_sle_p~s |   .8133395   .1302454    -1.29   0.197      .594242    1.113218
1.other_im~o |   .8281372    .110763    -1.41   0.159     .6371688    1.076342
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULL
> YADJMODEL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULLYADJMOD
> EL_ageband_0_timeperiod0.ster saved
(18,407 observations (episodes) created)
(cat_time: 18407 changes made)
(covid_death: 18407 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       46.51       46.51
          1 |     11,270       32.75       79.26
          2 |      7,137       20.74      100.00
------------+-----------------------------------
      Total |     34,412      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,190      2,815 |    16,005 
         1 |     8,752      2,518 |    11,270 
         2 |     4,998      2,139 |     7,137 
-----------+----------------------+----------
     Total |    26,940      7,472 |    34,412 
(23,144 observations deleted)
   1:      5.56 /        1 =       5.5640

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       11,270             Number of obs    =      11,270
No. of failures      =        2,518
Time at risk         =       638735
                                                Wald chi2(42)    =       42.36
Log pseudolikelihood =   -17149.531             Prob > chi2      =      0.4553

                       (Std. Err. adjusted for 1,060 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9766685   .1493013    -0.15   0.877      .723812    1.317858
 only 12-18  |    .803582   .1655794    -1.06   0.289     .5365852    1.203432
      mixed  |   .9224325   .1298005    -0.57   0.566     .7000956    1.215379
             |
        age1 |   1.015646   .0077453     2.04   0.042     1.000578     1.03094
        age2 |   .9575904   .0226447    -1.83   0.067     .9142204    1.003018
        age3 |   1.123661   .0758452     1.73   0.084     .9844203    1.282596
      1.male |   .9672291    .038389    -0.84   0.401     .8948401    1.045474
             |
   obese4cat |
Obese I ..)  |   1.108141   .0630821     1.80   0.071     .9911504    1.238941
Obese II..)  |   1.119229   .0783614     1.61   0.108     .9757149    1.283851
Obese II..)  |   1.187707   .1019237     2.00   0.045     1.003836    1.405257
             |
smoke_nomiss |
     Former  |   .7807756   .1248224    -1.55   0.122     .5707486    1.068089
    Current  |   1.018287   .0613408     0.30   0.764     .9048873    1.145898
             |
         imd |
          4  |   .9335766   .0453244    -1.42   0.157      .848838    1.026774
5 most de..  |   .9314533   .0624041    -1.06   0.289     .8168335    1.062157
             |
tot_adults~h |
          2  |   .6247054   .2732712    -1.08   0.282     .2650486    1.472397
          3  |   1.078177   .3308194     0.25   0.806        .5909     1.96728
             |
   ethnicity |
Asian or ..  |   1.051571   .0706706     0.75   0.454     .9217939    1.199619
      Other  |   1.065364   .0694478     0.97   0.331     .9375853    1.210557
             |
1.htdiag_o~p |   .9246551   .0654975    -1.11   0.269      .804795    1.062366
1.~y_disease |   .9890809   .0499807    -0.22   0.828     .8958154    1.092057
    1.asthma |    .961709   .0724603    -0.52   0.604     .8296781    1.114751
1.~c_disease |   1.058678   .0500842     1.21   0.228     .9649284    1.161536
             |
     diabcat |
T1DM, con..  |   1.108133    .134375     0.85   0.397     .8737212    1.405435
T1DM, unc..  |   .8952969   .2436729    -0.41   0.684     .5251648    1.526295
T2DM, con..  |   1.066099    .057404     1.19   0.235     .9593223     1.18476
T2DM, unc..  |   1.016133   .1106273     0.15   0.883     .8208797    1.257829
Diabetes,..  |   .6909864   .7118529    -0.36   0.720      .091741     5.20446
             |
cancer_exh~t |
  Last year  |   1.234641   .3831286     0.68   0.497     .6720463    2.268203
2-5 years..  |   .9338112   .1600298    -0.40   0.689     .6674002    1.306567
   5+ years  |   .8881069   .0481578    -2.19   0.029     .7985621    .9876927
             |
cancer_hae~t |
  Last year  |   .9603048    .389179    -0.10   0.920     .4339563    2.125065
2-5 years..  |   1.049104   .1639282     0.31   0.759     .7723487    1.425028
   5+ years  |   1.059519   .0510031     1.20   0.230     .9641258    1.164351
             |
1.~r_disease |   .9893263   .0490756    -0.22   0.829     .8976678    1.090344
1.stroke_d~a |   .9942244   .0520561    -0.11   0.912     .8972569    1.101671
1.other_ne~o |   1.003227   .0488498     0.07   0.947     .9119103    1.103689
             |
reduced_ki~t |
Stage 3a/..  |   .7830845   .2511494    -0.76   0.446     .4176504    1.468265
      1.esrd |   .9684336   .0398636    -0.78   0.436      .893371    1.049803
1.other_tr~t |   .9527169   .0481968    -0.96   0.338      .862785    1.052023
  1.asplenia |   .9908686   .0487003    -0.19   0.852      .899871    1.091068
1.ra_sle_p~s |   1.062435    .053821     1.20   0.232     .9620154    1.173337
1.other_im~o |   1.005923   .0479435     0.12   0.901     .9162113     1.10442
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.00391         0.04        1         0.8362
      2.kids_cat4 |      0.00248         0.02        1         0.8984
      3.kids_cat4 |      0.00417         0.05        1         0.8280
      age1        |      0.01160         0.36        1         0.5466
      age2        |     -0.00303         0.02        1         0.8758
      age3        |     -0.00278         0.02        1         0.8855
      0b.male     |            .            .        1             .
      1.male      |     -0.00035         0.00        1         0.9851
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.02743         2.05        1         0.1519
      3.obese4cat |     -0.00381         0.04        1         0.8401
      4.obese4cat |      0.01590         0.70        1         0.4018
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.01099         0.33        1         0.5641
      3.smoke_no~s|     -0.00953         0.25        1         0.6197
      1b.imd      |            .            .        1             .
      4.imd       |     -0.01283         0.42        1         0.5181
      5.imd       |      0.00020         0.00        1         0.9918
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.03505         3.67        1         0.0553
      3.tot_adul~h|     -0.01190         0.38        1         0.5365
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.00107         0.00        1         0.9551
      5.ethnicity |      0.01901         1.03        1         0.3110
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.04364         5.14        1         0.0234
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.03522         3.41        1         0.0649
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.02699         1.94        1         0.1640
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00123         0.00        1         0.9501
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02803         2.21        1         0.1367
      3.diabcat   |      0.00294         0.02        1         0.8799
      4.diabcat   |     -0.03791         3.89        1         0.0485
      5.diabcat   |      0.00941         0.23        1         0.6311
      6.diabcat   |     -0.00423         0.05        1         0.8190
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.01722         0.85        1         0.3563
      3.cancer_e~t|      0.01226         0.47        1         0.4915
      4.cancer_e~t|      0.02318         1.42        1         0.2341
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.03138         3.00        1         0.0831
      3.cancer_h~t|     -0.00000         0.00        1         0.9999
      4.cancer_h~t|     -0.00822         0.16        1         0.6888
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.01347         0.50        1         0.4776
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.00686         0.14        1         0.7094
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.03237         2.70        1         0.1004
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.02051         1.13        1         0.2886
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.03637         3.50        1         0.0613
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.01735         0.83        1         0.3612
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.02729         1.97        1         0.1606
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.01609         0.75        1         0.3868
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.02500         1.59        1         0.2073
      ------------+---------------------------------------------------
      global test |                     45.86       42         0.3151
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      8.59 /        1 =       8.5880
   1:      1.05 /        1 =       1.0500

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,107             Number of obs    =       1,107
No. of failures      =          259
Time at risk         =        62360
                                                Wald chi2(41)    =     2356.05
Log pseudolikelihood =   -1143.3256             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 188 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.105839   .2345562     0.47   0.635     .7297028     1.67586
3 childre..  |   1.383054   .2811476     1.60   0.111     .9285528    2.060021
4+ childr..  |   1.174642   .2081918     0.91   0.364     .8299272    1.662537
             |
        age1 |   .9957039   .0250484    -0.17   0.864     .9478006    1.046028
        age2 |   1.064953    .078728     0.85   0.395     .9213072    1.230996
        age3 |   .8043611    .167343    -1.05   0.295     .5350115    1.209314
      1.male |   .8798511   .1079834    -1.04   0.297     .6917383     1.11912
             |
   obese4cat |
Obese I ..)  |   1.003892   .2095938     0.02   0.985     .6667642    1.511478
Obese II..)  |   .9358286   .2199065    -0.28   0.778     .5904403    1.483258
Obese II..)  |   .6811608   .2151837    -1.22   0.224      .366732    1.265175
             |
smoke_nomiss |
     Former  |   1.268161   .5039114     0.60   0.550     .5820283     2.76315
    Current  |   .9706625   .1888224    -0.15   0.878     .6629558    1.421189
             |
         imd |
          4  |    .703543   .1127857    -2.19   0.028     .5138468    .9632691
5 most de..  |   .9597667   .1863263    -0.21   0.832     .6560182    1.404156
             |
tot_adults~h |
          2  |   .4530973   .4441247    -0.81   0.419     .0663508    3.094118
          3  |   .5948383   .4854108    -0.64   0.524     .1201672    2.944502
             |
   ethnicity |
Asian or ..  |   .7118255   .1946804    -1.24   0.214     .4164612    1.216669
      Other  |   1.201212   .2165331     1.02   0.309      .843685    1.710248
             |
1.htdiag_o~p |   .9382015   .2107339    -0.28   0.776     .6040928    1.457097
1.~y_disease |   1.061762   .1535178     0.41   0.679      .799749    1.409615
    1.asthma |   .7138809   .2319817    -1.04   0.300       .37759    1.349681
1.~c_disease |   .8799321   .1308467    -0.86   0.390     .6574682     1.17767
             |
     diabcat |
T1DM, con..  |   .7898639   .3216463    -0.58   0.562     .3555725    1.754593
T1DM, unc..  |   1.154151   .9277052     0.18   0.858     .2388186    5.577728
T2DM, con..  |    .942577   .1809111    -0.31   0.758     .6470587    1.373061
T2DM, unc..  |   1.730963   .5459842     1.74   0.082     .9328244    3.212001
             |
cancer_exh~t |
  Last year  |   1.443722    1.52434     0.35   0.728     .1822848    11.43449
2-5 years..  |   .3674647   .2643622    -1.39   0.164     .0897103    1.505181
   5+ years  |   .8552534   .1657203    -0.81   0.420      .585005    1.250345
             |
cancer_hae~t |
  Last year  |   3.51e-14   3.43e-14   -31.64   0.000     5.15e-15    2.39e-13
2-5 years..  |   2.809476   1.174459     2.47   0.013     1.238207    6.374661
   5+ years  |   1.136023   .2169745     0.67   0.504     .7812895    1.651818
             |
1.~r_disease |    1.10609   .1871889     0.60   0.551      .793848    1.541144
1.stroke_d~a |   .9408758   .1538536    -0.37   0.709     .6828769     1.29635
1.other_ne~o |   .8029859   .1352655    -1.30   0.193     .5771921    1.117109
             |
reduced_ki~t |
Stage 3a/..  |   2.105306   1.817581     0.86   0.389     .3876539    11.43368
      1.esrd |   .7524874   .1095741    -1.95   0.051     .5656538    1.001031
1.other_tr~t |   .8779174   .1314175    -0.87   0.384     .6546894    1.177259
  1.asplenia |   1.027449   .1589121     0.18   0.861     .7587656    1.391274
1.ra_sle_p~s |    .910816   .1686583    -0.50   0.614     .6335944    1.309333
1.other_im~o |   .8065049   .1436709    -1.21   0.227     .5688187    1.143511
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULL
> YADJMODEL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULLYADJMOD
> EL_ageband_0_timeperiod1.ster saved
(18,407 observations (episodes) created)
(cat_time: 18407 changes made)
(covid_death: 18407 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       46.51       46.51
          1 |     11,270       32.75       79.26
          2 |      7,137       20.74      100.00
------------+-----------------------------------
      Total |     34,412      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,190      2,815 |    16,005 
         1 |     8,752      2,518 |    11,270 
         2 |     4,998      2,139 |     7,137 
-----------+----------------------+----------
     Total |    26,940      7,472 |    34,412 
(27,277 observations deleted)
   1:      3.52 /        1 =       3.5170

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        7,137             Number of obs    =       7,137
No. of failures      =        2,139
Time at risk         =       326998
                                                Wald chi2(42)    =       36.67
Log pseudolikelihood =   -13368.891             Prob > chi2      =      0.7034

                         (Std. Err. adjusted for 984 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9107248   .1516321    -0.56   0.574     .6571513    1.262144
 only 12-18  |   .6290046   .1452458    -2.01   0.045     .4000365    .9890266
      mixed  |   .8893746   .1355393    -0.77   0.442      .659725    1.198965
             |
        age1 |   .9987863   .0084086    -0.14   0.885     .9824411    1.015404
        age2 |   1.004861   .0269436     0.18   0.856     .9534164    1.059082
        age3 |   .9792667   .0747615    -0.27   0.784     .8431727    1.137327
      1.male |   .9498063   .0409486    -1.19   0.232     .8728459    1.033552
             |
   obese4cat |
Obese I ..)  |   1.017413   .0683533     0.26   0.797     .8918884    1.160604
Obese II..)  |   .9189554    .074575    -1.04   0.298     .7838226    1.077385
Obese II..)  |   1.083835   .1023768     0.85   0.394     .9006596    1.304266
             |
smoke_nomiss |
     Former  |   .9084052   .1377518    -0.63   0.526     .6748422    1.222804
    Current  |   1.010826   .0672379     0.16   0.871      .887271    1.151586
             |
         imd |
          4  |   .9972242   .0558816    -0.05   0.960     .8934986    1.112991
5 most de..  |   .9211097   .0696307    -1.09   0.277     .7942648    1.068212
             |
tot_adults~h |
          2  |      1.168   .5121912     0.35   0.723      .494509    2.758746
          3  |   1.427324   .5150586     0.99   0.324     .7036575    2.895235
             |
   ethnicity |
Asian or ..  |   .9156898   .0687881    -1.17   0.241     .7903231    1.060943
      Other  |   1.017975   .0742539     0.24   0.807     .8823648    1.174427
             |
1.htdiag_o~p |   1.068415   .0899196     0.79   0.432     .9059442    1.260023
1.~y_disease |   .9894817   .0535534    -0.20   0.845     .8898943    1.100214
    1.asthma |   .9130344   .0747419    -1.11   0.266     .7776908    1.071932
1.~c_disease |    1.00879   .0570779     0.15   0.877     .9028991    1.127099
             |
     diabcat |
T1DM, con..  |   .9664855   .1337886    -0.25   0.805     .7368265    1.267726
T1DM, unc..  |   .6468273   .2219542    -1.27   0.204     .3301449    1.267279
T2DM, con..  |   1.020319   .0611555     0.34   0.737     .9072294    1.147506
T2DM, unc..  |   .8593897   .1103711    -1.18   0.238     .6681449    1.105375
Diabetes,..  |   1.448922   .8694063     0.62   0.537      .446985    4.696747
             |
cancer_exh~t |
  Last year  |   1.040731    .342827     0.12   0.904     .5456883    1.984873
2-5 years..  |    .968768   .1587944    -0.19   0.847     .7025806    1.335806
   5+ years  |   1.085143   .0633388     1.40   0.162     .9678394    1.216665
             |
cancer_hae~t |
  Last year  |   .6873186   .2955577    -0.87   0.383     .2958885     1.59657
2-5 years..  |    1.08282   .1786072     0.48   0.630     .7837072    1.496094
   5+ years  |    1.00418   .0578698     0.07   0.942     .8969287    1.124257
             |
1.~r_disease |   .9628429   .0527442    -0.69   0.489     .8648224    1.071973
1.stroke_d~a |   1.056226   .0581741     0.99   0.321     .9481455    1.176627
1.other_ne~o |    1.00648   .0553427     0.12   0.906     .9036504     1.12101
             |
reduced_ki~t |
Stage 3a/..  |   .8439483   .2679359    -0.53   0.593     .4529781    1.572369
      1.esrd |   .9598056   .0456516    -0.86   0.388     .8743741    1.053584
1.other_tr~t |   1.058576   .0568522     1.06   0.289     .9528116     1.17608
  1.asplenia |   .9220842   .0521385    -1.43   0.151     .8253536    1.030152
1.ra_sle_p~s |   1.031737   .0564359     0.57   0.568     .9268478    1.148497
1.other_im~o |   .8544549   .0492077    -2.73   0.006     .7632536    .9565539
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.00562         0.08        1         0.7794
      2.kids_cat4 |     -0.00938         0.19        1         0.6633
      3.kids_cat4 |     -0.00237         0.01        1         0.9074
      age1        |      0.00098         0.00        1         0.9608
      age2        |      0.00220         0.01        1         0.9111
      age3        |     -0.00215         0.01        1         0.9134
      0b.male     |            .            .        1             .
      1.male      |      0.00010         0.00        1         0.9961
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01327         0.45        1         0.5047
      3.obese4cat |     -0.02585         1.53        1         0.2166
      4.obese4cat |      0.02228         1.11        1         0.2931
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.00259         0.02        1         0.9013
      3.smoke_no~s|      0.03114         2.27        1         0.1322
      1b.imd      |            .            .        1             .
      4.imd       |     -0.02315         1.28        1         0.2576
      5.imd       |      0.00443         0.05        1         0.8266
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|     -0.00914         0.18        1         0.6697
      3.tot_adul~h|     -0.00684         0.10        1         0.7467
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.01006         0.23        1         0.6324
      5.ethnicity |     -0.00856         0.16        1         0.6898
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|      0.02661         1.79        1         0.1807
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.03210         2.41        1         0.1209
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.02823         1.91        1         0.1673
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.02052         1.06        1         0.3040
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.02839         1.94        1         0.1637
      3.diabcat   |     -0.02226         1.22        1         0.2694
      4.diabcat   |      0.02018         0.99        1         0.3188
      5.diabcat   |      0.00276         0.02        1         0.8934
      6.diabcat   |      0.02941         1.52        1         0.2175
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.03031         1.81        1         0.1780
      3.cancer_e~t|      0.00165         0.01        1         0.9379
      4.cancer_e~t|     -0.00213         0.01        1         0.9154
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.02767         1.64        1         0.2007
      3.cancer_h~t|      0.03336         2.42        1         0.1201
      4.cancer_h~t|      0.01607         0.62        1         0.4305
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.00416         0.04        1         0.8413
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.01713         0.71        1         0.4002
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.01385         0.46        1         0.4977
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01463         0.49        1         0.4818
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.02685         1.90        1         0.1680
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.03486         2.89        1         0.0890
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.00741         0.13        1         0.7147
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.01457         0.49        1         0.4820
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.02887         2.15        1         0.1423
      ------------+---------------------------------------------------
      global test |                     34.16       42         0.7998
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      5.06 /        1 =       5.0570
   1:      0.89 /        1 =       0.8850

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          687             Number of obs    =         687
No. of failures      =          214
Time at risk         =        31839
                                                Wald chi2(41)    =    10860.69
Log pseudolikelihood =   -811.90689             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 168 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.059727   .2298305     0.27   0.789     .6927679    1.621064
3 childre..  |   .8815723   .1969842    -0.56   0.573     .5689315    1.366016
4+ childr..  |   .8689831   .1606734    -0.76   0.448     .6048193    1.248524
             |
        age1 |   .9989273   .0283754    -0.04   0.970     .9448324    1.056119
        age2 |     1.0227   .0867886     0.26   0.791     .8659906    1.207767
        age3 |    .838628   .1986954    -0.74   0.458     .5271023     1.33427
      1.male |   .7054483   .1114254    -2.21   0.027     .5176284    .9614181
             |
   obese4cat |
Obese I ..)  |   1.801362   .3848631     2.75   0.006     1.185061    2.738175
Obese II..)  |   1.064134   .2808242     0.24   0.814     .6344022    1.784957
Obese II..)  |   .9605819   .3337297    -0.12   0.908       .48619    1.897854
             |
smoke_nomiss |
     Former  |   .2464334   .2571345    -1.34   0.179     .0318812    1.904863
    Current  |    1.07226   .2434402     0.31   0.759     .6871445    1.673218
             |
         imd |
          4  |   .9814878   .1779542    -0.10   0.918     .6879439    1.400286
5 most de..  |   1.098562   .2821998     0.37   0.714      .663998    1.817532
             |
tot_adults~h |
          2  |   .3227781   .4060763    -0.90   0.369      .027418    3.799901
          3  |   .4005657   .4423138    -0.83   0.407         .046    3.488109
             |
   ethnicity |
Asian or ..  |   .9394133   .2133484    -0.28   0.783     .6019244    1.466127
      Other  |   1.902917   .4659819     2.63   0.009     1.177551    3.075106
             |
1.htdiag_o~p |   .7930781   .1690643    -1.09   0.277     .5222292      1.2044
1.~y_disease |   .8365302   .1517399    -0.98   0.325     .5862468    1.193666
    1.asthma |   .7506353   .1999075    -1.08   0.281     .4453884    1.265083
1.~c_disease |   1.582235   .2789385     2.60   0.009     1.119977    2.235284
             |
     diabcat |
T1DM, con..  |    .343361    .189795    -1.93   0.053       .11621    1.014514
T1DM, unc..  |   1.649375   2.082936     0.40   0.692      .138793    19.60067
T2DM, con..  |   1.088347   .2556795     0.36   0.719      .686751    1.724788
T2DM, unc..  |   1.165521   .4710863     0.38   0.705     .5278092    2.573731
             |
cancer_exh~t |
  Last year  |   1.06e-16   1.31e-16   -29.80   0.000     9.43e-18    1.19e-15
2-5 years..  |   .4448357   .2479388    -1.45   0.146     .1491984     1.32628
   5+ years  |   .9634221   .1696137    -0.21   0.832     .6822754    1.360421
             |
cancer_hae~t |
  Last year  |   1.33e-16   1.48e-16   -32.76   0.000     1.49e-17    1.18e-15
2-5 years..  |   .7602228   .9431924    -0.22   0.825     .0668149    8.649853
   5+ years  |   1.372155   .2744632     1.58   0.114     .9271344    2.030782
             |
1.~r_disease |   .9558754   .2033388    -0.21   0.832     .6299837    1.450352
1.stroke_d~a |   .8814395   .1643883    -0.68   0.499     .6115664    1.270403
1.other_ne~o |   1.100949   .1953284     0.54   0.588     .7775862    1.558784
             |
reduced_ki~t |
Stage 3a/..  |   1.243032     .73656     0.37   0.714     .3891365     3.97066
      1.esrd |   .8657154   .1376708    -0.91   0.365     .6338878    1.182328
1.other_tr~t |   .9976431   .1743169    -0.01   0.989     .7083467    1.405091
  1.asplenia |   1.192087   .2219838     0.94   0.345     .8275648    1.717173
1.ra_sle_p~s |    .988279   .2018554    -0.06   0.954     .6622504    1.474813
1.other_im~o |   .7613908   .1401402    -1.48   0.139     .5308075     1.09214
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULL
> YADJMODEL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULLYADJMOD
> EL_ageband_0_timeperiod2.ster saved
(18,407 observations (episodes) created)
(cat_time: 18407 changes made)
(covid_death: 18407 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,005       46.51       46.51
          1 |     11,270       32.75       79.26
          2 |      7,137       20.74      100.00
------------+-----------------------------------
      Total |     34,412      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,190      2,815 |    16,005 
         1 |     8,752      2,518 |    11,270 
         2 |     4,998      2,139 |     7,137 
-----------+----------------------+----------
     Total |    26,940      7,472 |    34,412 
(34,414 observations deleted)
   1:      0.01 /        1 =       0.0050
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_death)
   1:      0.01 /        1 =       0.0070
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_death)
(5,317 observations (episodes) created)
(cat_time: 5317 changes made)
(covid_death: 5317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       46.41       46.41
          1 |      3,260       32.86       79.27
          2 |      2,057       20.73      100.00
------------+-----------------------------------
      Total |      9,922      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,785        820 |     4,605 
         1 |     2,509        751 |     3,260 
         2 |     1,440        617 |     2,057 
-----------+----------------------+----------
     Total |     7,734      2,188 |     9,922 
(5,317 observations deleted)
   1:      4.55 /        1 =       4.5500

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,605             Number of obs    =       4,605
No. of failures      =          820
Time at risk         =       308169
                                                Wald chi2(42)    =     4146.81
Log pseudolikelihood =   -4882.2324             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 928 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .7625084   .2009475    -1.03   0.304     .4549078    1.278103
 only 12-18  |   .7873924   .2556335    -0.74   0.462     .4167174    1.487787
      mixed  |   .7586898    .188445    -1.11   0.266     .4662737     1.23449
             |
        age1 |   .9610054   .0286917    -1.33   0.183     .9063844    1.018918
        age2 |   1.217996   .1964027     1.22   0.221     .8879515    1.670717
        age3 |   .6719746   .2164674    -1.23   0.217     .3573962    1.263443
      1.male |   1.090399   .0773455     1.22   0.222     .9488701    1.253037
             |
   obese4cat |
Obese I ..)  |   .9133593    .095549    -0.87   0.386     .7440381    1.121213
Obese II..)  |   .9469616   .1199506    -0.43   0.667     .7387739    1.213817
Obese II..)  |   1.068315   .1487687     0.47   0.635     .8131394    1.403569
             |
smoke_nomiss |
     Former  |   .9173494   .2493948    -0.32   0.751     .5384225    1.562955
    Current  |   1.091011   .1175615     0.81   0.419     .8832995    1.347566
             |
         imd |
          4  |   .8582647   .0836942    -1.57   0.117     .7089503    1.039027
5 most de..  |   1.024398   .1208095     0.20   0.838     .8129895    1.290782
             |
tot_adults~h |
          2  |   .5011333   .2513755    -1.38   0.168     .1874902    1.339455
          3  |   .6469208   .2614678    -1.08   0.281     .2929669    1.428511
             |
   ethnicity |
Asian or ..  |   .9733339   .1081781    -0.24   0.808     .7828125    1.210224
      Other  |   .9759282   .1076712    -0.22   0.825     .7861535    1.211514
             |
1.htdiag_o~p |   1.021453   .1368234     0.16   0.874     .7855972    1.328118
1.~y_disease |   1.125923    .097164     1.37   0.169     .9507197    1.333414
    1.asthma |   1.090563   .1308029     0.72   0.470     .8620992    1.379573
1.~c_disease |   1.000214     .08946     0.00   0.998     .8393845     1.19186
             |
     diabcat |
T1DM, con..  |   1.191315   .2587361     0.81   0.420     .7783195    1.823455
T1DM, unc..  |   .4667346   .2779568    -1.28   0.201     .1452612    1.499652
T2DM, con..  |   .9150466   .0877644    -0.93   0.355     .7582324    1.104293
T2DM, unc..  |   1.058879   .2004563     0.30   0.762     .7306437    1.534572
Diabetes,..  |   1.21e-14   6.29e-15   -61.81   0.000     4.40e-15    3.35e-14
             |
cancer_exh~t |
  Last year  |   .2864503   .2894852    -1.24   0.216     .0395212    2.076199
2-5 years..  |    .916928    .245184    -0.32   0.746      .542908    1.548618
   5+ years  |   .9457451   .0845799    -0.62   0.533     .7936873    1.126935
             |
cancer_hae~t |
  Last year  |    1.35881   .5846026     0.71   0.476     .5847165    3.157711
2-5 years..  |   .7394634   .2276478    -0.98   0.327     .4044546    1.351959
   5+ years  |    1.06251    .090173     0.71   0.475     .8996912    1.254795
             |
1.~r_disease |   1.123819   .0930131     1.41   0.158     .9555346    1.321741
1.stroke_d~a |   .9737291   .0842992    -0.31   0.758     .8217631    1.153798
1.other_ne~o |   .9742753   .0835515    -0.30   0.761       .82354      1.1526
             |
reduced_ki~t |
Stage 3a/..  |   1.037649   .1864171     0.21   0.837     .7296748    1.475611
      1.esrd |   1.003413   .0763922     0.04   0.964     .8643219    1.164886
1.other_tr~t |   .9854152   .0865154    -0.17   0.867     .8296353    1.170446
  1.asplenia |   1.011227   .0984969     0.11   0.909     .8354855    1.223936
1.ra_sle_p~s |   .9649543   .0865011    -0.40   0.691     .8094736    1.150299
1.other_im~o |   .9918219   .0897765    -0.09   0.928     .8305881    1.184355
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod0.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.04594         2.93        1         0.0868
      2.kids_cat4 |      0.03362         1.18        1         0.2776
      3.kids_cat4 |      0.02892         1.19        1         0.2756
      age1        |     -0.01551         0.23        1         0.6339
      age2        |      0.02233         0.49        1         0.4838
      age3        |     -0.02519         0.63        1         0.4261
      0b.male     |            .            .        1             .
      1.male      |     -0.00125         0.00        1         0.9699
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01475         0.21        1         0.6436
      3.obese4cat |     -0.03971         1.50        1         0.2203
      4.obese4cat |      0.03598         1.33        1         0.2484
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.07433         6.03        1         0.0141
      3.smoke_no~s|      0.02771         0.74        1         0.3910
      1b.imd      |            .            .        1             .
      4.imd       |      0.01386         0.22        1         0.6407
      5.imd       |     -0.02249         0.46        1         0.4974
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.02725         0.74        1         0.3909
      3.tot_adul~h|     -0.00432         0.02        1         0.8902
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.00230         0.00        1         0.9471
      5.ethnicity |      0.01061         0.10        1         0.7574
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.00056         0.00        1         0.9862
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.00920         0.09        1         0.7705
      0b.asthma   |            .            .        1             .
      1.asthma    |     -0.05596         2.78        1         0.0955
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.00296         0.01        1         0.9247
      1b.diabcat  |            .            .        1             .
      2.diabcat   |      0.01743         0.27        1         0.6048
      3.diabcat   |      0.00109         0.00        1         0.9725
      4.diabcat   |     -0.02496         0.59        1         0.4410
      5.diabcat   |     -0.05159         3.09        1         0.0789
      6.diabcat   |     -0.08588         0.49        1         0.4833
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.01881         0.34        1         0.5580
      3.cancer_e~t|      0.01916         0.36        1         0.5492
      4.cancer_e~t|     -0.01229         0.13        1         0.7137
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|     -0.03425         1.19        1         0.2759
      3.cancer_h~t|      0.05641         2.73        1         0.0983
      4.cancer_h~t|     -0.09886         7.92        1         0.0049
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.07667         5.55        1         0.0185
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.02674         0.68        1         0.4098
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|     -0.04044         1.45        1         0.2291
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.03876         1.48        1         0.2232
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.05171         2.80        1         0.0945
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.07009         4.75        1         0.0294
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.02277         0.60        1         0.4402
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.03759         1.35        1         0.2457
      0b.other_i~o|            .            .        1             .
      1.other_im~o|      0.00311         0.01        1         0.9197
      ------------+---------------------------------------------------
      global test |                     52.27       42         0.1332
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      3.26 /        1 =       3.2640
   1:      0.67 /        1 =       0.6650

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          455             Number of obs    =         455
No. of failures      =           79
Time at risk         =        30221
                                                Wald chi2(41)    =    14179.61
Log pseudolikelihood =   -265.66779             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 152 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   1.230251    .541549     0.47   0.638     .5191589    2.915328
3 childre..  |   1.150068   .3870237     0.42   0.678     .5946684     2.22419
4+ childr..  |   1.221886   .4376013     0.56   0.576     .6055987    2.465338
             |
        age1 |   .8810177   .0975126    -1.14   0.252     .7092055    1.094453
        age2 |   1.853364   1.141408     1.00   0.316     .5542967    6.196969
        age3 |   .3165695   .3863401    -0.94   0.346     .0289512    3.461559
      1.male |   .9189389   .2292228    -0.34   0.735     .5635864    1.498348
             |
   obese4cat |
Obese I ..)  |   1.307569   .4630127     0.76   0.449     .6532092     2.61744
Obese II..)  |   1.633078    .558932     1.43   0.152     .8349824    3.194011
Obese II..)  |   2.026179   .7588122     1.89   0.059     .9725218    4.221397
             |
smoke_nomiss |
     Former  |   1.261498    1.46164     0.20   0.841     .1302082    12.22179
    Current  |   .7279961   .3197768    -0.72   0.470     .3077751    1.721966
             |
         imd |
          4  |   1.030977   .3767054     0.08   0.933     .5037688    2.109924
5 most de..  |    .441271   .2087944    -1.73   0.084     .1745605    1.115488
             |
tot_adults~h |
          2  |   3.16e+08          .        .       .            .           .
          3  |   1.38e+08   7.65e+07    33.90   0.000     4.68e+07    4.09e+08
             |
   ethnicity |
Asian or ..  |   .8785216   .4292409    -0.27   0.791     .3371786    2.288995
      Other  |   1.938379   .6795844     1.89   0.059     .9750171    3.853585
             |
1.htdiag_o~p |   1.011272   .4408036     0.03   0.979     .4303654    2.376285
1.~y_disease |   2.048837    .617772     2.38   0.017      1.13462    3.699683
    1.asthma |   1.015748   .5513555     0.03   0.977     .3505479    2.943232
1.~c_disease |   .8751367   .3080928    -0.38   0.705     .4389444    1.744787
             |
     diabcat |
T1DM, con..  |   2.097681    1.61031     0.97   0.335     .4659123    9.444405
T1DM, unc..  |   2.069769   2.315416     0.65   0.516     .2310453    18.54159
T2DM, con..  |   1.279616   .3870627     0.82   0.415     .7073028    2.315017
T2DM, unc..  |   3.706377   1.666804     2.91   0.004     1.535161    8.948401
Diabetes,..  |   1.16e-17   1.01e-17   -44.67   0.000     2.10e-18    6.43e-17
             |
cancer_exh~t |
  Last year  |   8.97e-18   8.33e-18   -42.30   0.000     1.46e-18    5.53e-17
2-5 years..  |    .898279    .953972    -0.10   0.920     .1120561    7.200904
   5+ years  |    .554597   .2018279    -1.62   0.105     .2717752    1.131736
             |
cancer_hae~t |
  Last year  |   3.74e-18   4.53e-18   -33.16   0.000     3.49e-19    4.01e-17
2-5 years..  |   .5951847   .5852438    -0.53   0.598     .0866298    4.089181
   5+ years  |   .8599638    .277029    -0.47   0.640     .4573765    1.616912
             |
1.~r_disease |   1.110467   .3589184     0.32   0.746     .5893662    2.092309
1.stroke_d~a |   .9661053   .2472729    -0.13   0.893     .5850068    1.595468
1.other_ne~o |   1.440294   .4486602     1.17   0.242      .782162    2.652195
             |
reduced_ki~t |
Stage 3a/..  |   .7232763   .4411152    -0.53   0.595     .2188615    2.390227
      1.esrd |   .6440681   .1966479    -1.44   0.150     .3540312    1.171715
1.other_tr~t |   1.224453   .3942953     0.63   0.529     .6513886    2.301674
  1.asplenia |   .8029295   .2297907    -0.77   0.443     .4582175    1.406965
1.ra_sle_p~s |   .7008711   .2254333    -1.11   0.269     .3731225    1.316512
1.other_im~o |   1.125531   .3388065     0.39   0.694     .6239204    2.030418
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULL
> YADJMODEL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULLYADJMOD
> EL_ageband_1_timeperiod0.ster saved
(5,317 observations (episodes) created)
(cat_time: 5317 changes made)
(covid_death: 5317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       46.41       46.41
          1 |      3,260       32.86       79.27
          2 |      2,057       20.73      100.00
------------+-----------------------------------
      Total |      9,922      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,785        820 |     4,605 
         1 |     2,509        751 |     3,260 
         2 |     1,440        617 |     2,057 
-----------+----------------------+----------
     Total |     7,734      2,188 |     9,922 
(6,662 observations deleted)
   1:      1.54 /        1 =       1.5390

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,260             Number of obs    =       3,260
No. of failures      =          751
Time at risk         =       184140
                                                Wald chi2(42)    =       51.68
Log pseudolikelihood =   -4167.9392             Prob > chi2      =      0.1454

                         (Std. Err. adjusted for 848 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8042387   .2141926    -0.82   0.413     .4771828    1.355455
 only 12-18  |   .7421065   .2713101    -0.82   0.415     .3624696    1.519361
      mixed  |   1.022848   .2424324     0.10   0.924     .6427796    1.627648
             |
        age1 |   .9956876   .0327175    -0.13   0.895     .9335838    1.061923
        age2 |   .9979273   .1813892    -0.01   0.991     .6988428    1.425011
        age3 |   .9780522    .358871    -0.06   0.952     .4764701    2.007652
      1.male |    1.02545   .0771042     0.33   0.738     .8849361    1.188274
             |
   obese4cat |
Obese I ..)  |   1.111888   .1108154     1.06   0.287     .9145902    1.351746
Obese II..)  |   .9006156   .1229114    -0.77   0.443     .6892422    1.176812
Obese II..)  |    .875965   .1338315    -0.87   0.386       .64929    1.181775
             |
smoke_nomiss |
     Former  |   1.138852   .2944173     0.50   0.615     .6861412    1.890257
    Current  |   1.077071    .118527     0.67   0.500     .8681075    1.336335
             |
         imd |
          4  |    .907579   .0838619    -1.05   0.294     .7572372     1.08777
5 most de..  |   1.078076   .1334867     0.61   0.544     .8457735    1.374183
             |
tot_adults~h |
          2  |   .5469807   .3486966    -0.95   0.344     .1567966    1.908127
          3  |   .6085789   .3144631    -0.96   0.336      .221048    1.675511
             |
   ethnicity |
Asian or ..  |   1.059385    .123933     0.49   0.622     .8423169    1.332393
      Other  |    1.07237   .1195788     0.63   0.531     .8618432    1.334324
             |
1.htdiag_o~p |    1.06294   .1477853     0.44   0.661     .8093987    1.395903
1.~y_disease |   .9927275   .0883445    -0.08   0.935     .8338352    1.181898
    1.asthma |   .8639252   .1219841    -1.04   0.300     .6550713    1.139367
1.~c_disease |   1.030641   .0927988     0.34   0.737     .8639038     1.22956
             |
     diabcat |
T1DM, con..  |   1.511249   .3356149     1.86   0.063     .9779194    2.335442
T1DM, unc..  |   1.223952   .4413829     0.56   0.575     .6036749    2.481565
T2DM, con..  |   .9603849   .0933796    -0.42   0.678     .7937465    1.162007
T2DM, unc..  |   1.336219   .2293972     1.69   0.091     .9544349     1.87072
Diabetes,..  |   .8111828   .9919483    -0.17   0.864     .0738302    8.912583
             |
cancer_exh~t |
  Last year  |   .9994127   .4752196    -0.00   0.999     .3935496    2.537992
2-5 years..  |   .8566675   .2479255    -0.53   0.593     .4858125    1.510622
   5+ years  |   1.077274   .0975759     0.82   0.411     .9020426    1.286545
             |
cancer_hae~t |
  Last year  |   .4095829   .2870517    -1.27   0.203     .1037019    1.617697
2-5 years..  |    1.86976   .4646849     2.52   0.012     1.148788    3.043211
   5+ years  |   1.068312    .098863     0.71   0.475     .8911009    1.280765
             |
1.~r_disease |   1.123589   .1011999     1.29   0.196     .9417622    1.340522
1.stroke_d~a |   .9910472   .0865832    -0.10   0.918     .8350814    1.176142
1.other_ne~o |   1.074939   .0966072     0.80   0.421      .901331    1.281986
             |
reduced_ki~t |
Stage 3a/..  |   1.072682   .2051465     0.37   0.714     .7373636    1.560487
      1.esrd |   1.200622   .0886808     2.48   0.013     1.038806    1.387644
1.other_tr~t |    .864623   .0825117    -1.52   0.127     .7171267    1.042456
  1.asplenia |   1.103342   .1030432     1.05   0.292      .918787    1.324968
1.ra_sle_p~s |    .950348   .0863588    -0.56   0.575     .7953044    1.135617
1.other_im~o |   1.043245   .0938611     0.47   0.638     .8745882    1.244427
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod1.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |     -0.02371         0.46        1         0.4973
      2.kids_cat4 |      0.00954         0.07        1         0.7900
      3.kids_cat4 |     -0.02897         0.65        1         0.4218
      age1        |     -0.02572         0.69        1         0.4060
      age2        |      0.03180         1.15        1         0.2844
      age3        |     -0.03508         1.43        1         0.2314
      0b.male     |            .            .        1             .
      1.male      |     -0.09920         9.19        1         0.0024
      1b.obese4cat|            .            .        1             .
      2.obese4cat |      0.04245         1.45        1         0.2288
      3.obese4cat |     -0.03581         1.20        1         0.2738
      4.obese4cat |      0.04787         1.98        1         0.1598
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.02053         0.41        1         0.5236
      3.smoke_no~s|     -0.00027         0.00        1         0.9936
      1b.imd      |            .            .        1             .
      4.imd       |      0.01639         0.23        1         0.6347
      5.imd       |     -0.01365         0.16        1         0.6887
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.02199         0.47        1         0.4941
      3.tot_adul~h|      0.00551         0.03        1         0.8602
      1b.ethnicity|            .            .        1             .
      3.ethnicity |     -0.00450         0.02        1         0.8954
      5.ethnicity |      0.00902         0.06        1         0.8009
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.00060         0.00        1         0.9858
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01189         0.12        1         0.7279
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.04068         1.54        1         0.2142
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.08344         6.10        1         0.0135
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.00089         0.00        1         0.9784
      3.diabcat   |      0.02209         0.35        1         0.5532
      4.diabcat   |      0.02776         0.73        1         0.3938
      5.diabcat   |      0.03012         0.76        1         0.3839
      6.diabcat   |      0.02253         0.65        1         0.4216
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|      0.03654         1.02        1         0.3114
      3.cancer_e~t|      0.04207         1.59        1         0.2070
      4.cancer_e~t|      0.00491         0.02        1         0.8853
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.06216         3.29        1         0.0695
      3.cancer_h~t|     -0.04043         1.60        1         0.2059
      4.cancer_h~t|     -0.02990         0.74        1         0.3902
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.05181         2.35        1         0.1249
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|     -0.01114         0.10        1         0.7566
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.02785         0.67        1         0.4136
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01555         0.23        1         0.6311
      0b.esrd     |            .            .        1             .
      1.esrd      |     -0.04747         1.86        1         0.1721
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|     -0.02950         0.77        1         0.3792
      0b.asplenia |            .            .        1             .
      1.asplenia  |      0.03475         1.08        1         0.2982
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.02629         0.59        1         0.4421
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.05527         2.75        1         0.0973
      ------------+---------------------------------------------------
      global test |                     43.52       42         0.4064
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      1.97 /        1 =       1.9690
   1:      0.45 /        1 =       0.4530

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          310             Number of obs    =         310
No. of failures      =           59
Time at risk         =        17865
                                                Wald chi2(40)    =       95.45
Log pseudolikelihood =   -173.96272             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 134 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .5967339   .2780636    -1.11   0.268     .2394095    1.487374
3 childre..  |   .7632627    .370862    -0.56   0.578     .2944987    1.978175
4+ childr..  |   .7597702   .3122597    -0.67   0.504     .3395041    1.700276
             |
        age1 |   .9359415   .1029876    -0.60   0.547     .7543721    1.161213
        age2 |    .902942   .6018103    -0.15   0.878     .2445314     3.33415
        age3 |    1.60498   2.215134     0.34   0.732      .107318    24.00306
      1.male |   .8509744   .2400909    -0.57   0.567     .4895099    1.479352
             |
   obese4cat |
Obese I ..)  |   .8287612   .4288908    -0.36   0.717     .3005561    2.285248
Obese II..)  |   .5365525   .3171985    -1.05   0.292     .1684224    1.709325
Obese II..)  |    1.68221   .9902813     0.88   0.377     .5306349    5.332913
             |
smoke_nomiss |
     Former  |   .1782628   .3894987    -0.79   0.430     .0024616     12.9095
    Current  |   .6574044   .3270764    -0.84   0.399     .2479345    1.743124
             |
         imd |
          4  |   1.132741   .4903121     0.29   0.773     .4849354    2.645922
5 most de..  |   1.031379   .4313256     0.07   0.941     .4544053    2.340956
             |
tot_adults~h |
          2  |   3.78e-21          .        .       .            .           .
          3  |   .1784924   .2921498    -1.05   0.292     .0072178    4.414028
             |
   ethnicity |
Asian or ..  |   .7345917    .380582    -0.60   0.552     .2661032    2.027879
      Other  |   1.295309   .5292256     0.63   0.527     .5815632    2.885025
             |
1.htdiag_o~p |   2.397339   1.348205     1.55   0.120     .7962228    7.218123
1.~y_disease |   1.189799   .4518858     0.46   0.647     .5651804    2.504725
    1.asthma |   1.193094   .6924193     0.30   0.761     .3825378    3.721128
1.~c_disease |   .8010785   .3116857    -0.57   0.569     .3736693    1.717366
             |
     diabcat |
T1DM, con..  |   .5620799   .4500749    -0.72   0.472     .1170077    2.700111
T1DM, unc..  |   .9488003   1.127518    -0.04   0.965     .0923932    9.743384
T2DM, con..  |   1.015415   .3883666     0.04   0.968     .4798258    2.148836
T2DM, unc..  |   .7363272   .7835189    -0.29   0.774     .0914777    5.926885
Diabetes,..  |   2.815971   3.084317     0.95   0.345      .329088    24.09596
             |
cancer_exh~t |
  Last year  |   1.50e-19          .        .       .            .           .
2-5 years..  |   2.327756   1.578888     1.25   0.213     .6159964    8.796235
   5+ years  |   2.079987   .8040986     1.89   0.058     .9749812    4.437365
             |
cancer_hae~t |
  Last year  |   2.399934   2.414874     0.87   0.384     .3339634    17.24645
2-5 years..  |   7.064936    5.48297     2.52   0.012     1.543498     32.3378
   5+ years  |   .7807242   .3420662    -0.56   0.572     .3307901     1.84265
             |
1.~r_disease |    1.29643   .4421168     0.76   0.446     .6644574     2.52948
1.stroke_d~a |   1.620739   .5678958     1.38   0.168     .8155637    3.220833
1.other_ne~o |   1.391525   .5430273     0.85   0.397     .6476177    2.989944
             |
reduced_ki~t |
Stage 3a/..  |   .2082057    .197657    -1.65   0.098     .0323904    1.338345
      1.esrd |   1.120961   .3445831     0.37   0.710     .6136646    2.047621
1.other_tr~t |   1.370457   .4889082     0.88   0.377     .6810842    2.757593
  1.asplenia |   1.164915    .418941     0.42   0.671     .5756714    2.357294
1.ra_sle_p~s |   .7775404   .3006666    -0.65   0.515      .364395    1.659104
1.other_im~o |    2.00622   .7203041     1.94   0.052     .9925838    4.054993
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULL
> YADJMODEL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULLYADJMOD
> EL_ageband_1_timeperiod1.ster saved
(5,317 observations (episodes) created)
(cat_time: 5317 changes made)
(covid_death: 5317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       46.41       46.41
          1 |      3,260       32.86       79.27
          2 |      2,057       20.73      100.00
------------+-----------------------------------
      Total |      9,922      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,785        820 |     4,605 
         1 |     2,509        751 |     3,260 
         2 |     1,440        617 |     2,057 
-----------+----------------------+----------
     Total |     7,734      2,188 |     9,922 
(7,865 observations deleted)
   1:      1.23 /        1 =       1.2280

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,057             Number of obs    =       2,057
No. of failures      =          617
Time at risk         =        94958
                                                Wald chi2(42)    =      114.66
Log pseudolikelihood =   -3068.2578             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 744 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.479188   .5450835     1.06   0.288     .7183796    3.045739
 only 12-18  |   2.115054   .8792445     1.80   0.072      .936419    4.777191
      mixed  |   1.586496   .5744641     1.27   0.202     .7802293    3.225936
             |
        age1 |     .98109   .0367048    -0.51   0.610     .9117242    1.055733
        age2 |   1.106948   .2188037     0.51   0.607     .7514073    1.630719
        age3 |    .839073   .3281275    -0.45   0.654     .3898785    1.805802
      1.male |   .9108137   .0773325    -1.10   0.271     .7711847    1.075724
             |
   obese4cat |
Obese I ..)  |   1.119914   .1380867     0.92   0.358     .8794895    1.426064
Obese II..)  |   .8205459   .1249514    -1.30   0.194     .6088121    1.105917
Obese II..)  |   .9874463   .1729524    -0.07   0.943     .7005265    1.391882
             |
smoke_nomiss |
     Former  |   .7943752   .2573917    -0.71   0.477      .420941    1.499098
    Current  |    1.34907   .1685144     2.40   0.017     1.056111    1.723294
             |
         imd |
          4  |   .8125785    .079223    -2.13   0.033     .6712383    .9836803
5 most de..  |   .6783993   .1098732    -2.40   0.017     .4938844    .9318489
             |
tot_adults~h |
          2  |   .3537745   .2673346    -1.38   0.169      .080446    1.555782
          3  |   .3723977    .244925    -1.50   0.133     .1026063    1.351575
             |
   ethnicity |
Asian or ..  |    1.02288    .132191     0.18   0.861     .7939997    1.317738
      Other  |   .8699853   .1183103    -1.02   0.306     .6664323    1.135711
             |
1.htdiag_o~p |   1.190611   .1976205     1.05   0.293     .8599738    1.648369
1.~y_disease |   .8805818   .0901853    -1.24   0.214     .7204326    1.076331
    1.asthma |   .8545611   .1381461    -0.97   0.331      .622501     1.17313
1.~c_disease |   .9402571   .1003277    -0.58   0.564     .7628188    1.158969
             |
     diabcat |
T1DM, con..  |   1.359265   .3857659     1.08   0.279     .7793436    2.370714
T1DM, unc..  |   1.315494   .6366484     0.57   0.571     .5094949    3.396547
T2DM, con..  |   .9019889   .0960863    -0.97   0.333     .7320237    1.111418
T2DM, unc..  |    .933528   .2263482    -0.28   0.777     .5804174    1.501462
Diabetes,..  |   25.33377   11.40499     7.18   0.000      10.4833    61.22116
             |
cancer_exh~t |
  Last year  |   2.073469   .8654176     1.75   0.081     .9150098    4.698608
2-5 years..  |   .8403514   .2512426    -0.58   0.561     .4677076    1.509897
   5+ years  |    .988453   .1110694    -0.10   0.918     .7930657    1.231978
             |
cancer_hae~t |
  Last year  |   2.355501   .7846759     2.57   0.010     1.226102    4.525219
2-5 years..  |   .4247189   .2043941    -1.78   0.075      .165373    1.090783
   5+ years  |   1.014383   .1133301     0.13   0.898     .8148974    1.262702
             |
1.~r_disease |   1.124357   .1123539     1.17   0.241     .9243699     1.36761
1.stroke_d~a |   1.069967   .1096693     0.66   0.509     .8752338    1.308027
1.other_ne~o |   1.034466   .1103195     0.32   0.751     .8393455    1.274946
             |
reduced_ki~t |
Stage 3a/..  |   .8764488   .1793469    -0.64   0.519     .5868755    1.308902
      1.esrd |   1.066996   .0927297     0.75   0.456     .8998855     1.26514
1.other_tr~t |   .7922172   .0866932    -2.13   0.033     .6392878    .9817302
  1.asplenia |   1.147333   .1150236     1.37   0.170     .9426571    1.396449
1.ra_sle_p~s |   1.179847   .1121793     1.74   0.082     .9792502    1.421535
1.other_im~o |   .9614382    .099076    -0.38   0.703     .7856067    1.176624
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod2.ster saved

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      0b.kids_cat4|            .            .        1             .
      1.kids_cat4 |      0.00735         0.05        1         0.8302
      2.kids_cat4 |     -0.03548         1.01        1         0.3148
      3.kids_cat4 |     -0.01983         0.36        1         0.5482
      age1        |     -0.05456         2.55        1         0.1102
      age2        |      0.05617         2.74        1         0.0980
      age3        |     -0.05520         2.64        1         0.1039
      0b.male     |            .            .        1             .
      1.male      |     -0.01903         0.27        1         0.6020
      1b.obese4cat|            .            .        1             .
      2.obese4cat |     -0.01465         0.17        1         0.6844
      3.obese4cat |     -0.02263         0.41        1         0.5233
      4.obese4cat |      0.03509         1.13        1         0.2870
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.01523         0.17        1         0.6793
      3.smoke_no~s|     -0.06663         3.50        1         0.0613
      1b.imd      |            .            .        1             .
      4.imd       |      0.00502         0.02        1         0.8994
      5.imd       |      0.03330         0.85        1         0.3555
      1b.tot_adu~h|            .            .        1             .
      2.tot_adul~h|      0.05051         1.98        1         0.1594
      3.tot_adul~h|      0.06559         4.17        1         0.0410
      1b.ethnicity|            .            .        1             .
      3.ethnicity |      0.01331         0.13        1         0.7178
      5.ethnicity |      0.02621         0.48        1         0.4886
      0b.htdiag_~p|            .            .        1             .
      1.htdiag_o~p|     -0.02271         0.41        1         0.5195
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.01601         0.19        1         0.6669
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.00665         0.03        1         0.8560
      0b.chronic..|            .            .        1             .
      1.~c_disease|     -0.05998         2.93        1         0.0872
      1b.diabcat  |            .            .        1             .
      2.diabcat   |     -0.02641         0.52        1         0.4696
      3.diabcat   |     -0.04252         1.37        1         0.2410
      4.diabcat   |      0.02070         0.31        1         0.5768
      5.diabcat   |     -0.01428         0.15        1         0.6948
      6.diabcat   |      0.00731         0.02        1         0.8879
      1b.c~exhae~t|            .            .        1             .
      2.cancer_e~t|     -0.04911         1.71        1         0.1916
      3.cancer_e~t|      0.03639         0.81        1         0.3680
      4.cancer_e~t|     -0.00647         0.03        1         0.8565
      1b.cancer_..|            .            .        1             .
      2.cancer_h~t|      0.05395         1.61        1         0.2042
      3.cancer_h~t|     -0.03560         0.85        1         0.3570
      4.cancer_h~t|     -0.01987         0.33        1         0.5635
      0b.chronic..|            .            .        1             .
      1.~r_disease|      0.00390         0.01        1         0.9181
      0b.stroke_~a|            .            .        1             .
      1.stroke_d~a|      0.01957         0.28        1         0.5955
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.01899         0.28        1         0.5960
      1b.reduced~t|            .            .        1             .
      2.reduced_~t|     -0.01676         0.21        1         0.6467
      0b.esrd     |            .            .        1             .
      1.esrd      |      0.02829         0.61        1         0.4358
      0b.other_t~t|            .            .        1             .
      1.other_tr~t|      0.00868         0.06        1         0.8125
      0b.asplenia |            .            .        1             .
      1.asplenia  |     -0.05560         2.34        1         0.1261
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.02216         0.34        1         0.5609
      0b.other_i~o|            .            .        1             .
      1.other_im~o|     -0.01995         0.29        1         0.5900
      ------------+---------------------------------------------------
      global test |                     29.20       42         0.9326
      ----------------------------------------------------------------

note: robust variance-covariance matrix used.
   1:      1.30 /        1 =       1.3010
   1:     28.67 /        1 =      28.6680

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          206             Number of obs    =         206
No. of failures      =           60
Time at risk         =         9762
                                                Wald chi2(40)    =     6474.80
Log pseudolikelihood =   -132.89617             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 112 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
gp_number_~s |
2 childre..  |   .4451149   .2208282    -1.63   0.103     .1683365    1.176972
3 childre..  |   1.402473   .8253845     0.57   0.565     .4425317    4.444719
4+ childr..  |   .6281409   .2480491    -1.18   0.239     .2896828    1.362045
             |
        age1 |   1.330095   .2026466     1.87   0.061     .9867287    1.792947
        age2 |   .2876498   .2187051    -1.64   0.101     .0648158    1.276578
        age3 |    9.42204   13.96316     1.51   0.130     .5160496    172.0277
      1.male |   .9876981   .3388857    -0.04   0.971     .5041635    1.934983
             |
   obese4cat |
Obese I ..)  |   1.707295   1.089154     0.84   0.402     .4889808    5.961082
Obese II..)  |   .4114963   .2751245    -1.33   0.184      .110983    1.525722
Obese II..)  |   1.127122   .6442335     0.21   0.834     .3676602    3.455377
             |
smoke_nomiss |
     Former  |   6.60e-18   6.51e-18   -40.15   0.000     9.58e-19    4.55e-17
    Current  |   1.414019   .6693088     0.73   0.464     .5591767    3.575701
             |
         imd |
          4  |   1.784975   .7238216     1.43   0.153     .8062375    3.951856
5 most de..  |   1.130828   .6369387     0.22   0.827      .374936    3.410639
             |
tot_adults~h |
          2  |    1.22877   1.376938     0.18   0.854     .1366563    11.04871
          3  |   .9508675          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   1.020221   .6190965     0.03   0.974     .3105724    3.351393
      Other  |   .4747069    .354429    -1.00   0.318     .1098741    2.050953
             |
1.htdiag_o~p |     1.1373   .6017384     0.24   0.808     .4031901    3.208046
1.~y_disease |   1.301288    .644095     0.53   0.595     .4932383    3.433131
    1.asthma |   .7303174   .5298656    -0.43   0.665     .1761738    3.027485
1.~c_disease |   .3345283   .1807795    -2.03   0.043     .1159959    .9647685
             |
     diabcat |
T1DM, con..  |   5.097361   7.691058     1.08   0.280     .2648657    98.09909
T1DM, unc..  |   2.308714   1.840421     1.05   0.294     .4839764    11.01327
T2DM, con..  |   .1611824   .0798859    -3.68   0.000     .0610157    .4257881
T2DM, unc..  |   .7489082   1.289611    -0.17   0.867     .0256254    21.88704
Diabetes,..  |   1.78e+17          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   2.323652   4.905838     0.40   0.690     .0370734    145.6399
2-5 years..  |   .6328687   .6186539    -0.47   0.640     .0931603    4.299287
   5+ years  |    1.63344   .6372598     1.26   0.208     .7603632    3.509017
             |
cancer_hae~t |
  Last year  |   6.242948   7.339883     1.56   0.119      .623197    62.53945
2-5 years..  |   1.60e-17   2.01e-17   -30.82   0.000     1.37e-18    1.87e-16
   5+ years  |   .4745973   .2758994    -1.28   0.200     .1518774    1.483056
             |
1.~r_disease |   2.720793   1.078708     2.52   0.012     1.250896     5.91793
1.stroke_d~a |   .9260995    .405871    -0.18   0.861     .3922937    2.186271
1.other_ne~o |   2.542575   1.156868     2.05   0.040     1.042265    6.202533
             |
reduced_ki~t |
Stage 3a/..  |   .6433263   .4775692    -0.59   0.552     .1501575     2.75623
      1.esrd |   1.790933   .7286441     1.43   0.152     .8068013    3.975503
1.other_tr~t |    .843311   .4309634    -0.33   0.739     .3097362    2.296062
  1.asplenia |   2.021843    .922192     1.54   0.123     .8269935    4.943025
1.ra_sle_p~s |    .982946   .4317531    -0.04   0.969     .4155703    2.324956
1.other_im~o |   .5813567   .2531996    -1.25   0.213     .2475808    1.365113
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULL
> YADJMODEL_ageband_1_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_death_gp_number_kids_FULLYADJMOD
> EL_ageband_1_timeperiod2.ster saved
(5,317 observations (episodes) created)
(cat_time: 5317 changes made)
(covid_death: 5317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,605       46.41       46.41
          1 |      3,260       32.86       79.27
          2 |      2,057       20.73      100.00
------------+-----------------------------------
      Total |      9,922      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,785        820 |     4,605 
         1 |     2,509        751 |     3,260 
         2 |     1,440        617 |     2,057 
-----------+----------------------+----------
     Total |     7,734      2,188 |     9,922 
(9,922 observations deleted)
   1:      0.00 /        1 =       0.0040
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_death)
   1:      0.00 /        1 =       0.0040
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME covid_death)

. /*SENSITIVITY ANALYSIS: 12 months FUP
> keep if has_12_m_follow_up == 1
> foreach exposure_type in kids_cat4   {
> 
> *Age spline model (not adj ethnicity)
> cap erase ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x'
> basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
> if _rc==0{
> estimates
> estimates save ./output/an_sense_`outcome'_plus_eth_12mo_ageband_`x', replace
> *estat concordance /*c-statistic*/
> }
> else di "WARNING 12 MO FUP MODEL W/ AGE SPLINE  DID NOT FIT (OUTCOME `outcome
> ')"
> }       
> }
> */
. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death.log
  log type:  text
 closed on:  25 Jul 2021, 08:12:30
-------------------------------------------------------------------------------
