-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_test_ever.lo
> g
  log type:  text
 opened on:  17 Nov 2021, 20:30:10

. 
. 
. *****************************************************************************
> ********
. 
. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. if "`outcome'"=="covid_test_ever" {
 12. stsplit cat_time, at(0,85,154, 216, 263, 400)
 13. recode cat_time 85=1 154=2 216=3 263=4 
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18. *-School closure: 20th December 2020 (previous analysis up to 19th Decembe
> r 2020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 19. stsplit cat_time, at(0,92,161,222,270, 400)
 20. recode cat_time 92=1 161=2 222=3 270=4
 21. recode `outcome' .=0 
 22. tab cat_time
 23. tab cat_time `outcome'
 24. }
 25.  
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 26. 
. *Age spline model (not adj ethnicity)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id)
 27. if _rc==0{
 28. estimates
 29. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 30.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 31. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 32. 
. }
 33. drop cat_time
 34. }
 35. }
(36,437 observations (episodes) created)
(cat_time: 36437 changes made)
(covid_test_ever: 36437 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,120       30.67       30.67
          1 |     12,920       24.58       55.25
          2 |     10,122       19.26       74.51
          3 |      7,659       14.57       89.09
          4 |      5,736       10.91      100.00
------------+-----------------------------------
      Total |     52,557      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid test
observatio |         ever
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,900        220 |    16,120 
         1 |    12,692        228 |    12,920 
         2 |     9,884        238 |    10,122 
         3 |     7,447        212 |     7,659 
         4 |     5,459        277 |     5,736 
-----------+----------------------+----------
     Total |    51,382      1,175 |    52,557 

         failure _d:  covid_test_ever
   analysis time _t:  (stime_covid_test_ever-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1602.0279
Iteration 1:   log pseudolikelihood = -1577.8312
Iteration 2:   log pseudolikelihood = -1576.2643
Iteration 3:   log pseudolikelihood = -1576.1539
Iteration 4:   log pseudolikelihood =  -1576.125
Iteration 5:   log pseudolikelihood = -1576.1145
Iteration 6:   log pseudolikelihood = -1576.1106
Iteration 7:   log pseudolikelihood = -1576.1092
Iteration 8:   log pseudolikelihood = -1576.1086
Iteration 9:   log pseudolikelihood = -1576.1084
Iteration 10:  log pseudolikelihood = -1576.1084
Iteration 11:  log pseudolikelihood = -1576.1083
Iteration 12:  log pseudolikelihood = -1576.1083
Iteration 13:  log pseudolikelihood = -1576.1083
Iteration 14:  log pseudolikelihood = -1576.1083
Iteration 15:  log pseudolikelihood = -1576.1083
Iteration 16:  log pseudolikelihood = -1576.1083
Iteration 17:  log pseudolikelihood = -1576.1083
Iteration 18:  log pseudolikelihood = -1576.1083
Iteration 19:  log pseudolikelihood = -1576.1083
Iteration 20:  log pseudolikelihood = -1576.1083
Iteration 21:  log pseudolikelihood = -1576.1083
Iteration 22:  log pseudolikelihood = -1576.1083
Iteration 23:  log pseudolikelihood = -1576.1083
Iteration 24:  log pseudolikelihood = -1576.1083
Iteration 25:  log pseudolikelihood = -1576.1083
Iteration 26:  log pseudolikelihood = -1576.1083
Iteration 27:  log pseudolikelihood = -1576.1083
Iteration 28:  log pseudolikelihood = -1576.1083
Iteration 29:  log pseudolikelihood = -1576.1083
Iteration 30:  log pseudolikelihood = -1576.1083
Refining estimates:
Iteration 0:   log pseudolikelihood = -1576.1083
Iteration 1:   log pseudolikelihood = -1576.1083
Iteration 2:   log pseudolikelihood = -1576.1083

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,120             Number of obs    =      16,120
No. of failures      =          220
Time at risk         =      1234970
                                                Wald chi2(42)    =    40091.86
Log pseudolikelihood =   -1576.1083             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,134 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.307758     .80481     0.44   0.663     .3914604    4.368849
 only 12-18  |   3.382168   2.609182     1.58   0.114     .7456475    15.34111
      mixed  |   2.251783   1.334787     1.37   0.171     .7046294    7.196021
             |
        age1 |   .9767483   .0232246    -0.99   0.322     .9322732    1.023345
        age2 |   1.037223   .0796349     0.48   0.634     .8923173     1.20566
        age3 |   .9439206   .2025141    -0.27   0.788     .6198888    1.437332
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9989767   .1322953    -0.01   0.994     .7706018    1.295033
             |
   obese4cat |
Obese I ..)  |   .9931408   .2034859    -0.03   0.973     .6646715    1.483934
Obese II..)  |   .8682814   .2281892    -0.54   0.591     .5187522    1.453319
Obese II..)  |   1.122159     .31236     0.41   0.679      .650305    1.936385
             |
smoke_nomiss |
     Former  |   .2414945   .2403472    -1.43   0.153      .034336    1.698497
    Current  |   .8939252   .1972291    -0.51   0.611     .5800939     1.37754
             |
         imd |
          4  |   1.285685   .2078579     1.55   0.120     .9365265    1.765018
5 most de..  |   1.312134   .2636534     1.35   0.176     .8849976    1.945424
             |
tot_adults~h |
          2  |   1.713684   2.048222     0.45   0.652       .16465     17.8361
          3  |   .7910509    .816179    -0.23   0.820     .1047042    5.976471
             |
   ethnicity |
Asian or ..  |   .6358304   .1691535    -1.70   0.089     .3774778    1.071004
      Other  |   .7418557   .1802232    -1.23   0.219      .460821    1.194281
             |
1.htdiag_o~p |   .9558368   .1356469    -0.32   0.750     .7237458    1.262355
1.~y_disease |   .9182711   .1554091    -0.50   0.614     .6590414    1.279467
    1.asthma |   1.103846   .2616715     0.42   0.677     .6936295    1.756668
1.~c_disease |   .7288734   .1311568    -1.76   0.079     .5122512    1.037101
             |
     diabcat |
T1DM, con..  |   1.309024   .5044318     0.70   0.485     .6150885     2.78585
T1DM, unc..  |   1.505956   1.066322     0.58   0.563     .3759258    6.032851
T2DM, con..  |   .9666089   .1744297    -0.19   0.851     .6786517    1.376749
T2DM, unc..  |   .6291556   .2875238    -1.01   0.311     .2568972    1.540837
Diabetes,..  |   1.13e-14   6.28e-15   -57.62   0.000     3.78e-15    3.36e-14
             |
cancer_exh~t |
  Last year  |   1.15e-14   2.10e-15  -176.59   0.000     8.08e-15    1.65e-14
2-5 years..  |   2.062492   .7716091     1.94   0.053     .9907063    4.293777
   5+ years  |   .8678266   .1757492    -0.70   0.484      .583513     1.29067
             |
cancer_hae~t |
  Last year  |   1.232051   1.226111     0.21   0.834     .1751987    8.664158
2-5 years..  |    1.37884   .6228686     0.71   0.477     .5688498    3.342184
   5+ years  |   .8166052   .1496472    -1.11   0.269     .5701971    1.169497
             |
1.~r_disease |   .8269143   .1450836    -1.08   0.279     .5862943    1.166287
1.stroke_d~a |   .9958871   .1675429    -0.02   0.980     .7161572    1.384879
1.other_ne~o |   1.166814   .1953585     0.92   0.357     .8403995    1.620009
             |
reduced_ki~t |
Stage 3a/..  |   2.196695   1.605224     1.08   0.282     .5245158    9.199854
      1.esrd |   .8396675   .1210351    -1.21   0.225     .6330087    1.113794
1.other_tr~t |    1.05053   .1761928     0.29   0.769     .7562169    1.459386
  1.asplenia |   .8735647   .1518048    -0.78   0.437     .6214074    1.228043
1.ra_sle_p~s |   1.170431   .1833848     1.00   0.315     .8609505    1.591157
1.other_im~o |    .532182    .114257    -2.94   0.003     .3493906    .8106048
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,120             Number of obs    =      16,120
No. of failures      =          220
Time at risk         =      1234970
                                                Wald chi2(42)    =    40091.86
Log pseudolikelihood =   -1576.1083             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,134 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.307758     .80481     0.44   0.663     .3914604    4.368849
 only 12-18  |   3.382168   2.609182     1.58   0.114     .7456475    15.34111
      mixed  |   2.251783   1.334787     1.37   0.171     .7046294    7.196021
             |
        age1 |   .9767483   .0232246    -0.99   0.322     .9322732    1.023345
        age2 |   1.037223   .0796349     0.48   0.634     .8923173     1.20566
        age3 |   .9439206   .2025141    -0.27   0.788     .6198888    1.437332
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9989767   .1322953    -0.01   0.994     .7706018    1.295033
             |
   obese4cat |
Obese I ..)  |   .9931408   .2034859    -0.03   0.973     .6646715    1.483934
Obese II..)  |   .8682814   .2281892    -0.54   0.591     .5187522    1.453319
Obese II..)  |   1.122159     .31236     0.41   0.679      .650305    1.936385
             |
smoke_nomiss |
     Former  |   .2414945   .2403472    -1.43   0.153      .034336    1.698497
    Current  |   .8939252   .1972291    -0.51   0.611     .5800939     1.37754
             |
         imd |
          4  |   1.285685   .2078579     1.55   0.120     .9365265    1.765018
5 most de..  |   1.312134   .2636534     1.35   0.176     .8849976    1.945424
             |
tot_adults~h |
          2  |   1.713684   2.048222     0.45   0.652       .16465     17.8361
          3  |   .7910509    .816179    -0.23   0.820     .1047042    5.976471
             |
   ethnicity |
Asian or ..  |   .6358304   .1691535    -1.70   0.089     .3774778    1.071004
      Other  |   .7418557   .1802232    -1.23   0.219      .460821    1.194281
             |
1.htdiag_o~p |   .9558368   .1356469    -0.32   0.750     .7237458    1.262355
1.~y_disease |   .9182711   .1554091    -0.50   0.614     .6590414    1.279467
    1.asthma |   1.103846   .2616715     0.42   0.677     .6936295    1.756668
1.~c_disease |   .7288734   .1311568    -1.76   0.079     .5122512    1.037101
             |
     diabcat |
T1DM, con..  |   1.309024   .5044318     0.70   0.485     .6150885     2.78585
T1DM, unc..  |   1.505956   1.066322     0.58   0.563     .3759258    6.032851
T2DM, con..  |   .9666089   .1744297    -0.19   0.851     .6786517    1.376749
T2DM, unc..  |   .6291556   .2875238    -1.01   0.311     .2568972    1.540837
Diabetes,..  |   1.13e-14   6.28e-15   -57.62   0.000     3.78e-15    3.36e-14
             |
cancer_exh~t |
  Last year  |   1.15e-14   2.10e-15  -176.59   0.000     8.08e-15    1.65e-14
2-5 years..  |   2.062492   .7716091     1.94   0.053     .9907063    4.293777
   5+ years  |   .8678266   .1757492    -0.70   0.484      .583513     1.29067
             |
cancer_hae~t |
  Last year  |   1.232051   1.226111     0.21   0.834     .1751987    8.664158
2-5 years..  |    1.37884   .6228686     0.71   0.477     .5688498    3.342184
   5+ years  |   .8166052   .1496472    -1.11   0.269     .5701971    1.169497
             |
1.~r_disease |   .8269143   .1450836    -1.08   0.279     .5862943    1.166287
1.stroke_d~a |   .9958871   .1675429    -0.02   0.980     .7161572    1.384879
1.other_ne~o |   1.166814   .1953585     0.92   0.357     .8403995    1.620009
             |
reduced_ki~t |
Stage 3a/..  |   2.196695   1.605224     1.08   0.282     .5245158    9.199854
      1.esrd |   .8396675   .1210351    -1.21   0.225     .6330087    1.113794
1.other_tr~t |    1.05053   .1761928     0.29   0.769     .7562169    1.459386
  1.asplenia |   .8735647   .1518048    -0.78   0.437     .6214074    1.228043
1.ra_sle_p~s |   1.170431   .1833848     1.00   0.315     .8609505    1.591157
1.other_im~o |    .532182    .114257    -2.94   0.003     .3493906    .8106048
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLY
> ADJMODEL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLYADJMODE
> L_ageband_0_timeperiod0.ster saved
(no new episodes generated)
(cat_time: 36437 changes made)
(covid_test_ever: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,120       30.67       30.67
          1 |     12,920       24.58       55.25
          2 |     10,122       19.26       74.51
          3 |      7,659       14.57       89.09
          4 |      5,736       10.91      100.00
------------+-----------------------------------
      Total |     52,557      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid test
observatio |         ever
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,900        220 |    16,120 
         1 |    12,692        228 |    12,920 
         2 |     9,884        238 |    10,122 
         3 |     7,447        212 |     7,659 
         4 |     5,459        277 |     5,736 
-----------+----------------------+----------
     Total |    51,382      1,175 |    52,557 

         failure _d:  covid_test_ever
   analysis time _t:  (stime_covid_test_ever-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1606.5725
Iteration 1:   log pseudolikelihood = -1584.0344
Iteration 2:   log pseudolikelihood = -1582.7251
Iteration 3:   log pseudolikelihood = -1582.5312
Iteration 4:   log pseudolikelihood = -1582.4638
Iteration 5:   log pseudolikelihood = -1582.4391
Iteration 6:   log pseudolikelihood =   -1582.43
Iteration 7:   log pseudolikelihood = -1582.4266
Iteration 8:   log pseudolikelihood = -1582.4254
Iteration 9:   log pseudolikelihood = -1582.4249
Iteration 10:  log pseudolikelihood = -1582.4248
Iteration 11:  log pseudolikelihood = -1582.4247
Iteration 12:  log pseudolikelihood = -1582.4247
Iteration 13:  log pseudolikelihood = -1582.4247
Iteration 14:  log pseudolikelihood = -1582.4247
Iteration 15:  log pseudolikelihood = -1582.4247
Iteration 16:  log pseudolikelihood = -1582.4247
Iteration 17:  log pseudolikelihood = -1582.4247
Iteration 18:  log pseudolikelihood = -1582.4247
Iteration 19:  log pseudolikelihood = -1582.4247
Iteration 20:  log pseudolikelihood = -1582.4247
Iteration 21:  log pseudolikelihood = -1582.4247
Iteration 22:  log pseudolikelihood = -1582.4247
Iteration 23:  log pseudolikelihood = -1582.4247
Iteration 24:  log pseudolikelihood = -1582.4247
Iteration 25:  log pseudolikelihood = -1582.4247
Iteration 26:  log pseudolikelihood = -1582.4247
Iteration 27:  log pseudolikelihood = -1582.4247
Iteration 28:  log pseudolikelihood = -1582.4247
Iteration 29:  log pseudolikelihood = -1582.4247
Iteration 30:  log pseudolikelihood = -1582.4247
Iteration 31:  log pseudolikelihood = -1582.4247
Refining estimates:
Iteration 0:   log pseudolikelihood = -1582.4247
Iteration 1:   log pseudolikelihood = -1582.4247

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,920             Number of obs    =      12,920
No. of failures      =          228
Time at risk         =       796939
                                                Wald chi2(42)    =    58387.74
Log pseudolikelihood =   -1582.4247             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,108 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .4689499   .1913447    -1.86   0.063     .2107717    1.043375
 only 12-18  |   .4611958    .347683    -1.03   0.305     .1052417    2.021078
      mixed  |   .5474801   .1987217    -1.66   0.097     .2687839     1.11515
             |
        age1 |   1.025935   .0264477     0.99   0.321     .9753859    1.079103
        age2 |   .8919379   .0698615    -1.46   0.144     .7650042    1.039933
        age3 |   1.421673   .3044796     1.64   0.100     .9343251    2.163224
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9559707   .1281263    -0.34   0.737     .7351233    1.243165
             |
   obese4cat |
Obese I ..)  |   .5788514   .1369387    -2.31   0.021     .3640815    .9203131
Obese II..)  |   .4297717   .1392681    -2.61   0.009     .2277219    .8110933
Obese II..)  |   .5251779   .1846266    -1.83   0.067     .2636732    1.046037
             |
smoke_nomiss |
     Former  |   1.135997   .5192196     0.28   0.780     .4637952    2.782454
    Current  |    .711007   .1675997    -1.45   0.148     .4479476    1.128549
             |
         imd |
          4  |   1.330899    .207774     1.83   0.067     .9800751    1.807303
5 most de..  |   1.171016   .2570154     0.72   0.472     .7616234    1.800467
             |
tot_adults~h |
          2  |    .999554   1.414248    -0.00   1.000     .0624394    16.00123
          3  |   2.318238   2.393875     0.81   0.416     .3063264    17.54413
             |
   ethnicity |
Asian or ..  |   .8061135   .1926477    -0.90   0.367     .5046302    1.287713
      Other  |   1.030291   .2222869     0.14   0.890     .6750122    1.572562
             |
1.htdiag_o~p |   1.043979   .1481354     0.30   0.762     .7905156     1.37871
1.~y_disease |   .9183534   .1635679    -0.48   0.633     .6477424    1.302019
    1.asthma |   1.164825   .2636522     0.67   0.500     .7474727    1.815205
1.~c_disease |    1.24818   .1963498     1.41   0.159     .9170129    1.698942
             |
     diabcat |
T1DM, con..  |   1.513045   .5408761     1.16   0.247     .7508762    3.048844
T1DM, unc..  |   1.28e-14   2.42e-15  -169.03   0.000     8.82e-15    1.85e-14
T2DM, con..  |   .9745108   .1741639    -0.14   0.885     .6865315    1.383289
T2DM, unc..  |   1.239872   .4070099     0.65   0.512     .6515605    2.359385
Diabetes,..  |   1.61e-14   9.66e-15   -53.01   0.000     4.99e-15    5.22e-14
             |
cancer_exh~t |
  Last year  |   1.21e-14   2.36e-15  -165.12   0.000     8.30e-15    1.78e-14
2-5 years..  |   .3139573   .3159013    -1.15   0.250     .0436916    2.256019
   5+ years  |   1.107005   .1812204     0.62   0.535     .8031654    1.525788
             |
cancer_hae~t |
  Last year  |   1.189046   1.209483     0.17   0.865     .1619449     8.73032
2-5 years..  |   1.549149   .6464786     1.05   0.294     .6837175    3.510023
   5+ years  |   .8557875   .1561067    -0.85   0.393     .5985435     1.22359
             |
1.~r_disease |    .922473   .1550569    -0.48   0.631     .6635546    1.282421
1.stroke_d~a |   .9084027   .1545305    -0.56   0.572     .6508464     1.26788
1.other_ne~o |   .8915403   .1528364    -0.67   0.503     .6371179    1.247562
             |
reduced_ki~t |
Stage 3a/..  |    1.98708   1.391384     0.98   0.327     .5037218    7.838624
      1.esrd |   .8573988   .1271973    -1.04   0.300     .6410692    1.146729
1.other_tr~t |   .8526409   .1461957    -0.93   0.353     .6092805    1.193205
  1.asplenia |   1.109234   .1788523     0.64   0.520     .8086785    1.521495
1.ra_sle_p~s |   .9486773    .160428    -0.31   0.755     .6810427    1.321486
1.other_im~o |   1.075283    .172922     0.45   0.652     .7845791      1.4737
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,920             Number of obs    =      12,920
No. of failures      =          228
Time at risk         =       796939
                                                Wald chi2(42)    =    58387.74
Log pseudolikelihood =   -1582.4247             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,108 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .4689499   .1913447    -1.86   0.063     .2107717    1.043375
 only 12-18  |   .4611958    .347683    -1.03   0.305     .1052417    2.021078
      mixed  |   .5474801   .1987217    -1.66   0.097     .2687839     1.11515
             |
        age1 |   1.025935   .0264477     0.99   0.321     .9753859    1.079103
        age2 |   .8919379   .0698615    -1.46   0.144     .7650042    1.039933
        age3 |   1.421673   .3044796     1.64   0.100     .9343251    2.163224
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9559707   .1281263    -0.34   0.737     .7351233    1.243165
             |
   obese4cat |
Obese I ..)  |   .5788514   .1369387    -2.31   0.021     .3640815    .9203131
Obese II..)  |   .4297717   .1392681    -2.61   0.009     .2277219    .8110933
Obese II..)  |   .5251779   .1846266    -1.83   0.067     .2636732    1.046037
             |
smoke_nomiss |
     Former  |   1.135997   .5192196     0.28   0.780     .4637952    2.782454
    Current  |    .711007   .1675997    -1.45   0.148     .4479476    1.128549
             |
         imd |
          4  |   1.330899    .207774     1.83   0.067     .9800751    1.807303
5 most de..  |   1.171016   .2570154     0.72   0.472     .7616234    1.800467
             |
tot_adults~h |
          2  |    .999554   1.414248    -0.00   1.000     .0624394    16.00123
          3  |   2.318238   2.393875     0.81   0.416     .3063264    17.54413
             |
   ethnicity |
Asian or ..  |   .8061135   .1926477    -0.90   0.367     .5046302    1.287713
      Other  |   1.030291   .2222869     0.14   0.890     .6750122    1.572562
             |
1.htdiag_o~p |   1.043979   .1481354     0.30   0.762     .7905156     1.37871
1.~y_disease |   .9183534   .1635679    -0.48   0.633     .6477424    1.302019
    1.asthma |   1.164825   .2636522     0.67   0.500     .7474727    1.815205
1.~c_disease |    1.24818   .1963498     1.41   0.159     .9170129    1.698942
             |
     diabcat |
T1DM, con..  |   1.513045   .5408761     1.16   0.247     .7508762    3.048844
T1DM, unc..  |   1.28e-14   2.42e-15  -169.03   0.000     8.82e-15    1.85e-14
T2DM, con..  |   .9745108   .1741639    -0.14   0.885     .6865315    1.383289
T2DM, unc..  |   1.239872   .4070099     0.65   0.512     .6515605    2.359385
Diabetes,..  |   1.61e-14   9.66e-15   -53.01   0.000     4.99e-15    5.22e-14
             |
cancer_exh~t |
  Last year  |   1.21e-14   2.36e-15  -165.12   0.000     8.30e-15    1.78e-14
2-5 years..  |   .3139573   .3159013    -1.15   0.250     .0436916    2.256019
   5+ years  |   1.107005   .1812204     0.62   0.535     .8031654    1.525788
             |
cancer_hae~t |
  Last year  |   1.189046   1.209483     0.17   0.865     .1619449     8.73032
2-5 years..  |   1.549149   .6464786     1.05   0.294     .6837175    3.510023
   5+ years  |   .8557875   .1561067    -0.85   0.393     .5985435     1.22359
             |
1.~r_disease |    .922473   .1550569    -0.48   0.631     .6635546    1.282421
1.stroke_d~a |   .9084027   .1545305    -0.56   0.572     .6508464     1.26788
1.other_ne~o |   .8915403   .1528364    -0.67   0.503     .6371179    1.247562
             |
reduced_ki~t |
Stage 3a/..  |    1.98708   1.391384     0.98   0.327     .5037218    7.838624
      1.esrd |   .8573988   .1271973    -1.04   0.300     .6410692    1.146729
1.other_tr~t |   .8526409   .1461957    -0.93   0.353     .6092805    1.193205
  1.asplenia |   1.109234   .1788523     0.64   0.520     .8086785    1.521495
1.ra_sle_p~s |   .9486773    .160428    -0.31   0.755     .6810427    1.321486
1.other_im~o |   1.075283    .172922     0.45   0.652     .7845791      1.4737
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLY
> ADJMODEL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLYADJMODE
> L_ageband_0_timeperiod1.ster saved
(no new episodes generated)
(cat_time: 36437 changes made)
(covid_test_ever: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,120       30.67       30.67
          1 |     12,920       24.58       55.25
          2 |     10,122       19.26       74.51
          3 |      7,659       14.57       89.09
          4 |      5,736       10.91      100.00
------------+-----------------------------------
      Total |     52,557      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid test
observatio |         ever
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,900        220 |    16,120 
         1 |    12,692        228 |    12,920 
         2 |     9,884        238 |    10,122 
         3 |     7,447        212 |     7,659 
         4 |     5,459        277 |     5,736 
-----------+----------------------+----------
     Total |    51,382      1,175 |    52,557 

         failure _d:  covid_test_ever
   analysis time _t:  (stime_covid_test_ever-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1614.3246
Iteration 1:   log pseudolikelihood = -1597.8778
Iteration 2:   log pseudolikelihood = -1595.4827
Iteration 3:   log pseudolikelihood = -1595.2352
Iteration 4:   log pseudolikelihood = -1595.1576
Iteration 5:   log pseudolikelihood = -1595.1291
Iteration 6:   log pseudolikelihood = -1595.1186
Iteration 7:   log pseudolikelihood = -1595.1147
Iteration 8:   log pseudolikelihood = -1595.1133
Iteration 9:   log pseudolikelihood = -1595.1128
Iteration 10:  log pseudolikelihood = -1595.1126
Iteration 11:  log pseudolikelihood = -1595.1125
Iteration 12:  log pseudolikelihood = -1595.1125
Iteration 13:  log pseudolikelihood = -1595.1125
Iteration 14:  log pseudolikelihood = -1595.1125
Iteration 15:  log pseudolikelihood = -1595.1125
Iteration 16:  log pseudolikelihood = -1595.1125
Iteration 17:  log pseudolikelihood = -1595.1125
Iteration 18:  log pseudolikelihood = -1595.1125
Iteration 19:  log pseudolikelihood = -1595.1125
Iteration 20:  log pseudolikelihood = -1595.1125
Iteration 21:  log pseudolikelihood = -1595.1125
Iteration 22:  log pseudolikelihood = -1595.1125
Iteration 23:  log pseudolikelihood = -1595.1125
Iteration 24:  log pseudolikelihood = -1595.1125
Iteration 25:  log pseudolikelihood = -1595.1125
Iteration 26:  log pseudolikelihood = -1595.1125
Iteration 27:  log pseudolikelihood = -1595.1125
Iteration 28:  log pseudolikelihood = -1595.1125
Iteration 29:  log pseudolikelihood = -1595.1125
Iteration 30:  log pseudolikelihood = -1595.1125
Iteration 31:  log pseudolikelihood = -1595.1125
Refining estimates:
Iteration 0:   log pseudolikelihood = -1595.1125
Iteration 1:   log pseudolikelihood = -1595.1125

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       10,122             Number of obs    =      10,122
No. of failures      =          238
Time at risk         =       554359
                                                Wald chi2(42)    =    52627.20
Log pseudolikelihood =   -1595.1125             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,065 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .7615481   .4045826    -0.51   0.608     .2688346    2.157295
 only 12-18  |   .7683839   .6347952    -0.32   0.750     .1521822    3.879652
      mixed  |   .8797397   .4224161    -0.27   0.790      .343274    2.254589
             |
        age1 |   1.025886   .0233386     1.12   0.261      .981148    1.072664
        age2 |   .8989063   .0644059    -1.49   0.137     .7811357    1.034433
        age3 |   1.367533   .2709932     1.58   0.114     .9273891    2.016572
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9642161    .128554    -0.27   0.785     .7424855    1.252163
             |
   obese4cat |
Obese I ..)  |   .9917987    .189136    -0.04   0.966      .682495    1.441278
Obese II..)  |   .8684438    .208143    -0.59   0.556     .5429142     1.38916
Obese II..)  |   .6559225   .2249409    -1.23   0.219     .3349215    1.284583
             |
smoke_nomiss |
     Former  |    2.40229   .7951565     2.65   0.008     1.255678    4.595922
    Current  |   1.101769   .2085429     0.51   0.609     .7602829    1.596637
             |
         imd |
          4  |   .9137943   .1552935    -0.53   0.596     .6549258    1.274984
5 most de..  |   .7046675   .1740421    -1.42   0.156     .4342607    1.143452
             |
tot_adults~h |
          2  |   2.06e-14   2.15e-14   -30.13   0.000     2.65e-15    1.60e-13
          3  |   1.878545   2.198746     0.54   0.590     .1894659    18.62567
             |
   ethnicity |
Asian or ..  |   .8435392   .1960775    -0.73   0.464     .5348681    1.330344
      Other  |   1.241769   .2590523     1.04   0.299     .8250243    1.869023
             |
1.htdiag_o~p |   .9436814    .131884    -0.41   0.678     .7175726    1.241038
1.~y_disease |   .8588743   .1434779    -0.91   0.362     .6190611    1.191587
    1.asthma |   .9882706     .23517    -0.05   0.960     .6199019    1.575538
1.~c_disease |   1.036539   .1600939     0.23   0.816     .7658035    1.402989
             |
     diabcat |
T1DM, con..  |   .9704204    .402818    -0.07   0.942     .4301592    2.189226
T1DM, unc..  |   .7566085   .7604196    -0.28   0.781     .1055315    5.424508
T2DM, con..  |   .8624541   .1579159    -0.81   0.419     .6023937    1.234786
T2DM, unc..  |   .6853884    .283515    -0.91   0.361     .3046718    1.541847
Diabetes,..  |   1.37e-14   8.59e-15   -51.04   0.000     4.03e-15    4.68e-14
             |
cancer_exh~t |
  Last year  |   1.013031   .9980035     0.01   0.990     .1469088      6.9855
2-5 years..  |     1.3569   .5921586     0.70   0.484     .5768711    3.191662
   5+ years  |   .7921466   .1541874    -1.20   0.231      .540908    1.160079
             |
cancer_hae~t |
  Last year  |   1.17e-14   2.65e-15  -141.27   0.000     7.47e-15    1.82e-14
2-5 years..  |    2.22962   .7408453     2.41   0.016     1.162515    4.276251
   5+ years  |   1.025491   .1716788     0.15   0.880     .7386369    1.423746
             |
1.~r_disease |   1.055083   .1733612     0.33   0.744     .7645842    1.455955
1.stroke_d~a |   .9225946   .1505722    -0.49   0.622     .6700241    1.270373
1.other_ne~o |    1.04772   .1671281     0.29   0.770      .766417    1.432272
             |
reduced_ki~t |
Stage 3a/..  |   2.006521   1.395572     1.00   0.317     .5133551    7.842775
      1.esrd |   1.177184   .1552911     1.24   0.216     .9089834    1.524518
1.other_tr~t |   1.203494   .1882105     1.18   0.236     .8857825    1.635161
  1.asplenia |    1.10118   .1791436     0.59   0.554     .8005381    1.514728
1.ra_sle_p~s |    1.15849   .1731825     0.98   0.325     .8642642    1.552882
1.other_im~o |   1.337728   .1944091     2.00   0.045     1.006154    1.778571
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       10,122             Number of obs    =      10,122
No. of failures      =          238
Time at risk         =       554359
                                                Wald chi2(42)    =    52627.20
Log pseudolikelihood =   -1595.1125             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,065 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .7615481   .4045826    -0.51   0.608     .2688346    2.157295
 only 12-18  |   .7683839   .6347952    -0.32   0.750     .1521822    3.879652
      mixed  |   .8797397   .4224161    -0.27   0.790      .343274    2.254589
             |
        age1 |   1.025886   .0233386     1.12   0.261      .981148    1.072664
        age2 |   .8989063   .0644059    -1.49   0.137     .7811357    1.034433
        age3 |   1.367533   .2709932     1.58   0.114     .9273891    2.016572
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9642161    .128554    -0.27   0.785     .7424855    1.252163
             |
   obese4cat |
Obese I ..)  |   .9917987    .189136    -0.04   0.966      .682495    1.441278
Obese II..)  |   .8684438    .208143    -0.59   0.556     .5429142     1.38916
Obese II..)  |   .6559225   .2249409    -1.23   0.219     .3349215    1.284583
             |
smoke_nomiss |
     Former  |    2.40229   .7951565     2.65   0.008     1.255678    4.595922
    Current  |   1.101769   .2085429     0.51   0.609     .7602829    1.596637
             |
         imd |
          4  |   .9137943   .1552935    -0.53   0.596     .6549258    1.274984
5 most de..  |   .7046675   .1740421    -1.42   0.156     .4342607    1.143452
             |
tot_adults~h |
          2  |   2.06e-14   2.15e-14   -30.13   0.000     2.65e-15    1.60e-13
          3  |   1.878545   2.198746     0.54   0.590     .1894659    18.62567
             |
   ethnicity |
Asian or ..  |   .8435392   .1960775    -0.73   0.464     .5348681    1.330344
      Other  |   1.241769   .2590523     1.04   0.299     .8250243    1.869023
             |
1.htdiag_o~p |   .9436814    .131884    -0.41   0.678     .7175726    1.241038
1.~y_disease |   .8588743   .1434779    -0.91   0.362     .6190611    1.191587
    1.asthma |   .9882706     .23517    -0.05   0.960     .6199019    1.575538
1.~c_disease |   1.036539   .1600939     0.23   0.816     .7658035    1.402989
             |
     diabcat |
T1DM, con..  |   .9704204    .402818    -0.07   0.942     .4301592    2.189226
T1DM, unc..  |   .7566085   .7604196    -0.28   0.781     .1055315    5.424508
T2DM, con..  |   .8624541   .1579159    -0.81   0.419     .6023937    1.234786
T2DM, unc..  |   .6853884    .283515    -0.91   0.361     .3046718    1.541847
Diabetes,..  |   1.37e-14   8.59e-15   -51.04   0.000     4.03e-15    4.68e-14
             |
cancer_exh~t |
  Last year  |   1.013031   .9980035     0.01   0.990     .1469088      6.9855
2-5 years..  |     1.3569   .5921586     0.70   0.484     .5768711    3.191662
   5+ years  |   .7921466   .1541874    -1.20   0.231      .540908    1.160079
             |
cancer_hae~t |
  Last year  |   1.17e-14   2.65e-15  -141.27   0.000     7.47e-15    1.82e-14
2-5 years..  |    2.22962   .7408453     2.41   0.016     1.162515    4.276251
   5+ years  |   1.025491   .1716788     0.15   0.880     .7386369    1.423746
             |
1.~r_disease |   1.055083   .1733612     0.33   0.744     .7645842    1.455955
1.stroke_d~a |   .9225946   .1505722    -0.49   0.622     .6700241    1.270373
1.other_ne~o |    1.04772   .1671281     0.29   0.770      .766417    1.432272
             |
reduced_ki~t |
Stage 3a/..  |   2.006521   1.395572     1.00   0.317     .5133551    7.842775
      1.esrd |   1.177184   .1552911     1.24   0.216     .9089834    1.524518
1.other_tr~t |   1.203494   .1882105     1.18   0.236     .8857825    1.635161
  1.asplenia |    1.10118   .1791436     0.59   0.554     .8005381    1.514728
1.ra_sle_p~s |    1.15849   .1731825     0.98   0.325     .8642642    1.552882
1.other_im~o |   1.337728   .1944091     2.00   0.045     1.006154    1.778571
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLY
> ADJMODEL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLYADJMODE
> L_ageband_0_timeperiod2.ster saved
(no new episodes generated)
(cat_time: 36437 changes made)
(covid_test_ever: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,120       30.67       30.67
          1 |     12,920       24.58       55.25
          2 |     10,122       19.26       74.51
          3 |      7,659       14.57       89.09
          4 |      5,736       10.91      100.00
------------+-----------------------------------
      Total |     52,557      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid test
observatio |         ever
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,900        220 |    16,120 
         1 |    12,692        228 |    12,920 
         2 |     9,884        238 |    10,122 
         3 |     7,447        212 |     7,659 
         4 |     5,459        277 |     5,736 
-----------+----------------------+----------
     Total |    51,382      1,175 |    52,557 

         failure _d:  covid_test_ever
   analysis time _t:  (stime_covid_test_ever-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1375.9722
Iteration 1:   log pseudolikelihood = -1364.9466
Iteration 2:   log pseudolikelihood = -1352.3925
Iteration 3:   log pseudolikelihood = -1351.3834
Iteration 4:   log pseudolikelihood = -1351.0925
Iteration 5:   log pseudolikelihood =  -1350.986
Iteration 6:   log pseudolikelihood = -1350.9469
Iteration 7:   log pseudolikelihood = -1350.9325
Iteration 8:   log pseudolikelihood = -1350.9272
Iteration 9:   log pseudolikelihood = -1350.9252
Iteration 10:  log pseudolikelihood = -1350.9245
Iteration 11:  log pseudolikelihood = -1350.9243
Iteration 12:  log pseudolikelihood = -1350.9242
Iteration 13:  log pseudolikelihood = -1350.9241
Iteration 14:  log pseudolikelihood = -1350.9241
Iteration 15:  log pseudolikelihood = -1350.9241
Iteration 16:  log pseudolikelihood = -1350.9241
Iteration 17:  log pseudolikelihood = -1350.9241
Iteration 18:  log pseudolikelihood = -1350.9241
Iteration 19:  log pseudolikelihood = -1350.9241
Iteration 20:  log pseudolikelihood = -1350.9241
Iteration 21:  log pseudolikelihood = -1350.9241
Iteration 22:  log pseudolikelihood = -1350.9241
Iteration 23:  log pseudolikelihood = -1350.9241
Iteration 24:  log pseudolikelihood = -1350.9241
Iteration 25:  log pseudolikelihood = -1350.9241
Iteration 26:  log pseudolikelihood = -1350.9241
Iteration 27:  log pseudolikelihood = -1350.9241
Iteration 28:  log pseudolikelihood = -1350.9241
Iteration 29:  log pseudolikelihood = -1350.9241
Iteration 30:  log pseudolikelihood = -1350.9241
Iteration 31:  log pseudolikelihood = -1350.9241
Iteration 32:  log pseudolikelihood = -1350.9241
Refining estimates:
Iteration 0:   log pseudolikelihood = -1350.9241
Iteration 1:   log pseudolikelihood = -1350.9241

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        7,659             Number of obs    =       7,659
No. of failures      =          212
Time at risk         =       316108
                                                Wald chi2(41)    =    58591.94
Log pseudolikelihood =   -1350.9241             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,019 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.248452   .7712982     0.36   0.719     .3719602     4.19032
 only 12-18  |   3.323593   2.336804     1.71   0.088      .837783    13.18512
      mixed  |   1.406826   .8206321     0.59   0.558     .4484524    4.413312
             |
        age1 |   1.027569   .0270823     1.03   0.302     .9758361    1.082044
        age2 |   .9664835    .078286    -0.42   0.674     .8246057    1.132772
        age3 |   1.013961   .2269111     0.06   0.951     .6539335    1.572204
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    1.15727    .159908     1.06   0.290     .8827106    1.517229
             |
   obese4cat |
Obese I ..)  |   1.294425   .2459156     1.36   0.174     .8920007    1.878403
Obese II..)  |    1.00867   .2546757     0.03   0.973      .614939    1.654497
Obese II..)  |   1.264334   .3539174     0.84   0.402     .7304497    2.188435
             |
smoke_nomiss |
     Former  |   1.295299   .5805708     0.58   0.564     .5380835    3.118102
    Current  |   1.190866   .2326226     0.89   0.371     .8120638    1.746368
             |
         imd |
          4  |   1.036059   .1804444     0.20   0.839      .736437    1.457583
5 most de..  |   .7823648   .2074342    -0.93   0.355     .4652901    1.315512
             |
tot_adults~h |
          2  |   1.15e+09          .        .       .            .           .
          3  |   1.43e+09   1.61e+09    18.70   0.000     1.57e+08    1.30e+10
             |
   ethnicity |
Asian or ..  |   1.560514   .3007597     2.31   0.021     1.069584    2.276779
      Other  |   1.276118   .2990196     1.04   0.298     .8061902    2.019966
             |
1.htdiag_o~p |   1.008113    .158838     0.05   0.959     .7402769    1.372854
1.~y_disease |    .813676   .1465748    -1.14   0.252     .5716324    1.158207
    1.asthma |   1.068257   .2575211     0.27   0.784     .6660078    1.713452
1.~c_disease |   .9172545   .1657474    -0.48   0.633     .6436921    1.307078
             |
     diabcat |
T1DM, con..  |   .4369336   .3120238    -1.16   0.246     .1077839    1.771238
T1DM, unc..  |   8.00e-15   1.88e-15  -138.12   0.000     5.05e-15    1.27e-14
T2DM, con..  |    1.03751   .1767675     0.22   0.829     .7429636     1.44883
T2DM, unc..  |   1.166894   .4291421     0.42   0.675     .5675316    2.399237
Diabetes,..  |   14.98442    16.0194     2.53   0.011     1.843509    121.7964
             |
cancer_exh~t |
  Last year  |   1.04e-14   2.24e-15  -148.62   0.000     6.78e-15    1.58e-14
2-5 years..  |   .6074049   .4390414    -0.69   0.490     .1473048    2.504607
   5+ years  |   .8988202   .1648668    -0.58   0.561     .6273942    1.287672
             |
cancer_hae~t |
  Last year  |   1.690388   1.741608     0.51   0.610     .2243846    12.73444
2-5 years..  |   1.123052   .6187181     0.21   0.833     .3814618    3.306348
   5+ years  |   1.354381   .2269191     1.81   0.070     .9752746    1.880854
             |
1.~r_disease |   1.220591   .2043575     1.19   0.234     .8791395     1.69466
1.stroke_d~a |   1.129397   .1897734     0.72   0.469     .8124907    1.569909
1.other_ne~o |    1.34298   .2244717     1.76   0.078     .9678228    1.863559
             |
reduced_ki~t |
Stage 3a/..  |   1.14e-14   2.84e-15  -128.70   0.000     6.98e-15    1.86e-14
      1.esrd |   1.041365   .1481319     0.28   0.776     .7879913    1.376209
1.other_tr~t |   .9030106   .1677176    -0.55   0.583      .627477    1.299535
  1.asplenia |   1.361023   .2205985     1.90   0.057     .9906041    1.869953
1.ra_sle_p~s |   .9420573   .1618966    -0.35   0.728     .6726585     1.31935
1.other_im~o |   1.175979   .1981672     0.96   0.336     .8452035    1.636204
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        7,659             Number of obs    =       7,659
No. of failures      =          212
Time at risk         =       316108
                                                Wald chi2(41)    =    58591.94
Log pseudolikelihood =   -1350.9241             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,019 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.248452   .7712982     0.36   0.719     .3719602     4.19032
 only 12-18  |   3.323593   2.336804     1.71   0.088      .837783    13.18512
      mixed  |   1.406826   .8206321     0.59   0.558     .4484524    4.413312
             |
        age1 |   1.027569   .0270823     1.03   0.302     .9758361    1.082044
        age2 |   .9664835    .078286    -0.42   0.674     .8246057    1.132772
        age3 |   1.013961   .2269111     0.06   0.951     .6539335    1.572204
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    1.15727    .159908     1.06   0.290     .8827106    1.517229
             |
   obese4cat |
Obese I ..)  |   1.294425   .2459156     1.36   0.174     .8920007    1.878403
Obese II..)  |    1.00867   .2546757     0.03   0.973      .614939    1.654497
Obese II..)  |   1.264334   .3539174     0.84   0.402     .7304497    2.188435
             |
smoke_nomiss |
     Former  |   1.295299   .5805708     0.58   0.564     .5380835    3.118102
    Current  |   1.190866   .2326226     0.89   0.371     .8120638    1.746368
             |
         imd |
          4  |   1.036059   .1804444     0.20   0.839      .736437    1.457583
5 most de..  |   .7823648   .2074342    -0.93   0.355     .4652901    1.315512
             |
tot_adults~h |
          2  |   1.15e+09          .        .       .            .           .
          3  |   1.43e+09   1.61e+09    18.70   0.000     1.57e+08    1.30e+10
             |
   ethnicity |
Asian or ..  |   1.560514   .3007597     2.31   0.021     1.069584    2.276779
      Other  |   1.276118   .2990196     1.04   0.298     .8061902    2.019966
             |
1.htdiag_o~p |   1.008113    .158838     0.05   0.959     .7402769    1.372854
1.~y_disease |    .813676   .1465748    -1.14   0.252     .5716324    1.158207
    1.asthma |   1.068257   .2575211     0.27   0.784     .6660078    1.713452
1.~c_disease |   .9172545   .1657474    -0.48   0.633     .6436921    1.307078
             |
     diabcat |
T1DM, con..  |   .4369336   .3120238    -1.16   0.246     .1077839    1.771238
T1DM, unc..  |   8.00e-15   1.88e-15  -138.12   0.000     5.05e-15    1.27e-14
T2DM, con..  |    1.03751   .1767675     0.22   0.829     .7429636     1.44883
T2DM, unc..  |   1.166894   .4291421     0.42   0.675     .5675316    2.399237
Diabetes,..  |   14.98442    16.0194     2.53   0.011     1.843509    121.7964
             |
cancer_exh~t |
  Last year  |   1.04e-14   2.24e-15  -148.62   0.000     6.78e-15    1.58e-14
2-5 years..  |   .6074049   .4390414    -0.69   0.490     .1473048    2.504607
   5+ years  |   .8988202   .1648668    -0.58   0.561     .6273942    1.287672
             |
cancer_hae~t |
  Last year  |   1.690388   1.741608     0.51   0.610     .2243846    12.73444
2-5 years..  |   1.123052   .6187181     0.21   0.833     .3814618    3.306348
   5+ years  |   1.354381   .2269191     1.81   0.070     .9752746    1.880854
             |
1.~r_disease |   1.220591   .2043575     1.19   0.234     .8791395     1.69466
1.stroke_d~a |   1.129397   .1897734     0.72   0.469     .8124907    1.569909
1.other_ne~o |    1.34298   .2244717     1.76   0.078     .9678228    1.863559
             |
reduced_ki~t |
Stage 3a/..  |   1.14e-14   2.84e-15  -128.70   0.000     6.98e-15    1.86e-14
      1.esrd |   1.041365   .1481319     0.28   0.776     .7879913    1.376209
1.other_tr~t |   .9030106   .1677176    -0.55   0.583      .627477    1.299535
  1.asplenia |   1.361023   .2205985     1.90   0.057     .9906041    1.869953
1.ra_sle_p~s |   .9420573   .1618966    -0.35   0.728     .6726585     1.31935
1.other_im~o |   1.175979   .1981672     0.96   0.336     .8452035    1.636204
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLY
> ADJMODEL_ageband_0_timeperiod3.ster not found)
file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLYADJMODE
> L_ageband_0_timeperiod3.ster saved
(no new episodes generated)
(cat_time: 36437 changes made)
(covid_test_ever: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,120       30.67       30.67
          1 |     12,920       24.58       55.25
          2 |     10,122       19.26       74.51
          3 |      7,659       14.57       89.09
          4 |      5,736       10.91      100.00
------------+-----------------------------------
      Total |     52,557      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid test
observatio |         ever
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,900        220 |    16,120 
         1 |    12,692        228 |    12,920 
         2 |     9,884        238 |    10,122 
         3 |     7,447        212 |     7,659 
         4 |     5,459        277 |     5,736 
-----------+----------------------+----------
     Total |    51,382      1,175 |    52,557 

         failure _d:  covid_test_ever
   analysis time _t:  (stime_covid_test_ever-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1716.8234
Iteration 1:   log pseudolikelihood = -1693.0197
Iteration 2:   log pseudolikelihood = -1691.5592
Iteration 3:   log pseudolikelihood = -1691.3794
Iteration 4:   log pseudolikelihood = -1691.3159
Iteration 5:   log pseudolikelihood = -1691.2925
Iteration 6:   log pseudolikelihood = -1691.2839
Iteration 7:   log pseudolikelihood = -1691.2808
Iteration 8:   log pseudolikelihood = -1691.2796
Iteration 9:   log pseudolikelihood = -1691.2792
Iteration 10:  log pseudolikelihood =  -1691.279
Iteration 11:  log pseudolikelihood =  -1691.279
Iteration 12:  log pseudolikelihood = -1691.2789
Iteration 13:  log pseudolikelihood = -1691.2789
Iteration 14:  log pseudolikelihood = -1691.2789
Iteration 15:  log pseudolikelihood = -1691.2789
Iteration 16:  log pseudolikelihood = -1691.2789
Iteration 17:  log pseudolikelihood = -1691.2789
Iteration 18:  log pseudolikelihood = -1691.2789
Iteration 19:  log pseudolikelihood = -1691.2789
Iteration 20:  log pseudolikelihood = -1691.2789
Iteration 21:  log pseudolikelihood = -1691.2789
Iteration 22:  log pseudolikelihood = -1691.2789
Iteration 23:  log pseudolikelihood = -1691.2789
Iteration 24:  log pseudolikelihood = -1691.2789
Iteration 25:  log pseudolikelihood = -1691.2789
Iteration 26:  log pseudolikelihood = -1691.2789
Iteration 27:  log pseudolikelihood = -1691.2789
Iteration 28:  log pseudolikelihood = -1691.2789
Iteration 29:  log pseudolikelihood = -1691.2789
Iteration 30:  log pseudolikelihood = -1691.2789
Iteration 31:  log pseudolikelihood = -1691.2789
Refining estimates:
Iteration 0:   log pseudolikelihood = -1691.2789
Iteration 1:   log pseudolikelihood = -1691.2789

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,736             Number of obs    =       5,736
No. of failures      =          277
Time at risk         =       175141
                                                Wald chi2(41)    =     2652.57
Log pseudolikelihood =   -1691.2789             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 963 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .937287   .4020249    -0.15   0.880     .4043634    2.172568
 only 12-18  |   .9116612   .7043962    -0.12   0.905     .2005171    4.144913
      mixed  |    1.01104   .3965081     0.03   0.978     .4687541    2.180676
             |
        age1 |   .9973108   .0207952    -0.13   0.897     .9573746    1.038913
        age2 |   .9888938   .0678416    -0.16   0.871     .8644785    1.131215
        age3 |   1.006804   .1963234     0.03   0.972     .6870109    1.475457
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    1.06677   .1272407     0.54   0.588     .8443886    1.347718
             |
   obese4cat |
Obese I ..)  |   .8490643   .1613292    -0.86   0.389     .5850665    1.232185
Obese II..)  |   .4157126   .1302889    -2.80   0.005     .2249143    .7683679
Obese II..)  |   .9263912   .2503482    -0.28   0.777     .5454633    1.573343
             |
smoke_nomiss |
     Former  |   1.447636   .5497495     0.97   0.330     .6877173    3.047255
    Current  |   1.048422    .186849     0.27   0.791     .7393252    1.486746
             |
         imd |
          4  |    .773529   .1302366    -1.53   0.127     .5561123    1.075947
5 most de..  |   .9168878   .1896983    -0.42   0.675     .6112347    1.375385
             |
tot_adults~h |
          2  |   1.93e+09          .        .       .            .           .
          3  |   1.33e+09   8.18e+08    34.14   0.000     3.98e+08    4.44e+09
             |
   ethnicity |
Asian or ..  |   .8165933   .1761998    -0.94   0.348      .534981    1.246445
      Other  |   1.039104    .226239     0.18   0.860     .6781578     1.59216
             |
1.htdiag_o~p |   1.064982   .1354398     0.50   0.621     .8300232    1.366452
1.~y_disease |   .8542064   .1344173    -1.00   0.317     .6275068    1.162806
    1.asthma |   .7316176   .1927073    -1.19   0.235     .4365948    1.225998
1.~c_disease |   1.107185    .166069     0.68   0.497     .8251757    1.485572
             |
     diabcat |
T1DM, con..  |   .6679863   .3375375    -0.80   0.425     .2481134    1.798394
T1DM, unc..  |   1.959981   1.444219     0.91   0.361     .4624251    8.307351
T2DM, con..  |   .7163918   .1292387    -1.85   0.064     .5030277    1.020256
T2DM, unc..  |   1.836578   .4653973     2.40   0.016     1.117664     3.01792
Diabetes,..  |   7.32e-15   8.64e-15   -27.59   0.000     7.25e-16    7.39e-14
             |
cancer_exh~t |
  Last year  |   .8472037   .8428009    -0.17   0.868     .1205618     5.95341
2-5 years..  |   .7044391   .4110591    -0.60   0.548     .2244629    2.210764
   5+ years  |    1.14183   .1774409     0.85   0.393     .8420236    1.548383
             |
cancer_hae~t |
  Last year  |   1.475964   1.412759     0.41   0.684     .2261128    9.634442
2-5 years..  |   .9744707   .5092377    -0.05   0.961      .349904    2.713867
   5+ years  |    1.25134   .1855348     1.51   0.130     .9357692    1.673332
             |
1.~r_disease |   1.321457   .1844541     2.00   0.046     1.005169    1.737269
1.stroke_d~a |   .9697544   .1473172    -0.20   0.840      .720036    1.306079
1.other_ne~o |   1.036423   .1554162     0.24   0.811     .7724948    1.390524
             |
reduced_ki~t |
Stage 3a/..  |   1.817061   1.373521     0.79   0.429     .4129938    7.994572
      1.esrd |   .9017383   .1170141    -0.80   0.425     .6992368    1.162885
1.other_tr~t |    1.17751   .1665929     1.15   0.248     .8923548    1.553788
  1.asplenia |   1.015146   .1537295     0.10   0.921     .7544426    1.365938
1.ra_sle_p~s |   .8652984   .1341898    -0.93   0.351      .638502    1.172653
1.other_im~o |   1.082976   .1589876     0.54   0.587     .8121893    1.444044
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,736             Number of obs    =       5,736
No. of failures      =          277
Time at risk         =       175141
                                                Wald chi2(41)    =     2652.57
Log pseudolikelihood =   -1691.2789             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 963 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .937287   .4020249    -0.15   0.880     .4043634    2.172568
 only 12-18  |   .9116612   .7043962    -0.12   0.905     .2005171    4.144913
      mixed  |    1.01104   .3965081     0.03   0.978     .4687541    2.180676
             |
        age1 |   .9973108   .0207952    -0.13   0.897     .9573746    1.038913
        age2 |   .9888938   .0678416    -0.16   0.871     .8644785    1.131215
        age3 |   1.006804   .1963234     0.03   0.972     .6870109    1.475457
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    1.06677   .1272407     0.54   0.588     .8443886    1.347718
             |
   obese4cat |
Obese I ..)  |   .8490643   .1613292    -0.86   0.389     .5850665    1.232185
Obese II..)  |   .4157126   .1302889    -2.80   0.005     .2249143    .7683679
Obese II..)  |   .9263912   .2503482    -0.28   0.777     .5454633    1.573343
             |
smoke_nomiss |
     Former  |   1.447636   .5497495     0.97   0.330     .6877173    3.047255
    Current  |   1.048422    .186849     0.27   0.791     .7393252    1.486746
             |
         imd |
          4  |    .773529   .1302366    -1.53   0.127     .5561123    1.075947
5 most de..  |   .9168878   .1896983    -0.42   0.675     .6112347    1.375385
             |
tot_adults~h |
          2  |   1.93e+09          .        .       .            .           .
          3  |   1.33e+09   8.18e+08    34.14   0.000     3.98e+08    4.44e+09
             |
   ethnicity |
Asian or ..  |   .8165933   .1761998    -0.94   0.348      .534981    1.246445
      Other  |   1.039104    .226239     0.18   0.860     .6781578     1.59216
             |
1.htdiag_o~p |   1.064982   .1354398     0.50   0.621     .8300232    1.366452
1.~y_disease |   .8542064   .1344173    -1.00   0.317     .6275068    1.162806
    1.asthma |   .7316176   .1927073    -1.19   0.235     .4365948    1.225998
1.~c_disease |   1.107185    .166069     0.68   0.497     .8251757    1.485572
             |
     diabcat |
T1DM, con..  |   .6679863   .3375375    -0.80   0.425     .2481134    1.798394
T1DM, unc..  |   1.959981   1.444219     0.91   0.361     .4624251    8.307351
T2DM, con..  |   .7163918   .1292387    -1.85   0.064     .5030277    1.020256
T2DM, unc..  |   1.836578   .4653973     2.40   0.016     1.117664     3.01792
Diabetes,..  |   7.32e-15   8.64e-15   -27.59   0.000     7.25e-16    7.39e-14
             |
cancer_exh~t |
  Last year  |   .8472037   .8428009    -0.17   0.868     .1205618     5.95341
2-5 years..  |   .7044391   .4110591    -0.60   0.548     .2244629    2.210764
   5+ years  |    1.14183   .1774409     0.85   0.393     .8420236    1.548383
             |
cancer_hae~t |
  Last year  |   1.475964   1.412759     0.41   0.684     .2261128    9.634442
2-5 years..  |   .9744707   .5092377    -0.05   0.961      .349904    2.713867
   5+ years  |    1.25134   .1855348     1.51   0.130     .9357692    1.673332
             |
1.~r_disease |   1.321457   .1844541     2.00   0.046     1.005169    1.737269
1.stroke_d~a |   .9697544   .1473172    -0.20   0.840      .720036    1.306079
1.other_ne~o |   1.036423   .1554162     0.24   0.811     .7724948    1.390524
             |
reduced_ki~t |
Stage 3a/..  |   1.817061   1.373521     0.79   0.429     .4129938    7.994572
      1.esrd |   .9017383   .1170141    -0.80   0.425     .6992368    1.162885
1.other_tr~t |    1.17751   .1665929     1.15   0.248     .8923548    1.553788
  1.asplenia |   1.015146   .1537295     0.10   0.921     .7544426    1.365938
1.ra_sle_p~s |   .8652984   .1341898    -0.93   0.351      .638502    1.172653
1.other_im~o |   1.082976   .1589876     0.54   0.587     .8121893    1.444044
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLY
> ADJMODEL_ageband_0_timeperiod4.ster not found)
file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLYADJMODE
> L_ageband_0_timeperiod4.ster saved
(10,193 observations (episodes) created)
(cat_time: 10193 changes made)
(covid_test_ever: 10193 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,508       30.66       30.66
          1 |      3,585       24.39       55.05
          2 |      2,823       19.20       74.25
          3 |      2,146       14.60       88.85
          4 |      1,639       11.15      100.00
------------+-----------------------------------
      Total |     14,701      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid test
observatio |         ever
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,450         58 |     4,508 
         1 |     3,526         59 |     3,585 
         2 |     2,762         61 |     2,823 
         3 |     2,075         71 |     2,146 
         4 |     1,570         69 |     1,639 
-----------+----------------------+----------
     Total |    14,383        318 |    14,701 

         failure _d:  covid_test_ever
   analysis time _t:  (stime_covid_test_ever-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -348.69468
Iteration 1:   log pseudolikelihood = -326.69155
Iteration 2:   log pseudolikelihood = -325.04375
Iteration 3:   log pseudolikelihood = -324.73461
Iteration 4:   log pseudolikelihood = -324.62366
Iteration 5:   log pseudolikelihood = -324.58276
Iteration 6:   log pseudolikelihood =  -324.5677
Iteration 7:   log pseudolikelihood = -324.56215
Iteration 8:   log pseudolikelihood = -324.56011
Iteration 9:   log pseudolikelihood = -324.55936
Iteration 10:  log pseudolikelihood = -324.55909
Iteration 11:  log pseudolikelihood = -324.55899
Iteration 12:  log pseudolikelihood = -324.55895
Iteration 13:  log pseudolikelihood = -324.55894
Iteration 14:  log pseudolikelihood = -324.55893
Iteration 15:  log pseudolikelihood = -324.55893
Iteration 16:  log pseudolikelihood = -324.55893
Iteration 17:  log pseudolikelihood = -324.55893
Iteration 18:  log pseudolikelihood = -324.55893
Iteration 19:  log pseudolikelihood = -324.55893
Iteration 20:  log pseudolikelihood = -324.55893
Iteration 21:  log pseudolikelihood = -324.55893
Iteration 22:  log pseudolikelihood = -324.55893
Iteration 23:  log pseudolikelihood = -324.55893
Iteration 24:  log pseudolikelihood = -324.55893
Iteration 25:  log pseudolikelihood = -324.55893
Iteration 26:  log pseudolikelihood = -324.55893
Iteration 27:  log pseudolikelihood = -324.55893
Iteration 28:  log pseudolikelihood = -324.55893
Iteration 29:  log pseudolikelihood = -324.55893
Iteration 30:  log pseudolikelihood = -324.55893
Iteration 31:  log pseudolikelihood = -324.55893
Iteration 32:  log pseudolikelihood = -324.55893
Iteration 33:  log pseudolikelihood = -324.55893
Iteration 34:  log pseudolikelihood = -324.55893
Iteration 35:  log pseudolikelihood = -324.55893
Refining estimates:
Iteration 0:   log pseudolikelihood = -324.55893
Iteration 1:   log pseudolikelihood = -324.55893

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,508             Number of obs    =       4,508
No. of failures      =           58
Time at risk         =       344225
                                                Wald chi2(41)    =    43825.17
Log pseudolikelihood =   -324.55893             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.282327   1.364289     0.23   0.815     .1593642    10.31826
 only 12-18  |   2.53e-16   2.73e-16   -33.37   0.000     3.08e-17    2.09e-15
      mixed  |    1.42354   1.446296     0.35   0.728     .1943398    10.42744
             |
        age1 |   .8853886   .0976003    -1.10   0.269     .7133492    1.098919
        age2 |   1.559853   .7558636     0.92   0.359     .6034117    4.032306
        age3 |    .420348    .481318    -0.76   0.449     .0445598    3.965284
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.273773   .3431583     0.90   0.369     .7512348    2.159774
             |
   obese4cat |
Obese I ..)  |   .9180408    .357763    -0.22   0.826     .4277071    1.970505
Obese II..)  |   .5844556   .3446105    -0.91   0.362     .1840181    1.856276
Obese II..)  |   .2372557   .2402188    -1.42   0.155     .0326125    1.726032
             |
smoke_nomiss |
     Former  |   1.95e-16   4.62e-17  -153.06   0.000     1.23e-16    3.10e-16
    Current  |   .6580892   .3138059    -0.88   0.380     .2584606    1.675619
             |
         imd |
          4  |   1.466504   .4785055     1.17   0.241     .7736507    2.779853
5 most de..  |    1.34845   .5689784     0.71   0.479     .5897535    3.083183
             |
tot_adults~h |
          2  |   .5498013   .4139447    -0.79   0.427     .1257005    2.404774
          3  |   1.27e+15          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   2.032323   .7315827     1.97   0.049     1.003651    4.115313
      Other  |   1.505372   .6361896     0.97   0.333      .657529    3.446455
             |
1.htdiag_o~p |   .9975821   .2808815    -0.01   0.993     .5744899    1.732267
1.~y_disease |   .5876566    .233504    -1.34   0.181     .2697122    1.280403
    1.asthma |   1.184438   .5555673     0.36   0.718     .4723367    2.970115
1.~c_disease |   .5848704    .231728    -1.35   0.176     .2690358    1.271479
             |
     diabcat |
T1DM, con..  |   1.546295   1.199383     0.56   0.574     .3381101    7.071745
T1DM, unc..  |   1.73e-16   7.84e-17   -80.09   0.000     7.12e-17    4.20e-16
T2DM, con..  |   1.248236   .4008642     0.69   0.490     .6651778    2.342369
T2DM, unc..  |   1.035286   .6129813     0.06   0.953     .3243945    3.304055
Diabetes,..  |   1.13e-16   8.59e-17   -48.16   0.000     2.53e-17    5.02e-16
             |
cancer_exh~t |
  Last year  |   1.38e-16   8.48e-17   -59.42   0.000     4.14e-17    4.60e-16
2-5 years..  |   3.197604   2.349179     1.58   0.114     .7576592    13.49508
   5+ years  |   .8662165   .3113867    -0.40   0.690     .4281908    1.752329
             |
cancer_hae~t |
  Last year  |   2.32e-16   1.81e-16   -46.04   0.000     5.00e-17    1.07e-15
2-5 years..  |   1.101224   1.129332     0.09   0.925     .1475528    8.218713
   5+ years  |   .8732484   .3312343    -0.36   0.721     .4152084    1.836578
             |
1.~r_disease |   1.009392   .3220854     0.03   0.977     .5400717    1.886551
1.stroke_d~a |   .8063789   .2906952    -0.60   0.551      .397819    1.634529
1.other_ne~o |   1.090551    .350379     0.27   0.787     .5809872    2.047035
             |
reduced_ki~t |
Stage 3a/..  |   .8646413   .7113364    -0.18   0.860     .1724076    4.336262
      1.esrd |   .4334795   .1382619    -2.62   0.009     .2319908    .8099653
1.other_tr~t |   2.040557    .561723     2.59   0.010     1.189681     3.49999
  1.asplenia |   .9575636   .3170853    -0.13   0.896     .5003833    1.832451
1.ra_sle_p~s |   .6735977   .2433985    -1.09   0.274     .3317619    1.367649
1.other_im~o |   2.066985    .596636     2.52   0.012     1.173917     3.63946
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,508             Number of obs    =       4,508
No. of failures      =           58
Time at risk         =       344225
                                                Wald chi2(41)    =    43825.17
Log pseudolikelihood =   -324.55893             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.282327   1.364289     0.23   0.815     .1593642    10.31826
 only 12-18  |   2.53e-16   2.73e-16   -33.37   0.000     3.08e-17    2.09e-15
      mixed  |    1.42354   1.446296     0.35   0.728     .1943398    10.42744
             |
        age1 |   .8853886   .0976003    -1.10   0.269     .7133492    1.098919
        age2 |   1.559853   .7558636     0.92   0.359     .6034117    4.032306
        age3 |    .420348    .481318    -0.76   0.449     .0445598    3.965284
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.273773   .3431583     0.90   0.369     .7512348    2.159774
             |
   obese4cat |
Obese I ..)  |   .9180408    .357763    -0.22   0.826     .4277071    1.970505
Obese II..)  |   .5844556   .3446105    -0.91   0.362     .1840181    1.856276
Obese II..)  |   .2372557   .2402188    -1.42   0.155     .0326125    1.726032
             |
smoke_nomiss |
     Former  |   1.95e-16   4.62e-17  -153.06   0.000     1.23e-16    3.10e-16
    Current  |   .6580892   .3138059    -0.88   0.380     .2584606    1.675619
             |
         imd |
          4  |   1.466504   .4785055     1.17   0.241     .7736507    2.779853
5 most de..  |    1.34845   .5689784     0.71   0.479     .5897535    3.083183
             |
tot_adults~h |
          2  |   .5498013   .4139447    -0.79   0.427     .1257005    2.404774
          3  |   1.27e+15          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   2.032323   .7315827     1.97   0.049     1.003651    4.115313
      Other  |   1.505372   .6361896     0.97   0.333      .657529    3.446455
             |
1.htdiag_o~p |   .9975821   .2808815    -0.01   0.993     .5744899    1.732267
1.~y_disease |   .5876566    .233504    -1.34   0.181     .2697122    1.280403
    1.asthma |   1.184438   .5555673     0.36   0.718     .4723367    2.970115
1.~c_disease |   .5848704    .231728    -1.35   0.176     .2690358    1.271479
             |
     diabcat |
T1DM, con..  |   1.546295   1.199383     0.56   0.574     .3381101    7.071745
T1DM, unc..  |   1.73e-16   7.84e-17   -80.09   0.000     7.12e-17    4.20e-16
T2DM, con..  |   1.248236   .4008642     0.69   0.490     .6651778    2.342369
T2DM, unc..  |   1.035286   .6129813     0.06   0.953     .3243945    3.304055
Diabetes,..  |   1.13e-16   8.59e-17   -48.16   0.000     2.53e-17    5.02e-16
             |
cancer_exh~t |
  Last year  |   1.38e-16   8.48e-17   -59.42   0.000     4.14e-17    4.60e-16
2-5 years..  |   3.197604   2.349179     1.58   0.114     .7576592    13.49508
   5+ years  |   .8662165   .3113867    -0.40   0.690     .4281908    1.752329
             |
cancer_hae~t |
  Last year  |   2.32e-16   1.81e-16   -46.04   0.000     5.00e-17    1.07e-15
2-5 years..  |   1.101224   1.129332     0.09   0.925     .1475528    8.218713
   5+ years  |   .8732484   .3312343    -0.36   0.721     .4152084    1.836578
             |
1.~r_disease |   1.009392   .3220854     0.03   0.977     .5400717    1.886551
1.stroke_d~a |   .8063789   .2906952    -0.60   0.551      .397819    1.634529
1.other_ne~o |   1.090551    .350379     0.27   0.787     .5809872    2.047035
             |
reduced_ki~t |
Stage 3a/..  |   .8646413   .7113364    -0.18   0.860     .1724076    4.336262
      1.esrd |   .4334795   .1382619    -2.62   0.009     .2319908    .8099653
1.other_tr~t |   2.040557    .561723     2.59   0.010     1.189681     3.49999
  1.asplenia |   .9575636   .3170853    -0.13   0.896     .5003833    1.832451
1.ra_sle_p~s |   .6735977   .2433985    -1.09   0.274     .3317619    1.367649
1.other_im~o |   2.066985    .596636     2.52   0.012     1.173917     3.63946
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLY
> ADJMODEL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLYADJMODE
> L_ageband_1_timeperiod0.ster saved
(no new episodes generated)
(cat_time: 10193 changes made)
(covid_test_ever: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,508       30.66       30.66
          1 |      3,585       24.39       55.05
          2 |      2,823       19.20       74.25
          3 |      2,146       14.60       88.85
          4 |      1,639       11.15      100.00
------------+-----------------------------------
      Total |     14,701      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid test
observatio |         ever
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,450         58 |     4,508 
         1 |     3,526         59 |     3,585 
         2 |     2,762         61 |     2,823 
         3 |     2,075         71 |     2,146 
         4 |     1,570         69 |     1,639 
-----------+----------------------+----------
     Total |    14,383        318 |    14,701 

         failure _d:  covid_test_ever
   analysis time _t:  (stime_covid_test_ever-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -341.12991
Iteration 1:   log pseudolikelihood = -325.83562
Iteration 2:   log pseudolikelihood = -322.95634
Iteration 3:   log pseudolikelihood = -322.61445
Iteration 4:   log pseudolikelihood = -322.55291
Iteration 5:   log pseudolikelihood =  -322.5315
Iteration 6:   log pseudolikelihood = -322.52364
Iteration 7:   log pseudolikelihood = -322.52074
Iteration 8:   log pseudolikelihood = -322.51968
Iteration 9:   log pseudolikelihood = -322.51929
Iteration 10:  log pseudolikelihood = -322.51914
Iteration 11:  log pseudolikelihood = -322.51909
Iteration 12:  log pseudolikelihood = -322.51907
Iteration 13:  log pseudolikelihood = -322.51906
Iteration 14:  log pseudolikelihood = -322.51906
Iteration 15:  log pseudolikelihood = -322.51906
Iteration 16:  log pseudolikelihood = -322.51906
Iteration 17:  log pseudolikelihood = -322.51906
Iteration 18:  log pseudolikelihood = -322.51906
Iteration 19:  log pseudolikelihood = -322.51906
Iteration 20:  log pseudolikelihood = -322.51906
Iteration 21:  log pseudolikelihood = -322.51906
Iteration 22:  log pseudolikelihood = -322.51906
Iteration 23:  log pseudolikelihood = -322.51906
Iteration 24:  log pseudolikelihood = -322.51906
Iteration 25:  log pseudolikelihood = -322.51906
Iteration 26:  log pseudolikelihood = -322.51906
Iteration 27:  log pseudolikelihood = -322.51906
Iteration 28:  log pseudolikelihood = -322.51906
Iteration 29:  log pseudolikelihood = -322.51906
Iteration 30:  log pseudolikelihood = -322.51906
Iteration 31:  log pseudolikelihood = -322.51906
Iteration 32:  log pseudolikelihood = -322.51906
Iteration 33:  log pseudolikelihood = -322.51906
Refining estimates:
Iteration 0:   log pseudolikelihood = -322.51906
Iteration 1:   log pseudolikelihood = -322.51906

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,585             Number of obs    =       3,585
No. of failures      =           59
Time at risk         =       221443
                                                Wald chi2(42)    =    29954.89
Log pseudolikelihood =   -322.51906             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 885 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8150546   .6176994    -0.27   0.787      .184541    3.599817
 only 12-18  |   2.312533   2.228051     0.87   0.384     .3499311    15.28246
      mixed  |   .9252637   .6011135    -0.12   0.905      .258981    3.305698
             |
        age1 |   .8499672   .0998329    -1.38   0.166     .6751873    1.069991
        age2 |   2.484142   1.314986     1.72   0.086     .8802196    7.010708
        age3 |   .0891573   .1146629    -1.88   0.060     .0071688     1.10883
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .7238491   .1990915    -1.17   0.240     .4222103    1.240987
             |
   obese4cat |
Obese I ..)  |   1.051192   .4061524     0.13   0.897     .4929478    2.241628
Obese II..)  |   1.156673   .5087456     0.33   0.741      .488452    2.739044
Obese II..)  |   .8298693   .5153611    -0.30   0.764     .2456976     2.80297
             |
smoke_nomiss |
     Former  |    2.07818   1.452025     1.05   0.295     .5283825    8.173683
    Current  |   .7609105   .3442386    -0.60   0.546     .3135068    1.846801
             |
         imd |
          4  |     .69467   .2556367    -0.99   0.322     .3377059    1.428955
5 most de..  |   .6317021   .3322862    -0.87   0.383     .2253023    1.771165
             |
tot_adults~h |
          2  |   .6361129   .9925448    -0.29   0.772       .02988    13.54216
          3  |   .2842601   .3361071    -1.06   0.287     .0280067    2.885163
             |
   ethnicity |
Asian or ..  |   .1522713   .1536041    -1.87   0.062     .0210846    1.099689
      Other  |   1.588578   .5523777     1.33   0.183     .8035819    3.140414
             |
1.htdiag_o~p |   .8563325   .2431933    -0.55   0.585     .4908019    1.494096
1.~y_disease |    1.12277   .3700273     0.35   0.725     .5885231    2.141994
    1.asthma |   .4082436   .2846904    -1.28   0.199     .1040712    1.601432
1.~c_disease |   .9853308   .3192367    -0.05   0.964     .5221578    1.859355
             |
     diabcat |
T1DM, con..  |   .5840012   .6087771    -0.52   0.606     .0757008    4.505334
T1DM, unc..  |   1.17e-15   4.42e-16   -90.80   0.000     5.55e-16    2.45e-15
T2DM, con..  |   .8512918   .3182276    -0.43   0.667     .4091519    1.771219
T2DM, unc..  |   .8347748   .6399069    -0.24   0.814     .1858105     3.75032
Diabetes,..  |   2.55e-15   2.79e-15   -30.71   0.000     2.98e-16    2.17e-14
             |
cancer_exh~t |
  Last year  |   1.75e-15   1.18e-15   -50.19   0.000     4.64e-16    6.60e-15
2-5 years..  |   1.68e-15   5.59e-16  -102.49   0.000     8.79e-16    3.23e-15
   5+ years  |    .847715   .3151668    -0.44   0.657     .4090598    1.756762
             |
cancer_hae~t |
  Last year  |   1.18e-15   5.89e-16   -68.70   0.000     4.42e-16    3.14e-15
2-5 years..  |   1.603154    1.24107     0.61   0.542     .3515797    7.310157
   5+ years  |   .7819434   .2995276    -0.64   0.521     .3690779    1.656657
             |
1.~r_disease |   .8998616   .2983374    -0.32   0.750     .4698627    1.723378
1.stroke_d~a |   .9924476   .3310114    -0.02   0.982     .5161857    1.908135
1.other_ne~o |   1.241442   .3921405     0.68   0.494     .6684261    2.305684
             |
reduced_ki~t |
Stage 3a/..  |   .3779576   .3831506    -0.96   0.337     .0518258    2.756385
      1.esrd |   1.528923   .4186206     1.55   0.121     .8939763    2.614842
1.other_tr~t |   1.468951   .4419537     1.28   0.201      .814539    2.649127
  1.asplenia |   1.347131   .4097407     0.98   0.327     .7421812    2.445173
1.ra_sle_p~s |   1.306335   .4002456     0.87   0.383     .7165662    2.381511
1.other_im~o |   1.229093   .3743611     0.68   0.498     .6765861    2.232783
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,585             Number of obs    =       3,585
No. of failures      =           59
Time at risk         =       221443
                                                Wald chi2(42)    =    29954.89
Log pseudolikelihood =   -322.51906             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 885 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8150546   .6176994    -0.27   0.787      .184541    3.599817
 only 12-18  |   2.312533   2.228051     0.87   0.384     .3499311    15.28246
      mixed  |   .9252637   .6011135    -0.12   0.905      .258981    3.305698
             |
        age1 |   .8499672   .0998329    -1.38   0.166     .6751873    1.069991
        age2 |   2.484142   1.314986     1.72   0.086     .8802196    7.010708
        age3 |   .0891573   .1146629    -1.88   0.060     .0071688     1.10883
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .7238491   .1990915    -1.17   0.240     .4222103    1.240987
             |
   obese4cat |
Obese I ..)  |   1.051192   .4061524     0.13   0.897     .4929478    2.241628
Obese II..)  |   1.156673   .5087456     0.33   0.741      .488452    2.739044
Obese II..)  |   .8298693   .5153611    -0.30   0.764     .2456976     2.80297
             |
smoke_nomiss |
     Former  |    2.07818   1.452025     1.05   0.295     .5283825    8.173683
    Current  |   .7609105   .3442386    -0.60   0.546     .3135068    1.846801
             |
         imd |
          4  |     .69467   .2556367    -0.99   0.322     .3377059    1.428955
5 most de..  |   .6317021   .3322862    -0.87   0.383     .2253023    1.771165
             |
tot_adults~h |
          2  |   .6361129   .9925448    -0.29   0.772       .02988    13.54216
          3  |   .2842601   .3361071    -1.06   0.287     .0280067    2.885163
             |
   ethnicity |
Asian or ..  |   .1522713   .1536041    -1.87   0.062     .0210846    1.099689
      Other  |   1.588578   .5523777     1.33   0.183     .8035819    3.140414
             |
1.htdiag_o~p |   .8563325   .2431933    -0.55   0.585     .4908019    1.494096
1.~y_disease |    1.12277   .3700273     0.35   0.725     .5885231    2.141994
    1.asthma |   .4082436   .2846904    -1.28   0.199     .1040712    1.601432
1.~c_disease |   .9853308   .3192367    -0.05   0.964     .5221578    1.859355
             |
     diabcat |
T1DM, con..  |   .5840012   .6087771    -0.52   0.606     .0757008    4.505334
T1DM, unc..  |   1.17e-15   4.42e-16   -90.80   0.000     5.55e-16    2.45e-15
T2DM, con..  |   .8512918   .3182276    -0.43   0.667     .4091519    1.771219
T2DM, unc..  |   .8347748   .6399069    -0.24   0.814     .1858105     3.75032
Diabetes,..  |   2.55e-15   2.79e-15   -30.71   0.000     2.98e-16    2.17e-14
             |
cancer_exh~t |
  Last year  |   1.75e-15   1.18e-15   -50.19   0.000     4.64e-16    6.60e-15
2-5 years..  |   1.68e-15   5.59e-16  -102.49   0.000     8.79e-16    3.23e-15
   5+ years  |    .847715   .3151668    -0.44   0.657     .4090598    1.756762
             |
cancer_hae~t |
  Last year  |   1.18e-15   5.89e-16   -68.70   0.000     4.42e-16    3.14e-15
2-5 years..  |   1.603154    1.24107     0.61   0.542     .3515797    7.310157
   5+ years  |   .7819434   .2995276    -0.64   0.521     .3690779    1.656657
             |
1.~r_disease |   .8998616   .2983374    -0.32   0.750     .4698627    1.723378
1.stroke_d~a |   .9924476   .3310114    -0.02   0.982     .5161857    1.908135
1.other_ne~o |   1.241442   .3921405     0.68   0.494     .6684261    2.305684
             |
reduced_ki~t |
Stage 3a/..  |   .3779576   .3831506    -0.96   0.337     .0518258    2.756385
      1.esrd |   1.528923   .4186206     1.55   0.121     .8939763    2.614842
1.other_tr~t |   1.468951   .4419537     1.28   0.201      .814539    2.649127
  1.asplenia |   1.347131   .4097407     0.98   0.327     .7421812    2.445173
1.ra_sle_p~s |   1.306335   .4002456     0.87   0.383     .7165662    2.381511
1.other_im~o |   1.229093   .3743611     0.68   0.498     .6765861    2.232783
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLY
> ADJMODEL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLYADJMODE
> L_ageband_1_timeperiod1.ster saved
(no new episodes generated)
(cat_time: 10193 changes made)
(covid_test_ever: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,508       30.66       30.66
          1 |      3,585       24.39       55.05
          2 |      2,823       19.20       74.25
          3 |      2,146       14.60       88.85
          4 |      1,639       11.15      100.00
------------+-----------------------------------
      Total |     14,701      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid test
observatio |         ever
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,450         58 |     4,508 
         1 |     3,526         59 |     3,585 
         2 |     2,762         61 |     2,823 
         3 |     2,075         71 |     2,146 
         4 |     1,570         69 |     1,639 
-----------+----------------------+----------
     Total |    14,383        318 |    14,701 

         failure _d:  covid_test_ever
   analysis time _t:  (stime_covid_test_ever-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -336.46761
Iteration 1:   log pseudolikelihood = -320.05176
Iteration 2:   log pseudolikelihood = -318.38726
Iteration 3:   log pseudolikelihood = -317.97809
Iteration 4:   log pseudolikelihood = -317.82241
Iteration 5:   log pseudolikelihood = -317.76264
Iteration 6:   log pseudolikelihood = -317.73995
Iteration 7:   log pseudolikelihood = -317.73146
Iteration 8:   log pseudolikelihood = -317.72832
Iteration 9:   log pseudolikelihood = -317.72716
Iteration 10:  log pseudolikelihood = -317.72673
Iteration 11:  log pseudolikelihood = -317.72657
Iteration 12:  log pseudolikelihood = -317.72651
Iteration 13:  log pseudolikelihood = -317.72649
Iteration 14:  log pseudolikelihood = -317.72648
Iteration 15:  log pseudolikelihood = -317.72648
Iteration 16:  log pseudolikelihood = -317.72648
Iteration 17:  log pseudolikelihood = -317.72648
Iteration 18:  log pseudolikelihood = -317.72648
Iteration 19:  log pseudolikelihood = -317.72648
Iteration 20:  log pseudolikelihood = -317.72648
Iteration 21:  log pseudolikelihood = -317.72648
Iteration 22:  log pseudolikelihood = -317.72648
Iteration 23:  log pseudolikelihood = -317.72648
Iteration 24:  log pseudolikelihood = -317.72648
Iteration 25:  log pseudolikelihood = -317.72648
Iteration 26:  log pseudolikelihood = -317.72648
Iteration 27:  log pseudolikelihood = -317.72648
Iteration 28:  log pseudolikelihood = -317.72648
Iteration 29:  log pseudolikelihood = -317.72648
Iteration 30:  log pseudolikelihood = -317.72648
Iteration 31:  log pseudolikelihood = -317.72648
Iteration 32:  log pseudolikelihood = -317.72648
Iteration 33:  log pseudolikelihood = -317.72648
Iteration 34:  log pseudolikelihood = -317.72648
Refining estimates:
Iteration 0:   log pseudolikelihood = -317.72648
Iteration 1:   log pseudolikelihood = -317.72648

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,823             Number of obs    =       2,823
No. of failures      =           61
Time at risk         =       154532
                                                Wald chi2(41)    =    43068.70
Log pseudolikelihood =   -317.72648             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 827 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   5.48e+08          .        .       .            .           .
 only 12-18  |   6.29e-07   3.85e-07   -23.29   0.000     1.89e-07    2.09e-06
      mixed  |   1.06e+09   5.55e+08    39.82   0.000     3.82e+08    2.96e+09
             |
        age1 |   1.011201   .1125573     0.10   0.920     .8129984    1.257723
        age2 |   .9800238   .4822737    -0.04   0.967      .373557    2.571085
        age3 |   1.026257   1.218591     0.02   0.983     .1001216    10.51924
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8365978   .2286578    -0.65   0.514     .4896293     1.42944
             |
   obese4cat |
Obese I ..)  |   .4905828   .2270129    -1.54   0.124     .1980734    1.215062
Obese II..)  |   .8337977   .4083713    -0.37   0.711     .3192755    2.177489
Obese II..)  |   .4191409   .3027508    -1.20   0.229     .1017481    1.726608
             |
smoke_nomiss |
     Former  |   .9294215   1.002409    -0.07   0.946     .1122447    7.695901
    Current  |   1.269877   .4837034     0.63   0.531     .6019137    2.679102
             |
         imd |
          4  |   1.256544   .3834149     0.75   0.454     .6909506    2.285118
5 most de..  |   .6083085   .3206683    -0.94   0.346     .2164786    1.709357
             |
tot_adults~h |
          2  |   .2267915   6.906216    -0.05   0.961     2.72e-27    1.89e+25
          3  |   7.95e+13   2.43e+15     1.05   0.295     8.14e-13    7.76e+39
             |
   ethnicity |
Asian or ..  |   1.212099   .4958831     0.47   0.638     .5436282    2.702552
      Other  |   .9321823   .4565732    -0.14   0.886     .3569367    2.434504
             |
1.htdiag_o~p |   .8415101   .2428677    -0.60   0.550     .4779634    1.481576
1.~y_disease |   .9616722   .3351092    -0.11   0.911     .4857502    1.903887
    1.asthma |   1.159701   .5666761     0.30   0.762     .4450565    3.021878
1.~c_disease |   1.232531   .3824359     0.67   0.500     .6709383     2.26419
             |
     diabcat |
T1DM, con..  |   1.912811   1.183848     1.05   0.295     .5686687    6.434057
T1DM, unc..  |   5.75e-16   2.63e-16   -76.81   0.000     2.35e-16    1.41e-15
T2DM, con..  |   .4747013   .2168292    -1.63   0.103     .1939176    1.162047
T2DM, unc..  |   1.132072   .6666321     0.21   0.833      .356973    3.590151
Diabetes,..  |   4.35e-16   6.17e-16   -24.96   0.000     2.71e-17    6.99e-15
             |
cancer_exh~t |
  Last year  |   7.51e-16   4.35e-16   -60.12   0.000     2.41e-16    2.34e-15
2-5 years..  |   5.97e-16   1.87e-16  -112.06   0.000     3.24e-16    1.10e-15
   5+ years  |   .4686227   .2091798    -1.70   0.089      .195376    1.124024
             |
cancer_hae~t |
  Last year  |   7.50e-16   4.03e-16   -64.80   0.000     2.62e-16    2.15e-15
2-5 years..  |   1.033733   1.060461     0.03   0.974     .1384201    7.720012
   5+ years  |   .8499663   .2982365    -0.46   0.643     .4272989     1.69072
             |
1.~r_disease |   .4904566   .1976127    -1.77   0.077     .2226579    1.080347
1.stroke_d~a |   .7844098   .2772013    -0.69   0.492     .3924084    1.568006
1.other_ne~o |   .8705202   .3025925    -0.40   0.690      .440455    1.720506
             |
reduced_ki~t |
Stage 3a/..  |   .3968751   .3956471    -0.93   0.354     .0562453     2.80041
      1.esrd |    1.38156   .3577099     1.25   0.212     .8317236    2.294884
1.other_tr~t |   .9136314   .3063102    -0.27   0.788      .473578    1.762587
  1.asplenia |   .5181275   .2151007    -1.58   0.113     .2296466    1.168996
1.ra_sle_p~s |    .812827   .2763228    -0.61   0.542     .4174744    1.582583
1.other_im~o |   1.232252   .3926288     0.66   0.512     .6599082    2.300993
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,823             Number of obs    =       2,823
No. of failures      =           61
Time at risk         =       154532
                                                Wald chi2(41)    =    43068.70
Log pseudolikelihood =   -317.72648             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 827 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   5.48e+08          .        .       .            .           .
 only 12-18  |   6.29e-07   3.85e-07   -23.29   0.000     1.89e-07    2.09e-06
      mixed  |   1.06e+09   5.55e+08    39.82   0.000     3.82e+08    2.96e+09
             |
        age1 |   1.011201   .1125573     0.10   0.920     .8129984    1.257723
        age2 |   .9800238   .4822737    -0.04   0.967      .373557    2.571085
        age3 |   1.026257   1.218591     0.02   0.983     .1001216    10.51924
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8365978   .2286578    -0.65   0.514     .4896293     1.42944
             |
   obese4cat |
Obese I ..)  |   .4905828   .2270129    -1.54   0.124     .1980734    1.215062
Obese II..)  |   .8337977   .4083713    -0.37   0.711     .3192755    2.177489
Obese II..)  |   .4191409   .3027508    -1.20   0.229     .1017481    1.726608
             |
smoke_nomiss |
     Former  |   .9294215   1.002409    -0.07   0.946     .1122447    7.695901
    Current  |   1.269877   .4837034     0.63   0.531     .6019137    2.679102
             |
         imd |
          4  |   1.256544   .3834149     0.75   0.454     .6909506    2.285118
5 most de..  |   .6083085   .3206683    -0.94   0.346     .2164786    1.709357
             |
tot_adults~h |
          2  |   .2267915   6.906216    -0.05   0.961     2.72e-27    1.89e+25
          3  |   7.95e+13   2.43e+15     1.05   0.295     8.14e-13    7.76e+39
             |
   ethnicity |
Asian or ..  |   1.212099   .4958831     0.47   0.638     .5436282    2.702552
      Other  |   .9321823   .4565732    -0.14   0.886     .3569367    2.434504
             |
1.htdiag_o~p |   .8415101   .2428677    -0.60   0.550     .4779634    1.481576
1.~y_disease |   .9616722   .3351092    -0.11   0.911     .4857502    1.903887
    1.asthma |   1.159701   .5666761     0.30   0.762     .4450565    3.021878
1.~c_disease |   1.232531   .3824359     0.67   0.500     .6709383     2.26419
             |
     diabcat |
T1DM, con..  |   1.912811   1.183848     1.05   0.295     .5686687    6.434057
T1DM, unc..  |   5.75e-16   2.63e-16   -76.81   0.000     2.35e-16    1.41e-15
T2DM, con..  |   .4747013   .2168292    -1.63   0.103     .1939176    1.162047
T2DM, unc..  |   1.132072   .6666321     0.21   0.833      .356973    3.590151
Diabetes,..  |   4.35e-16   6.17e-16   -24.96   0.000     2.71e-17    6.99e-15
             |
cancer_exh~t |
  Last year  |   7.51e-16   4.35e-16   -60.12   0.000     2.41e-16    2.34e-15
2-5 years..  |   5.97e-16   1.87e-16  -112.06   0.000     3.24e-16    1.10e-15
   5+ years  |   .4686227   .2091798    -1.70   0.089      .195376    1.124024
             |
cancer_hae~t |
  Last year  |   7.50e-16   4.03e-16   -64.80   0.000     2.62e-16    2.15e-15
2-5 years..  |   1.033733   1.060461     0.03   0.974     .1384201    7.720012
   5+ years  |   .8499663   .2982365    -0.46   0.643     .4272989     1.69072
             |
1.~r_disease |   .4904566   .1976127    -1.77   0.077     .2226579    1.080347
1.stroke_d~a |   .7844098   .2772013    -0.69   0.492     .3924084    1.568006
1.other_ne~o |   .8705202   .3025925    -0.40   0.690      .440455    1.720506
             |
reduced_ki~t |
Stage 3a/..  |   .3968751   .3956471    -0.93   0.354     .0562453     2.80041
      1.esrd |    1.38156   .3577099     1.25   0.212     .8317236    2.294884
1.other_tr~t |   .9136314   .3063102    -0.27   0.788      .473578    1.762587
  1.asplenia |   .5181275   .2151007    -1.58   0.113     .2296466    1.168996
1.ra_sle_p~s |    .812827   .2763228    -0.61   0.542     .4174744    1.582583
1.other_im~o |   1.232252   .3926288     0.66   0.512     .6599082    2.300993
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLY
> ADJMODEL_ageband_1_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLYADJMODE
> L_ageband_1_timeperiod2.ster saved
(no new episodes generated)
(cat_time: 10193 changes made)
(covid_test_ever: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,508       30.66       30.66
          1 |      3,585       24.39       55.05
          2 |      2,823       19.20       74.25
          3 |      2,146       14.60       88.85
          4 |      1,639       11.15      100.00
------------+-----------------------------------
      Total |     14,701      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid test
observatio |         ever
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,450         58 |     4,508 
         1 |     3,526         59 |     3,585 
         2 |     2,762         61 |     2,823 
         3 |     2,075         71 |     2,146 
         4 |     1,570         69 |     1,639 
-----------+----------------------+----------
     Total |    14,383        318 |    14,701 

         failure _d:  covid_test_ever
   analysis time _t:  (stime_covid_test_ever-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -371.26449
Iteration 1:   log pseudolikelihood = -357.55132
Iteration 2:   log pseudolikelihood = -356.10094
Iteration 3:   log pseudolikelihood = -355.71064
Iteration 4:   log pseudolikelihood = -355.56882
Iteration 5:   log pseudolikelihood = -355.51677
Iteration 6:   log pseudolikelihood = -355.49764
Iteration 7:   log pseudolikelihood =  -355.4906
Iteration 8:   log pseudolikelihood = -355.48801
Iteration 9:   log pseudolikelihood = -355.48706
Iteration 10:  log pseudolikelihood = -355.48671
Iteration 11:  log pseudolikelihood = -355.48658
Iteration 12:  log pseudolikelihood = -355.48654
Iteration 13:  log pseudolikelihood = -355.48652
Iteration 14:  log pseudolikelihood = -355.48651
Iteration 15:  log pseudolikelihood = -355.48651
Iteration 16:  log pseudolikelihood = -355.48651
Iteration 17:  log pseudolikelihood = -355.48651
Iteration 18:  log pseudolikelihood = -355.48651
Iteration 19:  log pseudolikelihood = -355.48651
Iteration 20:  log pseudolikelihood = -355.48651
Iteration 21:  log pseudolikelihood = -355.48651
Iteration 22:  log pseudolikelihood = -355.48651
Iteration 23:  log pseudolikelihood = -355.48651
Iteration 24:  log pseudolikelihood = -355.48651
Iteration 25:  log pseudolikelihood = -355.48651
Iteration 26:  log pseudolikelihood = -355.48651
Iteration 27:  log pseudolikelihood = -355.48651
Iteration 28:  log pseudolikelihood = -355.48651
Iteration 29:  log pseudolikelihood = -355.48651
Iteration 30:  log pseudolikelihood = -355.48651
Iteration 31:  log pseudolikelihood = -355.48651
Iteration 32:  log pseudolikelihood = -355.48651
Iteration 33:  log pseudolikelihood = -355.48651
Iteration 34:  log pseudolikelihood = -355.48651
Iteration 35:  log pseudolikelihood = -355.48651
Iteration 36:  log pseudolikelihood = -355.48651
Iteration 37:  log pseudolikelihood = -355.48651
Iteration 38:  log pseudolikelihood = -355.48651
Iteration 39:  log pseudolikelihood = -355.48651
Iteration 40:  log pseudolikelihood = -355.48651
Iteration 41:  log pseudolikelihood = -355.48651
Iteration 42:  log pseudolikelihood = -355.48651
Iteration 43:  log pseudolikelihood = -355.48651
Iteration 44:  log pseudolikelihood = -355.48651
Refining estimates:
Iteration 0:   log pseudolikelihood = -355.48651
Iteration 1:   log pseudolikelihood = -355.48651

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,146             Number of obs    =       2,146
No. of failures      =           71
Time at risk         =        89502
                                                Wald chi2(34)    =       37.45
Log pseudolikelihood =   -355.48651             Prob > chi2      =      0.3136

                         (Std. Err. adjusted for 754 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9701095   1.102709    -0.03   0.979     .1045377    9.002617
 only 12-18  |   1.522722   2.221399     0.29   0.773     .0872688    26.56945
      mixed  |   1.773945   1.830873     0.56   0.579     .2346509     13.4109
             |
        age1 |   .9906443   .1070894    -0.09   0.931     .8014976    1.224428
        age2 |    1.04829   .4939718     0.10   0.920     .4162755    2.639866
        age3 |    .946787   1.058043    -0.05   0.961     .1059319    8.462096
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.110234    .277883     0.42   0.676     .6797754    1.813275
             |
   obese4cat |
Obese I ..)  |   1.222023   .3931556     0.62   0.533     .6504683    2.295791
Obese II..)  |   .9014297   .4333383    -0.22   0.829     .3513496    2.312727
Obese II..)  |   .9115899   .4965595    -0.17   0.865     .3134257    2.651334
             |
smoke_nomiss |
     Former  |    .701452   .7311117    -0.34   0.734     .0909504    5.409924
    Current  |   .8240854   .3231844    -0.49   0.622     .3820793    1.777423
             |
         imd |
          4  |    1.45398   .4371103     1.25   0.213     .8066065    2.620929
5 most de..  |   1.533211   .5573851     1.18   0.240     .7518912    3.126429
             |
tot_adults~h |
          2  |   .0001465          .        .       .            .           .
          3  |   1.08e+15          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .5595053   .2878314    -1.13   0.259     .2041329    1.533541
      Other  |    1.63601   .5229342     1.54   0.124     .8743954    3.061005
             |
1.htdiag_o~p |   1.110456   .2813831     0.41   0.679     .6757906    1.824698
1.~y_disease |   1.134711   .3483963     0.41   0.681     .6216363    2.071258
    1.asthma |   .9493291   .4580715    -0.11   0.914     .3687177    2.444216
1.~c_disease |   1.121986    .316659     0.41   0.683     .6452855    1.950845
             |
     diabcat |
T1DM, con..  |   .6117338   .6298557    -0.48   0.633     .0813102    4.602352
T1DM, unc..  |   6.47e-20          .        .       .            .           .
T2DM, con..  |     .82554   .2863336    -0.55   0.580     .4183156    1.629192
T2DM, unc..  |   .3362241   .3419464    -1.07   0.284     .0458079    2.467842
Diabetes,..  |   2.81e-18          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.03e-19          .        .       .            .           .
2-5 years..  |   2.81e-20          .        .       .            .           .
   5+ years  |   .6229855   .2342334    -1.26   0.208     .2981526    1.301719
             |
cancer_hae~t |
  Last year  |   1.13e-19          .        .       .            .           .
2-5 years..  |   2.20e-20          .        .       .            .           .
   5+ years  |   1.298916   .3694297     0.92   0.358     .7438535    2.268164
             |
1.~r_disease |   .8303704   .2523995    -0.61   0.541     .4576575    1.506618
1.stroke_d~a |   .7968839    .255043    -0.71   0.478     .4255668    1.492184
1.other_ne~o |   1.643153   .4573339     1.78   0.074     .9522825    2.835244
             |
reduced_ki~t |
Stage 3a/..  |   .9086386   .6109668    -0.14   0.887     .2432456      3.3942
      1.esrd |    1.09229   .2758325     0.35   0.727     .6658659    1.791798
1.other_tr~t |   1.128896    .325652     0.42   0.674     .6413694    1.987007
  1.asplenia |   .8400057   .2527575    -0.58   0.562     .4657533    1.514986
1.ra_sle_p~s |    1.10403   .3204293     0.34   0.733      .625074     1.94998
1.other_im~o |   1.159556   .3412041     0.50   0.615     .6513619    2.064245
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,146             Number of obs    =       2,146
No. of failures      =           71
Time at risk         =        89502
                                                Wald chi2(34)    =       37.45
Log pseudolikelihood =   -355.48651             Prob > chi2      =      0.3136

                         (Std. Err. adjusted for 754 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9701095   1.102709    -0.03   0.979     .1045377    9.002617
 only 12-18  |   1.522722   2.221399     0.29   0.773     .0872688    26.56945
      mixed  |   1.773945   1.830873     0.56   0.579     .2346509     13.4109
             |
        age1 |   .9906443   .1070894    -0.09   0.931     .8014976    1.224428
        age2 |    1.04829   .4939718     0.10   0.920     .4162755    2.639866
        age3 |    .946787   1.058043    -0.05   0.961     .1059319    8.462096
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.110234    .277883     0.42   0.676     .6797754    1.813275
             |
   obese4cat |
Obese I ..)  |   1.222023   .3931556     0.62   0.533     .6504683    2.295791
Obese II..)  |   .9014297   .4333383    -0.22   0.829     .3513496    2.312727
Obese II..)  |   .9115899   .4965595    -0.17   0.865     .3134257    2.651334
             |
smoke_nomiss |
     Former  |    .701452   .7311117    -0.34   0.734     .0909504    5.409924
    Current  |   .8240854   .3231844    -0.49   0.622     .3820793    1.777423
             |
         imd |
          4  |    1.45398   .4371103     1.25   0.213     .8066065    2.620929
5 most de..  |   1.533211   .5573851     1.18   0.240     .7518912    3.126429
             |
tot_adults~h |
          2  |   .0001465          .        .       .            .           .
          3  |   1.08e+15          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .5595053   .2878314    -1.13   0.259     .2041329    1.533541
      Other  |    1.63601   .5229342     1.54   0.124     .8743954    3.061005
             |
1.htdiag_o~p |   1.110456   .2813831     0.41   0.679     .6757906    1.824698
1.~y_disease |   1.134711   .3483963     0.41   0.681     .6216363    2.071258
    1.asthma |   .9493291   .4580715    -0.11   0.914     .3687177    2.444216
1.~c_disease |   1.121986    .316659     0.41   0.683     .6452855    1.950845
             |
     diabcat |
T1DM, con..  |   .6117338   .6298557    -0.48   0.633     .0813102    4.602352
T1DM, unc..  |   6.47e-20          .        .       .            .           .
T2DM, con..  |     .82554   .2863336    -0.55   0.580     .4183156    1.629192
T2DM, unc..  |   .3362241   .3419464    -1.07   0.284     .0458079    2.467842
Diabetes,..  |   2.81e-18          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.03e-19          .        .       .            .           .
2-5 years..  |   2.81e-20          .        .       .            .           .
   5+ years  |   .6229855   .2342334    -1.26   0.208     .2981526    1.301719
             |
cancer_hae~t |
  Last year  |   1.13e-19          .        .       .            .           .
2-5 years..  |   2.20e-20          .        .       .            .           .
   5+ years  |   1.298916   .3694297     0.92   0.358     .7438535    2.268164
             |
1.~r_disease |   .8303704   .2523995    -0.61   0.541     .4576575    1.506618
1.stroke_d~a |   .7968839    .255043    -0.71   0.478     .4255668    1.492184
1.other_ne~o |   1.643153   .4573339     1.78   0.074     .9522825    2.835244
             |
reduced_ki~t |
Stage 3a/..  |   .9086386   .6109668    -0.14   0.887     .2432456      3.3942
      1.esrd |    1.09229   .2758325     0.35   0.727     .6658659    1.791798
1.other_tr~t |   1.128896    .325652     0.42   0.674     .6413694    1.987007
  1.asplenia |   .8400057   .2527575    -0.58   0.562     .4657533    1.514986
1.ra_sle_p~s |    1.10403   .3204293     0.34   0.733      .625074     1.94998
1.other_im~o |   1.159556   .3412041     0.50   0.615     .6513619    2.064245
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLY
> ADJMODEL_ageband_1_timeperiod3.ster not found)
file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLYADJMODE
> L_ageband_1_timeperiod3.ster saved
(no new episodes generated)
(cat_time: 10193 changes made)
(covid_test_ever: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,508       30.66       30.66
          1 |      3,585       24.39       55.05
          2 |      2,823       19.20       74.25
          3 |      2,146       14.60       88.85
          4 |      1,639       11.15      100.00
------------+-----------------------------------
      Total |     14,701      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid test
observatio |         ever
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,450         58 |     4,508 
         1 |     3,526         59 |     3,585 
         2 |     2,762         61 |     2,823 
         3 |     2,075         71 |     2,146 
         4 |     1,570         69 |     1,639 
-----------+----------------------+----------
     Total |    14,383        318 |    14,701 

         failure _d:  covid_test_ever
   analysis time _t:  (stime_covid_test_ever-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -340.83556
Iteration 1:   log pseudolikelihood = -331.90919
Iteration 2:   log pseudolikelihood = -325.27008
Iteration 3:   log pseudolikelihood = -324.81504
Iteration 4:   log pseudolikelihood = -324.69211
Iteration 5:   log pseudolikelihood = -324.64717
Iteration 6:   log pseudolikelihood = -324.63066
Iteration 7:   log pseudolikelihood = -324.62458
Iteration 8:   log pseudolikelihood = -324.62235
Iteration 9:   log pseudolikelihood = -324.62153
Iteration 10:  log pseudolikelihood = -324.62123
Iteration 11:  log pseudolikelihood = -324.62112
Iteration 12:  log pseudolikelihood = -324.62107
Iteration 13:  log pseudolikelihood = -324.62106
Iteration 14:  log pseudolikelihood = -324.62105
Iteration 15:  log pseudolikelihood = -324.62105
Iteration 16:  log pseudolikelihood = -324.62105
Iteration 17:  log pseudolikelihood = -324.62105
Iteration 18:  log pseudolikelihood = -324.62105
Iteration 19:  log pseudolikelihood = -324.62105
Iteration 20:  log pseudolikelihood = -324.62105
Iteration 21:  log pseudolikelihood = -324.62105
Iteration 22:  log pseudolikelihood = -324.62105
Iteration 23:  log pseudolikelihood = -324.62105
Iteration 24:  log pseudolikelihood = -324.62105
Iteration 25:  log pseudolikelihood = -324.62105
Iteration 26:  log pseudolikelihood = -324.62105
Iteration 27:  log pseudolikelihood = -324.62105
Iteration 28:  log pseudolikelihood = -324.62105
Iteration 29:  log pseudolikelihood = -324.62105
Iteration 30:  log pseudolikelihood = -324.62105
Iteration 31:  log pseudolikelihood = -324.62105
Iteration 32:  log pseudolikelihood = -324.62105
Iteration 33:  log pseudolikelihood = -324.62105
Iteration 34:  log pseudolikelihood = -324.62105
Iteration 35:  log pseudolikelihood = -324.62105
Iteration 36:  log pseudolikelihood = -324.62105
Iteration 37:  log pseudolikelihood = -324.62105
Iteration 38:  log pseudolikelihood = -324.62105
Iteration 39:  log pseudolikelihood = -324.62105
Iteration 40:  log pseudolikelihood = -324.62105
Iteration 41:  log pseudolikelihood = -324.62105
Iteration 42:  log pseudolikelihood = -324.62105
Iteration 43:  log pseudolikelihood = -324.62105
Iteration 44:  log pseudolikelihood = -324.62105
Iteration 45:  log pseudolikelihood = -324.62105
Refining estimates:
Iteration 0:   log pseudolikelihood = -324.62105
Iteration 1:   log pseudolikelihood = -324.62105
Iteration 2:   log pseudolikelihood = -324.62105
Iteration 3:   log pseudolikelihood = -324.62105

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,639             Number of obs    =       1,639
No. of failures      =           69
Time at risk         =        50616
                                                Wald chi2(37)    =       98.38
Log pseudolikelihood =   -324.62105             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 692 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .3466045   .2644218    -1.39   0.165     .0777069    1.545998
 only 12-18  |   1.330991   1.278609     0.30   0.766     .2025226    8.747356
      mixed  |   .4943101   .3320973    -1.05   0.294     .1324733    1.844466
             |
        age1 |   .9877741   .1027888    -0.12   0.906     .8055281    1.211252
        age2 |   .8694882   .3933183    -0.31   0.757     .3582758    2.110133
        age3 |   1.641067   1.762709     0.46   0.645     .1999083    13.47169
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9208967   .2398885    -0.32   0.752     .5526849     1.53442
             |
   obese4cat |
Obese I ..)  |   .7174441   .2973693    -0.80   0.423     .3184039    1.616582
Obese II..)  |   .6243969   .3284453    -0.90   0.371     .2226956    1.750692
Obese II..)  |   .8339432   .4188681    -0.36   0.718     .3116018    2.231891
             |
smoke_nomiss |
     Former  |   1.372042   1.050335     0.41   0.679     .3060196    6.151562
    Current  |   1.631056   .5435023     1.47   0.142     .8488491    3.134059
             |
         imd |
          4  |   1.224746   .3986082     0.62   0.533     .6471614     2.31782
5 most de..  |   1.417168   .5502519     0.90   0.369     .6620949    3.033348
             |
tot_adults~h |
          2  |   .0001437          .        .       .            .           .
          3  |   3.18e+16          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .8732818   .3949948    -0.30   0.765     .3598709    2.119152
      Other  |   .8328101     .38285    -0.40   0.691     .3382527    2.050457
             |
1.htdiag_o~p |   .7734677   .2144714    -0.93   0.354     .4491757    1.331889
1.~y_disease |   1.238342   .3673398     0.72   0.471     .6923749    2.214826
    1.asthma |   .9959509   .4985468    -0.01   0.994     .3733781    2.656605
1.~c_disease |   .8731653   .2886056    -0.41   0.682     .4568257    1.668946
             |
     diabcat |
T1DM, con..  |   1.767114    1.12226     0.90   0.370     .5089589     6.13545
T1DM, unc..  |   1.829391   1.975996     0.56   0.576     .2202375    15.19574
T2DM, con..  |   1.268793   .4299367     0.70   0.482     .6530657    2.465043
T2DM, unc..  |   1.210555    .765058     0.30   0.762     .3507793    4.177678
Diabetes,..  |   1.43e-18          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |    10.3885   10.28924     2.36   0.018     1.491026    72.38036
2-5 years..  |   .6579637   .6659708    -0.41   0.679     .0904985    4.783681
   5+ years  |   1.067721    .355418     0.20   0.844     .5560501    2.050226
             |
cancer_hae~t |
  Last year  |   2.50e-19          .        .       .            .           .
2-5 years..  |   6.28e-20          .        .       .            .           .
   5+ years  |   1.425153   .4376027     1.15   0.249     .7807181    2.601528
             |
1.~r_disease |   1.012969    .302149     0.04   0.966     .5645462    1.817579
1.stroke_d~a |   1.315522   .3868643     0.93   0.351     .7392297    2.341082
1.other_ne~o |   1.202001   .3659054     0.60   0.546     .6618924    2.182841
             |
reduced_ki~t |
Stage 3a/..  |   1.031445   .6174741     0.05   0.959     .3190617    3.334399
      1.esrd |   1.367971   .3571887     1.20   0.230     .8200136     2.28209
1.other_tr~t |   1.383935   .3791681     1.19   0.236     .8089189    2.367698
  1.asplenia |   1.593549   .4663247     1.59   0.111     .8979987     2.82784
1.ra_sle_p~s |   1.001009   .3022766     0.00   0.997     .5538591     1.80916
1.other_im~o |   .8712588   .2806819    -0.43   0.669     .4633688    1.638202
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,639             Number of obs    =       1,639
No. of failures      =           69
Time at risk         =        50616
                                                Wald chi2(37)    =       98.38
Log pseudolikelihood =   -324.62105             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 692 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .3466045   .2644218    -1.39   0.165     .0777069    1.545998
 only 12-18  |   1.330991   1.278609     0.30   0.766     .2025226    8.747356
      mixed  |   .4943101   .3320973    -1.05   0.294     .1324733    1.844466
             |
        age1 |   .9877741   .1027888    -0.12   0.906     .8055281    1.211252
        age2 |   .8694882   .3933183    -0.31   0.757     .3582758    2.110133
        age3 |   1.641067   1.762709     0.46   0.645     .1999083    13.47169
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9208967   .2398885    -0.32   0.752     .5526849     1.53442
             |
   obese4cat |
Obese I ..)  |   .7174441   .2973693    -0.80   0.423     .3184039    1.616582
Obese II..)  |   .6243969   .3284453    -0.90   0.371     .2226956    1.750692
Obese II..)  |   .8339432   .4188681    -0.36   0.718     .3116018    2.231891
             |
smoke_nomiss |
     Former  |   1.372042   1.050335     0.41   0.679     .3060196    6.151562
    Current  |   1.631056   .5435023     1.47   0.142     .8488491    3.134059
             |
         imd |
          4  |   1.224746   .3986082     0.62   0.533     .6471614     2.31782
5 most de..  |   1.417168   .5502519     0.90   0.369     .6620949    3.033348
             |
tot_adults~h |
          2  |   .0001437          .        .       .            .           .
          3  |   3.18e+16          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .8732818   .3949948    -0.30   0.765     .3598709    2.119152
      Other  |   .8328101     .38285    -0.40   0.691     .3382527    2.050457
             |
1.htdiag_o~p |   .7734677   .2144714    -0.93   0.354     .4491757    1.331889
1.~y_disease |   1.238342   .3673398     0.72   0.471     .6923749    2.214826
    1.asthma |   .9959509   .4985468    -0.01   0.994     .3733781    2.656605
1.~c_disease |   .8731653   .2886056    -0.41   0.682     .4568257    1.668946
             |
     diabcat |
T1DM, con..  |   1.767114    1.12226     0.90   0.370     .5089589     6.13545
T1DM, unc..  |   1.829391   1.975996     0.56   0.576     .2202375    15.19574
T2DM, con..  |   1.268793   .4299367     0.70   0.482     .6530657    2.465043
T2DM, unc..  |   1.210555    .765058     0.30   0.762     .3507793    4.177678
Diabetes,..  |   1.43e-18          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |    10.3885   10.28924     2.36   0.018     1.491026    72.38036
2-5 years..  |   .6579637   .6659708    -0.41   0.679     .0904985    4.783681
   5+ years  |   1.067721    .355418     0.20   0.844     .5560501    2.050226
             |
cancer_hae~t |
  Last year  |   2.50e-19          .        .       .            .           .
2-5 years..  |   6.28e-20          .        .       .            .           .
   5+ years  |   1.425153   .4376027     1.15   0.249     .7807181    2.601528
             |
1.~r_disease |   1.012969    .302149     0.04   0.966     .5645462    1.817579
1.stroke_d~a |   1.315522   .3868643     0.93   0.351     .7392297    2.341082
1.other_ne~o |   1.202001   .3659054     0.60   0.546     .6618924    2.182841
             |
reduced_ki~t |
Stage 3a/..  |   1.031445   .6174741     0.05   0.959     .3190617    3.334399
      1.esrd |   1.367971   .3571887     1.20   0.230     .8200136     2.28209
1.other_tr~t |   1.383935   .3791681     1.19   0.236     .8089189    2.367698
  1.asplenia |   1.593549   .4663247     1.59   0.111     .8979987     2.82784
1.ra_sle_p~s |   1.001009   .3022766     0.00   0.997     .5538591     1.80916
1.other_im~o |   .8712588   .2806819    -0.43   0.669     .4633688    1.638202
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLY
> ADJMODEL_ageband_1_timeperiod4.ster not found)
file ./output/an_multivariate_cox_models_covid_test_ever_kids_cat4_FULLYADJMODE
> L_ageband_1_timeperiod4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_test_ever.lo
> g
  log type:  text
 closed on:  17 Nov 2021, 20:31:04
-------------------------------------------------------------------------------
