-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_tpp_prob_2nd
> VaccCensor.log
  log type:  text
 opened on:  28 Oct 2021, 11:28:49

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. forvalues period=0/4 {
  3. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  4. 
. *Censor at date of second vacc_7ds
. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
  5. replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>s
> econd_vacc_plus_7d
  6. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7.         
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  8. stsplit cat_time, at(0,85,154, 216, 263, 400)
  9. recode cat_time 85=1 154=2 216=3 263=4 
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. }
 14. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 15. stsplit cat_time, at(0,92,161,222,270, 400)
 16. recode cat_time 92=1 161=2 222=3 270=4
 17. recode `outcome' .=0 
 18. tab cat_time
 19. tab cat_time `outcome'
 20. }
 21. keep if cat_time==`period'
 22. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 23. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 24. if _rc==0{
 25. estimates
 26. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_2ndVaccCensor", replace
 27.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 28. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 29. 
. }
 30. }
 31. }
(12,880 missing values generated)
(2,587 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
     15,882  observations remaining, representing
     15,882  subjects
     14,991  failures in single-failure-per-subject data
  1,631,243  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(14,451 observations (episodes) created)
(cat_time: 14451 changes made)
(covid_tpp_prob: 14451 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,882       52.36       52.36
          1 |      7,485       24.68       77.03
          2 |      4,205       13.86       90.90
          3 |      1,953        6.44       97.34
          4 |        808        2.66      100.00
------------+-----------------------------------
      Total |     30,333      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,843      8,039 |    15,882 
         1 |     4,329      3,156 |     7,485 
         2 |     2,057      2,148 |     4,205 
         3 |       880      1,073 |     1,953 
         4 |       233        575 |       808 
-----------+----------------------+----------
     Total |    15,342     14,991 |    30,333 
(14,651 observations deleted)
   1:     10.16 /        1 =      10.1640

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,882             Number of obs    =      15,882
No. of failures      =        8,039
Time at risk         =       959892
                                                Wald chi2(42)    =       41.73
Log pseudolikelihood =   -56620.561             Prob > chi2      =      0.4827

                       (Std. Err. adjusted for 1,115 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.030066   .0787945     0.39   0.699     .8866509    1.196678
 only 12-18  |    1.08911   .1120646     0.83   0.407     .8901983    1.332467
      mixed  |   1.017857   .0724668     0.25   0.804     .8852887    1.170276
             |
        age1 |   1.003816   .0040321     0.95   0.343     .9959447     1.01175
        age2 |   .9852938    .012556    -1.16   0.245     .9609894    1.010213
        age3 |   1.047041   .0385818     1.25   0.212     .9740879    1.125457
      1.male |   .9550245   .0209202    -2.10   0.036     .9148894    .9969203
             |
   obese4cat |
Obese I ..)  |   1.011196   .0336471     0.33   0.738     .9473534    1.079341
Obese II..)  |   .9772958   .0401954    -0.56   0.577      .901606     1.05934
Obese II..)  |   1.055232   .0550753     1.03   0.303     .9526243    1.168892
             |
smoke_nomiss |
     Former  |   1.143357   .0872135     1.76   0.079     .9845854    1.327731
    Current  |   1.028994   .0337145     0.87   0.383     .9649922    1.097241
             |
         imd |
          4  |   .9830032   .0267033    -0.63   0.528     .9320346    1.036759
5 most de..  |   .9952432   .0368166    -0.13   0.897     .9256379    1.070083
             |
tot_adults~h |
          2  |   .7586074   .1515173    -1.38   0.167     .5128683    1.122092
          3  |   .9437512   .1407982    -0.39   0.698     .7044769    1.264295
             |
   ethnicity |
Asian or ..  |    .959816   .0372225    -1.06   0.290     .8895649    1.035615
      Other  |   .9557355   .0367949    -1.18   0.240     .8862724    1.030643
             |
1.htdiag_o~p |   .9889112   .0232614    -0.47   0.635     .9443546     1.03557
1.~y_disease |   .9964281   .0273498    -0.13   0.896     .9442398    1.051501
    1.asthma |   1.008983   .0423705     0.21   0.831     .9292639    1.095541
1.~c_disease |    .979654   .0283265    -0.71   0.477      .925679    1.036776
             |
     diabcat |
T1DM, con..  |    .895773   .0657958    -1.50   0.134     .7756682    1.034475
T1DM, unc..  |   1.053978   .1570614     0.35   0.724     .7870232    1.411483
T2DM, con..  |   1.026335   .0310399     0.86   0.390     .9672659    1.089011
T2DM, unc..  |   1.079745   .0613363     1.35   0.177     .9659792     1.20691
Diabetes,..  |   .9300754   .3316135    -0.20   0.839     .4624095    1.870724
             |
cancer_exh~t |
  Last year  |    1.28584   .2668818     1.21   0.226     .8560835    1.931335
2-5 years..  |   1.087313   .0918598     0.99   0.322     .9213871    1.283118
   5+ years  |   .9395306   .0289332    -2.03   0.043     .8845001    .9979849
             |
cancer_hae~t |
  Last year  |   1.019155   .2003589     0.10   0.923     .6932662    1.498238
2-5 years..  |   .9170682   .0847609    -0.94   0.349     .7651182    1.099195
   5+ years  |   .9822284   .0288013    -0.61   0.541     .9273704    1.040332
             |
1.~r_disease |   1.003594   .0287426     0.13   0.900     .9488112    1.061539
1.stroke_d~a |   1.022358   .0273219     0.83   0.408     .9701862    1.077335
1.other_ne~o |   1.030659   .0289911     1.07   0.283     .9753749    1.089076
             |
reduced_ki~t |
Stage 3a/..  |   1.118489   .1981583     0.63   0.527     .7903649    1.582835
      1.esrd |   1.004136   .0228359     0.18   0.856     .9603614    1.049906
1.other_tr~t |   .9806226   .0271185    -0.71   0.479      .928886    1.035241
  1.asplenia |   .9827715   .0271638    -0.63   0.530     .9309479     1.03748
1.ra_sle_p~s |   .9690454   .0265017    -1.15   0.250     .9184705    1.022405
1.other_im~o |    1.02002   .0276508     0.73   0.465       .96724     1.07568
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod0_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,587 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
     15,882  observations remaining, representing
     15,882  subjects
     14,991  failures in single-failure-per-subject data
  1,631,243  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(14,451 observations (episodes) created)
(cat_time: 14451 changes made)
(covid_tpp_prob: 14451 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,882       52.36       52.36
          1 |      7,485       24.68       77.03
          2 |      4,205       13.86       90.90
          3 |      1,953        6.44       97.34
          4 |        808        2.66      100.00
------------+-----------------------------------
      Total |     30,333      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,843      8,039 |    15,882 
         1 |     4,329      3,156 |     7,485 
         2 |     2,057      2,148 |     4,205 
         3 |       880      1,073 |     1,953 
         4 |       233        575 |       808 
-----------+----------------------+----------
     Total |    15,342     14,991 |    30,333 
(23,048 observations deleted)
   1:      4.25 /        1 =       4.2480

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        7,485             Number of obs    =       7,485
No. of failures      =        3,156
Time at risk         =       399939
                                                Wald chi2(42)    =       39.44
Log pseudolikelihood =   -20061.387             Prob > chi2      =      0.5838

                       (Std. Err. adjusted for 1,005 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.135052   .1409058     1.02   0.308     .8899125    1.447719
 only 12-18  |   1.178744   .2024305     0.96   0.338     .8418589    1.650441
      mixed  |   1.070838    .122786     0.60   0.551     .8553066    1.340681
             |
        age1 |   .9979834   .0063626    -0.32   0.752     .9855906    1.010532
        age2 |   1.000815   .0205024     0.04   0.968      .961427    1.041817
        age3 |    1.00663   .0593549     0.11   0.911     .8967666    1.129952
      1.male |   .9996804    .037356    -0.01   0.993     .9290809    1.075645
             |
   obese4cat |
Obese I ..)  |   1.014003   .0536694     0.26   0.793     .9140852    1.124843
Obese II..)  |   .9742378   .0628751    -0.40   0.686     .8584804    1.105604
Obese II..)  |   1.115315   .0867759     1.40   0.161     .9575705    1.299046
             |
smoke_nomiss |
     Former  |   1.198585   .1480538     1.47   0.143     .9408602    1.526906
    Current  |   1.038616   .0573361     0.69   0.493     .9321049    1.157297
             |
         imd |
          4  |   1.048869    .047701     1.05   0.294     .9594228    1.146655
5 most de..  |   .9145978   .0577855    -1.41   0.158     .8080722    1.035166
             |
tot_adults~h |
          2  |   1.539726   .4727817     1.41   0.160     .8434848     2.81067
          3  |   1.231903   .3364366     0.76   0.445     .7212909    2.103983
             |
   ethnicity |
Asian or ..  |   1.088346    .062051     1.48   0.138     .9732772    1.217019
      Other  |   1.025196   .0586714     0.43   0.664     .9164164    1.146887
             |
1.htdiag_o~p |   1.025357   .0388625     0.66   0.509     .9519481    1.104426
1.~y_disease |   .9618162    .043014    -0.87   0.384     .8810995    1.049927
    1.asthma |    1.02929   .0683741     0.43   0.664     .9036366    1.172416
1.~c_disease |   .9715162    .042196    -0.67   0.506     .8922359    1.057841
             |
     diabcat |
T1DM, con..  |    1.09009   .1133768     0.83   0.407     .8890611    1.336574
T1DM, unc..  |   1.195024   .3015497     0.71   0.480     .7287629    1.959598
T2DM, con..  |   .9451048   .0468158    -1.14   0.254     .8576609    1.041464
T2DM, unc..  |   .9475273   .0908603    -0.56   0.574     .7851784    1.143445
Diabetes,..  |   1.316095   .5044041     0.72   0.474     .6209512    2.789441
             |
cancer_exh~t |
  Last year  |   .7856663    .328301    -0.58   0.564     .3463796    1.782067
2-5 years..  |    1.28598   .1652406     1.96   0.050     .9996776    1.654278
   5+ years  |   1.038566   .0459867     0.85   0.393     .9522344    1.132725
             |
cancer_hae~t |
  Last year  |   1.302124   .3274398     1.05   0.294     .7954336    2.131574
2-5 years..  |   .9497416   .1344271    -0.36   0.716     .7196574    1.253387
   5+ years  |   1.050799    .049725     1.05   0.295     .9577227    1.152921
             |
1.~r_disease |   1.000426   .0444294     0.01   0.992     .9170278    1.091408
1.stroke_d~a |   1.074255   .0467424     1.65   0.100     .9864393    1.169888
1.other_ne~o |   .9572122   .0429777    -0.97   0.330     .8765774    1.045265
             |
reduced_ki~t |
Stage 3a/..  |   1.129318   .3163983     0.43   0.664     .6521349    1.955669
      1.esrd |   .9620564   .0351725    -1.06   0.290     .8955314    1.033523
1.other_tr~t |    1.00061   .0445853     0.01   0.989     .9169315    1.091925
  1.asplenia |   .9998714    .043621    -0.00   0.998     .9179291    1.089129
1.ra_sle_p~s |   1.086451   .0480887     1.87   0.061     .9961713    1.184912
1.other_im~o |   .9970559   .0450628    -0.07   0.948     .9125332    1.089407
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod1_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,587 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
     15,882  observations remaining, representing
     15,882  subjects
     14,991  failures in single-failure-per-subject data
  1,631,243  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(14,451 observations (episodes) created)
(cat_time: 14451 changes made)
(covid_tpp_prob: 14451 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,882       52.36       52.36
          1 |      7,485       24.68       77.03
          2 |      4,205       13.86       90.90
          3 |      1,953        6.44       97.34
          4 |        808        2.66      100.00
------------+-----------------------------------
      Total |     30,333      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,843      8,039 |    15,882 
         1 |     4,329      3,156 |     7,485 
         2 |     2,057      2,148 |     4,205 
         3 |       880      1,073 |     1,953 
         4 |       233        575 |       808 
-----------+----------------------+----------
     Total |    15,342     14,991 |    30,333 
(26,328 observations deleted)
   1:      2.42 /        1 =       2.4250

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,205             Number of obs    =       4,205
No. of failures      =        2,148
Time at risk         =       187669
                                                Wald chi2(42)    =       42.48
Log pseudolikelihood =   -12257.227             Prob > chi2      =      0.4503

                         (Std. Err. adjusted for 902 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.103658   .1990789     0.55   0.585     .7749863     1.57172
 only 12-18  |   .8585221   .2015541    -0.65   0.516     .5418961     1.36015
      mixed  |   1.048735   .1763083     0.28   0.777     .7543374    1.458027
             |
        age1 |    1.00535   .0083407     0.64   0.520     .9891344    1.021831
        age2 |   .9827805   .0256156    -0.67   0.505     .9338356    1.034291
        age3 |   1.055884    .078259     0.73   0.463     .9131195    1.220969
      1.male |   .9552798   .0405029    -1.08   0.281     .8791044    1.038056
             |
   obese4cat |
Obese I ..)  |   .9868364   .0638565    -0.20   0.838     .8692915    1.120276
Obese II..)  |   1.026934    .075479     0.36   0.718     .8891596    1.186056
Obese II..)  |   .9901724   .0917031    -0.11   0.915     .8258064    1.187253
             |
smoke_nomiss |
     Former  |   .9193791   .1534673    -0.50   0.615     .6628388    1.275209
    Current  |   1.082035   .0712565     1.20   0.231     .9510119    1.231108
             |
         imd |
          4  |   .9902615   .0533143    -0.18   0.856     .8910916    1.100468
5 most de..  |   1.018708   .0722465     0.26   0.794     .8865078    1.170622
             |
tot_adults~h |
          2  |   .7660007   .2969673    -0.69   0.492     .3582867    1.637675
          3  |   .8402607   .2652773    -0.55   0.581     .4525668    1.560075
             |
   ethnicity |
Asian or ..  |   1.061855   .0778834     0.82   0.413     .9196706     1.22602
      Other  |   .8439701   .0644882    -2.22   0.026     .7265848      .98032
             |
1.htdiag_o~p |   .9605634   .0435575    -0.89   0.375      .878876    1.049843
1.~y_disease |   .9821194   .0528373    -0.34   0.737     .8838331    1.091336
    1.asthma |   .9809413   .0793453    -0.24   0.812     .8371281    1.149461
1.~c_disease |   .9486506   .0528571    -0.95   0.344     .8505088    1.058117
             |
     diabcat |
T1DM, con..  |   1.093617   .1292653     0.76   0.449     .8674682    1.378723
T1DM, unc..  |    1.22438   .4070032     0.61   0.543       .63821    2.348925
T2DM, con..  |   1.014615   .0573294     0.26   0.797     .9082496    1.133436
T2DM, unc..  |    .817607   .1003259    -1.64   0.101     .6428304    1.039903
Diabetes,..  |   .6961079   .4873841    -0.52   0.605     .1764829    2.745683
             |
cancer_exh~t |
  Last year  |   2.458748   .8855066     2.50   0.012      1.21383     4.98047
2-5 years..  |   .9935989   .1786993    -0.04   0.972     .6984287    1.413514
   5+ years  |   1.030194   .0586454     0.52   0.601     .9214317    1.151795
             |
cancer_hae~t |
  Last year  |   .7664734   .3352318    -0.61   0.543     .3252429    1.806285
2-5 years..  |   1.386972   .1977571     2.29   0.022     1.048822    1.834145
   5+ years  |   .9615995   .0580928    -0.65   0.517     .8542222    1.082474
             |
1.~r_disease |   .9365311   .0552151    -1.11   0.266     .8343301    1.051251
1.stroke_d~a |   .9733543    .055342    -0.48   0.635     .8707113    1.088097
1.other_ne~o |   1.058954   .0585115     1.04   0.300     .9502655    1.180075
             |
reduced_ki~t |
Stage 3a/..  |   1.156258   .4204757     0.40   0.690     .5669091    2.358283
      1.esrd |   1.030163   .0463794     0.66   0.509     .9431567    1.125196
1.other_tr~t |   1.064136   .0561634     1.18   0.239       .95956    1.180109
  1.asplenia |   .9888476   .0523326    -0.21   0.832     .8914179    1.096926
1.ra_sle_p~s |   1.095912   .0557307     1.80   0.072     .9919487    1.210771
1.other_im~o |   1.041492   .0595493     0.71   0.477     .9310796    1.164997
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod2_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,587 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
     15,882  observations remaining, representing
     15,882  subjects
     14,991  failures in single-failure-per-subject data
  1,631,243  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(14,451 observations (episodes) created)
(cat_time: 14451 changes made)
(covid_tpp_prob: 14451 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,882       52.36       52.36
          1 |      7,485       24.68       77.03
          2 |      4,205       13.86       90.90
          3 |      1,953        6.44       97.34
          4 |        808        2.66      100.00
------------+-----------------------------------
      Total |     30,333      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,843      8,039 |    15,882 
         1 |     4,329      3,156 |     7,485 
         2 |     2,057      2,148 |     4,205 
         3 |       880      1,073 |     1,953 
         4 |       233        575 |       808 
-----------+----------------------+----------
     Total |    15,342     14,991 |    30,333 
(28,580 observations deleted)
   1:      1.18 /        1 =       1.1830

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,953             Number of obs    =       1,953
No. of failures      =        1,073
Time at risk         =        64013
                                                Wald chi2(42)    =      128.72
Log pseudolikelihood =   -5248.8286             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 741 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.020271    .249981     0.08   0.935     .6311886    1.649196
 only 12-18  |   .8829138    .278254    -0.40   0.693     .4760565    1.637488
      mixed  |   .8615759   .1953287    -0.66   0.511     .5524804    1.343601
             |
        age1 |   1.009268   .0119877     0.78   0.437      .986044    1.033039
        age2 |   .9726793   .0354125    -0.76   0.447     .9056905    1.044623
        age3 |   1.075888    .111081     0.71   0.479     .8787877    1.317195
      1.male |   .9940024   .0589215    -0.10   0.919     .8849744    1.116463
             |
   obese4cat |
Obese I ..)  |   1.087253   .0962227     0.95   0.345     .9141108    1.293191
Obese II..)  |     .93246   .1027324    -0.63   0.526     .7513639    1.157204
Obese II..)  |   1.009385   .1409875     0.07   0.947     .7676514    1.327241
             |
smoke_nomiss |
     Former  |   .8337462   .2308884    -0.66   0.511     .4845199    1.434684
    Current  |   1.131417   .1080899     1.29   0.196     .9382165    1.364402
             |
         imd |
          4  |   .9614316   .0735954    -0.51   0.607     .8274863    1.117059
5 most de..  |   1.052095   .1076126     0.50   0.620     .8609754     1.28564
             |
tot_adults~h |
          2  |   1.505961   .8324729     0.74   0.459     .5096622    4.449849
          3  |   1.436955   .6380766     0.82   0.414     .6018231    3.430972
             |
   ethnicity |
Asian or ..  |   1.060813   .1123868     0.56   0.577     .8619049    1.305626
      Other  |   1.013956   .0985666     0.14   0.887     .8380579    1.226774
             |
1.htdiag_o~p |   1.070465   .0667834     1.09   0.275     .9472577    1.209697
1.~y_disease |   1.101573   .0778332     1.37   0.171     .9591143    1.265191
    1.asthma |   1.124857   .1297265     1.02   0.308     .8972852    1.410145
1.~c_disease |   1.051313   .0784574     0.67   0.503     .9082564    1.216902
             |
     diabcat |
T1DM, con..  |   1.106818    .211733     0.53   0.596     .7607503    1.610312
T1DM, unc..  |   .9600247   .5267223    -0.07   0.941     .3275416    2.813833
T2DM, con..  |   1.021845   .0862528     0.26   0.798     .8660363    1.205686
T2DM, unc..  |   1.195334   .1612106     1.32   0.186     .9176784    1.556997
Diabetes,..  |   6.418214    1.38405     8.62   0.000     4.205887    9.794241
             |
cancer_exh~t |
  Last year  |   1.123161   1.561117     0.08   0.933     .0736766    17.12199
2-5 years..  |   1.901254   .4286649     2.85   0.004      1.22215     2.95771
   5+ years  |   1.149689   .0933193     1.72   0.086     .9805933    1.347943
             |
cancer_hae~t |
  Last year  |    1.15106   .6102139     0.27   0.791     .4072382    3.253473
2-5 years..  |   1.011842   .2653364     0.04   0.964     .6052033    1.691703
   5+ years  |   .9291836   .0698714    -0.98   0.329     .8018518    1.076735
             |
1.~r_disease |   1.045906   .0762685     0.62   0.538     .9066133    1.206599
1.stroke_d~a |   .9752888   .0769094    -0.32   0.751     .8356206    1.138302
1.other_ne~o |   1.160262   .0838934     2.06   0.040     1.006954    1.336912
             |
reduced_ki~t |
Stage 3a/..  |    .934865   .5988124    -0.11   0.916     .2663948    3.280742
      1.esrd |   1.051376   .0658014     0.80   0.423     .9300035    1.188588
1.other_tr~t |    1.00781   .0738936     0.11   0.915     .8729067    1.163562
  1.asplenia |   .8998663   .0714456    -1.33   0.184     .7701871     1.05138
1.ra_sle_p~s |   1.009222   .0828883     0.11   0.911     .8591657    1.185487
1.other_im~o |   1.134652   .0845153     1.70   0.090      .980529    1.313001
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod3_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,587 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
     15,882  observations remaining, representing
     15,882  subjects
     14,991  failures in single-failure-per-subject data
  1,631,243  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(14,451 observations (episodes) created)
(cat_time: 14451 changes made)
(covid_tpp_prob: 14451 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,882       52.36       52.36
          1 |      7,485       24.68       77.03
          2 |      4,205       13.86       90.90
          3 |      1,953        6.44       97.34
          4 |        808        2.66      100.00
------------+-----------------------------------
      Total |     30,333      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     7,843      8,039 |    15,882 
         1 |     4,329      3,156 |     7,485 
         2 |     2,057      2,148 |     4,205 
         3 |       880      1,073 |     1,953 
         4 |       233        575 |       808 
-----------+----------------------+----------
     Total |    15,342     14,991 |    30,333 
(29,725 observations deleted)
   1:      0.37 /        1 =       0.3690

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          808             Number of obs    =         808
No. of failures      =          575
Time at risk         =        19730
                                                Wald chi2(41)    =       51.27
Log pseudolikelihood =   -2197.7614             Prob > chi2      =      0.1306

                         (Std. Err. adjusted for 505 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.249099   .4822915     0.58   0.565      .586055    2.662292
 only 12-18  |   1.099883   .4942761     0.21   0.832     .4558536    2.653797
      mixed  |   .9674022   .3514029    -0.09   0.927     .4746935    1.971518
             |
        age1 |   .9952588   .0164097    -0.29   0.773     .9636105    1.027947
        age2 |   1.024333   .0526316     0.47   0.640      .926201    1.132862
        age3 |   .9361585   .1383532    -0.45   0.655     .7007318    1.250682
      1.male |   .8741376   .0734093    -1.60   0.109     .7414752    1.030535
             |
   obese4cat |
Obese I ..)  |   .8933962   .1158151    -0.87   0.385     .6929451    1.151832
Obese II..)  |   1.423358   .2211138     2.27   0.023     1.049743    1.929947
Obese II..)  |   .7355264   .1516677    -1.49   0.136      .490996     1.10184
             |
smoke_nomiss |
     Former  |   1.257517   .3592729     0.80   0.423     .7183325    2.201417
    Current  |   1.062534     .14744     0.44   0.662     .8095207    1.394626
             |
         imd |
          4  |   .8830401   .1013936    -1.08   0.279     .7050869    1.105906
5 most de..  |   .9155842   .1238737    -0.65   0.514     .7023204    1.193607
             |
tot_adults~h |
          2  |   1.122879   .7290718     0.18   0.858     .3145272     4.00874
          3  |   .6864432   .3229144    -0.80   0.424     .2730141    1.725933
             |
   ethnicity |
Asian or ..  |    1.04893   .1709735     0.29   0.769     .7620835    1.443746
      Other  |   1.088303   .1483036     0.62   0.535     .8332132    1.421489
             |
1.htdiag_o~p |   1.154677   .0968213     1.72   0.086     .9796839    1.360927
1.~y_disease |    1.06832    .119837     0.59   0.556     .8574705    1.331016
    1.asthma |   1.038105   .1858849     0.21   0.835     .7308422    1.474548
1.~c_disease |   1.059893   .1051744     0.59   0.558      .872562    1.287442
             |
     diabcat |
T1DM, con..  |    .734674   .2138903    -1.06   0.290     .4152207    1.299901
T1DM, unc..  |   .3048934   .3022289    -1.20   0.231     .0436903    2.127702
T2DM, con..  |   1.135522   .1130726     1.28   0.202     .9341895    1.380245
T2DM, unc..  |   1.603603   .3820681     1.98   0.047     1.005293    2.558001
             |
cancer_exh~t |
  Last year  |   1.325611   .4174761     0.90   0.371     .7150658    2.457457
2-5 years..  |   .8483082    .334172    -0.42   0.676     .3919602    1.835969
   5+ years  |   .9236351   .1061198    -0.69   0.489     .7373994    1.156906
             |
cancer_hae~t |
  Last year  |   .5606398   .3867758    -0.84   0.402     .1450289    2.167272
2-5 years..  |   1.454034   .6173781     0.88   0.378      .632641    3.341889
   5+ years  |   .9949376   .1102305    -0.05   0.963     .8007373    1.236237
             |
1.~r_disease |   1.106324   .1203038     0.93   0.353     .8939658    1.369126
1.stroke_d~a |   1.155183   .1080625     1.54   0.123     .9616662    1.387641
1.other_ne~o |   1.184733   .1415849     1.42   0.156      .937336    1.497428
             |
reduced_ki~t |
Stage 3a/..  |   .6486698   .3973654    -0.71   0.480     .1952497    2.155048
      1.esrd |   1.143882   .1011893     1.52   0.129     .9617959    1.360441
1.other_tr~t |   .9429167   .1008868    -0.55   0.583     .7645388    1.162913
  1.asplenia |   1.018298   .1097715     0.17   0.866     .8243591    1.257864
1.ra_sle_p~s |   .7463839   .0827483    -2.64   0.008     .6006111    .9275369
1.other_im~o |   .9855631   .1088002    -0.13   0.895     .7938107    1.223635
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod4_2ndVaccCensor.ster saved
(3,628 missing values generated)
(732 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         65  observations end on or before enter()
------------------------------------------------------------------------------
      4,486  observations remaining, representing
      4,486  subjects
      4,230  failures in single-failure-per-subject data
    451,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(3,974 observations (episodes) created)
(cat_time: 3974 changes made)
(covid_tpp_prob: 3974 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,486       53.03       53.03
          1 |      2,070       24.47       77.49
          2 |      1,149       13.58       91.08
          3 |        541        6.39       97.47
          4 |        214        2.53      100.00
------------+-----------------------------------
      Total |      8,460      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,150      2,336 |     4,486 
         1 |     1,192        878 |     2,070 
         2 |       572        577 |     1,149 
         3 |       250        291 |       541 
         4 |        66        148 |       214 
-----------+----------------------+----------
     Total |     4,230      4,230 |     8,460 
(4,039 observations deleted)
   1:      7.58 /        1 =       7.5800

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,486             Number of obs    =       4,486
No. of failures      =        2,336
Time at risk         =       267118
                                                Wald chi2(42)    =     6608.40
Log pseudolikelihood =   -13475.646             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 919 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .907903   .1245923    -0.70   0.481     .6937905    1.188093
 only 12-18  |   .8351826   .1552266    -0.97   0.333     .5801998    1.202224
      mixed  |   .8898364   .1120372    -0.93   0.354     .6952442    1.138893
             |
        age1 |   .9982766   .0209031    -0.08   0.934     .9581366    1.040098
        age2 |   1.005092   .1091569     0.05   0.963     .8123856    1.243511
        age3 |   .9921136   .2279854    -0.03   0.973     .6323497    1.556559
      1.male |   .9769036   .0433539    -0.53   0.599     .8955222    1.065681
             |
   obese4cat |
Obese I ..)  |   .9956973   .0589831    -0.07   0.942     .8865514    1.118281
Obese II..)  |   1.045334   .0783876     0.59   0.554     .9024538    1.210835
Obese II..)  |    1.16015    .103386     1.67   0.096     .9742261    1.381555
             |
smoke_nomiss |
     Former  |   .9323427   .1481409    -0.44   0.659      .682853    1.272987
    Current  |   1.008689   .0633482     0.14   0.890     .8918658    1.140814
             |
         imd |
          4  |    1.03875    .054036     0.73   0.465     .9380619    1.150246
5 most de..  |   .9699813   .0710437    -0.42   0.677      .840271    1.119715
             |
tot_adults~h |
          2  |    1.36791   .6137429     0.70   0.485     .5677368    3.295853
          3  |   2.025814   .6149336     2.33   0.020     1.117425    3.672661
             |
   ethnicity |
Asian or ..  |   1.066506   .0739147     0.93   0.353     .9310445    1.221677
      Other  |   .9487434   .0632224    -0.79   0.430     .8325807    1.081113
             |
1.htdiag_o~p |   1.024561   .0455701     0.55   0.585     .9390279    1.117886
1.~y_disease |   .9847872   .0517638    -0.29   0.771     .8883832    1.091653
    1.asthma |    .962242   .0725435    -0.51   0.610     .8300651    1.115466
1.~c_disease |   .9667286   .0506485    -0.65   0.518     .8723861    1.071274
             |
     diabcat |
T1DM, con..  |   1.219575   .1392078     1.74   0.082     .9750988    1.525347
T1DM, unc..  |   .8787185   .2371202    -0.48   0.632     .5177915     1.49123
T2DM, con..  |   .9875484   .0554316    -0.22   0.823     .8846673    1.102394
T2DM, unc..  |   1.103286   .1223098     0.89   0.375     .8878187    1.371046
Diabetes,..  |   4.54e-18   2.30e-18   -78.90   0.000     1.68e-18    1.23e-17
             |
cancer_exh~t |
  Last year  |     .99372   .2966449    -0.02   0.983     .5535587    1.783875
2-5 years..  |   1.103384   .1907735     0.57   0.569     .7862404    1.548454
   5+ years  |   1.040246   .0562195     0.73   0.465     .9356929    1.156482
             |
cancer_hae~t |
  Last year  |   .8394693   .2247942    -0.65   0.513     .4966711    1.418864
2-5 years..  |   .8548703   .1469103    -0.91   0.362     .6104082    1.197237
   5+ years  |   .9278515   .0527292    -1.32   0.188     .8300519    1.037174
             |
1.~r_disease |   1.001958   .0527142     0.04   0.970     .9037883     1.11079
1.stroke_d~a |   1.100099   .0533893     1.97   0.049     1.000281    1.209879
1.other_ne~o |   .9294601   .0484596    -1.40   0.161     .8391727    1.029462
             |
reduced_ki~t |
Stage 3a/..  |   1.113944   .1187575     1.01   0.311     .9038923    1.372808
      1.esrd |   .9675543   .0428358    -0.75   0.456     .8871371    1.055261
1.other_tr~t |   .9449591   .0490274    -1.09   0.275     .8535914    1.046107
  1.asplenia |   1.058964   .0567263     1.07   0.285     .9534199    1.176192
1.ra_sle_p~s |   1.011658   .0523552     0.22   0.823     .9140765    1.119657
1.other_im~o |   1.044446   .0515344     0.88   0.378     .9481704    1.150497
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod0_2ndVaccCensor.ster saved
(3,628 missing values generated)
(732 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         65  observations end on or before enter()
------------------------------------------------------------------------------
      4,486  observations remaining, representing
      4,486  subjects
      4,230  failures in single-failure-per-subject data
    451,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(3,974 observations (episodes) created)
(cat_time: 3974 changes made)
(covid_tpp_prob: 3974 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,486       53.03       53.03
          1 |      2,070       24.47       77.49
          2 |      1,149       13.58       91.08
          3 |        541        6.39       97.47
          4 |        214        2.53      100.00
------------+-----------------------------------
      Total |      8,460      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,150      2,336 |     4,486 
         1 |     1,192        878 |     2,070 
         2 |       572        577 |     1,149 
         3 |       250        291 |       541 
         4 |        66        148 |       214 
-----------+----------------------+----------
     Total |     4,230      4,230 |     8,460 
(6,455 observations deleted)
   1:      1.24 /        1 =       1.2430

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,070             Number of obs    =       2,070
No. of failures      =          878
Time at risk         =       109900
                                                Wald chi2(42)    =       50.10
Log pseudolikelihood =   -4432.7773             Prob > chi2      =      0.1829

                         (Std. Err. adjusted for 771 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .4920309   .1179805    -2.96   0.003      .307531    .7872195
 only 12-18  |   .7870959    .223793    -0.84   0.400     .4508246    1.374193
      mixed  |   .5547822   .1209091    -2.70   0.007     .3619193    .8504194
             |
        age1 |    .960126   .0310805    -1.26   0.209     .9011017    1.023017
        age2 |   1.281576   .2180882     1.46   0.145     .9181077    1.788936
        age3 |   .5872771   .2139569    -1.46   0.144     .2875631    1.199369
      1.male |   1.061546   .0703442     0.90   0.367     .9322519    1.208772
             |
   obese4cat |
Obese I ..)  |   1.036787     .09311     0.40   0.687     .8694531    1.236325
Obese II..)  |   .8637027   .1140679    -1.11   0.267      .666726    1.118874
Obese II..)  |   .9362439   .1702993    -0.36   0.717     .6554787    1.337271
             |
smoke_nomiss |
     Former  |   .9545619    .255108    -0.17   0.862     .5653525    1.611717
    Current  |    1.02012    .101849     0.20   0.842     .8388171    1.240611
             |
         imd |
          4  |   .9313146   .0800938    -0.83   0.408     .7868508    1.102302
5 most de..  |   1.100103   .1189742     0.88   0.378     .8899741    1.359845
             |
tot_adults~h |
          2  |   2.645138   1.105263     2.33   0.020     1.166209    5.999574
          3  |   1.889404   .6373225     1.89   0.059     .9754444    3.659713
             |
   ethnicity |
Asian or ..  |   1.211386    .141285     1.64   0.100     .9638426    1.522505
      Other  |   .9608772    .104828    -0.37   0.715     .7758989    1.189955
             |
1.htdiag_o~p |   .9810562   .0717826    -0.26   0.794     .8499876    1.132336
1.~y_disease |   .7859498   .0703427    -2.69   0.007     .6594959    .9366504
    1.asthma |   .9605317   .1167945    -0.33   0.741     .7568522    1.219024
1.~c_disease |   1.066536    .086744     0.79   0.428       .90938    1.250852
             |
     diabcat |
T1DM, con..  |   .9384854   .2362431    -0.25   0.801     .5730021    1.537088
T1DM, unc..  |   .4985397   .2824774    -1.23   0.219     .1642104    1.513557
T2DM, con..  |   1.031152   .0935625     0.34   0.735     .8631534    1.231848
T2DM, unc..  |   1.092526   .2005128     0.48   0.630     .7624465    1.565503
Diabetes,..  |   1.308052   .9314107     0.38   0.706     .3239807    5.281181
             |
cancer_exh~t |
  Last year  |   1.463615   .5001336     1.11   0.265     .7491376    2.859512
2-5 years..  |   1.138044   .3010076     0.49   0.625      .677673    1.911165
   5+ years  |   .9751258   .0891781    -0.28   0.783     .8151092    1.166556
             |
cancer_hae~t |
  Last year  |   .5614744   .3339496    -0.97   0.332     .1750083    1.801363
2-5 years..  |   1.075606   .2382946     0.33   0.742      .696746    1.660475
   5+ years  |   .9301857   .0840787    -0.80   0.423     .7791665    1.110476
             |
1.~r_disease |   1.042242   .0870701     0.50   0.620      .884827    1.227663
1.stroke_d~a |   .9932115   .0818467    -0.08   0.934     .8450794    1.167309
1.other_ne~o |   .9625881   .0821321    -0.45   0.655     .8143523    1.137807
             |
reduced_ki~t |
Stage 3a/..  |   .9626894   .1740809    -0.21   0.833     .6754067    1.372167
      1.esrd |   1.051713   .0777375     0.68   0.495     .9098726    1.215665
1.other_tr~t |   .9704024   .0811158    -0.36   0.719     .8237587    1.143151
  1.asplenia |   .9906775   .0810832    -0.11   0.909     .8438488    1.163054
1.ra_sle_p~s |   1.133412   .1014954     1.40   0.162     .9509633    1.350864
1.other_im~o |   1.116933   .0961452     1.28   0.199     .9435305    1.322203
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod1_2ndVaccCensor.ster saved
(3,628 missing values generated)
(732 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         65  observations end on or before enter()
------------------------------------------------------------------------------
      4,486  observations remaining, representing
      4,486  subjects
      4,230  failures in single-failure-per-subject data
    451,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(3,974 observations (episodes) created)
(cat_time: 3974 changes made)
(covid_tpp_prob: 3974 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,486       53.03       53.03
          1 |      2,070       24.47       77.49
          2 |      1,149       13.58       91.08
          3 |        541        6.39       97.47
          4 |        214        2.53      100.00
------------+-----------------------------------
      Total |      8,460      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,150      2,336 |     4,486 
         1 |     1,192        878 |     2,070 
         2 |       572        577 |     1,149 
         3 |       250        291 |       541 
         4 |        66        148 |       214 
-----------+----------------------+----------
     Total |     4,230      4,230 |     8,460 
(7,376 observations deleted)
   1:      0.65 /        1 =       0.6510

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,149             Number of obs    =       1,149
No. of failures      =          577
Time at risk         =        51403
                                                Wald chi2(42)    =       60.92
Log pseudolikelihood =   -2539.5937             Prob > chi2      =      0.0295

                         (Std. Err. adjusted for 610 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.11326   .3724805     0.32   0.748     .5778256    2.144846
 only 12-18  |   1.177056   .4862274     0.39   0.693     .5238129    2.644953
      mixed  |   1.154375   .3658401     0.45   0.651     .6202794    2.148357
             |
        age1 |   .9935447   .0396101    -0.16   0.871     .9188661    1.074293
        age2 |   1.035747   .2171794     0.17   0.867     .6867059    1.562201
        age3 |   .8974562   .4026344    -0.24   0.809     .3725036    2.162201
      1.male |   1.087786   .0949808     0.96   0.335     .9166853    1.290823
             |
   obese4cat |
Obese I ..)  |   1.229177   .1412207     1.80   0.072     .9813402    1.539605
Obese II..)  |   1.091168   .1680428     0.57   0.571     .8068715    1.475635
Obese II..)  |   1.387701   .2608432     1.74   0.081     .9600581    2.005832
             |
smoke_nomiss |
     Former  |   .4623088    .173205    -2.06   0.039     .2218338    .9634665
    Current  |   1.104371   .1406668     0.78   0.436     .8603899    1.417539
             |
         imd |
          4  |   .9269394   .1001062    -0.70   0.482     .7501094    1.145455
5 most de..  |   .7866545   .1224861    -1.54   0.123     .5797592    1.067383
             |
tot_adults~h |
          2  |   1.847475   1.317063     0.86   0.389     .4568337    7.471351
          3  |   1.342554   .7009995     0.56   0.573     .4824881    3.735744
             |
   ethnicity |
Asian or ..  |   1.087317   .1539887     0.59   0.554     .8237718    1.435178
      Other  |   .8389578   .1209841    -1.22   0.223     .6323978    1.112986
             |
1.htdiag_o~p |   1.006062   .0897707     0.07   0.946     .8446409    1.198332
1.~y_disease |   .9377821   .0953644    -0.63   0.528     .7683197    1.144621
    1.asthma |   1.135069   .1700651     0.85   0.398     .8462299    1.522496
1.~c_disease |   .9012031   .0949673    -0.99   0.324     .7330345    1.107952
             |
     diabcat |
T1DM, con..  |   1.445648   .3451751     1.54   0.123     .9053625    2.308355
T1DM, unc..  |   .9888253   .6339171    -0.02   0.986      .281469    3.473831
T2DM, con..  |   1.001586   .1233558     0.01   0.990     .7867813    1.275037
T2DM, unc..  |   1.178397   .2445058     0.79   0.429     .7846495    1.769732
Diabetes,..  |   2.541772   .5593957     4.24   0.000     1.651214     3.91264
             |
cancer_exh~t |
  Last year  |   1.770746   .9015825     1.12   0.262     .6527751    4.803402
2-5 years..  |    1.05231   .4914328     0.11   0.913     .4213368    2.628198
   5+ years  |   .9092904   .1058675    -0.82   0.414     .7237662     1.14237
             |
cancer_hae~t |
  Last year  |   1.765663   .7771068     1.29   0.196     .7452042    4.183504
2-5 years..  |   1.115745   .3967776     0.31   0.758     .5557292    2.240095
   5+ years  |   1.025659   .1115437     0.23   0.816     .8287658    1.269328
             |
1.~r_disease |   1.055649   .1105867     0.52   0.605      .859706     1.29625
1.stroke_d~a |   1.113848   .1137363     1.06   0.291     .9118191    1.360639
1.other_ne~o |   1.102385   .1166733     0.92   0.357     .8958689    1.356507
             |
reduced_ki~t |
Stage 3a/..  |   1.316849   .2834534     1.28   0.201     .8636026    2.007975
      1.esrd |   .9571491   .0876253    -0.48   0.632      .799933    1.145264
1.other_tr~t |   .8552574   .0960521    -1.39   0.164     .6862783    1.065843
  1.asplenia |   .8376111   .0933405    -1.59   0.112     .6732672    1.042071
1.ra_sle_p~s |   1.045402   .1139984     0.41   0.684     .8442321    1.294507
1.other_im~o |   .8332688   .0940997    -1.62   0.106     .6678214    1.039704
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod2_2ndVaccCensor.ster saved
(3,628 missing values generated)
(732 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         65  observations end on or before enter()
------------------------------------------------------------------------------
      4,486  observations remaining, representing
      4,486  subjects
      4,230  failures in single-failure-per-subject data
    451,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(3,974 observations (episodes) created)
(cat_time: 3974 changes made)
(covid_tpp_prob: 3974 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,486       53.03       53.03
          1 |      2,070       24.47       77.49
          2 |      1,149       13.58       91.08
          3 |        541        6.39       97.47
          4 |        214        2.53      100.00
------------+-----------------------------------
      Total |      8,460      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,150      2,336 |     4,486 
         1 |     1,192        878 |     2,070 
         2 |       572        577 |     1,149 
         3 |       250        291 |       541 
         4 |        66        148 |       214 
-----------+----------------------+----------
     Total |     4,230      4,230 |     8,460 
(7,984 observations deleted)
   1:      1.11 /        1 =       1.1140

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          541             Number of obs    =         541
No. of failures      =          291
Time at risk         =        17862
                                                Wald chi2(41)    =     2829.62
Log pseudolikelihood =   -1034.2078             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 388 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .7657361   .3229893    -0.63   0.527     .3349965    1.750322
 only 12-18  |   1.163075   .6874851     0.26   0.798     .3651481    3.704646
      mixed  |   .5167599   .2167681    -1.57   0.116      .227107    1.175837
             |
        age1 |   1.092787    .063915     1.52   0.129      .974429     1.22552
        age2 |   .6938964   .2110558    -1.20   0.230     .3822899    1.259495
        age3 |   2.044506   1.324195     1.10   0.270     .5744841      7.2761
      1.male |   1.052606   .1246837     0.43   0.665     .8345239    1.327678
             |
   obese4cat |
Obese I ..)  |   1.073982   .2062698     0.37   0.710     .7370798    1.564874
Obese II..)  |   1.147119   .2577971     0.61   0.541     .7384378    1.781979
Obese II..)  |   1.711929   .4387074     2.10   0.036     1.035983    2.828909
             |
smoke_nomiss |
     Former  |   .5219738   .2123265    -1.60   0.110     .2351799    1.158503
    Current  |   .7018884   .1539035    -1.61   0.106     .4566933    1.078727
             |
         imd |
          4  |   1.224637   .1892682     1.31   0.190     .9045938     1.65791
5 most de..  |   1.327494    .255801     1.47   0.142     .9099354    1.936665
             |
tot_adults~h |
          2  |   3.04e-17   3.11e-17   -37.18   0.000     4.10e-18    2.26e-16
          3  |   1.678876   1.283577     0.68   0.498      .375177    7.512787
             |
   ethnicity |
Asian or ..  |   1.156269   .2598359     0.65   0.518     .7443505     1.79614
      Other  |   1.128616    .223221     0.61   0.541     .7659369    1.663027
             |
1.htdiag_o~p |   .8329866   .1132947    -1.34   0.179     .6380664    1.087452
1.~y_disease |   1.000767   .1390723     0.01   0.996     .7621586    1.314077
    1.asthma |   .8842281   .2129737    -0.51   0.609     .5514998    1.417697
1.~c_disease |   .8186924   .1185892    -1.38   0.167      .616343    1.087474
             |
     diabcat |
T1DM, con..  |   .8004205   .3395516    -0.52   0.600     .3485174    1.838281
T1DM, unc..  |   1.864964   1.418864     0.82   0.413     .4198331    8.284461
T2DM, con..  |   1.106248   .1854517     0.60   0.547     .7964473    1.536556
T2DM, unc..  |   1.724928   .4981675     1.89   0.059     .9793543      3.0381
             |
cancer_exh~t |
  Last year  |   3.299489   1.336252     2.95   0.003     1.491834    7.297479
2-5 years..  |   .9629778   .4797551    -0.08   0.940     .3627004    2.556728
   5+ years  |   .9238584   .1561165    -0.47   0.639     .6633866    1.286602
             |
cancer_hae~t |
  Last year  |   .4410007   .3512566    -1.03   0.304     .0925674    2.100973
2-5 years..  |   .4769814   .2482862    -1.42   0.155     .1719571     1.32307
   5+ years  |   1.109465   .1787458     0.64   0.519     .8090523    1.521425
             |
1.~r_disease |   .9727849   .1474667    -0.18   0.856     .7227386     1.30934
1.stroke_d~a |   .9830466   .1564676    -0.11   0.914      .719601    1.342939
1.other_ne~o |   .7715241   .1180232    -1.70   0.090     .5716598    1.041265
             |
reduced_ki~t |
Stage 3a/..  |   .8357189   .3766167    -0.40   0.690     .3455145    2.021409
      1.esrd |   .9938707   .1278883    -0.05   0.962     .7723246    1.278969
1.other_tr~t |   .9740366   .1472195    -0.17   0.862     .7243051    1.309873
  1.asplenia |   1.087281   .1581463     0.58   0.565     .8175866     1.44594
1.ra_sle_p~s |   1.043196   .1829446     0.24   0.809     .7397608    1.471095
1.other_im~o |   1.161956   .1657822     1.05   0.293      .878505    1.536862
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod3_2ndVaccCensor.ster saved
(3,628 missing values generated)
(732 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         65  observations end on or before enter()
------------------------------------------------------------------------------
      4,486  observations remaining, representing
      4,486  subjects
      4,230  failures in single-failure-per-subject data
    451,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(3,974 observations (episodes) created)
(cat_time: 3974 changes made)
(covid_tpp_prob: 3974 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,486       53.03       53.03
          1 |      2,070       24.47       77.49
          2 |      1,149       13.58       91.08
          3 |        541        6.39       97.47
          4 |        214        2.53      100.00
------------+-----------------------------------
      Total |      8,460      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,150      2,336 |     4,486 
         1 |     1,192        878 |     2,070 
         2 |       572        577 |     1,149 
         3 |       250        291 |       541 
         4 |        66        148 |       214 
-----------+----------------------+----------
     Total |     4,230      4,230 |     8,460 
(8,311 observations deleted)
   1:      0.55 /        1 =       0.5530

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          214             Number of obs    =         214
No. of failures      =          148
Time at risk         =         5114
                                                Wald chi2(40)    =     1189.04
Log pseudolikelihood =   -357.41118             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 189 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .2029361   .2229099    -1.45   0.147     .0235711    1.747188
 only 12-18  |   .4066538   .5416678    -0.68   0.499     .0298823    5.533953
      mixed  |   .1859659   .2095769    -1.49   0.136     .0204249    1.693196
             |
        age1 |   1.003231   .0883289     0.04   0.971     .8442234    1.192187
        age2 |   1.195765    .580927     0.37   0.713     .4614399    3.098681
        age3 |   .5966959    .616998    -0.50   0.618     .0786303      4.5281
      1.male |   1.108248   .2356118     0.48   0.629     .7305881    1.681129
             |
   obese4cat |
Obese I ..)  |    .986393   .2980422    -0.05   0.964     .5455774    1.783379
Obese II..)  |   1.501551    .519145     1.18   0.240     .7625114    2.956881
Obese II..)  |   1.942743   .8134351     1.59   0.113     .8550933    4.413847
             |
smoke_nomiss |
     Former  |   1.207071   .5733542     0.40   0.692     .4757896    3.062318
    Current  |   .9245979   .2848356    -0.25   0.799     .5055081    1.691133
             |
         imd |
          4  |   .9230467   .2016194    -0.37   0.714     .6015854    1.416283
5 most de..  |   2.233761   .7637228     2.35   0.019     1.142907    4.365787
             |
tot_adults~h |
          2  |   16.05659   23.66611     1.88   0.060     .8934101    288.5729
          3  |   6.036245   10.23985     1.06   0.289     .2171666    167.7802
             |
   ethnicity |
Asian or ..  |   1.763846   .4985538     2.01   0.045     1.013601    3.069404
      Other  |   1.509684   .4532843     1.37   0.170     .8381307     2.71932
             |
1.htdiag_o~p |   1.056486   .2283584     0.25   0.799      .691636    1.613802
1.~y_disease |    1.00771    .255332     0.03   0.976     .6132812    1.655815
    1.asthma |   1.423427   .5365915     0.94   0.349     .6799178    2.979984
1.~c_disease |   1.027879   .2259833     0.13   0.900     .6680389    1.581546
             |
     diabcat |
T1DM, con..  |   .6168418   .3825116    -0.78   0.436     .1829501    2.079768
T1DM, unc..  |   1.57e-16   1.89e-16   -30.23   0.000     1.48e-17    1.66e-15
T2DM, con..  |   1.406469   .3883127     1.24   0.217     .8186936    2.416233
T2DM, unc..  |   2.927439   1.387672     2.27   0.023      1.15611    7.412702
             |
cancer_exh~t |
2-5 years..  |    1.72096   .8840858     1.06   0.291     .6287739    4.710285
   5+ years  |   1.239472   .3133239     0.85   0.396     .7552021    2.034279
             |
cancer_hae~t |
  Last year  |   2.683592   1.636095     1.62   0.105     .8123961    8.864723
2-5 years..  |   .2415469   .3042311    -1.13   0.259     .0204599    2.851672
   5+ years  |   1.083563   .2653199     0.33   0.743     .6705486    1.750969
             |
1.~r_disease |   1.050224   .2819555     0.18   0.855     .6205237    1.777483
1.stroke_d~a |   1.357885   .3418314     1.22   0.224     .8290542    2.224041
1.other_ne~o |   1.082172   .2546299     0.34   0.737      .682359    1.716248
             |
reduced_ki~t |
Stage 3a/..  |   2.936689   1.164977     2.72   0.007     1.349549     6.39039
      1.esrd |   .7568729   .1888155    -1.12   0.264     .4641683    1.234157
1.other_tr~t |   1.296615   .3641699     0.92   0.355     .7477232     2.24844
  1.asplenia |   .5735151   .1642454    -1.94   0.052     .3271709    1.005345
1.ra_sle_p~s |   .9824457   .2892905    -0.06   0.952     .5516506    1.749657
1.other_im~o |   .8481518   .2576266    -0.54   0.588     .4676496    1.538249
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod4_2ndVaccCensor.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_tpp_prob_2nd
> VaccCensor.log
  log type:  text
 closed on:  28 Oct 2021, 11:29:27
-------------------------------------------------------------------------------
