-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death_1stVac
> cCensor.log
  log type:  text
 opened on:  14 Sep 2021, 10:56:05

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. forvalues period=0/3 {
  3. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  4. 
. /*Censor at date of second vacc_7ds
> gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
> replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>seco
> nd_vacc_plus_7d
> stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)*/
.         
. *Censor at date of first vacc_7ds
. gen second_vacc_plus_7d=covid_vacc_date+7
  5. replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>s
> econd_vacc_plus_7d
  6. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7.         
.         
.         
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-alpha variant 15th March 2021 
. *-delta variant 24th May 2021 
. 
. if "`outcome'"=="covid_tpp_prob" {
  8. stsplit cat_time, at(0,85,154,173)
  9. recode cat_time 85=1 154=2 173=3
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. }
 14. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-alpha variant 21st March 2021 
. *-delta variant 31st May 2021 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 15. stsplit cat_time, at(0,92,161,173)
 16. recode cat_time 92=1 161=2 173=3
 17. recode `outcome' .=0 
 18. tab cat_time
 19. tab cat_time `outcome'
 20. }
 21. 
. keep if cat_time==`period'
 22. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 23. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 24. if _rc==0{
 25. estimates
 26. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_1stVaccCensor", replace
 27.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 28. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 29. 
. }
 30. }
 31. }
(8,073 missing values generated)
(5,150 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,117  total observations
        187  observations end on or before enter()
------------------------------------------------------------------------------
     15,930  observations remaining, representing
     15,930  subjects
      6,554  failures in single-failure-per-subject data
  1,756,469  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(17,666 observations (episodes) created)
(cat_time: 17666 changes made)
(covid_death: 17666 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,930       47.42       47.42
          1 |      8,814       26.24       73.65
          2 |      4,714       14.03       87.68
          3 |      4,138       12.32      100.00
------------+-----------------------------------
      Total |     33,596      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,301      3,629 |    15,930 
         1 |     6,843      1,971 |     8,814 
         2 |     4,452        262 |     4,714 
         3 |     3,446        692 |     4,138 
-----------+----------------------+----------
     Total |    27,042      6,554 |    33,596 
(17,853 observations deleted)
   1:      6.20 /        1 =       6.2040

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,930             Number of obs    =      15,930
No. of failures      =        3,629
Time at risk         =      1122491
                                                Wald chi2(42)    =       37.86
Log pseudolikelihood =   -25790.004             Prob > chi2      =      0.6534

                       (Std. Err. adjusted for 1,127 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.004399   .1294452     0.03   0.973     .7801985    1.293028
 only 12-18  |   .9566241   .1530663    -0.28   0.782     .6991066    1.308999
      mixed  |   1.052428   .1248712     0.43   0.667     .8340591    1.327969
             |
        age1 |   .9975783   .0062616    -0.39   0.699     .9853809    1.009927
        age2 |   .9982479   .0203412    -0.09   0.931     .9591655    1.038923
        age3 |   1.017922   .0596378     0.30   0.762     .9074952    1.141785
      1.male |   .9938364   .0337547    -0.18   0.856     .9298323    1.062246
             |
   obese4cat |
Obese I ..)  |   .9251198   .0476642    -1.51   0.131     .8362617     1.02342
Obese II..)  |   1.056212   .0638791     0.90   0.366     .9381471    1.189135
Obese II..)  |   1.123446   .0771502     1.69   0.090     .9819686    1.285306
             |
smoke_nomiss |
     Former  |   .9248967   .1127474    -0.64   0.522      .728332    1.174511
    Current  |   .9171869   .0481636    -1.65   0.100     .8274834    1.016615
             |
         imd |
          4  |   1.027979   .0412191     0.69   0.491     .9502844    1.112027
5 most de..  |   1.043319   .0536088     0.83   0.409     .9433647    1.153863
             |
tot_adults~h |
          2  |   1.321859   .4553145     0.81   0.418     .6729592     2.59646
          3  |   1.559046   .4370443     1.58   0.113     .9000015    2.700689
             |
   ethnicity |
Asian or ..  |   .9968353   .0530628    -0.06   0.953     .8980755    1.106456
      Other  |   1.006941   .0553461     0.13   0.900     .9041033    1.121476
             |
1.htdiag_o~p |   1.016313   .0360544     0.46   0.648     .9480485    1.089493
1.~y_disease |   1.061681   .0431374     1.47   0.141      .980412    1.149686
    1.asthma |   1.011379   .0582359     0.20   0.844     .9034435    1.132209
1.~c_disease |   .9761798   .0411818    -0.57   0.568     .8987117    1.060325
             |
     diabcat |
T1DM, con..  |   .9803599   .1082932    -0.18   0.857     .7895135    1.217339
T1DM, unc..  |    1.28907   .2611512     1.25   0.210     .8666277    1.917434
T2DM, con..  |   .9537915   .0447068    -1.01   0.313     .8700722    1.045566
T2DM, unc..  |   .9352396   .0872628    -0.72   0.473     .7789352    1.122909
Diabetes,..  |   1.194663    .655019     0.32   0.746     .4078887    3.499039
             |
cancer_exh~t |
  Last year  |   .8647215   .2396112    -0.52   0.600     .5023558    1.488473
2-5 years..  |   .8416074   .1187253    -1.22   0.222     .6383087    1.109656
   5+ years  |   1.017893   .0435652     0.41   0.679     .9359901    1.106963
             |
cancer_hae~t |
  Last year  |   1.144528   .3063481     0.50   0.614     .6773155    1.934024
2-5 years..  |   .9068284    .120506    -0.74   0.462     .6988939    1.176628
   5+ years  |   1.057347   .0436412     1.35   0.177     .9751797    1.146437
             |
1.~r_disease |   .9985855   .0432471    -0.03   0.974     .9173206     1.08705
1.stroke_d~a |   .9213997   .0387655    -1.95   0.052     .8484691    1.000599
1.other_ne~o |   .9580427   .0423521    -0.97   0.332     .8785285    1.044754
             |
reduced_ki~t |
Stage 3a/..  |   .9031518   .2623011    -0.35   0.726     .5111489    1.595784
      1.esrd |   1.003143   .0344716     0.09   0.927     .9378051    1.073033
1.other_tr~t |   1.042039   .0423872     1.01   0.311     .9621873    1.128518
  1.asplenia |   .9980033   .0432642    -0.05   0.963     .9167094    1.086506
1.ra_sle_p~s |   .9755371   .0395761    -0.61   0.542     .9009731    1.056272
1.other_im~o |   .9496899   .0407245    -1.20   0.229     .8731335    1.032959
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod0_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod0_1stVaccCensor.ster saved
(8,073 missing values generated)
(5,150 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,117  total observations
        187  observations end on or before enter()
------------------------------------------------------------------------------
     15,930  observations remaining, representing
     15,930  subjects
      6,554  failures in single-failure-per-subject data
  1,756,469  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(17,666 observations (episodes) created)
(cat_time: 17666 changes made)
(covid_death: 17666 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,930       47.42       47.42
          1 |      8,814       26.24       73.65
          2 |      4,714       14.03       87.68
          3 |      4,138       12.32      100.00
------------+-----------------------------------
      Total |     33,596      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,301      3,629 |    15,930 
         1 |     6,843      1,971 |     8,814 
         2 |     4,452        262 |     4,714 
         3 |     3,446        692 |     4,138 
-----------+----------------------+----------
     Total |    27,042      6,554 |    33,596 
(24,969 observations deleted)
   1:      2.32 /        1 =       2.3220

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        8,814             Number of obs    =       8,814
No. of failures      =        1,971
Time at risk         =       462826
                                                Wald chi2(42)    =       48.37
Log pseudolikelihood =    -12805.24             Prob > chi2      =      0.2313

                       (Std. Err. adjusted for 1,044 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.094197   .1666672     0.59   0.555     .8117851    1.474857
 only 12-18  |   .9363413   .1890112    -0.33   0.745     .6303901    1.390782
      mixed  |   1.066094   .1514447     0.45   0.652     .8070072    1.408359
             |
        age1 |   .9854102   .0081654    -1.77   0.076     .9695355    1.001545
        age2 |   1.034651   .0268513     1.31   0.189     .9833398     1.08864
        age3 |   .9276022   .0684046    -1.02   0.308     .8027701    1.071846
      1.male |   .9165065   .0400915    -1.99   0.046     .8412028    .9985513
             |
   obese4cat |
Obese I ..)  |   .9413808   .0644352    -0.88   0.377      .823195    1.076535
Obese II..)  |    .980951    .080669    -0.23   0.815     .8349266    1.152514
Obese II..)  |   .9153693   .0984654    -0.82   0.411     .7413672     1.13021
             |
smoke_nomiss |
     Former  |   1.061004   .1731297     0.36   0.717     .7705872    1.460872
    Current  |   .9868267   .0681107    -0.19   0.848     .8619677    1.129772
             |
         imd |
          4  |   .9798653   .0591712    -0.34   0.736      .870492    1.102981
5 most de..  |   1.081365   .0789402     1.07   0.284     .9372037    1.247701
             |
tot_adults~h |
          2  |   .8857937   .2903959    -0.37   0.711     .4658834    1.684178
          3  |   .6824297   .1784705    -1.46   0.144     .4087425    1.139373
             |
   ethnicity |
Asian or ..  |   .8954934   .0682077    -1.45   0.147     .7713087    1.039672
      Other  |   .9325357   .0696155    -0.94   0.349     .8056041    1.079467
             |
1.htdiag_o~p |   1.096648   .0521284     1.94   0.052      .999093    1.203728
1.~y_disease |   .9371474   .0547969    -1.11   0.267     .8356732    1.050943
    1.asthma |   .9899036   .0791908    -0.13   0.899     .8462489    1.157944
1.~c_disease |   1.034938   .0572897     0.62   0.535     .9285292    1.153542
             |
     diabcat |
T1DM, con..  |   1.129121   .1518707     0.90   0.367     .8674632    1.469705
T1DM, unc..  |   .7223981     .26649    -0.88   0.378     .3505674    1.488613
T2DM, con..  |   1.047024   .0627908     0.77   0.444     .9309136    1.177616
T2DM, unc..  |   1.122158   .1241316     1.04   0.297     .9034315     1.39384
Diabetes,..  |   .8159929   .6974514    -0.24   0.812     .1528063    4.357441
             |
cancer_exh~t |
  Last year  |   .4600254   .2396134    -1.49   0.136     .1657358    1.276871
2-5 years..  |   1.264175    .198362     1.49   0.135     .9294905     1.71937
   5+ years  |   .9127983   .0552682    -1.51   0.132     .8106552    1.027812
             |
cancer_hae~t |
  Last year  |   1.190843   .4981885     0.42   0.676     .5245113    2.703673
2-5 years..  |   1.005486   .1990234     0.03   0.978     .6821681    1.482043
   5+ years  |   1.056808   .0628233     0.93   0.353     .9405788    1.187399
             |
1.~r_disease |   1.007943   .0587426     0.14   0.892     .8991417     1.12991
1.stroke_d~a |   .9144988   .0525163    -1.56   0.120     .8171499    1.023445
1.other_ne~o |   .9670646   .0570258    -0.57   0.570     .8615131    1.085548
             |
reduced_ki~t |
Stage 3a/..  |   .9774851   .4104827    -0.05   0.957      .429199    2.226187
      1.esrd |   1.074017   .0517229     1.48   0.138     .9772789     1.18033
1.other_tr~t |   .9741811   .0547611    -0.47   0.642     .8725525    1.087647
  1.asplenia |   .9542937   .0531213    -0.84   0.401     .8556565    1.064302
1.ra_sle_p~s |   1.051045   .0594352     0.88   0.379     .9407775    1.174237
1.other_im~o |   1.061387   .0587437     1.08   0.282     .9522766    1.182999
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod1_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod1_1stVaccCensor.ster saved
(8,073 missing values generated)
(5,150 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,117  total observations
        187  observations end on or before enter()
------------------------------------------------------------------------------
     15,930  observations remaining, representing
     15,930  subjects
      6,554  failures in single-failure-per-subject data
  1,756,469  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(17,666 observations (episodes) created)
(cat_time: 17666 changes made)
(covid_death: 17666 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,930       47.42       47.42
          1 |      8,814       26.24       73.65
          2 |      4,714       14.03       87.68
          3 |      4,138       12.32      100.00
------------+-----------------------------------
      Total |     33,596      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,301      3,629 |    15,930 
         1 |     6,843      1,971 |     8,814 
         2 |     4,452        262 |     4,714 
         3 |     3,446        692 |     4,138 
-----------+----------------------+----------
     Total |    27,042      6,554 |    33,596 
(29,069 observations deleted)
   1:      2.63 /        1 =       2.6290

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,714             Number of obs    =       4,714
No. of failures      =          262
Time at risk         =        53285
                                                Wald chi2(42)    =    14759.50
Log pseudolikelihood =   -1577.1241             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 920 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.122266   .6129368     0.21   0.833     .3847722    3.273317
 only 12-18  |   .9808868   .6474785    -0.03   0.977     .2689955    3.576785
      mixed  |   1.233207   .6520412     0.40   0.692      .437497    3.476139
             |
        age1 |   1.008228   .0240657     0.34   0.731     .9621462    1.056517
        age2 |   1.018922   .0728456     0.26   0.793     .8856987    1.172183
        age3 |   .8608974   .1740581    -0.74   0.459     .5792335    1.279526
      1.male |   1.093194   .1391222     0.70   0.484     .8518667    1.402888
             |
   obese4cat |
Obese I ..)  |   .8120647   .1574475    -1.07   0.283      .555335     1.18748
Obese II..)  |   1.191378   .2561255     0.81   0.415     .7817283    1.815695
Obese II..)  |   .7065075   .2171346    -1.13   0.258     .3868233     1.29039
             |
smoke_nomiss |
     Former  |   1.140136   .5265142     0.28   0.776     .4611822     2.81865
    Current  |   1.561277   .2566226     2.71   0.007     1.131281    2.154714
             |
         imd |
          4  |   .9866901   .1527409    -0.09   0.931     .7284734    1.336435
5 most de..  |   .9287478   .1947811    -0.35   0.724     .6157154    1.400927
             |
tot_adults~h |
          2  |   2.200776   2.526399     0.69   0.492     .2319701    20.87948
          3  |   1.062285   1.206723     0.05   0.958     .1146313    9.844173
             |
   ethnicity |
Asian or ..  |   .5943504   .1446133    -2.14   0.032     .3689215    .9575274
      Other  |   .9517828   .2024966    -0.23   0.816     .6272496    1.444226
             |
1.htdiag_o~p |   .9069942   .1205591    -0.73   0.463     .6989747    1.176922
1.~y_disease |   .8757422   .1483509    -0.78   0.433     .6283225     1.22059
    1.asthma |   1.431862   .2824629     1.82   0.069     .9727133    2.107741
1.~c_disease |   .9055847   .1386228    -0.65   0.517     .6708586    1.222439
             |
     diabcat |
T1DM, con..  |    1.59006   .5295851     1.39   0.164     .8277757     3.05432
T1DM, unc..  |   .6202667   .6243317    -0.47   0.635     .0862578    4.460242
T2DM, con..  |   1.224253   .1989025     1.25   0.213     .8903853    1.683312
T2DM, unc..  |   1.089315   .3479765     0.27   0.789     .5824263     2.03735
Diabetes,..  |   3.49e-14   2.78e-14   -38.91   0.000     7.34e-15    1.66e-13
             |
cancer_exh~t |
  Last year  |   .7105961   .7382947    -0.33   0.742     .0927346    5.445072
2-5 years..  |   .4674551   .3311442    -1.07   0.283      .116614    1.873826
   5+ years  |   .9095561   .1479467    -0.58   0.560     .6612636    1.251078
             |
cancer_hae~t |
  Last year  |   1.795565   1.806756     0.58   0.561     .2498586    12.90351
2-5 years..  |   .7405938   .4314424    -0.52   0.606     .2364295    2.319842
   5+ years  |   1.005223   .1687109     0.03   0.975     .7234382    1.396765
             |
1.~r_disease |   .9998882   .1604568    -0.00   0.999     .7300542    1.369455
1.stroke_d~a |   1.029626   .1630972     0.18   0.854     .7548237    1.404473
1.other_ne~o |   1.063117   .1669609     0.39   0.697     .7814504    1.446309
             |
reduced_ki~t |
Stage 3a/..  |   4.17e-14   1.32e-14   -97.53   0.000     2.25e-14    7.75e-14
      1.esrd |   .8957546   .1163982    -0.85   0.397     .6943529    1.155574
1.other_tr~t |   .9322491   .1443769    -0.45   0.651     .6881877    1.262865
  1.asplenia |   .9159867   .1458836    -0.55   0.582     .6703838    1.251569
1.ra_sle_p~s |   1.024972   .1588445     0.16   0.874     .7564797    1.388757
1.other_im~o |   1.127016   .1718022     0.78   0.433     .8359357    1.519452
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod2_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod2_1stVaccCensor.ster saved
(8,073 missing values generated)
(5,150 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,117  total observations
        187  observations end on or before enter()
------------------------------------------------------------------------------
     15,930  observations remaining, representing
     15,930  subjects
      6,554  failures in single-failure-per-subject data
  1,756,469  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(17,666 observations (episodes) created)
(cat_time: 17666 changes made)
(covid_death: 17666 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,930       47.42       47.42
          1 |      8,814       26.24       73.65
          2 |      4,714       14.03       87.68
          3 |      4,138       12.32      100.00
------------+-----------------------------------
      Total |     33,596      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,301      3,629 |    15,930 
         1 |     6,843      1,971 |     8,814 
         2 |     4,452        262 |     4,714 
         3 |     3,446        692 |     4,138 
-----------+----------------------+----------
     Total |    27,042      6,554 |    33,596 
(29,645 observations deleted)
   1:      2.42 /        1 =       2.4170

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,138             Number of obs    =       4,138
No. of failures      =          692
Time at risk         =       117867
                                                Wald chi2(42)    =     2037.15
Log pseudolikelihood =   -4002.8786             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 894 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.040214   .6360301     2.29   0.022      1.10743    3.758677
 only 12-18  |   1.712262    .594777     1.55   0.122     .8667505    3.382567
      mixed  |   1.867077   .5433112     2.15   0.032      1.05552    3.302616
             |
        age1 |   .9922197   .0143912    -0.54   0.590     .9644105    1.020831
        age2 |    1.04305   .0483541     0.91   0.363     .9524557    1.142261
        age3 |   .8900605   .1173423    -0.88   0.377     .6873854    1.152494
      1.male |   .9651712   .0736854    -0.46   0.642     .8310361    1.120957
             |
   obese4cat |
Obese I ..)  |   1.061793   .1136908     0.56   0.575     .8607914     1.30973
Obese II..)  |   .8591388   .1266201    -1.03   0.303     .6435955    1.146868
Obese II..)  |   1.002612    .174115     0.02   0.988     .7133657    1.409139
             |
smoke_nomiss |
     Former  |   .7568982   .2437914    -0.86   0.387      .402598    1.422995
    Current  |   .8762832   .1098878    -1.05   0.292     .6853336    1.120436
             |
         imd |
          4  |   .9281498   .0908455    -0.76   0.446     .7661329    1.124429
5 most de..  |   .8036198   .1150216    -1.53   0.127      .607042    1.063855
             |
tot_adults~h |
          2  |   3.247175   2.625902     1.46   0.145      .665522    15.84342
          3  |   1.207483   .8594057     0.26   0.791     .2992625    4.872024
             |
   ethnicity |
Asian or ..  |   1.176712   .1374277     1.39   0.164      .935963    1.479386
      Other  |    .783178   .1086032    -1.76   0.078      .596794    1.027771
             |
1.htdiag_o~p |   1.059795   .0864536     0.71   0.477     .9032014    1.243539
1.~y_disease |   .9507162   .0872631    -0.55   0.582     .7941855    1.138099
    1.asthma |   .6911935   .1136242    -2.25   0.025     .5008087    .9539538
1.~c_disease |   1.061121   .1029987     0.61   0.541      .877288    1.283475
             |
     diabcat |
T1DM, con..  |   .9975542    .256902    -0.01   0.992     .6021781    1.652525
T1DM, unc..  |   1.621967   .6248991     1.26   0.209     .7622505     3.45133
T2DM, con..  |   1.165589   .1158433     1.54   0.123     .9592853     1.41626
T2DM, unc..  |   1.112092   .2121409     0.56   0.578     .7651863    1.616273
Diabetes,..  |   1.63e-15   1.28e-15   -43.22   0.000     3.48e-16    7.63e-15
             |
cancer_exh~t |
  Last year  |   .5169959   .3823689    -0.89   0.372     .1213222    2.203098
2-5 years..  |   .7869608   .2380495    -0.79   0.428      .434982    1.423754
   5+ years  |   .8603475   .0918157    -1.41   0.159      .697966    1.060507
             |
cancer_hae~t |
  Last year  |   1.054721   .7138312     0.08   0.937      .279929    3.973997
2-5 years..  |   1.108665   .3506058     0.33   0.744     .5965067    2.060561
   5+ years  |   1.008231   .1011519     0.08   0.935     .8282513    1.227319
             |
1.~r_disease |   .8554215   .0862468    -1.55   0.121     .7020351    1.042321
1.stroke_d~a |   1.187747   .1061092     1.93   0.054     .9969662    1.415035
1.other_ne~o |   .9457288   .0935015    -0.56   0.572     .7791316    1.147949
             |
reduced_ki~t |
Stage 3a/..  |   1.414263   .6476038     0.76   0.449     .5764446    3.469789
      1.esrd |   1.091058   .0847206     1.12   0.262     .9370273     1.27041
1.other_tr~t |   1.096901   .0949616     1.07   0.285     .9257141    1.299745
  1.asplenia |   .9836751   .0944646    -0.17   0.864     .8149083    1.187393
1.ra_sle_p~s |   1.160612   .1125347     1.54   0.125      .959739    1.403527
1.other_im~o |   1.078275   .1032852     0.79   0.431     .8937072     1.30096
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod3_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod3_1stVaccCensor.ster saved
(2,260 missing values generated)
(1,474 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,536  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
      4,482  observations remaining, representing
      4,482  subjects
      1,839  failures in single-failure-per-subject data
    483,114  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(4,759 observations (episodes) created)
(cat_time: 4759 changes made)
(covid_death: 4759 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,482       48.50       48.50
          1 |      2,418       26.17       74.67
          2 |      1,248       13.51       88.17
          3 |      1,093       11.83      100.00
------------+-----------------------------------
      Total |      9,241      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,427      1,055 |     4,482 
         1 |     1,891        527 |     2,418 
         2 |     1,170         78 |     1,248 
         3 |       914        179 |     1,093 
-----------+----------------------+----------
     Total |     7,402      1,839 |     9,241 
(4,813 observations deleted)
   1:      1.21 /        1 =       1.2050

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,482             Number of obs    =       4,482
No. of failures      =        1,055
Time at risk         =       313058
                                                Wald chi2(41)    =       42.22
Log pseudolikelihood =   -6139.4655             Prob > chi2      =      0.4181

                         (Std. Err. adjusted for 918 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9628136   .2574731    -0.14   0.887     .5700542    1.626179
 only 12-18  |   .9868793   .3024495    -0.04   0.966     .5412474    1.799419
      mixed  |   1.048951   .2615771     0.19   0.848     .6434145    1.710092
             |
        age1 |   1.015781   .0286447     0.56   0.579     .9611619    1.073504
        age2 |   .9042374   .1337995    -0.68   0.496     .6765979    1.208466
        age3 |   1.243163     .39055     0.69   0.488     .6716086    2.301125
      1.male |   1.035274   .0661308     0.54   0.587      .913445    1.173351
             |
   obese4cat |
Obese I ..)  |   1.129854   .0987905     1.40   0.163      .951911    1.341061
Obese II..)  |    .914724    .105713    -0.77   0.441     .7293202     1.14726
Obese II..)  |   1.395072   .1691028     2.75   0.006     1.100066     1.76919
             |
smoke_nomiss |
     Former  |   1.016133   .2327381     0.07   0.944     .6486177    1.591887
    Current  |   1.153273    .103395     1.59   0.112     .9674288    1.374819
             |
         imd |
          4  |   .9812775   .0777235    -0.24   0.811     .8401779    1.146073
5 most de..  |   1.044015   .1116944     0.40   0.687     .8465263    1.287576
             |
tot_adults~h |
          2  |   1.036791   .4486194     0.08   0.933     .4439934    2.421063
          3  |   .5457128   .2216276    -1.49   0.136     .2461897    1.209646
             |
   ethnicity |
Asian or ..  |   .9486646   .0945099    -0.53   0.597     .7803914    1.153222
      Other  |   .9613952   .1001984    -0.38   0.706     .7837692    1.179277
             |
1.htdiag_o~p |   1.026093   .0691502     0.38   0.702     .8991305    1.170983
1.~y_disease |   .9205232   .0717165    -1.06   0.288     .7901672    1.072384
    1.asthma |   1.088154   .1189557     0.77   0.440     .8782907    1.348164
1.~c_disease |   1.104488   .0843632     1.30   0.193      .950921    1.282855
             |
     diabcat |
T1DM, con..  |   1.093953   .2006178     0.49   0.624     .7636575    1.567108
T1DM, unc..  |   .3745717   .2654515    -1.39   0.166     .0933911    1.502327
T2DM, con..  |   .9424092   .0843464    -0.66   0.507     .7907812    1.123111
T2DM, unc..  |   1.168925   .1763297     1.03   0.301     .8697304    1.571044
             |
cancer_exh~t |
  Last year  |    .947227   .4764684    -0.11   0.914     .3534174    2.538752
2-5 years..  |   .9323225   .2249627    -0.29   0.771     .5810016    1.496081
   5+ years  |   1.022438   .0839757     0.27   0.787     .8704135    1.201016
             |
cancer_hae~t |
  Last year  |   1.637873    .785065     1.03   0.303     .6401512    4.190617
2-5 years..  |   .9438056   .2560718    -0.21   0.831     .5545438    1.606309
   5+ years  |   .9792895   .0771253    -0.27   0.790     .8392157    1.142743
             |
1.~r_disease |   .9599789   .0723693    -0.54   0.588      .828119    1.112835
1.stroke_d~a |   1.160126   .0890914     1.93   0.053     .9980159    1.348568
1.other_ne~o |   1.007041   .0742429     0.10   0.924      .871552    1.163592
             |
reduced_ki~t |
Stage 3a/..  |   1.245026   .1956321     1.39   0.163     .9150156    1.694059
      1.esrd |   .9368613   .0608749    -1.00   0.316     .8248337    1.064104
1.other_tr~t |   .9812037    .076684    -0.24   0.808      .841851    1.143624
  1.asplenia |    .997701   .0762683    -0.03   0.976     .8588773    1.158963
1.ra_sle_p~s |   .8969708   .0711405    -1.37   0.170     .7678348    1.047825
1.other_im~o |   .9919837   .0758251    -0.11   0.916     .8539658    1.152308
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod0_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod0_1stVaccCensor.ster saved
(2,260 missing values generated)
(1,474 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,536  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
      4,482  observations remaining, representing
      4,482  subjects
      1,839  failures in single-failure-per-subject data
    483,114  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(4,759 observations (episodes) created)
(cat_time: 4759 changes made)
(covid_death: 4759 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,482       48.50       48.50
          1 |      2,418       26.17       74.67
          2 |      1,248       13.51       88.17
          3 |      1,093       11.83      100.00
------------+-----------------------------------
      Total |      9,241      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,427      1,055 |     4,482 
         1 |     1,891        527 |     2,418 
         2 |     1,170         78 |     1,248 
         3 |       914        179 |     1,093 
-----------+----------------------+----------
     Total |     7,402      1,839 |     9,241 
(6,877 observations deleted)
   1:      0.52 /        1 =       0.5200

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,418             Number of obs    =       2,418
No. of failures      =          527
Time at risk         =       124686
                                                Wald chi2(41)    =       32.22
Log pseudolikelihood =   -2734.3357             Prob > chi2      =      0.8349

                         (Std. Err. adjusted for 776 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.414311   .5480026     0.89   0.371     .6618049    3.022454
 only 12-18  |   .9417258   .4694924    -0.12   0.904     .3544561    2.501995
      mixed  |   1.451977   .5302561     1.02   0.307     .7097487    2.970401
             |
        age1 |    .992813   .0397996    -0.18   0.857      .917793    1.073965
        age2 |   .9967669    .211102    -0.02   0.988     .6581432    1.509617
        age3 |   1.053123   .4728149     0.12   0.908     .4368376    2.538858
      1.male |   1.140789   .1019023     1.47   0.140     .9575708    1.359064
             |
   obese4cat |
Obese I ..)  |   1.168925   .1433231     1.27   0.203     .9192208     1.48646
Obese II..)  |   1.304295   .1901503     1.82   0.068     .9801242    1.735684
Obese II..)  |   1.257537   .2301904     1.25   0.211     .8784346    1.800246
             |
smoke_nomiss |
     Former  |    .967401   .3013877    -0.11   0.915     .5253152     1.78153
    Current  |   .9186256    .126422    -0.62   0.537      .701448    1.203044
             |
         imd |
          4  |   1.045273   .1155351     0.40   0.689      .841677    1.298117
5 most de..  |   .8806471   .1345843    -0.83   0.406     .6527061    1.188191
             |
tot_adults~h |
          2  |   .3082019   .3566173    -1.02   0.309     .0319094    2.976816
          3  |   .7692057   .5236953    -0.39   0.700     .2025453     2.92121
             |
   ethnicity |
Asian or ..  |   1.123006   .1534398     0.85   0.396     .8591709    1.467859
      Other  |   1.163615   .1783365     0.99   0.323     .8616948    1.571321
             |
1.htdiag_o~p |   .9585174   .0936128    -0.43   0.664     .7915313    1.160732
1.~y_disease |    1.03174   .1092426     0.30   0.768     .8383845    1.269688
    1.asthma |   1.088728   .1943048     0.48   0.634     .7673717     1.54466
1.~c_disease |   1.061173   .1172063     0.54   0.591      .854616    1.317653
             |
     diabcat |
T1DM, con..  |   1.086455   .2855067     0.32   0.752     .6491224    1.818431
T1DM, unc..  |   1.968072   .9121448     1.46   0.144     .7934753    4.881445
T2DM, con..  |   1.160786   .1278902     1.35   0.176     .9353421    1.440567
T2DM, unc..  |   .8351275    .204873    -0.73   0.463     .5163408    1.350732
             |
cancer_exh~t |
  Last year  |   1.294903     .68134     0.49   0.623     .4617003    3.631738
2-5 years..  |    .893436   .3386609    -0.30   0.766     .4250223    1.878085
   5+ years  |   .9131096    .110075    -0.75   0.451     .7209596    1.156471
             |
cancer_hae~t |
  Last year  |   1.554622   .9546101     0.72   0.472     .4666032     5.17967
2-5 years..  |   1.216791   .3285123     0.73   0.467     .7168142    2.065502
   5+ years  |   .8273636    .102541    -1.53   0.126     .6489347    1.054853
             |
1.~r_disease |   1.024631   .1074716     0.23   0.817     .8342316    1.258486
1.stroke_d~a |   .9749246   .1122709    -0.22   0.825     .7779433    1.221783
1.other_ne~o |   .8901335   .1067581    -0.97   0.332     .7036656    1.126015
             |
reduced_ki~t |
Stage 3a/..  |   1.164229   .2610865     0.68   0.498     .7501539    1.806867
      1.esrd |   .9998296   .0896151    -0.00   0.998       .83875    1.191844
1.other_tr~t |   .9350222   .1052228    -0.60   0.550     .7499492    1.165768
  1.asplenia |   .9766404   .1096739    -0.21   0.833     .7836952    1.217089
1.ra_sle_p~s |   1.185569   .1227726     1.64   0.100     .9677869    1.452358
1.other_im~o |   .9972871    .103574    -0.03   0.979     .8136132    1.222426
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod1_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod1_1stVaccCensor.ster saved
(2,260 missing values generated)
(1,474 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,536  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
      4,482  observations remaining, representing
      4,482  subjects
      1,839  failures in single-failure-per-subject data
    483,114  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(4,759 observations (episodes) created)
(cat_time: 4759 changes made)
(covid_death: 4759 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,482       48.50       48.50
          1 |      2,418       26.17       74.67
          2 |      1,248       13.51       88.17
          3 |      1,093       11.83      100.00
------------+-----------------------------------
      Total |      9,241      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,427      1,055 |     4,482 
         1 |     1,891        527 |     2,418 
         2 |     1,170         78 |     1,248 
         3 |       914        179 |     1,093 
-----------+----------------------+----------
     Total |     7,402      1,839 |     9,241 
(8,047 observations deleted)
   1:      0.73 /        1 =       0.7350

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,248             Number of obs    =       1,248
No. of failures      =           78
Time at risk         =        14100
                                                Wald chi2(38)    =    32038.10
Log pseudolikelihood =   -342.09419             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 621 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8575337   .6619773    -0.20   0.842     .1888696    3.893501
 only 12-18  |   1.249578   1.315944     0.21   0.832     .1586187    9.844019
      mixed  |   1.060976   .6837388     0.09   0.927     .3000231    3.751947
             |
        age1 |    .892406   .0916822    -1.11   0.268     .7296481    1.091469
        age2 |   1.451556   .8354697     0.65   0.517     .4697959    4.484959
        age3 |   .4778156   .6019565    -0.59   0.558     .0404491    5.644325
      1.male |   1.410531   .3119222     1.56   0.120     .9144278    2.175784
             |
   obese4cat |
Obese I ..)  |   .5849814   .2424539    -1.29   0.196     .2596267    1.318059
Obese II..)  |   1.237264   .5145467     0.51   0.609     .5476075    2.795474
Obese II..)  |   .6279683   .3997711    -0.73   0.465     .1803242    2.186862
             |
smoke_nomiss |
     Former  |   2.849703   1.525688     1.96   0.050     .9978819    8.138042
    Current  |   .4970894   .2345747    -1.48   0.139     .1971313    1.253469
             |
         imd |
          4  |   1.016086   .2871866     0.06   0.955     .5839114     1.76813
5 most de..  |   .7340254   .3316446    -0.68   0.494     .3027781    1.779499
             |
tot_adults~h |
          2  |   .0002511          .        .       .            .           .
          3  |   1.07e+15   5.01e+15     7.40   0.000     1.11e+11    1.03e+19
             |
   ethnicity |
Asian or ..  |   2.283792   .6718571     2.81   0.005     1.283057    4.065062
      Other  |   1.705282   .6885633     1.32   0.186     .7728511    3.762674
             |
1.htdiag_o~p |   .9785073   .2477677    -0.09   0.932     .5957052    1.607299
1.~y_disease |    .497283   .1854703    -1.87   0.061      .239405    1.032937
    1.asthma |   .7150704   .3891447    -0.62   0.538     .2461052    2.077671
1.~c_disease |   .4586281   .1811861    -1.97   0.048     .2114385    .9948035
             |
     diabcat |
T1DM, con..  |    1.04051   .8169647     0.05   0.960     .2233152    4.848127
T1DM, unc..  |   1.33e-19          .        .       .            .           .
T2DM, con..  |   1.189251    .356995     0.58   0.564     .6603222    2.141861
T2DM, unc..  |   .5473516   .3922449    -0.84   0.400     .1343617    2.229755
             |
cancer_exh~t |
  Last year  |   3.114314   2.468704     1.43   0.152     .6585948    14.72674
2-5 years..  |   1.436494   1.038511     0.50   0.616     .3482807    5.924864
   5+ years  |   1.023316   .3216693     0.07   0.942     .5526411    1.894858
             |
cancer_hae~t |
  Last year  |   6.91e-19          .        .       .            .           .
2-5 years..  |   1.475166   1.173181     0.49   0.625     .3103779    7.011179
   5+ years  |   1.590335   .4351266     1.70   0.090      .930238    2.718837
             |
1.~r_disease |   .4386589   .1599621    -2.26   0.024     .2146478    .8964529
1.stroke_d~a |   .8308708   .2552678    -0.60   0.546     .4550085    1.517216
1.other_ne~o |   .5211031   .1813782    -1.87   0.061     .2634204    1.030856
             |
reduced_ki~t |
Stage 3a/..  |   2.57e-19   7.98e-20  -137.86   0.000     1.40e-19    4.72e-19
      1.esrd |   1.041902   .2363428     0.18   0.856     .6679476    1.625218
1.other_tr~t |   .8111212   .2539549    -0.67   0.504     .4391189    1.498268
  1.asplenia |   1.006163   .2535478     0.02   0.981     .6140019    1.648795
1.ra_sle_p~s |   .8369412   .2714913    -0.55   0.583     .4431776    1.580564
1.other_im~o |   1.359426   .3880759     1.08   0.282     .7768954    2.378748
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod2_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod2_1stVaccCensor.ster saved
(2,260 missing values generated)
(1,474 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,536  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
      4,482  observations remaining, representing
      4,482  subjects
      1,839  failures in single-failure-per-subject data
    483,114  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(4,759 observations (episodes) created)
(cat_time: 4759 changes made)
(covid_death: 4759 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,482       48.50       48.50
          1 |      2,418       26.17       74.67
          2 |      1,248       13.51       88.17
          3 |      1,093       11.83      100.00
------------+-----------------------------------
      Total |      9,241      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,427      1,055 |     4,482 
         1 |     1,891        527 |     2,418 
         2 |     1,170         78 |     1,248 
         3 |       914        179 |     1,093 
-----------+----------------------+----------
     Total |     7,402      1,839 |     9,241 
(8,202 observations deleted)
   1:      0.66 /        1 =       0.6600

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,093             Number of obs    =       1,093
No. of failures      =          179
Time at risk         =        31270
                                                Wald chi2(40)    =     1882.18
Log pseudolikelihood =   -786.44411             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 573 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.103579    .583525     0.19   0.852     .3914939    3.110872
 only 12-18  |   1.591192   1.039348     0.71   0.477     .4423108    5.724236
      mixed  |   .8883985   .4324686    -0.24   0.808     .3421736    2.306583
             |
        age1 |    1.02641   .0732669     0.37   0.715     .8924019    1.180541
        age2 |   .8565901   .3376374    -0.39   0.695     .3956031    1.854755
        age3 |   1.370293    1.17218     0.37   0.713     .2562572    7.327412
      1.male |   .8832375   .1381658    -0.79   0.427     .6500146     1.20014
             |
   obese4cat |
Obese I ..)  |    1.32108   .2927688     1.26   0.209     .8556408    2.039702
Obese II..)  |   .8286103    .277364    -0.56   0.574     .4299562    1.596895
Obese II..)  |   .5694644   .2473283    -1.30   0.195     .2430944    1.334007
             |
smoke_nomiss |
     Former  |   1.243889   .6428737     0.42   0.673     .4517093    3.425346
    Current  |   1.546007   .3429203     1.96   0.050     1.000936    2.387903
             |
         imd |
          4  |   1.102675    .198008     0.54   0.586     .7755264    1.567827
5 most de..  |   .8252615   .2231247    -0.71   0.477     .4857955    1.401941
             |
tot_adults~h |
          2  |   9.97e+08          .        .       .            .           .
          3  |   1.62e+09   1.62e+09    21.27   0.000     2.30e+08    1.14e+10
             |
   ethnicity |
Asian or ..  |   1.541932   .3491773     1.91   0.056     .9892516    2.403386
      Other  |   .8647306   .2364203    -0.53   0.595     .5060104    1.477754
             |
1.htdiag_o~p |   1.451998   .2345126     2.31   0.021     1.058006    1.992709
1.~y_disease |   1.373246   .2507382     1.74   0.082     .9601279    1.964117
    1.asthma |   1.178872   .3313077     0.59   0.558     .6795898    2.044968
1.~c_disease |   .8696445   .1832307    -0.66   0.507     .5754358    1.314276
             |
     diabcat |
T1DM, con..  |   1.769455   .6208422     1.63   0.104     .8895732    3.519634
T1DM, unc..  |   1.177588    1.26093     0.15   0.879      .144394    9.603671
T2DM, con..  |   1.156082   .2465884     0.68   0.497     .7610797    1.756091
T2DM, unc..  |   1.024461    .391167     0.06   0.950      .484712    2.165246
             |
cancer_exh~t |
  Last year  |   2.143474   1.960667     0.83   0.405     .3568717    12.87433
2-5 years..  |   1.288563   .8643239     0.38   0.705     .3460577    4.798025
   5+ years  |   1.204334   .2224635     1.01   0.314      .838521    1.729737
             |
cancer_hae~t |
  Last year  |   8.41e-16   9.27e-16   -31.50   0.000     9.70e-17    7.29e-15
2-5 years..  |   1.616069   .8932008     0.87   0.385     .5470171    4.774399
   5+ years  |   1.261543   .2366236     1.24   0.215     .8734635    1.822045
             |
1.~r_disease |    1.12116   .1983744     0.65   0.518     .7926088    1.585902
1.stroke_d~a |    1.17081   .2328923     0.79   0.428     .7928106    1.729035
1.other_ne~o |    1.59282   .2802383     2.65   0.008     1.128256    2.248671
             |
reduced_ki~t |
Stage 3a/..  |   .8220497   .3400534    -0.47   0.636     .3654143    1.849314
      1.esrd |   1.191858    .186167     1.12   0.261     .8775415    1.618756
1.other_tr~t |   .9052964   .1785673    -0.50   0.614      .615026    1.332564
  1.asplenia |   1.182394   .2174343     0.91   0.362     .8245787    1.695479
1.ra_sle_p~s |   1.338092   .2319333     1.68   0.093     .9526776    1.879429
1.other_im~o |   .8898437   .1765033    -0.59   0.556     .6032192     1.31266
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod3_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod3_1stVaccCensor.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death_1stVac
> cCensor.log
  log type:  text
 closed on:  14 Sep 2021, 10:56:26
-------------------------------------------------------------------------------
