-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission_2nd
> VaccCensor.log
  log type:  text
 opened on:  28 Oct 2021, 11:32:51

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. forvalues period=0/4 {
  3. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  4. 
. *Censor at date of second vacc_7ds
. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
  5. replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>s
> econd_vacc_plus_7d
  6. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7.         
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  8. stsplit cat_time, at(0,85,154, 216, 263, 400)
  9. recode cat_time 85=1 154=2 216=3 263=4 
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. }
 14. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 15. stsplit cat_time, at(0,92,161,222,270, 400)
 16. recode cat_time 92=1 161=2 222=3 270=4
 17. recode `outcome' .=0 
 18. tab cat_time
 19. tab cat_time `outcome'
 20. }
 21. keep if cat_time==`period'
 22. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 23. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 24. if _rc==0{
 25. estimates
 26. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_2ndVaccCensor", replace
 27.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 28. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 29. 
. }
 30. }
 31. }
(12,880 missing values generated)
(2,811 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        214  observations end on or before enter()
------------------------------------------------------------------------------
     15,868  observations remaining, representing
     15,868  subjects
      2,141  failures in single-failure-per-subject data
  2,303,432  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(23,718 observations (episodes) created)
(cat_time: 23718 changes made)
(covidadmission: 23718 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,868       40.08       40.08
          1 |      9,195       23.23       63.31
          2 |      6,745       17.04       80.35
          3 |      4,637       11.71       92.07
          4 |      3,141        7.93      100.00
------------+-----------------------------------
      Total |     39,586      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,697      1,171 |    15,868 
         1 |     8,762        433 |     9,195 
         2 |     6,468        277 |     6,745 
         3 |     4,465        172 |     4,637 
         4 |     3,053         88 |     3,141 
-----------+----------------------+----------
     Total |    37,445      2,141 |    39,586 
(23,932 observations deleted)
   1:      7.58 /        1 =       7.5780

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,868             Number of obs    =      15,868
No. of failures      =        1,171
Time at risk         =      1122807
                                                Wald chi2(42)    =       30.12
Log pseudolikelihood =   -8335.0538             Prob > chi2      =      0.9146

                       (Std. Err. adjusted for 1,115 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.052887   .2350195     0.23   0.817     .6797999     1.63073
 only 12-18  |   1.307903   .3820531     0.92   0.358     .7377852    2.318574
      mixed  |    1.16318   .2450139     0.72   0.473     .7697477    1.757702
             |
        age1 |   1.008757   .0112052     0.78   0.433     .9870323    1.030959
        age2 |   .9741226   .0346485    -0.74   0.461     .9085257    1.044456
        age3 |   1.067267   .1079443     0.64   0.520     .8753498     1.30126
      1.male |   1.080376   .0649685     1.29   0.199     .9602584     1.21552
             |
   obese4cat |
Obese I ..)  |   .9886327   .0872044    -0.13   0.897     .8316737    1.175214
Obese II..)  |   1.088908   .1096432     0.85   0.398      .893887    1.326476
Obese II..)  |   .9029883   .1249057    -0.74   0.461     .6885569    1.184198
             |
smoke_nomiss |
     Former  |   1.492731   .2638032     2.27   0.023      1.05573    2.110621
    Current  |   .9520907   .0893461    -0.52   0.601     .7921361    1.144345
             |
         imd |
          4  |   1.013762   .0769018     0.18   0.857     .8737063    1.176268
5 most de..  |   .9615266   .1012704    -0.37   0.710      .782187    1.181985
             |
tot_adults~h |
          2  |   1.021952   .4578925     0.05   0.961     .4246622    2.459332
          3  |   .6885625    .257738    -1.00   0.319     .3306186    1.434034
             |
   ethnicity |
Asian or ..  |   1.004082   .1013668     0.04   0.968     .8238275    1.223776
      Other  |   .9457479   .0966999    -0.55   0.585     .7740028    1.155602
             |
1.htdiag_o~p |   .9987055   .0656299    -0.02   0.984     .8780127    1.135989
1.~y_disease |   1.014157   .0769761     0.19   0.853     .8739719    1.176827
    1.asthma |   1.014894   .1130668     0.13   0.894      .815813    1.262557
1.~c_disease |   .9459668    .072837    -0.72   0.471     .8134589     1.10006
             |
     diabcat |
T1DM, con..  |   1.006625   .1826488     0.04   0.971     .7053749    1.436532
T1DM, unc..  |   1.339743   .4729903     0.83   0.407     .6706694    2.676298
T2DM, con..  |   .9135698   .0741077    -1.11   0.265     .7792795    1.071002
T2DM, unc..  |   1.090708    .166114     0.57   0.569     .8092287    1.470097
Diabetes,..  |   2.273563   1.354636     1.38   0.168     .7072017    7.309215
             |
cancer_exh~t |
  Last year  |   1.110483   .6517952     0.18   0.858     .3514803    3.508509
2-5 years..  |   1.036498   .2366396     0.16   0.875     .6625723     1.62145
   5+ years  |   .9182685   .0724824    -1.08   0.280     .7866493     1.07191
             |
cancer_hae~t |
  Last year  |   .4614927   .3260845    -1.09   0.274      .115536    1.843369
2-5 years..  |   .9664338    .254316    -0.13   0.897     .5770047    1.618694
   5+ years  |   .9097512   .0703232    -1.22   0.221     .7818534    1.058571
             |
1.~r_disease |   1.021238   .0739923     0.29   0.772     .8860418    1.177062
1.stroke_d~a |   .8987751   .0674815    -1.42   0.155     .7757851    1.041263
1.other_ne~o |   1.059299   .0741121     0.82   0.410     .9235607    1.214986
             |
reduced_ki~t |
Stage 3a/..  |   .7669752   .4531364    -0.45   0.653     .2409257    2.441628
      1.esrd |   1.017321    .061864     0.28   0.778     .9030165    1.146094
1.other_tr~t |   .9852642     .07256    -0.20   0.840     .8528365    1.138255
  1.asplenia |   .9895395   .0747038    -0.14   0.889       .85344    1.147343
1.ra_sle_p~s |   1.084705   .0729521     1.21   0.227     .9507448    1.237541
1.other_im~o |   .9776419   .0708517    -0.31   0.755     .8481868    1.126855
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod0_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,811 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        214  observations end on or before enter()
------------------------------------------------------------------------------
     15,868  observations remaining, representing
     15,868  subjects
      2,141  failures in single-failure-per-subject data
  2,303,432  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(23,718 observations (episodes) created)
(cat_time: 23718 changes made)
(covidadmission: 23718 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,868       40.08       40.08
          1 |      9,195       23.23       63.31
          2 |      6,745       17.04       80.35
          3 |      4,637       11.71       92.07
          4 |      3,141        7.93      100.00
------------+-----------------------------------
      Total |     39,586      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,697      1,171 |    15,868 
         1 |     8,762        433 |     9,195 
         2 |     6,468        277 |     6,745 
         3 |     4,465        172 |     4,637 
         4 |     3,053         88 |     3,141 
-----------+----------------------+----------
     Total |    37,445      2,141 |    39,586 
(30,605 observations deleted)
   1:     11.69 /        1 =      11.6930

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,195             Number of obs    =       9,195
No. of failures      =          433
Time at risk         =       549492
                                                Wald chi2(42)    =    69139.83
Log pseudolikelihood =   -2869.0744             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,034 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.312817   .4491842     0.80   0.426     .6713719    2.567115
 only 12-18  |    1.44125   .6104032     0.86   0.388     .6283992    3.305546
      mixed  |   1.281738   .4187688     0.76   0.447     .6756084    2.431663
             |
        age1 |   1.002681   .0173246     0.15   0.877     .9692934    1.037218
        age2 |    .985401   .0545873    -0.27   0.791     .8840153    1.098414
        age3 |   1.063887   .1681226     0.39   0.695     .7805179    1.450134
      1.male |   1.069379   .1010036     0.71   0.478     .8886592    1.286851
             |
   obese4cat |
Obese I ..)  |   1.315919   .1646664     2.19   0.028     1.029709     1.68168
Obese II..)  |   .6846294   .1377687    -1.88   0.060     .4614955    1.015649
Obese II..)  |   1.137799   .2438355     0.60   0.547     .7475654    1.731737
             |
smoke_nomiss |
     Former  |   .5368527   .2450501    -1.36   0.173     .2194413    1.313384
    Current  |   .7784431   .1314761    -1.48   0.138     .5590648    1.083906
             |
         imd |
          4  |   .9226511   .1160394    -0.64   0.522     .7210812    1.180568
5 most de..  |   1.115555   .1694585     0.72   0.472     .8283028    1.502425
             |
tot_adults~h |
          2  |   2.331645    1.52553     1.29   0.196     .6467632    8.405813
          3  |   .7424161   .4620715    -0.48   0.632     .2192144     2.51435
             |
   ethnicity |
Asian or ..  |   .6956325   .1276868    -1.98   0.048     .4854422    .9968325
      Other  |   .9306751   .1648385    -0.41   0.685      .657712    1.316923
             |
1.htdiag_o~p |    .894818   .0929844    -1.07   0.285     .7299324     1.09695
1.~y_disease |   .8765338   .1135482    -1.02   0.309     .6799894    1.129888
    1.asthma |   .6279242   .1400698    -2.09   0.037     .4055379    .9722613
1.~c_disease |   .8780678   .1100394    -1.04   0.299     .6868399    1.122537
             |
     diabcat |
T1DM, con..  |   1.296262   .3284926     1.02   0.306     .7888338    2.130102
T1DM, unc..  |   6.01e-16   1.10e-16  -191.24   0.000     4.20e-16    8.61e-16
T2DM, con..  |   .9342353    .127439    -0.50   0.618     .7150623    1.220587
T2DM, unc..  |   1.020527   .2807071     0.07   0.941     .5952401    1.749673
Diabetes,..  |   5.82e-16   2.27e-16   -90.02   0.000     2.71e-16    1.25e-15
             |
cancer_exh~t |
  Last year  |   2.958903   1.662726     1.93   0.054     .9835734    8.901329
2-5 years..  |   1.117336   .3983362     0.31   0.756     .5555539      2.2472
   5+ years  |   .9565695   .1212362    -0.35   0.726     .7461648    1.226304
             |
cancer_hae~t |
  Last year  |   .5977999   .6017072    -0.51   0.609     .0831363     4.29854
2-5 years..  |    1.07007   .3793534     0.19   0.848     .5341343    2.143749
   5+ years  |   .9137959   .1171742    -0.70   0.482     .7107246    1.174889
             |
1.~r_disease |   1.037188   .1265374     0.30   0.765     .8166023     1.31736
1.stroke_d~a |   1.079059   .1252904     0.66   0.512     .8594317    1.354811
1.other_ne~o |   .9391898   .1129059    -0.52   0.602     .7420362    1.188726
             |
reduced_ki~t |
Stage 3a/..  |   6.73e-16   1.55e-16  -151.90   0.000     4.29e-16    1.06e-15
      1.esrd |   .9539272   .0944335    -0.48   0.634     .7856896    1.158189
1.other_tr~t |   .8711702   .1060002    -1.13   0.257     .6863293    1.105792
  1.asplenia |   1.028752   .1223224     0.24   0.812     .8148913    1.298738
1.ra_sle_p~s |   .8412555   .1046299    -1.39   0.165     .6592665    1.073482
1.other_im~o |   .8352394   .1063201    -1.41   0.157     .6508172    1.071921
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod1_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,811 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        214  observations end on or before enter()
------------------------------------------------------------------------------
     15,868  observations remaining, representing
     15,868  subjects
      2,141  failures in single-failure-per-subject data
  2,303,432  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(23,718 observations (episodes) created)
(cat_time: 23718 changes made)
(covidadmission: 23718 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,868       40.08       40.08
          1 |      9,195       23.23       63.31
          2 |      6,745       17.04       80.35
          3 |      4,637       11.71       92.07
          4 |      3,141        7.93      100.00
------------+-----------------------------------
      Total |     39,586      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,697      1,171 |    15,868 
         1 |     8,762        433 |     9,195 
         2 |     6,468        277 |     6,745 
         3 |     4,465        172 |     4,637 
         4 |     3,053         88 |     3,141 
-----------+----------------------+----------
     Total |    37,445      2,141 |    39,586 
(33,055 observations deleted)
   1:      2.52 /        1 =       2.5220

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        6,745             Number of obs    =       6,745
No. of failures      =          277
Time at risk         =       348653
                                                Wald chi2(42)    =       49.28
Log pseudolikelihood =   -1741.9828             Prob > chi2      =      0.2049

                         (Std. Err. adjusted for 980 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.643264   .8884063     0.92   0.358     .5695314    4.741293
 only 12-18  |   4.078473   2.179924     2.63   0.009     1.430654    11.62681
      mixed  |   1.588309   .8149167     0.90   0.367      .581042    4.341728
             |
        age1 |   .9933518   .0224734    -0.29   0.768     .9502671     1.03839
        age2 |   1.027105   .0745239     0.37   0.712     .8909518    1.184066
        age3 |    .911464   .1914811    -0.44   0.659     .6038352    1.375817
      1.male |    1.20696   .1415039     1.60   0.109     .9591754    1.518755
             |
   obese4cat |
Obese I ..)  |   .9762914    .170266    -0.14   0.891     .6936322    1.374136
Obese II..)  |   .7831032    .188855    -1.01   0.311     .4881365     1.25631
Obese II..)  |   1.230153   .3018847     0.84   0.399       .76045    1.989975
             |
smoke_nomiss |
     Former  |   .8962923   .4035472    -0.24   0.808      .370855    2.166183
    Current  |   .6121474   .1313699    -2.29   0.022      .401961     .932241
             |
         imd |
          4  |    .966194    .147651    -0.23   0.822     .7161205    1.303594
5 most de..  |   1.010358    .197906     0.05   0.958     .6882469    1.483222
             |
tot_adults~h |
          2  |    3.17476   3.499216     1.05   0.295     .3660308    27.53621
          3  |   1.237199   1.296319     0.20   0.839      .158695    9.645303
             |
   ethnicity |
Asian or ..  |   .7776749   .1781453    -1.10   0.272     .4963748    1.218391
      Other  |   1.170279   .2273939     0.81   0.418     .7996402    1.712711
             |
1.htdiag_o~p |    .959276    .127858    -0.31   0.755      .738738    1.245652
1.~y_disease |   .9044608   .1414843    -0.64   0.521     .6656359    1.228974
    1.asthma |   .8413114   .2091898    -0.69   0.487     .5167825    1.369638
1.~c_disease |   1.039881   .1597713     0.25   0.799     .7694875    1.405288
             |
     diabcat |
T1DM, con..  |   .8916476   .3452077    -0.30   0.767     .4174886    1.904329
T1DM, unc..  |   .8133326   .7958717    -0.21   0.833     .1194925    5.535997
T2DM, con..  |   1.000896   .1653066     0.01   0.996      .724112    1.383478
T2DM, unc..  |   1.251647   .3414834     0.82   0.411     .7332482    2.136549
Diabetes,..  |   3.598198   3.342724     1.38   0.168     .5825315    22.22546
             |
cancer_exh~t |
  Last year  |   1.292528    1.19954     0.28   0.782     .2096409    7.968997
2-5 years..  |   1.426812   .5964726     0.85   0.395     .6288192    3.237486
   5+ years  |   1.120916   .1748129     0.73   0.464     .8257021    1.521677
             |
cancer_hae~t |
  Last year  |   .9520729   .9222765    -0.05   0.960     .1425963    6.356708
2-5 years..  |     1.4932   .6314619     0.95   0.343     .6518567    3.420456
   5+ years  |   1.179671   .1784634     1.09   0.275     .8769791    1.586839
             |
1.~r_disease |   .9939789   .1555373    -0.04   0.969     .7314448    1.350743
1.stroke_d~a |   .8143577   .1294346    -1.29   0.196      .596382    1.112003
1.other_ne~o |   .8766202   .1360512    -0.85   0.396     .6467035    1.188277
             |
reduced_ki~t |
Stage 3a/..  |   1.360072    1.33463     0.31   0.754     .1987393    9.307656
      1.esrd |   .8688168   .1105887    -1.10   0.269     .6769891       1.115
1.other_tr~t |   .8801185   .1342699    -0.84   0.403     .6526537     1.18686
  1.asplenia |   1.356179   .1901604     2.17   0.030       1.0303    1.785133
1.ra_sle_p~s |   .8827517   .1312905    -0.84   0.402      .659539    1.181508
1.other_im~o |   1.137829   .1655895     0.89   0.375     .8554619    1.513399
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod2_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,811 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        214  observations end on or before enter()
------------------------------------------------------------------------------
     15,868  observations remaining, representing
     15,868  subjects
      2,141  failures in single-failure-per-subject data
  2,303,432  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(23,718 observations (episodes) created)
(cat_time: 23718 changes made)
(covidadmission: 23718 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,868       40.08       40.08
          1 |      9,195       23.23       63.31
          2 |      6,745       17.04       80.35
          3 |      4,637       11.71       92.07
          4 |      3,141        7.93      100.00
------------+-----------------------------------
      Total |     39,586      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,697      1,171 |    15,868 
         1 |     8,762        433 |     9,195 
         2 |     6,468        277 |     6,745 
         3 |     4,465        172 |     4,637 
         4 |     3,053         88 |     3,141 
-----------+----------------------+----------
     Total |    37,445      2,141 |    39,586 
(35,163 observations deleted)
   1:      5.38 /        1 =       5.3830

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,637             Number of obs    =       4,637
No. of failures      =          172
Time at risk         =       187075
                                                Wald chi2(39)    =       59.47
Log pseudolikelihood =    -1002.647             Prob > chi2      =      0.0189

                         (Std. Err. adjusted for 916 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.437483   .8208622     0.64   0.525     .4693877    4.402242
 only 12-18  |   1.157453    .939097     0.18   0.857      .235984    5.677067
      mixed  |   .9985048   .5492287    -0.00   0.998     .3397393    2.934638
             |
        age1 |   .9930474   .0295014    -0.23   0.814      .936877    1.052586
        age2 |   1.002505    .096397     0.03   0.979     .8303062    1.210416
        age3 |   1.053736   .2887858     0.19   0.849     .6158182    1.803065
      1.male |   .7785909   .1337195    -1.46   0.145      .556057    1.090183
             |
   obese4cat |
Obese I ..)  |   1.178892   .2570546     0.75   0.450     .7689033    1.807493
Obese II..)  |    .979119   .2902256    -0.07   0.943     .5476796    1.750429
Obese II..)  |   .6263602   .2610009    -1.12   0.262      .276779    1.417474
             |
smoke_nomiss |
     Former  |   1.041125   .5481194     0.08   0.939     .3709987    2.921686
    Current  |   1.179318   .2767481     0.70   0.482     .7445281    1.868016
             |
         imd |
          4  |    .931774    .193138    -0.34   0.733     .6206884    1.398774
5 most de..  |   .9583386   .2557126    -0.16   0.873     .5680593    1.616755
             |
tot_adults~h |
          2  |   .7425928   1.095446    -0.20   0.840     .0412182    13.37867
          3  |   .8698579   1.038162    -0.12   0.907     .0838596    9.022856
             |
   ethnicity |
Asian or ..  |   .6149191   .1839735    -1.63   0.104     .3420997    1.105308
      Other  |   .6463127   .1877695    -1.50   0.133     .3657195    1.142187
             |
1.htdiag_o~p |   .6599952   .1199976    -2.29   0.022     .4621456    .9425462
1.~y_disease |   1.114002   .2158814     0.56   0.577     .7619606    1.628694
    1.asthma |   .7770847   .2467489    -0.79   0.427     .4170471    1.447944
1.~c_disease |   1.247599     .23468     1.18   0.240     .8628976    1.803809
             |
     diabcat |
T1DM, con..  |   1.353701   .5350973     0.77   0.444      .623815     2.93758
T1DM, unc..  |   1.727951   1.715965     0.55   0.582     .2467372     12.1012
T2DM, con..  |   1.030539   .2143305     0.14   0.885     .6855391    1.549161
T2DM, unc..  |   .5277785   .3083598    -1.09   0.274     .1679302    1.658726
Diabetes,..  |   5.51e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   2.09e-19          .        .       .            .           .
2-5 years..  |   2.103587   .9180948     1.70   0.088     .8942522    4.948357
   5+ years  |   .6152082   .1449087    -2.06   0.039     .3877274    .9761525
             |
cancer_hae~t |
  Last year  |   7.73e-20          .        .       .            .           .
2-5 years..  |   1.806808   .8164639     1.31   0.190     .7451944    4.380812
   5+ years  |    .998296   .2098378    -0.01   0.994     .6612112    1.507226
             |
1.~r_disease |   1.157863   .2090609     0.81   0.417     .8127671    1.649483
1.stroke_d~a |   .8742996   .1783754    -0.66   0.510     .5861347    1.304137
1.other_ne~o |   .6552241   .1391289    -1.99   0.046      .432163    .9934183
             |
reduced_ki~t |
Stage 3a/..  |   2.075355   2.232171     0.68   0.497     .2521002    17.08487
      1.esrd |   .8791747    .146279    -0.77   0.439     .6345275    1.218148
1.other_tr~t |   1.400117   .2421328     1.95   0.052     .9976075     1.96503
  1.asplenia |   .7100341   .1520205    -1.60   0.110     .4666962     1.08025
1.ra_sle_p~s |    1.27112   .2419605     1.26   0.208      .875303    1.845927
1.other_im~o |   .9095099   .1771592    -0.49   0.626     .6208774    1.332321
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod3_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,811 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        214  observations end on or before enter()
------------------------------------------------------------------------------
     15,868  observations remaining, representing
     15,868  subjects
      2,141  failures in single-failure-per-subject data
  2,303,432  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(23,718 observations (episodes) created)
(cat_time: 23718 changes made)
(covidadmission: 23718 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,868       40.08       40.08
          1 |      9,195       23.23       63.31
          2 |      6,745       17.04       80.35
          3 |      4,637       11.71       92.07
          4 |      3,141        7.93      100.00
------------+-----------------------------------
      Total |     39,586      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,697      1,171 |    15,868 
         1 |     8,762        433 |     9,195 
         2 |     6,468        277 |     6,745 
         3 |     4,465        172 |     4,637 
         4 |     3,053         88 |     3,141 
-----------+----------------------+----------
     Total |    37,445      2,141 |    39,586 
(36,659 observations deleted)
   1:      3.47 /        1 =       3.4720

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,141             Number of obs    =       3,141
No. of failures      =           88
Time at risk         =        95405
                                                Wald chi2(42)    =    48639.32
Log pseudolikelihood =   -475.20938             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 838 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .6648213   .5055232    -0.54   0.591     .1497822    2.950868
 only 12-18  |   2.82e-16   1.78e-16   -56.68   0.000     8.18e-17    9.73e-16
      mixed  |   .7734002     .53737    -0.37   0.712     .1981421    3.018783
             |
        age1 |   .9804423   .0374508    -0.52   0.605     .9097204    1.056662
        age2 |   1.013967   .1284969     0.11   0.913     .7909584    1.299852
        age3 |   1.002046   .3685309     0.01   0.996     .4873423    2.060351
      1.male |   1.355269    .303711     1.36   0.175     .8735229    2.102698
             |
   obese4cat |
Obese I ..)  |   1.200534    .359352     0.61   0.541     .6677083    2.158549
Obese II..)  |   .8284369   .3572814    -0.44   0.663     .3557627    1.929117
Obese II..)  |   1.450363   .5707841     0.94   0.345     .6706408    3.136631
             |
smoke_nomiss |
     Former  |   .5544631   .5865281    -0.56   0.577     .0697341    4.408591
    Current  |   1.266281    .390981     0.76   0.445     .6913694    2.319262
             |
         imd |
          4  |   .7248854   .2113187    -1.10   0.270     .4093804    1.283547
5 most de..  |   1.018637   .3471442     0.05   0.957     .5223194    1.986565
             |
tot_adults~h |
          2  |   3.82e-17   2.83e-17   -51.06   0.000     8.96e-18    1.63e-16
          3  |   .2542983   .2279398    -1.53   0.127     .0438905    1.473386
             |
   ethnicity |
Asian or ..  |   .7204576   .2781361    -0.85   0.396     .3380633     1.53539
      Other  |   .6632004   .2982569    -0.91   0.361     .2746878    1.601217
             |
1.htdiag_o~p |   1.050387   .2409569     0.21   0.830      .670016    1.646696
1.~y_disease |   .6943544    .222586    -1.14   0.255     .3704379    1.301509
    1.asthma |   1.145642   .4552529     0.34   0.732     .5257753    2.496305
1.~c_disease |   .5919342   .1934346    -1.60   0.109     .3119712    1.123136
             |
     diabcat |
T1DM, con..  |   1.047532   .7661364     0.06   0.949      .249817    4.392511
T1DM, unc..  |   2.543257   2.427355     0.98   0.328      .391724    16.51203
T2DM, con..  |   1.098072   .3247089     0.32   0.752     .6150684     1.96037
T2DM, unc..  |   .5944065   .4240729    -0.73   0.466      .146826    2.406379
Diabetes,..  |   1.52e-16   1.38e-16   -40.20   0.000     2.58e-17    8.99e-16
             |
cancer_exh~t |
  Last year  |   1.71e-16   1.00e-16   -61.94   0.000     5.42e-17    5.39e-16
2-5 years..  |   1.51e-16   3.81e-17  -144.96   0.000     9.26e-17    2.48e-16
   5+ years  |   .6811372   .2157468    -1.21   0.225     .3661178     1.26721
             |
cancer_hae~t |
  Last year  |   4.181009   3.089806     1.94   0.053     .9822796     17.7962
2-5 years..  |    .889027   .9198894    -0.11   0.909     .1169941    6.755628
   5+ years  |   .6307957   .2013849    -1.44   0.149     .3373946    1.179341
             |
1.~r_disease |   1.054774   .2786813     0.20   0.840     .6284403    1.770333
1.stroke_d~a |     .59712   .1881771    -1.64   0.102     .3219682    1.107415
1.other_ne~o |    1.04978   .2790173     0.18   0.855     .6235347    1.767405
             |
reduced_ki~t |
Stage 3a/..  |   2.69e-16   1.50e-16   -64.18   0.000     9.01e-17    8.05e-16
      1.esrd |    .958446   .2201307    -0.18   0.853     .6110381    1.503374
1.other_tr~t |   1.083595   .3043871     0.29   0.775      .624828    1.879203
  1.asplenia |   .9892926   .2616917    -0.04   0.968     .5890627    1.661453
1.ra_sle_p~s |   1.027448   .2885811     0.10   0.923     .5924904    1.781715
1.other_im~o |   .9029847   .2707658    -0.34   0.734     .5016978    1.625244
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod4_2ndVaccCensor.ster saved
(3,628 missing values generated)
(812 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         68  observations end on or before enter()
------------------------------------------------------------------------------
      4,483  observations remaining, representing
      4,483  subjects
        606  failures in single-failure-per-subject data
    646,109  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(6,701 observations (episodes) created)
(cat_time: 6701 changes made)
(covidadmission: 6701 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,483       40.08       40.08
          1 |      2,553       22.83       62.91
          2 |      1,899       16.98       79.89
          3 |      1,343       12.01       91.90
          4 |        906        8.10      100.00
------------+-----------------------------------
      Total |     11,184      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,155        328 |     4,483 
         1 |     2,440        113 |     2,553 
         2 |     1,811         88 |     1,899 
         3 |     1,290         53 |     1,343 
         4 |       882         24 |       906 
-----------+----------------------+----------
     Total |    10,578        606 |    11,184 
(6,769 observations deleted)
   1:      6.43 /        1 =       6.4280

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,483             Number of obs    =       4,483
No. of failures      =          328
Time at risk         =       312993
                                                Wald chi2(42)    =    22147.42
Log pseudolikelihood =   -1908.7661             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 919 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8662882   .4086399    -0.30   0.761     .3436679    2.183664
 only 12-18  |   .9616665   .4996034    -0.08   0.940     .3473839    2.662192
      mixed  |    .892913   .3925791    -0.26   0.797     .3771976    2.113729
             |
        age1 |   .9700444   .0509231    -0.58   0.562     .8751999    1.075167
        age2 |   1.224598   .3412072     0.73   0.467     .7092924    2.114278
        age3 |   .6144667   .3670451    -0.82   0.415     .1905646    1.981319
      1.male |   .8993991   .1017562    -0.94   0.349     .7205253    1.122679
             |
   obese4cat |
Obese I ..)  |     .95714   .1560135    -0.27   0.788     .6953923     1.31741
Obese II..)  |    .727107   .1751226    -1.32   0.186     .4535109    1.165759
Obese II..)  |   1.422904   .3197383     1.57   0.117     .9160167    2.210281
             |
smoke_nomiss |
     Former  |   1.683705   .5266854     1.67   0.096     .9120079    3.108373
    Current  |   1.012661   .1682366     0.08   0.940     .7312256    1.402417
             |
         imd |
          4  |   .7630764   .1140844    -1.81   0.071     .5692571    1.022887
5 most de..  |   .9787744   .1899728    -0.11   0.912     .6690687     1.43184
             |
tot_adults~h |
          2  |   2.317894    2.11963     0.92   0.358     .3861009     13.9151
          3  |    1.38843   1.051258     0.43   0.665      .314798    6.123735
             |
   ethnicity |
Asian or ..  |   .8527743   .1664582    -0.82   0.415     .5816784    1.250217
      Other  |   1.038594   .1835328     0.21   0.830     .7345611    1.468467
             |
1.htdiag_o~p |   .7583553   .0962436    -2.18   0.029     .5913517    .9725223
1.~y_disease |   .9135463   .1338035    -0.62   0.537     .6855805    1.217314
    1.asthma |   1.008808   .1958734     0.05   0.964     .6895037     1.47598
1.~c_disease |    1.16389   .1507857     1.17   0.241     .9028921    1.500333
             |
     diabcat |
T1DM, con..  |   .9588279   .3175682    -0.13   0.899     .5009782    1.835112
T1DM, unc..  |   1.13e-14   2.91e-15  -125.01   0.000     6.85e-15    1.88e-14
T2DM, con..  |   .8609252    .132512    -0.97   0.331     .6367223    1.164074
T2DM, unc..  |    .891646   .2755877    -0.37   0.711     .4865251    1.634104
Diabetes,..  |   9.91e-15   5.32e-15   -60.09   0.000     3.46e-15    2.84e-14
             |
cancer_exh~t |
  Last year  |   .6180481   .6145416    -0.48   0.628     .0880339    4.339048
2-5 years..  |   .8009399   .4016968    -0.44   0.658     .2997059    2.140448
   5+ years  |   .9321854   .1399157    -0.47   0.640     .6946112    1.251016
             |
cancer_hae~t |
  Last year  |   1.002968   .7146566     0.00   0.997     .2481822    4.053253
2-5 years..  |    1.13768   .4649656     0.32   0.752     .5106661    2.534563
   5+ years  |    1.07962   .1535523     0.54   0.590     .8169703     1.42671
             |
1.~r_disease |   .7960177   .1200372    -1.51   0.130     .5923303    1.069748
1.stroke_d~a |   .9983134    .143648    -0.01   0.991      .752986     1.32357
1.other_ne~o |   1.088169   .1548943     0.59   0.553     .8232521    1.438334
             |
reduced_ki~t |
Stage 3a/..  |   .8536332   .2715177    -0.50   0.619     .4576432    1.592266
      1.esrd |   1.006068   .1155179     0.05   0.958     .8033249    1.259979
1.other_tr~t |   .8117836   .1182906    -1.43   0.152     .6101067    1.080127
  1.asplenia |   1.117362   .1555249     0.80   0.425     .8505809    1.467817
1.ra_sle_p~s |   .8391409    .126386    -1.16   0.244     .6246437    1.127295
1.other_im~o |   1.003245   .1389414     0.02   0.981     .7647555    1.316108
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod0_2ndVaccCensor.ster saved
(3,628 missing values generated)
(812 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         68  observations end on or before enter()
------------------------------------------------------------------------------
      4,483  observations remaining, representing
      4,483  subjects
        606  failures in single-failure-per-subject data
    646,109  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(6,701 observations (episodes) created)
(cat_time: 6701 changes made)
(covidadmission: 6701 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,483       40.08       40.08
          1 |      2,553       22.83       62.91
          2 |      1,899       16.98       79.89
          3 |      1,343       12.01       91.90
          4 |        906        8.10      100.00
------------+-----------------------------------
      Total |     11,184      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,155        328 |     4,483 
         1 |     2,440        113 |     2,553 
         2 |     1,811         88 |     1,899 
         3 |     1,290         53 |     1,343 
         4 |       882         24 |       906 
-----------+----------------------+----------
     Total |    10,578        606 |    11,184 
(8,699 observations deleted)
   1:      3.08 /        1 =       3.0800

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,553             Number of obs    =       2,553
No. of failures      =          113
Time at risk         =       153108
                                                Wald chi2(42)    =    23959.06
Log pseudolikelihood =   -575.72535             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 819 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   5.365314   5.292949     1.70   0.089     .7760223    37.09506
 only 12-18  |   1.930269   2.478342     0.51   0.608     .1558581    23.90596
      mixed  |   6.678816   6.493322     1.95   0.051     .9934337    44.90143
             |
        age1 |   .9226929    .077745    -0.95   0.340     .7822327    1.088374
        age2 |   1.626271   .7048634     1.12   0.262     .6954443    3.802974
        age3 |   .3451513    .316761    -1.16   0.246     .0571246    2.085431
      1.male |   .8380074   .1662424    -0.89   0.373     .5680519    1.236254
             |
   obese4cat |
Obese I ..)  |   1.110396   .2796228     0.42   0.678     .6778381    1.818987
Obese II..)  |   .5626608   .2290371    -1.41   0.158     .2533705    1.249503
Obese II..)  |   1.624048   .6042343     1.30   0.192     .7832593     3.36738
             |
smoke_nomiss |
     Former  |   4.581689   1.649765     4.23   0.000     2.262178    9.279497
    Current  |   .5756868   .2141737    -1.48   0.138     .2776594    1.193604
             |
         imd |
          4  |   1.423943   .3407483     1.48   0.140      .890842    2.276063
5 most de..  |   1.143244   .3602007     0.42   0.671     .6165269    2.119953
             |
tot_adults~h |
          2  |   2.583581   2.653611     0.92   0.355     .3451025    19.34177
          3  |   .3416034   .2512922    -1.46   0.144     .0807898    1.444401
             |
   ethnicity |
Asian or ..  |   1.248889   .3542259     0.78   0.433     .7163001    2.177472
      Other  |   1.374658   .4374268     1.00   0.317     .7367768    2.564801
             |
1.htdiag_o~p |   1.523258   .3152629     2.03   0.042     1.015321    2.285301
1.~y_disease |   .9823744   .2397534    -0.07   0.942     .6088875    1.584955
    1.asthma |   1.707556   .4758237     1.92   0.055     .9889654    2.948281
1.~c_disease |   2.012222   .4072158     3.46   0.001     1.353372    2.991814
             |
     diabcat |
T1DM, con..  |   .7898844   .5965251    -0.31   0.755     .1797759    3.470529
T1DM, unc..  |   2.78e-16   1.62e-16   -61.44   0.000     8.86e-17    8.71e-16
T2DM, con..  |   1.567393   .3720012     1.89   0.058      .984364    2.495744
T2DM, unc..  |   1.261368   .5567731     0.53   0.599     .5310289    2.996165
Diabetes,..  |   1.74e-16   1.23e-16   -51.35   0.000     4.36e-17    6.96e-16
             |
cancer_exh~t |
  Last year  |   2.71e-16   1.63e-16   -59.37   0.000     8.29e-17    8.83e-16
2-5 years..  |   1.327151   1.033792     0.36   0.716      .288318    6.108982
   5+ years  |   1.305896   .3044537     1.14   0.252     .8269163    2.062319
             |
cancer_hae~t |
  Last year  |   1.70e-16   6.21e-17   -99.12   0.000     8.27e-17    3.48e-16
2-5 years..  |   .5178298     .53726    -0.63   0.526     .0677714     3.95665
   5+ years  |   .5343551   .1672009    -2.00   0.045     .2893924    .9866719
             |
1.~r_disease |   .8763638   .2317554    -0.50   0.618     .5218951    1.471586
1.stroke_d~a |   .7489442    .203114    -1.07   0.286     .4401526     1.27437
1.other_ne~o |   .7839606   .2085553    -0.91   0.360     .4654264    1.320497
             |
reduced_ki~t |
Stage 3a/..  |   1.018211   .4100484     0.04   0.964     .4624304    2.241966
      1.esrd |   1.160316   .2355515     0.73   0.464     .7794293    1.727331
1.other_tr~t |   1.090236   .2493021     0.38   0.706     .6964306    1.706723
  1.asplenia |   .8593935   .2266153    -0.57   0.566     .5125508    1.440944
1.ra_sle_p~s |   .9404483   .2383771    -0.24   0.809     .5722415    1.545576
1.other_im~o |   .9958951   .2454601    -0.02   0.987     .6143508    1.614399
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod1_2ndVaccCensor.ster saved
(3,628 missing values generated)
(812 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         68  observations end on or before enter()
------------------------------------------------------------------------------
      4,483  observations remaining, representing
      4,483  subjects
        606  failures in single-failure-per-subject data
    646,109  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(6,701 observations (episodes) created)
(cat_time: 6701 changes made)
(covidadmission: 6701 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,483       40.08       40.08
          1 |      2,553       22.83       62.91
          2 |      1,899       16.98       79.89
          3 |      1,343       12.01       91.90
          4 |        906        8.10      100.00
------------+-----------------------------------
      Total |     11,184      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,155        328 |     4,483 
         1 |     2,440        113 |     2,553 
         2 |     1,811         88 |     1,899 
         3 |     1,290         53 |     1,343 
         4 |       882         24 |       906 
-----------+----------------------+----------
     Total |    10,578        606 |    11,184 
(9,353 observations deleted)
   1:      3.06 /        1 =       3.0580

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,899             Number of obs    =       1,899
No. of failures      =           88
Time at risk         =        98966
                                                Wald chi2(39)    =    56446.11
Log pseudolikelihood =   -421.80778             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 754 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.26e+09   1.01e+09    26.11   0.000     2.62e+08    6.08e+09
 only 12-18  |   1.03e+09          .        .       .            .           .
      mixed  |   8.31e+08   6.44e+08    26.48   0.000     1.82e+08    3.80e+09
             |
        age1 |   .9092777   .0817886    -1.06   0.290     .7623104    1.084579
        age2 |   1.419298   .7189724     0.69   0.489     .5258733    3.830592
        age3 |   .4724453   .5219331    -0.68   0.497     .0541986    4.118271
      1.male |    .796624   .1670865    -1.08   0.278     .5281041    1.201675
             |
   obese4cat |
Obese I ..)  |    .727365   .2687517    -0.86   0.389     .3525695    1.500583
Obese II..)  |   1.241364   .4187106     0.64   0.522     .6408991    2.404409
Obese II..)  |   .9244174   .4868248    -0.15   0.881     .3293069    2.594988
             |
smoke_nomiss |
     Former  |   1.81e-19   5.61e-20  -139.31   0.000     9.87e-20    3.32e-19
    Current  |   .5527162   .2270743    -1.44   0.149     .2470586    1.236529
             |
         imd |
          4  |   .6164385   .1963292    -1.52   0.129     .3302106     1.15077
5 most de..  |   .6164773    .248351    -1.20   0.230     .2799022    1.357775
             |
tot_adults~h |
          2  |   .1275461   .0941796    -2.79   0.005     .0300015    .5422398
          3  |   1.41e+17          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .6904942   .2808048    -0.91   0.362     .3111717    1.532216
      Other  |   .6704793   .2835043    -0.95   0.344     .2927283    1.535699
             |
1.htdiag_o~p |   .7459996    .189636    -1.15   0.249      .453273    1.227771
1.~y_disease |   .6166792    .186795    -1.60   0.111     .3405856    1.116586
    1.asthma |   .7947081   .3381518    -0.54   0.589     .3451578    1.829775
1.~c_disease |   1.530906   .3696002     1.76   0.078     .9537765    2.457257
             |
     diabcat |
T1DM, con..  |   1.795886   .9227991     1.14   0.255     .6559895    4.916552
T1DM, unc..  |   4.37e-19   2.80e-19   -65.95   0.000     1.24e-19    1.53e-18
T2DM, con..  |   1.105534   .3080254     0.36   0.719      .640338    1.908689
T2DM, unc..  |   .9297444   .5583751    -0.12   0.903     .2865226    3.016951
Diabetes,..  |   3.88e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   2.958871   3.097595     1.04   0.300     .3802041    23.02689
2-5 years..  |   .6618673   .6974654    -0.39   0.695      .083905    5.221001
   5+ years  |   .6267296   .2163602    -1.35   0.176     .3185867    1.232914
             |
cancer_hae~t |
  Last year  |   2.15e-19   8.50e-20  -108.46   0.000     9.87e-20    4.67e-19
2-5 years..  |   1.79e-19   5.76e-20  -134.09   0.000     9.51e-20    3.36e-19
   5+ years  |   1.180458   .3185129     0.61   0.539     .6956299    2.003194
             |
1.~r_disease |   1.226114   .3240077     0.77   0.440     .7304593    2.058097
1.stroke_d~a |   .7426016   .2004075    -1.10   0.270     .4375626    1.260293
1.other_ne~o |   1.286149   .3240922     1.00   0.318     .7848736    2.107572
             |
reduced_ki~t |
Stage 3a/..  |   .7151364   .5473076    -0.44   0.661     .1595688    3.205013
      1.esrd |   .6666197   .1617382    -1.67   0.095     .4143391    1.072508
1.other_tr~t |   .9977455   .2474934    -0.01   0.993     .6135882    1.622417
  1.asplenia |   .5933742   .1834738    -1.69   0.091     .3236932    1.087737
1.ra_sle_p~s |   1.378529   .3371954     1.31   0.189     .8535075    2.226508
1.other_im~o |   1.071642   .2921391     0.25   0.800     .6280649    1.828499
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod2_2ndVaccCensor.ster saved
(3,628 missing values generated)
(812 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         68  observations end on or before enter()
------------------------------------------------------------------------------
      4,483  observations remaining, representing
      4,483  subjects
        606  failures in single-failure-per-subject data
    646,109  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(6,701 observations (episodes) created)
(cat_time: 6701 changes made)
(covidadmission: 6701 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,483       40.08       40.08
          1 |      2,553       22.83       62.91
          2 |      1,899       16.98       79.89
          3 |      1,343       12.01       91.90
          4 |        906        8.10      100.00
------------+-----------------------------------
      Total |     11,184      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,155        328 |     4,483 
         1 |     2,440        113 |     2,553 
         2 |     1,811         88 |     1,899 
         3 |     1,290         53 |     1,343 
         4 |       882         24 |       906 
-----------+----------------------+----------
     Total |    10,578        606 |    11,184 
(9,909 observations deleted)
   1:      2.09 /        1 =       2.0880

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,343             Number of obs    =       1,343
No. of failures      =           53
Time at risk         =        54056
                                                Wald chi2(41)    =    28094.17
Log pseudolikelihood =   -227.39803             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 648 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.15e+09   9.42e+08    25.36   0.000     2.28e+08    5.74e+09
 only 12-18  |   2.92e+09          .        .       .            .           .
      mixed  |   8.94e+08   6.75e+08    27.33   0.000     2.04e+08    3.92e+09
             |
        age1 |   1.336499   .1919438     2.02   0.043     1.008606    1.770987
        age2 |   .3257338   .2257989    -1.62   0.106     .0837162    1.267408
        age3 |   7.604673   11.05937     1.40   0.163     .4397338    131.5138
      1.male |   1.215808   .3783559     0.63   0.530     .6606529    2.237466
             |
   obese4cat |
Obese I ..)  |   .9359239   .4125718    -0.15   0.881     .3944717    2.220574
Obese II..)  |   1.594729    .785973     0.95   0.344      .606969    4.189936
Obese II..)  |   2.077311   1.233894     1.23   0.218     .6484844    6.654316
             |
smoke_nomiss |
     Former  |   3.47e-17   2.55e-17   -51.53   0.000     8.21e-18    1.47e-16
    Current  |   .7792444   .3785974    -0.51   0.608     .3006878    2.019443
             |
         imd |
          4  |   .4736149   .1930407    -1.83   0.067     .2130513     1.05285
5 most de..  |   .2690474   .1848256    -1.91   0.056     .0699978    1.034124
             |
tot_adults~h |
          2  |   1.29e-17   1.66e-17   -30.23   0.000     1.04e-18    1.61e-16
          3  |   .1299677   .1478689    -1.79   0.073     .0139763    1.208588
             |
   ethnicity |
Asian or ..  |   1.313376   .5994477     0.60   0.550     .5368905    3.212864
      Other  |   1.180582   .5528569     0.35   0.723     .4715039    2.956016
             |
1.htdiag_o~p |   1.094919   .3278537     0.30   0.762     .6088427     1.96906
1.~y_disease |   1.204215   .3764525     0.59   0.552     .6525414    2.222287
    1.asthma |   1.737411   .8020313     1.20   0.231     .7030192    4.293762
1.~c_disease |   1.465107   .4900273     1.14   0.253     .7606278    2.822063
             |
     diabcat |
T1DM, con..  |    .434325   .4787783    -0.76   0.449     .0500602    3.768226
T1DM, unc..  |   4.50e-17   5.26e-17   -32.19   0.000     4.55e-18    4.45e-16
T2DM, con..  |    .493757   .2370085    -1.47   0.142     .1927204    1.265024
T2DM, unc..  |   .6185258   .4708013    -0.63   0.528     .1391398    2.749566
Diabetes,..  |   9.54e-17   7.55e-17   -46.64   0.000     2.02e-17    4.50e-16
             |
cancer_exh~t |
  Last year  |   60.08823   49.40147     4.98   0.000      11.9943    301.0258
2-5 years..  |   .9985216   1.074235    -0.00   0.999     .1212308    8.224356
   5+ years  |   .8528768   .3576434    -0.38   0.704     .3749259    1.940114
             |
cancer_hae~t |
  Last year  |   6.06e-17   3.37e-17   -67.16   0.000     2.04e-17    1.80e-16
2-5 years..  |   4.68e-17   2.09e-17   -84.04   0.000     1.95e-17    1.12e-16
   5+ years  |   1.145644   .4467055     0.35   0.727     .5335221    2.460069
             |
1.~r_disease |   .6435646    .242838    -1.17   0.243     .3071892    1.348275
1.stroke_d~a |   1.038444    .367681     0.11   0.915     .5187988    2.078583
1.other_ne~o |   .4499356   .1858944    -1.93   0.053     .2002027    1.011186
             |
reduced_ki~t |
Stage 3a/..  |    1.29908    .997088     0.34   0.733     .2886087     5.84739
      1.esrd |   1.130369   .3383841     0.41   0.682     .6286474    2.032514
1.other_tr~t |   1.129861   .4158652     0.33   0.740     .5491937    2.324474
  1.asplenia |   .7744415   .3046052    -0.65   0.516     .3582548    1.674115
1.ra_sle_p~s |   .9217742   .3487031    -0.22   0.830      .439156    1.934774
1.other_im~o |   1.273671   .4429512     0.70   0.487     .6442142    2.518164
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod3_2ndVaccCensor.ster saved
(3,628 missing values generated)
(812 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         68  observations end on or before enter()
------------------------------------------------------------------------------
      4,483  observations remaining, representing
      4,483  subjects
        606  failures in single-failure-per-subject data
    646,109  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(6,701 observations (episodes) created)
(cat_time: 6701 changes made)
(covidadmission: 6701 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,483       40.08       40.08
          1 |      2,553       22.83       62.91
          2 |      1,899       16.98       79.89
          3 |      1,343       12.01       91.90
          4 |        906        8.10      100.00
------------+-----------------------------------
      Total |     11,184      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,155        328 |     4,483 
         1 |     2,440        113 |     2,553 
         2 |     1,811         88 |     1,899 
         3 |     1,290         53 |     1,343 
         4 |       882         24 |       906 
-----------+----------------------+----------
     Total |    10,578        606 |    11,184 
(10,346 observations deleted)
   1:      1.14 /        1 =       1.1360

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects      =          906             Number of obs    =         906
No. of failures      =           24
Time at risk         =        26986
                                                Wald chi2(35)    =    17605.27
Log pseudolikelihood =   -76.960734             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 528 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .4839799   .5640894    -0.62   0.534     .0492871    4.752495
 only 12-18  |   3.84e-20   5.64e-20   -30.43   0.000     2.15e-21    6.83e-19
      mixed  |   .3501609   .3714763    -0.99   0.323     .0437775    2.800816
             |
        age1 |    .747714   .1815354    -1.20   0.231     .4645951    1.203362
        age2 |   3.273735   3.794326     1.02   0.306      .337663    31.73975
        age3 |   .1105699   .2601318    -0.94   0.349     .0010992    11.12276
      1.male |   1.353867   .5513526     0.74   0.457     .6094389    3.007611
             |
   obese4cat |
Obese I ..)  |   .9707686   .7028899    -0.04   0.967     .2348545    4.012661
Obese II..)  |   .3073941   .3826476    -0.95   0.343     .0267985    3.525988
Obese II..)  |   2.142185   1.796025     0.91   0.364     .4141931    11.07927
             |
smoke_nomiss |
     Former  |   7.62e-20   1.02e-19   -32.79   0.000     5.49e-21    1.06e-18
    Current  |   .6619256   .4683102    -0.58   0.560     .1654195    2.648692
             |
         imd |
          4  |   2.119125   .9806267     1.62   0.105     .8555834    5.248688
5 most de..  |    .253378   .1655023    -2.10   0.036     .0704334    .9115059
             |
tot_adults~h |
          2  |   .0100365          .        .       .            .           .
          3  |   5.05e+16          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .2689672   .2324777    -1.52   0.129     .0494284      1.4636
      Other  |   1.245056    .807404     0.34   0.735      .349297    4.437956
             |
1.htdiag_o~p |    1.56419   .6714806     1.04   0.297     .6743466    3.628241
1.~y_disease |   .4987327   .3070935    -1.13   0.259     .1491909    1.667221
    1.asthma |   6.888812   5.086587     2.61   0.009     1.620432    29.28584
1.~c_disease |   .3461663    .271693    -1.35   0.176     .0743376    1.611985
             |
     diabcat |
T1DM, con..  |   .8184046   .5918021    -0.28   0.782     .1983581    3.376651
T1DM, unc..  |   3.64e-19          .        .       .            .           .
T2DM, con..  |   .5157246    .420534    -0.81   0.417     .1043105    2.549809
T2DM, unc..  |   9.824457   7.626611     2.94   0.003     2.145511    44.98693
Diabetes,..  |   2.35e-18          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.08e-18          .        .       .            .           .
2-5 years..  |   3.67e-19          .        .       .            .           .
   5+ years  |   1.613005   1.065725     0.72   0.469     .4418148    5.888858
             |
cancer_hae~t |
  Last year  |   9.564012   12.54348     1.72   0.085     .7315848    125.0304
2-5 years..  |   1.85e-19          .        .       .            .           .
   5+ years  |   1.497013   .8686421     0.70   0.487      .480082     4.66805
             |
1.~r_disease |    1.06877   .7934111     0.09   0.929     .2494523    4.579113
1.stroke_d~a |   1.552662    .827983     0.83   0.409     .5459582    4.415647
1.other_ne~o |   2.851666   1.439038     2.08   0.038     1.060611    7.667274
             |
reduced_ki~t |
Stage 3a/..  |   1.92e-19   1.51e-19   -54.67   0.000     4.10e-20    9.00e-19
      1.esrd |   1.458347   .6316366     0.87   0.384     .6240076    3.408252
1.other_tr~t |   .4909373   .4099975    -0.85   0.394     .0955345    2.522852
  1.asplenia |    .141926   .1507976    -1.84   0.066      .017687    1.138862
1.ra_sle_p~s |   4.005061   2.229434     2.49   0.013     1.345192    11.92433
1.other_im~o |   .4771825   .3370771    -1.05   0.295     .1195099    1.905307
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod4_2ndVaccCensor.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission_2nd
> VaccCensor.log
  log type:  text
 closed on:  28 Oct 2021, 11:33:48
-------------------------------------------------------------------------------
