-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_tpp_prob.log
  log type:  text
 opened on:  28 Oct 2021, 11:24:35

. 
. 
. *****************************************************************************
> ********
. 
. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 19. 
. *Age spline model (not adj ethnicity)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id)
 20. if _rc==0{
 21. estimates
 22. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 23.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 24. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 25. 
. }
 26. drop cat_time
 27. }
 28. }
(18,078 observations (episodes) created)
(cat_time: 18078 changes made)
(covid_tpp_prob: 18078 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -46583.701
Iteration 1:   log pseudolikelihood = -46564.715
Iteration 2:   log pseudolikelihood = -46564.653
Iteration 3:   log pseudolikelihood = -46564.653
Refining estimates:
Iteration 0:   log pseudolikelihood = -46564.653

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,079             Number of obs    =      16,079
No. of failures      =        6,525
Time at risk         =      1069677
                                                Wald chi2(42)    =       41.71
Log pseudolikelihood =   -46564.653             Prob > chi2      =      0.4835

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |     1.1854   .1127295     1.79   0.074     .9838238    1.428278
 only 12-18  |   1.195643   .1398988     1.53   0.127     .9506151    1.503828
      mixed  |   1.199955   .1073621     2.04   0.042     1.006947    1.429959
             |
        age1 |    1.00231   .0045303     0.51   0.610     .9934702    1.011229
        age2 |   .9906443   .0141548    -0.66   0.511     .9632862    1.018779
        age3 |   1.030875   .0424102     0.74   0.460      .951015     1.11744
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9485832   .0238251    -2.10   0.036     .9030176     .996448
             |
   obese4cat |
Obese I ..)  |   .9913588   .0345947    -0.25   0.804     .9258212    1.061536
Obese II..)  |    .967157   .0441801    -0.73   0.465     .8843288    1.057743
Obese II..)  |   1.011202   .0561339     0.20   0.841      .906955     1.12743
             |
smoke_nomiss |
     Former  |   1.211322   .1011097     2.30   0.022     1.028512    1.426625
    Current  |   1.040515   .0380198     1.09   0.277     .9686033    1.117766
             |
         imd |
          4  |   .9793594   .0306329    -0.67   0.505     .9211233    1.041277
5 most de..  |   .9911567   .0425315    -0.21   0.836     .9112058    1.078123
             |
tot_adults~h |
          2  |   .8099454   .1693129    -1.01   0.313     .5376733    1.220093
          3  |   .7900148   .1289706    -1.44   0.149     .5736881    1.087914
             |
   ethnicity |
Asian or ..  |   .9699376   .0418664    -0.71   0.479     .8912562    1.055565
      Other  |    .941994   .0413032    -1.36   0.173     .8644222    1.026527
             |
1.htdiag_o~p |   .9966232   .0261355    -0.13   0.897     .9466927    1.049187
1.~y_disease |   1.022594   .0304359     0.75   0.453     .9646474    1.084021
    1.asthma |   .9904319   .0453653    -0.21   0.834     .9053919    1.083459
1.~c_disease |   .9765987   .0306132    -0.76   0.450      .918404    1.038481
             |
     diabcat |
T1DM, con..  |   .9250966   .0764855    -0.94   0.346     .7867036    1.087835
T1DM, unc..  |   1.104626   .1832786     0.60   0.549     .7979669    1.529136
T2DM, con..  |     1.0277   .0348155     0.81   0.420     .9616788    1.098253
T2DM, unc..  |   1.055488   .0666717     0.85   0.393     .9325795    1.194596
Diabetes,..  |   .7350699   .3075257    -0.74   0.462      .323756    1.668935
             |
cancer_exh~t |
  Last year  |   1.251552   .2873423     0.98   0.328     .7980366    1.962797
2-5 years..  |   1.009817   .0987796     0.10   0.920     .8336407    1.223226
   5+ years  |   .9596779   .0331675    -1.19   0.234     .8968237    1.026937
             |
cancer_hae~t |
  Last year  |   .9199523   .2140416    -0.36   0.720     .5830686     1.45148
2-5 years..  |   .8864734   .0950947    -1.12   0.261     .7183809    1.093898
   5+ years  |   .9831931   .0312688    -0.53   0.594     .9237783    1.046429
             |
1.~r_disease |   .9970982   .0307254    -0.09   0.925     .9386601    1.059174
1.stroke_d~a |   1.036511   .0304878     1.22   0.223     .9784458    1.098022
1.other_ne~o |   1.049969   .0332571     1.54   0.124     .9867686    1.117218
             |
reduced_ki~t |
Stage 3a/..  |   1.136305   .2268954     0.64   0.522     .7682957    1.680588
      1.esrd |   .9877422   .0251603    -0.48   0.628     .9396396    1.038307
1.other_tr~t |   1.001138    .030044     0.04   0.970     .9439515     1.06179
  1.asplenia |   .9838594   .0303618    -0.53   0.598     .9261153    1.045204
1.ra_sle_p~s |   .9450935    .029959    -1.78   0.075     .8881619    1.005675
1.other_im~o |    1.01938   .0316972     0.62   0.537     .9591096    1.083437
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,079             Number of obs    =      16,079
No. of failures      =        6,525
Time at risk         =      1069677
                                                Wald chi2(42)    =       41.71
Log pseudolikelihood =   -46564.653             Prob > chi2      =      0.4835

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |     1.1854   .1127295     1.79   0.074     .9838238    1.428278
 only 12-18  |   1.195643   .1398988     1.53   0.127     .9506151    1.503828
      mixed  |   1.199955   .1073621     2.04   0.042     1.006947    1.429959
             |
        age1 |    1.00231   .0045303     0.51   0.610     .9934702    1.011229
        age2 |   .9906443   .0141548    -0.66   0.511     .9632862    1.018779
        age3 |   1.030875   .0424102     0.74   0.460      .951015     1.11744
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9485832   .0238251    -2.10   0.036     .9030176     .996448
             |
   obese4cat |
Obese I ..)  |   .9913588   .0345947    -0.25   0.804     .9258212    1.061536
Obese II..)  |    .967157   .0441801    -0.73   0.465     .8843288    1.057743
Obese II..)  |   1.011202   .0561339     0.20   0.841      .906955     1.12743
             |
smoke_nomiss |
     Former  |   1.211322   .1011097     2.30   0.022     1.028512    1.426625
    Current  |   1.040515   .0380198     1.09   0.277     .9686033    1.117766
             |
         imd |
          4  |   .9793594   .0306329    -0.67   0.505     .9211233    1.041277
5 most de..  |   .9911567   .0425315    -0.21   0.836     .9112058    1.078123
             |
tot_adults~h |
          2  |   .8099454   .1693129    -1.01   0.313     .5376733    1.220093
          3  |   .7900148   .1289706    -1.44   0.149     .5736881    1.087914
             |
   ethnicity |
Asian or ..  |   .9699376   .0418664    -0.71   0.479     .8912562    1.055565
      Other  |    .941994   .0413032    -1.36   0.173     .8644222    1.026527
             |
1.htdiag_o~p |   .9966232   .0261355    -0.13   0.897     .9466927    1.049187
1.~y_disease |   1.022594   .0304359     0.75   0.453     .9646474    1.084021
    1.asthma |   .9904319   .0453653    -0.21   0.834     .9053919    1.083459
1.~c_disease |   .9765987   .0306132    -0.76   0.450      .918404    1.038481
             |
     diabcat |
T1DM, con..  |   .9250966   .0764855    -0.94   0.346     .7867036    1.087835
T1DM, unc..  |   1.104626   .1832786     0.60   0.549     .7979669    1.529136
T2DM, con..  |     1.0277   .0348155     0.81   0.420     .9616788    1.098253
T2DM, unc..  |   1.055488   .0666717     0.85   0.393     .9325795    1.194596
Diabetes,..  |   .7350699   .3075257    -0.74   0.462      .323756    1.668935
             |
cancer_exh~t |
  Last year  |   1.251552   .2873423     0.98   0.328     .7980366    1.962797
2-5 years..  |   1.009817   .0987796     0.10   0.920     .8336407    1.223226
   5+ years  |   .9596779   .0331675    -1.19   0.234     .8968237    1.026937
             |
cancer_hae~t |
  Last year  |   .9199523   .2140416    -0.36   0.720     .5830686     1.45148
2-5 years..  |   .8864734   .0950947    -1.12   0.261     .7183809    1.093898
   5+ years  |   .9831931   .0312688    -0.53   0.594     .9237783    1.046429
             |
1.~r_disease |   .9970982   .0307254    -0.09   0.925     .9386601    1.059174
1.stroke_d~a |   1.036511   .0304878     1.22   0.223     .9784458    1.098022
1.other_ne~o |   1.049969   .0332571     1.54   0.124     .9867686    1.117218
             |
reduced_ki~t |
Stage 3a/..  |   1.136305   .2268954     0.64   0.522     .7682957    1.680588
      1.esrd |   .9877422   .0251603    -0.48   0.628     .9396396    1.038307
1.other_tr~t |   1.001138    .030044     0.04   0.970     .9439515     1.06179
  1.asplenia |   .9838594   .0303618    -0.53   0.598     .9261153    1.045204
1.ra_sle_p~s |   .9450935    .029959    -1.78   0.075     .8881619    1.005675
1.other_im~o |    1.01938   .0316972     0.62   0.537     .9591096    1.083437
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod0.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -25845.535
Iteration 1:   log pseudolikelihood = -25826.202
Iteration 2:   log pseudolikelihood = -25826.129
Iteration 3:   log pseudolikelihood = -25826.129
Refining estimates:
Iteration 0:   log pseudolikelihood = -25826.129

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,340             Number of obs    =       9,340
No. of failures      =        3,925
Time at risk         =       499720
                                                Wald chi2(42)    =       43.96
Log pseudolikelihood =   -25826.129             Prob > chi2      =      0.3884

                       (Std. Err. adjusted for 1,038 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.040831   .1096929     0.38   0.704     .8465889    1.279641
 only 12-18  |    1.00482   .1544193     0.03   0.975      .743493       1.358
      mixed  |   .9658322   .0930824    -0.36   0.718     .7995891    1.166639
             |
        age1 |      1.002   .0059033     0.34   0.735     .9904959    1.013637
        age2 |   .9910384   .0187253    -0.48   0.634     .9550088    1.028427
        age3 |    1.02596   .0557444     0.47   0.637     .9223192    1.141246
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9917103   .0336277    -0.25   0.806     .9279437    1.059859
             |
   obese4cat |
Obese I ..)  |   .9952072   .0470822    -0.10   0.919     .9070768      1.0919
Obese II..)  |   .9700528   .0571915    -0.52   0.606     .8641934    1.088879
Obese II..)  |   1.047225   .0732217     0.66   0.509     .9131123    1.201035
             |
smoke_nomiss |
     Former  |   1.124456   .1289169     1.02   0.306     .8981596    1.407768
    Current  |   .9983108   .0500253    -0.03   0.973      .904924    1.101335
             |
         imd |
          4  |   1.011284   .0412743     0.27   0.783     .9335385    1.095503
5 most de..  |   .9355924   .0517006    -1.20   0.228     .8395556    1.042615
             |
tot_adults~h |
          2  |   1.398062   .3892141     1.20   0.229     .8101321    2.412666
          3  |   1.119338   .2673457     0.47   0.637     .7009028    1.787576
             |
   ethnicity |
Asian or ..  |   1.149766   .0590686     2.72   0.007     1.039631    1.271568
      Other  |   1.098941    .055246     1.88   0.061     .9958243    1.212735
             |
1.htdiag_o~p |   1.037635   .0342526     1.12   0.263     .9726269    1.106988
1.~y_disease |   .9507438   .0372054    -1.29   0.197     .8805489    1.026534
    1.asthma |   1.058217   .0620402     0.97   0.334      .943347    1.187076
1.~c_disease |   .9897119   .0399473    -0.26   0.798     .9144335    1.071187
             |
     diabcat |
T1DM, con..  |   .9850651   .0986295    -0.15   0.881     .8095403    1.198647
T1DM, unc..  |   1.157385   .2646401     0.64   0.523     .7393462    1.811791
T2DM, con..  |   .9503407   .0424593    -1.14   0.254     .8706616    1.037312
T2DM, unc..  |   .9085091   .0775642    -1.12   0.261     .7685246    1.073991
Diabetes,..  |   1.377603   .4666918     0.95   0.344     .7091887    2.676002
             |
cancer_exh~t |
  Last year  |   .8408368   .3014447    -0.48   0.629     .4164388    1.697744
2-5 years..  |   1.203077   .1317273     1.69   0.091     .9707189    1.491053
   5+ years  |    1.02958   .0420779     0.71   0.476     .9503258    1.115445
             |
cancer_hae~t |
  Last year  |   1.278322   .2857812     1.10   0.272     .8247949    1.981228
2-5 years..  |   .9726714   .1229233    -0.22   0.826     .7592658    1.246059
   5+ years  |    1.05504   .0441923     1.28   0.201     .9718851    1.145311
             |
1.~r_disease |   1.000922   .0397782     0.02   0.982     .9259171    1.082002
1.stroke_d~a |   1.052498   .0421251     1.28   0.201     .9730894    1.138386
1.other_ne~o |   .9666192   .0390244    -0.84   0.400     .8930806    1.046213
             |
reduced_ki~t |
Stage 3a/..  |   1.085375    .281784     0.32   0.752     .6525167    1.805377
      1.esrd |   .9817877   .0316684    -0.57   0.569     .9216401    1.045861
1.other_tr~t |   1.030496   .0410141     0.75   0.450     .9531654    1.114101
  1.asplenia |   1.017859   .0406557     0.44   0.658     .9412144    1.100745
1.ra_sle_p~s |   1.078913   .0425619     1.93   0.054     .9986367    1.165643
1.other_im~o |   .9861143    .039564    -0.35   0.727     .9115407    1.066789
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,340             Number of obs    =       9,340
No. of failures      =        3,925
Time at risk         =       499720
                                                Wald chi2(42)    =       43.96
Log pseudolikelihood =   -25826.129             Prob > chi2      =      0.3884

                       (Std. Err. adjusted for 1,038 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.040831   .1096929     0.38   0.704     .8465889    1.279641
 only 12-18  |    1.00482   .1544193     0.03   0.975      .743493       1.358
      mixed  |   .9658322   .0930824    -0.36   0.718     .7995891    1.166639
             |
        age1 |      1.002   .0059033     0.34   0.735     .9904959    1.013637
        age2 |   .9910384   .0187253    -0.48   0.634     .9550088    1.028427
        age3 |    1.02596   .0557444     0.47   0.637     .9223192    1.141246
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9917103   .0336277    -0.25   0.806     .9279437    1.059859
             |
   obese4cat |
Obese I ..)  |   .9952072   .0470822    -0.10   0.919     .9070768      1.0919
Obese II..)  |   .9700528   .0571915    -0.52   0.606     .8641934    1.088879
Obese II..)  |   1.047225   .0732217     0.66   0.509     .9131123    1.201035
             |
smoke_nomiss |
     Former  |   1.124456   .1289169     1.02   0.306     .8981596    1.407768
    Current  |   .9983108   .0500253    -0.03   0.973      .904924    1.101335
             |
         imd |
          4  |   1.011284   .0412743     0.27   0.783     .9335385    1.095503
5 most de..  |   .9355924   .0517006    -1.20   0.228     .8395556    1.042615
             |
tot_adults~h |
          2  |   1.398062   .3892141     1.20   0.229     .8101321    2.412666
          3  |   1.119338   .2673457     0.47   0.637     .7009028    1.787576
             |
   ethnicity |
Asian or ..  |   1.149766   .0590686     2.72   0.007     1.039631    1.271568
      Other  |   1.098941    .055246     1.88   0.061     .9958243    1.212735
             |
1.htdiag_o~p |   1.037635   .0342526     1.12   0.263     .9726269    1.106988
1.~y_disease |   .9507438   .0372054    -1.29   0.197     .8805489    1.026534
    1.asthma |   1.058217   .0620402     0.97   0.334      .943347    1.187076
1.~c_disease |   .9897119   .0399473    -0.26   0.798     .9144335    1.071187
             |
     diabcat |
T1DM, con..  |   .9850651   .0986295    -0.15   0.881     .8095403    1.198647
T1DM, unc..  |   1.157385   .2646401     0.64   0.523     .7393462    1.811791
T2DM, con..  |   .9503407   .0424593    -1.14   0.254     .8706616    1.037312
T2DM, unc..  |   .9085091   .0775642    -1.12   0.261     .7685246    1.073991
Diabetes,..  |   1.377603   .4666918     0.95   0.344     .7091887    2.676002
             |
cancer_exh~t |
  Last year  |   .8408368   .3014447    -0.48   0.629     .4164388    1.697744
2-5 years..  |   1.203077   .1317273     1.69   0.091     .9707189    1.491053
   5+ years  |    1.02958   .0420779     0.71   0.476     .9503258    1.115445
             |
cancer_hae~t |
  Last year  |   1.278322   .2857812     1.10   0.272     .8247949    1.981228
2-5 years..  |   .9726714   .1229233    -0.22   0.826     .7592658    1.246059
   5+ years  |    1.05504   .0441923     1.28   0.201     .9718851    1.145311
             |
1.~r_disease |   1.000922   .0397782     0.02   0.982     .9259171    1.082002
1.stroke_d~a |   1.052498   .0421251     1.28   0.201     .9730894    1.138386
1.other_ne~o |   .9666192   .0390244    -0.84   0.400     .8930806    1.046213
             |
reduced_ki~t |
Stage 3a/..  |   1.085375    .281784     0.32   0.752     .6525167    1.805377
      1.esrd |   .9817877   .0316684    -0.57   0.569     .9216401    1.045861
1.other_tr~t |   1.030496   .0410141     0.75   0.450     .9531654    1.114101
  1.asplenia |   1.017859   .0406557     0.44   0.658     .9412144    1.100745
1.ra_sle_p~s |   1.078913   .0425619     1.93   0.054     .9986367    1.165643
1.other_im~o |   .9861143    .039564    -0.35   0.727     .9115407    1.066789
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod1.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -15755.722
Iteration 1:   log pseudolikelihood = -15737.726
Iteration 2:   log pseudolikelihood = -15736.751
Iteration 3:   log pseudolikelihood = -15736.724
Iteration 4:   log pseudolikelihood = -15736.724
Refining estimates:
Iteration 0:   log pseudolikelihood = -15736.724

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,260             Number of obs    =       5,260
No. of failures      =        2,652
Time at risk         =       235184
                                                Wald chi2(42)    =       40.25
Log pseudolikelihood =   -15736.724             Prob > chi2      =      0.5481

                         (Std. Err. adjusted for 940 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.110643   .1560321     0.75   0.455     .8433167     1.46271
 only 12-18  |   .9475369     .17689    -0.29   0.773     .6571891    1.366161
      mixed  |   1.045376   .1347051     0.34   0.731     .8120602    1.345726
             |
        age1 |    1.00471   .0073123     0.65   0.519     .9904796    1.019144
        age2 |    .997702   .0231583    -0.10   0.921     .9533296     1.04414
        age3 |   .9952419   .0662148    -0.07   0.943     .8735686    1.133862
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9505421   .0343637    -1.40   0.161     .8855211    1.020337
             |
   obese4cat |
Obese I ..)  |   1.010082   .0593091     0.17   0.864     .9002773    1.133278
Obese II..)  |   .9573613    .064242    -0.65   0.516     .8393778    1.091929
Obese II..)  |   .9311537   .0783568    -0.85   0.397     .7895736    1.098121
             |
smoke_nomiss |
     Former  |   .8921635    .129186    -0.79   0.431     .6717223    1.184948
    Current  |   1.071383   .0620712     1.19   0.234     .9563791    1.200217
             |
         imd |
          4  |   1.023714   .0507532     0.47   0.636     .9289194    1.128182
5 most de..  |   1.075608   .0689482     1.14   0.256     .9486162      1.2196
             |
tot_adults~h |
          2  |   .8527828   .3042821    -0.45   0.655     .4237605    1.716154
          3  |    .830006   .2248484    -0.69   0.492       .48808    1.411469
             |
   ethnicity |
Asian or ..  |   1.059621   .0703565     0.87   0.383     .9303206    1.206892
      Other  |   .8966645   .0603847    -1.62   0.105     .7857908    1.023182
             |
1.htdiag_o~p |   .9870093   .0399471    -0.32   0.747     .9117393    1.068493
1.~y_disease |   .9979398    .048375    -0.04   0.966     .9074913    1.097403
    1.asthma |   1.015116   .0751137     0.20   0.839     .8780732    1.173547
1.~c_disease |   .9592789   .0469242    -0.85   0.395     .8715803    1.055802
             |
     diabcat |
T1DM, con..  |   1.105746   .1190799     0.93   0.351     .8953402    1.365599
T1DM, unc..  |   1.205851    .375213     0.60   0.547     .6552898    2.218982
T2DM, con..  |   .9887778   .0507006    -0.22   0.826     .8942366    1.093314
T2DM, unc..  |   .8830003   .0899181    -1.22   0.222     .7232373    1.078055
Diabetes,..  |   .9226306   .5076502    -0.15   0.884     .3138191    2.712541
             |
cancer_exh~t |
  Last year  |   2.314395   .7725008     2.51   0.012     1.203158    4.451971
2-5 years..  |   .9404494   .1539025    -0.38   0.708     .6823987    1.296083
   5+ years  |   1.062318   .0558524     1.15   0.250     .9583003    1.177625
             |
cancer_hae~t |
  Last year  |   .8401387   .3182301    -0.46   0.646     .3998807    1.765109
2-5 years..  |   1.266369   .1623165     1.84   0.065     .9850485    1.628031
   5+ years  |     .95353   .0504182    -0.90   0.368     .8596601     1.05765
             |
1.~r_disease |   .9307448   .0477997    -1.40   0.162     .8416199    1.029308
1.stroke_d~a |   .9342779   .0474359    -1.34   0.181     .8457816    1.032034
1.other_ne~o |   1.041757   .0532349     0.80   0.423     .9424731    1.151499
             |
reduced_ki~t |
Stage 3a/..  |   .8772279   .3038381    -0.38   0.705     .4449271    1.729561
      1.esrd |   1.001531   .0401033     0.04   0.970     .9259349    1.083298
1.other_tr~t |    1.03868   .0508489     0.78   0.438     .9436498     1.14328
  1.asplenia |   .9804074   .0472527    -0.41   0.681     .8920335    1.077536
1.ra_sle_p~s |   1.096856   .0515035     1.97   0.049     1.000417    1.202592
1.other_im~o |   1.024111   .0521594     0.47   0.640     .9268175    1.131618
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,260             Number of obs    =       5,260
No. of failures      =        2,652
Time at risk         =       235184
                                                Wald chi2(42)    =       40.25
Log pseudolikelihood =   -15736.724             Prob > chi2      =      0.5481

                         (Std. Err. adjusted for 940 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.110643   .1560321     0.75   0.455     .8433167     1.46271
 only 12-18  |   .9475369     .17689    -0.29   0.773     .6571891    1.366161
      mixed  |   1.045376   .1347051     0.34   0.731     .8120602    1.345726
             |
        age1 |    1.00471   .0073123     0.65   0.519     .9904796    1.019144
        age2 |    .997702   .0231583    -0.10   0.921     .9533296     1.04414
        age3 |   .9952419   .0662148    -0.07   0.943     .8735686    1.133862
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9505421   .0343637    -1.40   0.161     .8855211    1.020337
             |
   obese4cat |
Obese I ..)  |   1.010082   .0593091     0.17   0.864     .9002773    1.133278
Obese II..)  |   .9573613    .064242    -0.65   0.516     .8393778    1.091929
Obese II..)  |   .9311537   .0783568    -0.85   0.397     .7895736    1.098121
             |
smoke_nomiss |
     Former  |   .8921635    .129186    -0.79   0.431     .6717223    1.184948
    Current  |   1.071383   .0620712     1.19   0.234     .9563791    1.200217
             |
         imd |
          4  |   1.023714   .0507532     0.47   0.636     .9289194    1.128182
5 most de..  |   1.075608   .0689482     1.14   0.256     .9486162      1.2196
             |
tot_adults~h |
          2  |   .8527828   .3042821    -0.45   0.655     .4237605    1.716154
          3  |    .830006   .2248484    -0.69   0.492       .48808    1.411469
             |
   ethnicity |
Asian or ..  |   1.059621   .0703565     0.87   0.383     .9303206    1.206892
      Other  |   .8966645   .0603847    -1.62   0.105     .7857908    1.023182
             |
1.htdiag_o~p |   .9870093   .0399471    -0.32   0.747     .9117393    1.068493
1.~y_disease |   .9979398    .048375    -0.04   0.966     .9074913    1.097403
    1.asthma |   1.015116   .0751137     0.20   0.839     .8780732    1.173547
1.~c_disease |   .9592789   .0469242    -0.85   0.395     .8715803    1.055802
             |
     diabcat |
T1DM, con..  |   1.105746   .1190799     0.93   0.351     .8953402    1.365599
T1DM, unc..  |   1.205851    .375213     0.60   0.547     .6552898    2.218982
T2DM, con..  |   .9887778   .0507006    -0.22   0.826     .8942366    1.093314
T2DM, unc..  |   .8830003   .0899181    -1.22   0.222     .7232373    1.078055
Diabetes,..  |   .9226306   .5076502    -0.15   0.884     .3138191    2.712541
             |
cancer_exh~t |
  Last year  |   2.314395   .7725008     2.51   0.012     1.203158    4.451971
2-5 years..  |   .9404494   .1539025    -0.38   0.708     .6823987    1.296083
   5+ years  |   1.062318   .0558524     1.15   0.250     .9583003    1.177625
             |
cancer_hae~t |
  Last year  |   .8401387   .3182301    -0.46   0.646     .3998807    1.765109
2-5 years..  |   1.266369   .1623165     1.84   0.065     .9850485    1.628031
   5+ years  |     .95353   .0504182    -0.90   0.368     .8596601     1.05765
             |
1.~r_disease |   .9307448   .0477997    -1.40   0.162     .8416199    1.029308
1.stroke_d~a |   .9342779   .0474359    -1.34   0.181     .8457816    1.032034
1.other_ne~o |   1.041757   .0532349     0.80   0.423     .9424731    1.151499
             |
reduced_ki~t |
Stage 3a/..  |   .8772279   .3038381    -0.38   0.705     .4449271    1.729561
      1.esrd |   1.001531   .0401033     0.04   0.970     .9259349    1.083298
1.other_tr~t |    1.03868   .0508489     0.78   0.438     .9436498     1.14328
  1.asplenia |   .9804074   .0472527    -0.41   0.681     .8920335    1.077536
1.ra_sle_p~s |   1.096856   .0515035     1.97   0.049     1.000417    1.202592
1.other_im~o |   1.024111   .0521594     0.47   0.640     .9268175    1.131618
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod2.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood =  -6948.872
Iteration 1:   log pseudolikelihood = -6933.3026
Iteration 2:   log pseudolikelihood = -6928.4407
Iteration 3:   log pseudolikelihood =  -6928.392
Iteration 4:   log pseudolikelihood = -6928.3918
Refining estimates:
Iteration 0:   log pseudolikelihood = -6928.3918

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,462             Number of obs    =       2,462
No. of failures      =        1,352
Time at risk         =        80292
                                                Wald chi2(42)    =      125.26
Log pseudolikelihood =   -6928.3918             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 796 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8495899    .164396    -0.84   0.400     .5814354    1.241416
 only 12-18  |    .670242   .1856366    -1.44   0.149     .3894707    1.153423
      mixed  |   .7282852   .1290842    -1.79   0.074     .5145542    1.030794
             |
        age1 |   1.015935   .0107672     1.49   0.136     .9950494    1.037259
        age2 |   .9463071   .0313989    -1.66   0.096     .8867247    1.009893
        age3 |   1.169017    .110583     1.65   0.099     .9711844     1.40715
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.021298   .0538178     0.40   0.689     .9210814    1.132419
             |
   obese4cat |
Obese I ..)  |   1.080188   .0870059     0.96   0.338     .9224386    1.264914
Obese II..)  |   .9134506    .087986    -0.94   0.347     .7563017    1.103253
Obese II..)  |   1.035139   .1219555     0.29   0.769     .8217007    1.304017
             |
smoke_nomiss |
     Former  |   .8846688   .2014976    -0.54   0.591     .5661165     1.38247
    Current  |   1.148812   .0966468     1.65   0.099     .9741809    1.354748
             |
         imd |
          4  |   .9535943   .0640393    -0.71   0.479     .8359891    1.087744
5 most de..  |    1.02662   .0951751     0.28   0.777     .8560461    1.231182
             |
tot_adults~h |
          2  |   1.304465   .7054291     0.49   0.623     .4519803    3.764831
          3  |   1.501275   .6025692     1.01   0.311      .683616     3.29692
             |
   ethnicity |
Asian or ..  |   1.049283    .101379     0.50   0.619     .8682636    1.268041
      Other  |    .949071   .0854187    -0.58   0.561     .7955885    1.132163
             |
1.htdiag_o~p |   .9992248   .0572595    -0.01   0.989     .8930711    1.117996
1.~y_disease |   1.038304    .066439     0.59   0.557     .9159204     1.17704
    1.asthma |   1.031298   .1071797     0.30   0.767      .841243    1.264291
1.~c_disease |   1.057987   .0712475     0.84   0.403     .9271673    1.207264
             |
     diabcat |
T1DM, con..  |   1.183488   .1943846     1.03   0.305     .8577418    1.632945
T1DM, unc..  |   1.086714   .5587677     0.16   0.872     .3966831    2.977055
T2DM, con..  |    .945479   .0729861    -0.73   0.468     .8127248    1.099918
T2DM, unc..  |   1.128482    .135049     1.01   0.312     .8925422    1.426792
Diabetes,..  |   6.057264   1.336251     8.17   0.000     3.930962    9.333708
             |
cancer_exh~t |
  Last year  |    1.42832   1.019917     0.50   0.618     .3523793    5.789499
2-5 years..  |   1.475641   .3039319     1.89   0.059     .9855127    2.209527
   5+ years  |   1.106979    .080683     1.39   0.163     .9596189    1.276967
             |
cancer_hae~t |
  Last year  |   1.186307    .603648     0.34   0.737     .4375886    3.216088
2-5 years..  |   1.040875   .2354402     0.18   0.859     .6681309     1.62157
   5+ years  |   1.055025   .0731064     0.77   0.440     .9210434    1.208497
             |
1.~r_disease |   1.079287   .0721817     1.14   0.254     .9466931    1.230451
1.stroke_d~a |   1.008609   .0685736     0.13   0.900      .882777    1.152377
1.other_ne~o |   1.144378   .0775516     1.99   0.047     1.002042    1.306933
             |
reduced_ki~t |
Stage 3a/..  |   1.516992   .6716635     0.94   0.347     .6369496    3.612945
      1.esrd |   1.006036   .0560869     0.11   0.914     .9019004    1.122195
1.other_tr~t |   1.049518   .0690281     0.73   0.462     .9225824    1.193918
  1.asplenia |   .9305855   .0654943    -1.02   0.307     .8106792    1.068227
1.ra_sle_p~s |   .9451211   .0678202    -0.79   0.432     .8211203    1.087848
1.other_im~o |   1.109414   .0753417     1.53   0.126     .9711523    1.267359
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,462             Number of obs    =       2,462
No. of failures      =        1,352
Time at risk         =        80292
                                                Wald chi2(42)    =      125.26
Log pseudolikelihood =   -6928.3918             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 796 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8495899    .164396    -0.84   0.400     .5814354    1.241416
 only 12-18  |    .670242   .1856366    -1.44   0.149     .3894707    1.153423
      mixed  |   .7282852   .1290842    -1.79   0.074     .5145542    1.030794
             |
        age1 |   1.015935   .0107672     1.49   0.136     .9950494    1.037259
        age2 |   .9463071   .0313989    -1.66   0.096     .8867247    1.009893
        age3 |   1.169017    .110583     1.65   0.099     .9711844     1.40715
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.021298   .0538178     0.40   0.689     .9210814    1.132419
             |
   obese4cat |
Obese I ..)  |   1.080188   .0870059     0.96   0.338     .9224386    1.264914
Obese II..)  |   .9134506    .087986    -0.94   0.347     .7563017    1.103253
Obese II..)  |   1.035139   .1219555     0.29   0.769     .8217007    1.304017
             |
smoke_nomiss |
     Former  |   .8846688   .2014976    -0.54   0.591     .5661165     1.38247
    Current  |   1.148812   .0966468     1.65   0.099     .9741809    1.354748
             |
         imd |
          4  |   .9535943   .0640393    -0.71   0.479     .8359891    1.087744
5 most de..  |    1.02662   .0951751     0.28   0.777     .8560461    1.231182
             |
tot_adults~h |
          2  |   1.304465   .7054291     0.49   0.623     .4519803    3.764831
          3  |   1.501275   .6025692     1.01   0.311      .683616     3.29692
             |
   ethnicity |
Asian or ..  |   1.049283    .101379     0.50   0.619     .8682636    1.268041
      Other  |    .949071   .0854187    -0.58   0.561     .7955885    1.132163
             |
1.htdiag_o~p |   .9992248   .0572595    -0.01   0.989     .8930711    1.117996
1.~y_disease |   1.038304    .066439     0.59   0.557     .9159204     1.17704
    1.asthma |   1.031298   .1071797     0.30   0.767      .841243    1.264291
1.~c_disease |   1.057987   .0712475     0.84   0.403     .9271673    1.207264
             |
     diabcat |
T1DM, con..  |   1.183488   .1943846     1.03   0.305     .8577418    1.632945
T1DM, unc..  |   1.086714   .5587677     0.16   0.872     .3966831    2.977055
T2DM, con..  |    .945479   .0729861    -0.73   0.468     .8127248    1.099918
T2DM, unc..  |   1.128482    .135049     1.01   0.312     .8925422    1.426792
Diabetes,..  |   6.057264   1.336251     8.17   0.000     3.930962    9.333708
             |
cancer_exh~t |
  Last year  |    1.42832   1.019917     0.50   0.618     .3523793    5.789499
2-5 years..  |   1.475641   .3039319     1.89   0.059     .9855127    2.209527
   5+ years  |   1.106979    .080683     1.39   0.163     .9596189    1.276967
             |
cancer_hae~t |
  Last year  |   1.186307    .603648     0.34   0.737     .4375886    3.216088
2-5 years..  |   1.040875   .2354402     0.18   0.859     .6681309     1.62157
   5+ years  |   1.055025   .0731064     0.77   0.440     .9210434    1.208497
             |
1.~r_disease |   1.079287   .0721817     1.14   0.254     .9466931    1.230451
1.stroke_d~a |   1.008609   .0685736     0.13   0.900      .882777    1.152377
1.other_ne~o |   1.144378   .0775516     1.99   0.047     1.002042    1.306933
             |
reduced_ki~t |
Stage 3a/..  |   1.516992   .6716635     0.94   0.347     .6369496    3.612945
      1.esrd |   1.006036   .0560869     0.11   0.914     .9019004    1.122195
1.other_tr~t |   1.049518   .0690281     0.73   0.462     .9225824    1.193918
  1.asplenia |   .9305855   .0654943    -1.02   0.307     .8106792    1.068227
1.ra_sle_p~s |   .9451211   .0678202    -0.79   0.432     .8211203    1.087848
1.other_im~o |   1.109414   .0753417     1.53   0.126     .9711523    1.267359
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod3.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod3.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2938.8804
Iteration 1:   log pseudolikelihood = -2913.3362
Iteration 2:   log pseudolikelihood = -2912.9421
Iteration 3:   log pseudolikelihood = -2912.9308
Iteration 4:   log pseudolikelihood = -2912.9308
Refining estimates:
Iteration 0:   log pseudolikelihood = -2912.9308

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,016             Number of obs    =       1,016
No. of failures      =          719
Time at risk         =        24973
                                                Wald chi2(41)    =       69.32
Log pseudolikelihood =   -2912.9308             Prob > chi2      =      0.0037

                         (Std. Err. adjusted for 569 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.384598    .498388     0.90   0.366      .683805    2.803592
 only 12-18  |   1.129712   .4764934     0.29   0.772     .4942481    2.582201
      mixed  |   1.054506    .361953     0.15   0.877     .5381197    2.066422
             |
        age1 |    .991917     .01411    -0.57   0.568     .9646438    1.019961
        age2 |    1.02863   .0467078     0.62   0.534     .9410396    1.124373
        age3 |   .9334088   .1220606    -0.53   0.598     .7223728    1.206097
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8651339   .0644694    -1.94   0.052     .7475705    1.001185
             |
   obese4cat |
Obese I ..)  |   .9023495   .1041585    -0.89   0.373     .7196483    1.131434
Obese II..)  |   1.399829   .1775098     2.65   0.008     1.091781    1.794792
Obese II..)  |   .8794693    .145702    -0.78   0.438     .6356262    1.216857
             |
smoke_nomiss |
     Former  |   1.088739   .3069271     0.30   0.763     .6265577    1.891849
    Current  |   .9828625   .1224887    -0.14   0.890     .7698608    1.254797
             |
         imd |
          4  |   .8440253   .0876101    -1.63   0.102     .6886531    1.034452
5 most de..  |   .9209197   .1174199    -0.65   0.518     .7172839    1.182367
             |
tot_adults~h |
          2  |   1.188428   .7712828     0.27   0.790     .3330797    4.240311
          3  |   .6358043   .3017451    -0.95   0.340     .2508149    1.611735
             |
   ethnicity |
Asian or ..  |   1.023356   .1447694     0.16   0.870     .7755526    1.350337
      Other  |   1.049217   .1297936     0.39   0.698     .8233171    1.337098
             |
1.htdiag_o~p |   1.209389   .0941932     2.44   0.015     1.038175    1.408841
1.~y_disease |   1.058786   .1049074     0.58   0.564     .8719043    1.285723
    1.asthma |   1.055943   .1732912     0.33   0.740      .765508    1.456571
1.~c_disease |   1.081964   .0957661     0.89   0.373     .9096448    1.286927
             |
     diabcat |
T1DM, con..  |   .7450339    .205659    -1.07   0.286     .4337211    1.279798
T1DM, unc..  |   .3488945   .3501433    -1.05   0.294     .0488029    2.494264
T2DM, con..  |   1.175561   .1086781     1.75   0.080     .9807391    1.409084
T2DM, unc..  |    1.36344   .2859292     1.48   0.139     .9039185    2.056567
             |
cancer_exh~t |
  Last year  |   1.412883    .407463     1.20   0.231     .8028362    2.486481
2-5 years..  |   .7986105   .2141586    -0.84   0.402     .4721429    1.350817
   5+ years  |   .8731786   .0887936    -1.33   0.182     .7153924    1.065766
             |
cancer_hae~t |
  Last year  |    .402181   .2851846    -1.28   0.199     .1001933    1.614375
2-5 years..  |   1.016815   .3848439     0.04   0.965     .4842609    2.135033
   5+ years  |   1.037455   .1006401     0.38   0.705     .8578215    1.254704
             |
1.~r_disease |   1.108718   .1095888     1.04   0.296     .9134524    1.345725
1.stroke_d~a |   1.133605   .0958877     1.48   0.138     .9604205    1.338017
1.other_ne~o |   1.056183   .1112221     0.52   0.604     .8592167    1.298301
             |
reduced_ki~t |
Stage 3a/..  |   .6286869   .4067036    -0.72   0.473     .1769229    2.234009
      1.esrd |   1.124057    .089686     1.47   0.143     .9613312    1.314329
1.other_tr~t |   .9837048    .094718    -0.17   0.865     .8145264    1.188022
  1.asplenia |   1.058791   .1036107     0.58   0.559     .8740046    1.282646
1.ra_sle_p~s |   .7453707   .0722141    -3.03   0.002     .6164601    .9012383
1.other_im~o |    1.00944   .1008748     0.09   0.925     .8298868    1.227842
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,016             Number of obs    =       1,016
No. of failures      =          719
Time at risk         =        24973
                                                Wald chi2(41)    =       69.32
Log pseudolikelihood =   -2912.9308             Prob > chi2      =      0.0037

                         (Std. Err. adjusted for 569 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.384598    .498388     0.90   0.366      .683805    2.803592
 only 12-18  |   1.129712   .4764934     0.29   0.772     .4942481    2.582201
      mixed  |   1.054506    .361953     0.15   0.877     .5381197    2.066422
             |
        age1 |    .991917     .01411    -0.57   0.568     .9646438    1.019961
        age2 |    1.02863   .0467078     0.62   0.534     .9410396    1.124373
        age3 |   .9334088   .1220606    -0.53   0.598     .7223728    1.206097
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8651339   .0644694    -1.94   0.052     .7475705    1.001185
             |
   obese4cat |
Obese I ..)  |   .9023495   .1041585    -0.89   0.373     .7196483    1.131434
Obese II..)  |   1.399829   .1775098     2.65   0.008     1.091781    1.794792
Obese II..)  |   .8794693    .145702    -0.78   0.438     .6356262    1.216857
             |
smoke_nomiss |
     Former  |   1.088739   .3069271     0.30   0.763     .6265577    1.891849
    Current  |   .9828625   .1224887    -0.14   0.890     .7698608    1.254797
             |
         imd |
          4  |   .8440253   .0876101    -1.63   0.102     .6886531    1.034452
5 most de..  |   .9209197   .1174199    -0.65   0.518     .7172839    1.182367
             |
tot_adults~h |
          2  |   1.188428   .7712828     0.27   0.790     .3330797    4.240311
          3  |   .6358043   .3017451    -0.95   0.340     .2508149    1.611735
             |
   ethnicity |
Asian or ..  |   1.023356   .1447694     0.16   0.870     .7755526    1.350337
      Other  |   1.049217   .1297936     0.39   0.698     .8233171    1.337098
             |
1.htdiag_o~p |   1.209389   .0941932     2.44   0.015     1.038175    1.408841
1.~y_disease |   1.058786   .1049074     0.58   0.564     .8719043    1.285723
    1.asthma |   1.055943   .1732912     0.33   0.740      .765508    1.456571
1.~c_disease |   1.081964   .0957661     0.89   0.373     .9096448    1.286927
             |
     diabcat |
T1DM, con..  |   .7450339    .205659    -1.07   0.286     .4337211    1.279798
T1DM, unc..  |   .3488945   .3501433    -1.05   0.294     .0488029    2.494264
T2DM, con..  |   1.175561   .1086781     1.75   0.080     .9807391    1.409084
T2DM, unc..  |    1.36344   .2859292     1.48   0.139     .9039185    2.056567
             |
cancer_exh~t |
  Last year  |   1.412883    .407463     1.20   0.231     .8028362    2.486481
2-5 years..  |   .7986105   .2141586    -0.84   0.402     .4721429    1.350817
   5+ years  |   .8731786   .0887936    -1.33   0.182     .7153924    1.065766
             |
cancer_hae~t |
  Last year  |    .402181   .2851846    -1.28   0.199     .1001933    1.614375
2-5 years..  |   1.016815   .3848439     0.04   0.965     .4842609    2.135033
   5+ years  |   1.037455   .1006401     0.38   0.705     .8578215    1.254704
             |
1.~r_disease |   1.108718   .1095888     1.04   0.296     .9134524    1.345725
1.stroke_d~a |   1.133605   .0958877     1.48   0.138     .9604205    1.338017
1.other_ne~o |   1.056183   .1112221     0.52   0.604     .8592167    1.298301
             |
reduced_ki~t |
Stage 3a/..  |   .6286869   .4067036    -0.72   0.473     .1769229    2.234009
      1.esrd |   1.124057    .089686     1.47   0.143     .9613312    1.314329
1.other_tr~t |   .9837048    .094718    -0.17   0.865     .8145264    1.188022
  1.asplenia |   1.058791   .1036107     0.58   0.559     .8740046    1.282646
1.ra_sle_p~s |   .7453707   .0722141    -3.03   0.002     .6164601    .9012383
1.other_im~o |    1.00944   .1008748     0.09   0.925     .8298868    1.227842
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod4.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod4.ster saved
(4,975 observations (episodes) created)
(cat_time: 4975 changes made)
(covid_tpp_prob: 4975 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -11203.854
Iteration 1:   log pseudolikelihood = -11179.541
Iteration 2:   log pseudolikelihood = -11178.823
Iteration 3:   log pseudolikelihood =  -11178.64
Iteration 4:   log pseudolikelihood = -11178.573
Iteration 5:   log pseudolikelihood = -11178.548
Iteration 6:   log pseudolikelihood = -11178.539
Iteration 7:   log pseudolikelihood = -11178.536
Iteration 8:   log pseudolikelihood = -11178.534
Iteration 9:   log pseudolikelihood = -11178.534
Iteration 10:  log pseudolikelihood = -11178.534
Iteration 11:  log pseudolikelihood = -11178.534
Iteration 12:  log pseudolikelihood = -11178.534
Iteration 13:  log pseudolikelihood = -11178.534
Iteration 14:  log pseudolikelihood = -11178.534
Iteration 15:  log pseudolikelihood = -11178.534
Iteration 16:  log pseudolikelihood = -11178.534
Iteration 17:  log pseudolikelihood = -11178.534
Iteration 18:  log pseudolikelihood = -11178.534
Iteration 19:  log pseudolikelihood = -11178.534
Iteration 20:  log pseudolikelihood = -11178.534
Iteration 21:  log pseudolikelihood = -11178.534
Iteration 22:  log pseudolikelihood = -11178.534
Iteration 23:  log pseudolikelihood = -11178.534
Iteration 24:  log pseudolikelihood = -11178.534
Iteration 25:  log pseudolikelihood = -11178.534
Iteration 26:  log pseudolikelihood = -11178.534
Iteration 27:  log pseudolikelihood = -11178.534
Iteration 28:  log pseudolikelihood = -11178.534
Iteration 29:  log pseudolikelihood = -11178.534
Iteration 30:  log pseudolikelihood = -11178.534
Iteration 31:  log pseudolikelihood = -11178.534
Iteration 32:  log pseudolikelihood = -11178.534
Iteration 33:  log pseudolikelihood = -11178.534
Iteration 34:  log pseudolikelihood = -11178.534
Iteration 35:  log pseudolikelihood = -11178.534
Iteration 36:  log pseudolikelihood = -11178.534
Refining estimates:
Iteration 0:   log pseudolikelihood = -11178.534
Iteration 1:   log pseudolikelihood = -11178.534
Iteration 2:   log pseudolikelihood = -11178.534

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,549             Number of obs    =       4,549
No. of failures      =        1,908
Time at risk         =       298676
                                                Wald chi2(42)    =     6078.21
Log pseudolikelihood =   -11178.534             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.033215   .1633542     0.21   0.836     .7579026    1.408536
 only 12-18  |   .7764242    .171639    -1.14   0.252     .5034189    1.197481
      mixed  |   .9764053    .144054    -0.16   0.871       .73122    1.303804
             |
        age1 |   1.002403   .0232059     0.10   0.917     .9579368    1.048934
        age2 |   1.006032   .1215663     0.05   0.960     .7938801    1.274879
        age3 |   .9837636   .2525139    -0.06   0.949      .594844    1.626966
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9729272   .0472381    -0.57   0.572     .8846111    1.070061
             |
   obese4cat |
Obese I ..)  |   .9236732   .0631935    -1.16   0.246     .8077613    1.056218
Obese II..)  |   1.036186   .0833463     0.44   0.659     .8850561    1.213123
Obese II..)  |   1.129655   .1120909     1.23   0.219     .9300034    1.372167
             |
smoke_nomiss |
     Former  |   .9361144   .1699652    -0.36   0.716     .6558142    1.336217
    Current  |   1.044996   .0680843     0.68   0.499      .919722    1.187334
             |
         imd |
          4  |   1.044835   .0598362     0.77   0.444     .9339008    1.168947
5 most de..  |   .9569818   .0751197    -0.56   0.575     .8205166    1.116143
             |
tot_adults~h |
          2  |   .8335211   .4299251    -0.35   0.724     .3032998    2.290663
          3  |   1.610119    .515392     1.49   0.137     .8597894    3.015253
             |
   ethnicity |
Asian or ..  |   1.128285   .0854805     1.59   0.111     .9725917    1.308902
      Other  |   .8916195   .0701827    -1.46   0.145     .7641494    1.040353
             |
1.htdiag_o~p |   1.009514   .0497895     0.19   0.848     .9164966    1.111972
1.~y_disease |   .9483691   .0540847    -0.93   0.353     .8480747    1.060524
    1.asthma |   1.048574   .0841627     0.59   0.555      .895939    1.227213
1.~c_disease |   .9345815    .054579    -1.16   0.247     .8335037    1.047917
             |
     diabcat |
T1DM, con..  |   1.226947   .1596816     1.57   0.116     .9507051    1.583456
T1DM, unc..  |    .966213    .279791    -0.12   0.906     .5477549    1.704353
T2DM, con..  |   1.028295   .0635507     0.45   0.652     .9109862     1.16071
T2DM, unc..  |   1.089689   .1361708     0.69   0.492     .8529699    1.392102
Diabetes,..  |   3.46e-17   1.76e-17   -74.67   0.000     1.28e-17    9.36e-17
             |
cancer_exh~t |
  Last year  |   1.150977    .355237     0.46   0.649     .6285675    2.107565
2-5 years..  |   .8899011   .1727457    -0.60   0.548     .6082867    1.301893
   5+ years  |   1.003298    .059652     0.06   0.956     .8929371    1.127298
             |
cancer_hae~t |
  Last year  |   .9557639   .2738794    -0.16   0.875     .5450473    1.675973
2-5 years..  |   .7578135   .1597642    -1.32   0.188      .501314    1.145552
   5+ years  |   .9256299   .0577728    -1.24   0.216     .8190493     1.04608
             |
1.~r_disease |   1.084667   .0596678     1.48   0.140     .9738041    1.208151
1.stroke_d~a |   1.129028   .0618765     2.21   0.027     1.014039    1.257057
1.other_ne~o |   .9274666   .0526712    -1.33   0.185     .8297709    1.036665
             |
reduced_ki~t |
Stage 3a/..  |   1.081133   .1304367     0.65   0.518     .8534602    1.369541
      1.esrd |    .953285   .0466245    -0.98   0.328     .8661461    1.049191
1.other_tr~t |   .9921671    .058528    -0.13   0.894     .8838375    1.113774
  1.asplenia |   1.061284    .063731     0.99   0.322     .9434439    1.193842
1.ra_sle_p~s |   1.047256   .0594316     0.81   0.416     .9370164    1.170465
1.other_im~o |   1.128504   .0602952     2.26   0.024     1.016305     1.25309
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,549             Number of obs    =       4,549
No. of failures      =        1,908
Time at risk         =       298676
                                                Wald chi2(42)    =     6078.21
Log pseudolikelihood =   -11178.534             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.033215   .1633542     0.21   0.836     .7579026    1.408536
 only 12-18  |   .7764242    .171639    -1.14   0.252     .5034189    1.197481
      mixed  |   .9764053    .144054    -0.16   0.871       .73122    1.303804
             |
        age1 |   1.002403   .0232059     0.10   0.917     .9579368    1.048934
        age2 |   1.006032   .1215663     0.05   0.960     .7938801    1.274879
        age3 |   .9837636   .2525139    -0.06   0.949      .594844    1.626966
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9729272   .0472381    -0.57   0.572     .8846111    1.070061
             |
   obese4cat |
Obese I ..)  |   .9236732   .0631935    -1.16   0.246     .8077613    1.056218
Obese II..)  |   1.036186   .0833463     0.44   0.659     .8850561    1.213123
Obese II..)  |   1.129655   .1120909     1.23   0.219     .9300034    1.372167
             |
smoke_nomiss |
     Former  |   .9361144   .1699652    -0.36   0.716     .6558142    1.336217
    Current  |   1.044996   .0680843     0.68   0.499      .919722    1.187334
             |
         imd |
          4  |   1.044835   .0598362     0.77   0.444     .9339008    1.168947
5 most de..  |   .9569818   .0751197    -0.56   0.575     .8205166    1.116143
             |
tot_adults~h |
          2  |   .8335211   .4299251    -0.35   0.724     .3032998    2.290663
          3  |   1.610119    .515392     1.49   0.137     .8597894    3.015253
             |
   ethnicity |
Asian or ..  |   1.128285   .0854805     1.59   0.111     .9725917    1.308902
      Other  |   .8916195   .0701827    -1.46   0.145     .7641494    1.040353
             |
1.htdiag_o~p |   1.009514   .0497895     0.19   0.848     .9164966    1.111972
1.~y_disease |   .9483691   .0540847    -0.93   0.353     .8480747    1.060524
    1.asthma |   1.048574   .0841627     0.59   0.555      .895939    1.227213
1.~c_disease |   .9345815    .054579    -1.16   0.247     .8335037    1.047917
             |
     diabcat |
T1DM, con..  |   1.226947   .1596816     1.57   0.116     .9507051    1.583456
T1DM, unc..  |    .966213    .279791    -0.12   0.906     .5477549    1.704353
T2DM, con..  |   1.028295   .0635507     0.45   0.652     .9109862     1.16071
T2DM, unc..  |   1.089689   .1361708     0.69   0.492     .8529699    1.392102
Diabetes,..  |   3.46e-17   1.76e-17   -74.67   0.000     1.28e-17    9.36e-17
             |
cancer_exh~t |
  Last year  |   1.150977    .355237     0.46   0.649     .6285675    2.107565
2-5 years..  |   .8899011   .1727457    -0.60   0.548     .6082867    1.301893
   5+ years  |   1.003298    .059652     0.06   0.956     .8929371    1.127298
             |
cancer_hae~t |
  Last year  |   .9557639   .2738794    -0.16   0.875     .5450473    1.675973
2-5 years..  |   .7578135   .1597642    -1.32   0.188      .501314    1.145552
   5+ years  |   .9256299   .0577728    -1.24   0.216     .8190493     1.04608
             |
1.~r_disease |   1.084667   .0596678     1.48   0.140     .9738041    1.208151
1.stroke_d~a |   1.129028   .0618765     2.21   0.027     1.014039    1.257057
1.other_ne~o |   .9274666   .0526712    -1.33   0.185     .8297709    1.036665
             |
reduced_ki~t |
Stage 3a/..  |   1.081133   .1304367     0.65   0.518     .8534602    1.369541
      1.esrd |    .953285   .0466245    -0.98   0.328     .8661461    1.049191
1.other_tr~t |   .9921671    .058528    -0.13   0.894     .8838375    1.113774
  1.asplenia |   1.061284    .063731     0.99   0.322     .9434439    1.193842
1.ra_sle_p~s |   1.047256   .0594316     0.81   0.416     .9370164    1.170465
1.other_im~o |   1.128504   .0602952     2.26   0.024     1.016305     1.25309
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod0.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -5884.5283
Iteration 1:   log pseudolikelihood = -5859.9243
Iteration 2:   log pseudolikelihood = -5858.7411
Iteration 3:   log pseudolikelihood = -5858.7269
Iteration 4:   log pseudolikelihood = -5858.7269
Refining estimates:
Iteration 0:   log pseudolikelihood = -5858.7269

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,591             Number of obs    =       2,591
No. of failures      =        1,111
Time at risk         =       137162
                                                Wald chi2(42)    =       61.55
Log pseudolikelihood =   -5858.7269             Prob > chi2      =      0.0262

                         (Std. Err. adjusted for 827 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5440944   .1093593    -3.03   0.002     .3669345    .8067892
 only 12-18  |   .9341318   .2284299    -0.28   0.781     .5784392    1.508546
      mixed  |   .6030476   .1097654    -2.78   0.005     .4221023    .8615599
             |
        age1 |    .971932   .0277599    -1.00   0.319     .9190184    1.027892
        age2 |   1.186339   .1771732     1.14   0.253     .8852923    1.589758
        age3 |   .6910431   .2207917    -1.16   0.247     .3694384    1.292612
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.041472   .0607337     0.70   0.486     .9289872    1.167578
             |
   obese4cat |
Obese I ..)  |   1.081313   .0850077     0.99   0.320     .9269028    1.261447
Obese II..)  |   .8834489   .1064821    -1.03   0.304     .6975673    1.118863
Obese II..)  |   1.038235   .1565931     0.25   0.804     .7725238    1.395337
             |
smoke_nomiss |
     Former  |   1.068486   .2518903     0.28   0.779     .6731351    1.696037
    Current  |    .966585   .0859232    -0.38   0.702      .812033    1.150552
             |
         imd |
          4  |   .9064236   .0710169    -1.25   0.210     .7773935     1.05687
5 most de..  |   1.124261   .1077899     1.22   0.222     .9316592    1.356679
             |
tot_adults~h |
          2  |   2.077963   .7849991     1.94   0.053     .9910065    4.357116
          3  |   1.523281   .4693089     1.37   0.172     .8327847    2.786297
             |
   ethnicity |
Asian or ..  |   1.224082   .1260747     1.96   0.050     1.000324    1.497891
      Other  |    .903307   .0895004    -1.03   0.305     .7438709    1.096915
             |
1.htdiag_o~p |   .9588764   .0644106    -0.63   0.532     .8405912    1.093806
1.~y_disease |   .8314628     .06568    -2.34   0.019     .7122027    .9706933
    1.asthma |   .9080498   .1019663    -0.86   0.390     .7286634    1.131599
1.~c_disease |   1.026623   .0746835     0.36   0.718     .8902029     1.18395
             |
     diabcat |
T1DM, con..  |   1.005139   .2012718     0.03   0.980     .6788585    1.488241
T1DM, unc..  |   .6018109   .3029182    -1.01   0.313     .2243946    1.614015
T2DM, con..  |   1.064963   .0871023     0.77   0.442     .9072263    1.250125
T2DM, unc..  |   .9511153   .1549869    -0.31   0.758     .6910787    1.308997
Diabetes,..  |   1.237879   .8960078     0.29   0.768     .2996105    5.114453
             |
cancer_exh~t |
  Last year  |   1.330857   .4622443     0.82   0.411     .6737287    2.628923
2-5 years..  |   1.235894    .267729     0.98   0.328     .8083271    1.889623
   5+ years  |   .9838116   .0772015    -0.21   0.835     .8435612     1.14738
             |
cancer_hae~t |
  Last year  |   .6122457    .309114    -0.97   0.331      .227597    1.646968
2-5 years..  |   1.042612   .2212076     0.20   0.844     .6879016    1.580227
   5+ years  |   .9206834   .0759678    -1.00   0.317     .7832053    1.082293
             |
1.~r_disease |   1.055333   .0802744     0.71   0.479     .9091647    1.225001
1.stroke_d~a |   .9927954   .0742259    -0.10   0.923     .8574722    1.149475
1.other_ne~o |   1.027504    .077649     0.36   0.720     .8860493    1.191542
             |
reduced_ki~t |
Stage 3a/..  |   .8758034   .1474832    -0.79   0.431     .6296022     1.21828
      1.esrd |   1.056875   .0698711     0.84   0.403     .9284318    1.203088
1.other_tr~t |   .9616108   .0737661    -0.51   0.610     .8273758    1.117624
  1.asplenia |    .965708   .0725266    -0.46   0.642     .8335255    1.118852
1.ra_sle_p~s |   1.107089   .0882087     1.28   0.202     .9470265    1.294205
1.other_im~o |   1.129594   .0861539     1.60   0.110     .9727508    1.311727
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,591             Number of obs    =       2,591
No. of failures      =        1,111
Time at risk         =       137162
                                                Wald chi2(42)    =       61.55
Log pseudolikelihood =   -5858.7269             Prob > chi2      =      0.0262

                         (Std. Err. adjusted for 827 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5440944   .1093593    -3.03   0.002     .3669345    .8067892
 only 12-18  |   .9341318   .2284299    -0.28   0.781     .5784392    1.508546
      mixed  |   .6030476   .1097654    -2.78   0.005     .4221023    .8615599
             |
        age1 |    .971932   .0277599    -1.00   0.319     .9190184    1.027892
        age2 |   1.186339   .1771732     1.14   0.253     .8852923    1.589758
        age3 |   .6910431   .2207917    -1.16   0.247     .3694384    1.292612
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.041472   .0607337     0.70   0.486     .9289872    1.167578
             |
   obese4cat |
Obese I ..)  |   1.081313   .0850077     0.99   0.320     .9269028    1.261447
Obese II..)  |   .8834489   .1064821    -1.03   0.304     .6975673    1.118863
Obese II..)  |   1.038235   .1565931     0.25   0.804     .7725238    1.395337
             |
smoke_nomiss |
     Former  |   1.068486   .2518903     0.28   0.779     .6731351    1.696037
    Current  |    .966585   .0859232    -0.38   0.702      .812033    1.150552
             |
         imd |
          4  |   .9064236   .0710169    -1.25   0.210     .7773935     1.05687
5 most de..  |   1.124261   .1077899     1.22   0.222     .9316592    1.356679
             |
tot_adults~h |
          2  |   2.077963   .7849991     1.94   0.053     .9910065    4.357116
          3  |   1.523281   .4693089     1.37   0.172     .8327847    2.786297
             |
   ethnicity |
Asian or ..  |   1.224082   .1260747     1.96   0.050     1.000324    1.497891
      Other  |    .903307   .0895004    -1.03   0.305     .7438709    1.096915
             |
1.htdiag_o~p |   .9588764   .0644106    -0.63   0.532     .8405912    1.093806
1.~y_disease |   .8314628     .06568    -2.34   0.019     .7122027    .9706933
    1.asthma |   .9080498   .1019663    -0.86   0.390     .7286634    1.131599
1.~c_disease |   1.026623   .0746835     0.36   0.718     .8902029     1.18395
             |
     diabcat |
T1DM, con..  |   1.005139   .2012718     0.03   0.980     .6788585    1.488241
T1DM, unc..  |   .6018109   .3029182    -1.01   0.313     .2243946    1.614015
T2DM, con..  |   1.064963   .0871023     0.77   0.442     .9072263    1.250125
T2DM, unc..  |   .9511153   .1549869    -0.31   0.758     .6910787    1.308997
Diabetes,..  |   1.237879   .8960078     0.29   0.768     .2996105    5.114453
             |
cancer_exh~t |
  Last year  |   1.330857   .4622443     0.82   0.411     .6737287    2.628923
2-5 years..  |   1.235894    .267729     0.98   0.328     .8083271    1.889623
   5+ years  |   .9838116   .0772015    -0.21   0.835     .8435612     1.14738
             |
cancer_hae~t |
  Last year  |   .6122457    .309114    -0.97   0.331      .227597    1.646968
2-5 years..  |   1.042612   .2212076     0.20   0.844     .6879016    1.580227
   5+ years  |   .9206834   .0759678    -1.00   0.317     .7832053    1.082293
             |
1.~r_disease |   1.055333   .0802744     0.71   0.479     .9091647    1.225001
1.stroke_d~a |   .9927954   .0742259    -0.10   0.923     .8574722    1.149475
1.other_ne~o |   1.027504    .077649     0.36   0.720     .8860493    1.191542
             |
reduced_ki~t |
Stage 3a/..  |   .8758034   .1474832    -0.79   0.431     .6296022     1.21828
      1.esrd |   1.056875   .0698711     0.84   0.403     .9284318    1.203088
1.other_tr~t |   .9616108   .0737661    -0.51   0.610     .8273758    1.117624
  1.asplenia |    .965708   .0725266    -0.46   0.642     .8335255    1.118852
1.ra_sle_p~s |   1.107089   .0882087     1.28   0.202     .9470265    1.294205
1.other_im~o |   1.129594   .0861539     1.60   0.110     .9727508    1.311727
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod1.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -3317.7293
Iteration 1:   log pseudolikelihood = -3297.2809
Iteration 2:   log pseudolikelihood = -3296.4524
Iteration 3:   log pseudolikelihood =  -3296.445
Iteration 4:   log pseudolikelihood =  -3296.445
Refining estimates:
Iteration 0:   log pseudolikelihood =  -3296.445

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,433             Number of obs    =       1,433
No. of failures      =          713
Time at risk         =        64384
                                                Wald chi2(42)    =       65.17
Log pseudolikelihood =    -3296.445             Prob > chi2      =      0.0125

                         (Std. Err. adjusted for 663 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8739798   .2475414    -0.48   0.634     .5016624    1.522619
 only 12-18  |   1.019291   .3338492     0.06   0.953     .5364182    1.936837
      mixed  |   .9542588   .2455787    -0.18   0.856     .5762479     1.58024
             |
        age1 |   .9830506   .0354532    -0.47   0.635     .9159626    1.055052
        age2 |   1.106693   .2077417     0.54   0.589      .766028    1.598857
        age3 |    .786944   .3149906    -0.60   0.549     .3591144    1.724467
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.030807   .0796091     0.39   0.694     .8860116    1.199267
             |
   obese4cat |
Obese I ..)  |   1.161676   .1221993     1.42   0.154      .945247     1.42766
Obese II..)  |   1.086348   .1503876     0.60   0.550     .8281968    1.424965
Obese II..)  |   1.113466    .204044     0.59   0.558     .7774873    1.594633
             |
smoke_nomiss |
     Former  |   .4010308   .1520367    -2.41   0.016     .1907545    .8431034
    Current  |   1.156112    .131209     1.28   0.201     .9255415    1.444123
             |
         imd |
          4  |   .8975387   .0887273    -1.09   0.274     .7394463    1.089431
5 most de..  |   .8545049   .1272412    -1.06   0.291     .6382124      1.1441
             |
tot_adults~h |
          2  |   1.760511   1.122225     0.89   0.375     .5047155    6.140885
          3  |   1.425139   .7465938     0.68   0.499     .5104279    3.979054
             |
   ethnicity |
Asian or ..  |   1.086241   .1451248     0.62   0.536     .8359945    1.411397
      Other  |   .8698456   .1073671    -1.13   0.259     .6829302    1.107919
             |
1.htdiag_o~p |   1.036671   .0840992     0.44   0.657     .8842764     1.21533
1.~y_disease |   .9467482   .0879927    -0.59   0.556     .7890819    1.135918
    1.asthma |   1.116262   .1488549     0.82   0.409     .8595228    1.449689
1.~c_disease |   .9259084   .0842382    -0.85   0.397     .7746875    1.106648
             |
     diabcat |
T1DM, con..  |    1.58605   .3330611     2.20   0.028      1.05092    2.393669
T1DM, unc..  |   1.402601   .7714072     0.62   0.538     .4772954    4.121742
T2DM, con..  |   1.027256   .1143082     0.24   0.809     .8259635    1.277604
T2DM, unc..  |   .9276745   .1881417    -0.37   0.711     .6233952    1.380473
Diabetes,..  |   2.309852   .5236849     3.69   0.000     1.481158    3.602192
             |
cancer_exh~t |
  Last year  |   2.195763   .9015499     1.92   0.055     .9819605     4.90995
2-5 years..  |   .7441449   .3210591    -0.68   0.493     .3194546    1.733428
   5+ years  |   .9495959   .0961996    -0.51   0.610      .778587    1.158165
             |
cancer_hae~t |
  Last year  |   1.894266   .7561109     1.60   0.109     .8663177    4.141948
2-5 years..  |   .9252949   .2945417    -0.24   0.807       .49582    1.726777
   5+ years  |   1.003019   .0984572     0.03   0.976      .827474    1.215804
             |
1.~r_disease |   1.081138   .1016718     0.83   0.407     .8991517    1.299958
1.stroke_d~a |   1.027449   .0976387     0.28   0.776     .8528452    1.237799
1.other_ne~o |   1.079501   .1040924     0.79   0.428      .893603    1.304071
             |
reduced_ki~t |
Stage 3a/..  |   1.462685   .2646943     2.10   0.036     1.025919    2.085394
      1.esrd |    .939789   .0762064    -0.77   0.444     .8016917    1.101675
1.other_tr~t |   .8947554   .0897406    -1.11   0.268     .7350756    1.089122
  1.asplenia |   .8303207   .0795307    -1.94   0.052     .6882007     1.00179
1.ra_sle_p~s |   1.046862   .1040186     0.46   0.645     .8616131    1.271941
1.other_im~o |   .8569246   .0866985    -1.53   0.127     .7027861     1.04487
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,433             Number of obs    =       1,433
No. of failures      =          713
Time at risk         =        64384
                                                Wald chi2(42)    =       65.17
Log pseudolikelihood =    -3296.445             Prob > chi2      =      0.0125

                         (Std. Err. adjusted for 663 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8739798   .2475414    -0.48   0.634     .5016624    1.522619
 only 12-18  |   1.019291   .3338492     0.06   0.953     .5364182    1.936837
      mixed  |   .9542588   .2455787    -0.18   0.856     .5762479     1.58024
             |
        age1 |   .9830506   .0354532    -0.47   0.635     .9159626    1.055052
        age2 |   1.106693   .2077417     0.54   0.589      .766028    1.598857
        age3 |    .786944   .3149906    -0.60   0.549     .3591144    1.724467
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.030807   .0796091     0.39   0.694     .8860116    1.199267
             |
   obese4cat |
Obese I ..)  |   1.161676   .1221993     1.42   0.154      .945247     1.42766
Obese II..)  |   1.086348   .1503876     0.60   0.550     .8281968    1.424965
Obese II..)  |   1.113466    .204044     0.59   0.558     .7774873    1.594633
             |
smoke_nomiss |
     Former  |   .4010308   .1520367    -2.41   0.016     .1907545    .8431034
    Current  |   1.156112    .131209     1.28   0.201     .9255415    1.444123
             |
         imd |
          4  |   .8975387   .0887273    -1.09   0.274     .7394463    1.089431
5 most de..  |   .8545049   .1272412    -1.06   0.291     .6382124      1.1441
             |
tot_adults~h |
          2  |   1.760511   1.122225     0.89   0.375     .5047155    6.140885
          3  |   1.425139   .7465938     0.68   0.499     .5104279    3.979054
             |
   ethnicity |
Asian or ..  |   1.086241   .1451248     0.62   0.536     .8359945    1.411397
      Other  |   .8698456   .1073671    -1.13   0.259     .6829302    1.107919
             |
1.htdiag_o~p |   1.036671   .0840992     0.44   0.657     .8842764     1.21533
1.~y_disease |   .9467482   .0879927    -0.59   0.556     .7890819    1.135918
    1.asthma |   1.116262   .1488549     0.82   0.409     .8595228    1.449689
1.~c_disease |   .9259084   .0842382    -0.85   0.397     .7746875    1.106648
             |
     diabcat |
T1DM, con..  |    1.58605   .3330611     2.20   0.028      1.05092    2.393669
T1DM, unc..  |   1.402601   .7714072     0.62   0.538     .4772954    4.121742
T2DM, con..  |   1.027256   .1143082     0.24   0.809     .8259635    1.277604
T2DM, unc..  |   .9276745   .1881417    -0.37   0.711     .6233952    1.380473
Diabetes,..  |   2.309852   .5236849     3.69   0.000     1.481158    3.602192
             |
cancer_exh~t |
  Last year  |   2.195763   .9015499     1.92   0.055     .9819605     4.90995
2-5 years..  |   .7441449   .3210591    -0.68   0.493     .3194546    1.733428
   5+ years  |   .9495959   .0961996    -0.51   0.610      .778587    1.158165
             |
cancer_hae~t |
  Last year  |   1.894266   .7561109     1.60   0.109     .8663177    4.141948
2-5 years..  |   .9252949   .2945417    -0.24   0.807       .49582    1.726777
   5+ years  |   1.003019   .0984572     0.03   0.976      .827474    1.215804
             |
1.~r_disease |   1.081138   .1016718     0.83   0.407     .8991517    1.299958
1.stroke_d~a |   1.027449   .0976387     0.28   0.776     .8528452    1.237799
1.other_ne~o |   1.079501   .1040924     0.79   0.428      .893603    1.304071
             |
reduced_ki~t |
Stage 3a/..  |   1.462685   .2646943     2.10   0.036     1.025919    2.085394
      1.esrd |    .939789   .0762064    -0.77   0.444     .8016917    1.101675
1.other_tr~t |   .8947554   .0897406    -1.11   0.268     .7350756    1.089122
  1.asplenia |   .8303207   .0795307    -1.94   0.052     .6882007     1.00179
1.ra_sle_p~s |   1.046862   .1040186     0.46   0.645     .8616131    1.271941
1.other_im~o |   .8569246   .0866985    -1.53   0.127     .7027861     1.04487
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod2.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1411.2689
Iteration 1:   log pseudolikelihood = -1395.7791
Iteration 2:   log pseudolikelihood = -1395.0027
Iteration 3:   log pseudolikelihood = -1394.8756
Iteration 4:   log pseudolikelihood = -1394.8307
Iteration 5:   log pseudolikelihood = -1394.8142
Iteration 6:   log pseudolikelihood = -1394.8082
Iteration 7:   log pseudolikelihood = -1394.8059
Iteration 8:   log pseudolikelihood = -1394.8051
Iteration 9:   log pseudolikelihood = -1394.8048
Iteration 10:  log pseudolikelihood = -1394.8047
Iteration 11:  log pseudolikelihood = -1394.8046
Iteration 12:  log pseudolikelihood = -1394.8046
Iteration 13:  log pseudolikelihood = -1394.8046
Iteration 14:  log pseudolikelihood = -1394.8046
Iteration 15:  log pseudolikelihood = -1394.8046
Iteration 16:  log pseudolikelihood = -1394.8046
Iteration 17:  log pseudolikelihood = -1394.8046
Iteration 18:  log pseudolikelihood = -1394.8046
Iteration 19:  log pseudolikelihood = -1394.8046
Iteration 20:  log pseudolikelihood = -1394.8046
Iteration 21:  log pseudolikelihood = -1394.8046
Iteration 22:  log pseudolikelihood = -1394.8046
Iteration 23:  log pseudolikelihood = -1394.8046
Iteration 24:  log pseudolikelihood = -1394.8046
Iteration 25:  log pseudolikelihood = -1394.8046
Iteration 26:  log pseudolikelihood = -1394.8046
Iteration 27:  log pseudolikelihood = -1394.8046
Iteration 28:  log pseudolikelihood = -1394.8046
Iteration 29:  log pseudolikelihood = -1394.8046
Refining estimates:
Iteration 0:   log pseudolikelihood = -1394.8046
Iteration 1:   log pseudolikelihood = -1394.8046
Iteration 2:   log pseudolikelihood = -1394.8046

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          679             Number of obs    =         679
No. of failures      =          367
Time at risk         =        22324
                                                Wald chi2(41)    =     1914.62
Log pseudolikelihood =   -1394.8046             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 446 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8473243   .3006322    -0.47   0.641     .4227094    1.698469
 only 12-18  |   1.069489   .5828684     0.12   0.902     .3675144     3.11228
      mixed  |   .5738044   .1971214    -1.62   0.106     .2926491    1.125073
             |
        age1 |   1.021607   .0522465     0.42   0.676     .9241704    1.129316
        age2 |   .9521178   .2526557    -0.18   0.853     .5659972    1.601648
        age3 |   1.072805    .605238     0.12   0.901     .3550614    3.241441
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.104405   .1168395     0.94   0.348     .8975869    1.358878
             |
   obese4cat |
Obese I ..)  |   .8907767   .1435129    -0.72   0.473     .6495789    1.221535
Obese II..)  |    1.01547   .1940573     0.08   0.936     .6982355    1.476837
Obese II..)  |   1.102913   .2477715     0.44   0.663     .7100962    1.713031
             |
smoke_nomiss |
     Former  |    .804501   .2555754    -0.68   0.494     .4316336     1.49947
    Current  |   .8043154   .1539339    -1.14   0.255     .5527378    1.170398
             |
         imd |
          4  |   1.097476   .1487649     0.69   0.493     .8414204    1.431453
5 most de..  |   1.193234   .2099781     1.00   0.315     .8451546     1.68467
             |
tot_adults~h |
          2  |   3.47e-14   3.43e-14   -31.38   0.000     5.01e-15    2.41e-13
          3  |   1.603725   1.138524     0.67   0.506     .3988784    6.447913
             |
   ethnicity |
Asian or ..  |   1.060242   .2088298     0.30   0.766     .7206904    1.559772
      Other  |   1.071999   .1849736     0.40   0.687     .7643975    1.503382
             |
1.htdiag_o~p |   .8271803   .0970585    -1.62   0.106     .6572386    1.041064
1.~y_disease |   .9424429   .1180831    -0.47   0.636     .7372317    1.204775
    1.asthma |   .9687311   .2011758    -0.15   0.878     .6448144    1.455364
1.~c_disease |   .8905184   .1118825    -0.92   0.356     .6961456    1.139163
             |
     diabcat |
T1DM, con..  |   .9280093   .3560425    -0.19   0.846        .4375     1.96846
T1DM, unc..  |    1.34837   .9918615     0.41   0.684     .3189079    5.701028
T2DM, con..  |   1.123034   .1695753     0.77   0.442     .8353407     1.50981
T2DM, unc..  |   1.470228   .3925918     1.44   0.149     .8711443      2.4813
             |
cancer_exh~t |
  Last year  |   2.434128   .8707317     2.49   0.013     1.207406    4.907199
2-5 years..  |   1.176904   .3352318     0.57   0.567     .6734149    2.056833
   5+ years  |   .9048534   .1358966    -0.67   0.506     .6741233    1.214555
             |
cancer_hae~t |
  Last year  |   .3821615   .3278256    -1.12   0.262     .0711328    2.053167
2-5 years..  |   .5972319   .2572148    -1.20   0.231     .2567727    1.389111
   5+ years  |   1.145383   .1462849     1.06   0.288     .8917392    1.471173
             |
1.~r_disease |   .9814624   .1326978    -0.14   0.890     .7529874    1.279262
1.stroke_d~a |   1.053076   .1446445     0.38   0.707     .8045327    1.378402
1.other_ne~o |   .7722567   .1057545    -1.89   0.059      .590468    1.010013
             |
reduced_ki~t |
Stage 3a/..  |   1.006376   .4241477     0.02   0.988     .4405677    2.298837
      1.esrd |   1.011157   .1142419     0.10   0.922     .8103055    1.261794
1.other_tr~t |   1.017943   .1371109     0.13   0.895      .781757    1.325486
  1.asplenia |    1.08491     .13989     0.63   0.527     .8426325    1.396847
1.ra_sle_p~s |   .9988412   .1634217    -0.01   0.994     .7248202    1.376457
1.other_im~o |   1.113624   .1355836     0.88   0.377     .8772128    1.413749
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          679             Number of obs    =         679
No. of failures      =          367
Time at risk         =        22324
                                                Wald chi2(41)    =     1914.62
Log pseudolikelihood =   -1394.8046             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 446 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8473243   .3006322    -0.47   0.641     .4227094    1.698469
 only 12-18  |   1.069489   .5828684     0.12   0.902     .3675144     3.11228
      mixed  |   .5738044   .1971214    -1.62   0.106     .2926491    1.125073
             |
        age1 |   1.021607   .0522465     0.42   0.676     .9241704    1.129316
        age2 |   .9521178   .2526557    -0.18   0.853     .5659972    1.601648
        age3 |   1.072805    .605238     0.12   0.901     .3550614    3.241441
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.104405   .1168395     0.94   0.348     .8975869    1.358878
             |
   obese4cat |
Obese I ..)  |   .8907767   .1435129    -0.72   0.473     .6495789    1.221535
Obese II..)  |    1.01547   .1940573     0.08   0.936     .6982355    1.476837
Obese II..)  |   1.102913   .2477715     0.44   0.663     .7100962    1.713031
             |
smoke_nomiss |
     Former  |    .804501   .2555754    -0.68   0.494     .4316336     1.49947
    Current  |   .8043154   .1539339    -1.14   0.255     .5527378    1.170398
             |
         imd |
          4  |   1.097476   .1487649     0.69   0.493     .8414204    1.431453
5 most de..  |   1.193234   .2099781     1.00   0.315     .8451546     1.68467
             |
tot_adults~h |
          2  |   3.47e-14   3.43e-14   -31.38   0.000     5.01e-15    2.41e-13
          3  |   1.603725   1.138524     0.67   0.506     .3988784    6.447913
             |
   ethnicity |
Asian or ..  |   1.060242   .2088298     0.30   0.766     .7206904    1.559772
      Other  |   1.071999   .1849736     0.40   0.687     .7643975    1.503382
             |
1.htdiag_o~p |   .8271803   .0970585    -1.62   0.106     .6572386    1.041064
1.~y_disease |   .9424429   .1180831    -0.47   0.636     .7372317    1.204775
    1.asthma |   .9687311   .2011758    -0.15   0.878     .6448144    1.455364
1.~c_disease |   .8905184   .1118825    -0.92   0.356     .6961456    1.139163
             |
     diabcat |
T1DM, con..  |   .9280093   .3560425    -0.19   0.846        .4375     1.96846
T1DM, unc..  |    1.34837   .9918615     0.41   0.684     .3189079    5.701028
T2DM, con..  |   1.123034   .1695753     0.77   0.442     .8353407     1.50981
T2DM, unc..  |   1.470228   .3925918     1.44   0.149     .8711443      2.4813
             |
cancer_exh~t |
  Last year  |   2.434128   .8707317     2.49   0.013     1.207406    4.907199
2-5 years..  |   1.176904   .3352318     0.57   0.567     .6734149    2.056833
   5+ years  |   .9048534   .1358966    -0.67   0.506     .6741233    1.214555
             |
cancer_hae~t |
  Last year  |   .3821615   .3278256    -1.12   0.262     .0711328    2.053167
2-5 years..  |   .5972319   .2572148    -1.20   0.231     .2567727    1.389111
   5+ years  |   1.145383   .1462849     1.06   0.288     .8917392    1.471173
             |
1.~r_disease |   .9814624   .1326978    -0.14   0.890     .7529874    1.279262
1.stroke_d~a |   1.053076   .1446445     0.38   0.707     .8045327    1.378402
1.other_ne~o |   .7722567   .1057545    -1.89   0.059      .590468    1.010013
             |
reduced_ki~t |
Stage 3a/..  |   1.006376   .4241477     0.02   0.988     .4405677    2.298837
      1.esrd |   1.011157   .1142419     0.10   0.922     .8103055    1.261794
1.other_tr~t |   1.017943   .1371109     0.13   0.895      .781757    1.325486
  1.asplenia |    1.08491     .13989     0.63   0.527     .8426325    1.396847
1.ra_sle_p~s |   .9988412   .1634217    -0.01   0.994     .7248202    1.376457
1.other_im~o |   1.113624   .1355836     0.88   0.377     .8772128    1.413749
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod3.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod3.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -531.74712
Iteration 1:   log pseudolikelihood =  -514.6768
Iteration 2:   log pseudolikelihood = -513.91249
Iteration 3:   log pseudolikelihood = -513.89072
Iteration 4:   log pseudolikelihood = -513.88437
Iteration 5:   log pseudolikelihood = -513.88204
Iteration 6:   log pseudolikelihood = -513.88118
Iteration 7:   log pseudolikelihood = -513.88087
Iteration 8:   log pseudolikelihood = -513.88075
Iteration 9:   log pseudolikelihood = -513.88071
Iteration 10:  log pseudolikelihood = -513.88069
Iteration 11:  log pseudolikelihood = -513.88069
Iteration 12:  log pseudolikelihood = -513.88069
Iteration 13:  log pseudolikelihood = -513.88068
Iteration 14:  log pseudolikelihood = -513.88068
Iteration 15:  log pseudolikelihood = -513.88068
Iteration 16:  log pseudolikelihood = -513.88068
Iteration 17:  log pseudolikelihood = -513.88068
Iteration 18:  log pseudolikelihood = -513.88068
Iteration 19:  log pseudolikelihood = -513.88068
Iteration 20:  log pseudolikelihood = -513.88068
Iteration 21:  log pseudolikelihood = -513.88068
Iteration 22:  log pseudolikelihood = -513.88068
Iteration 23:  log pseudolikelihood = -513.88068
Iteration 24:  log pseudolikelihood = -513.88068
Iteration 25:  log pseudolikelihood = -513.88068
Iteration 26:  log pseudolikelihood = -513.88068
Iteration 27:  log pseudolikelihood = -513.88068
Iteration 28:  log pseudolikelihood = -513.88068
Refining estimates:
Iteration 0:   log pseudolikelihood = -513.88068
Iteration 1:   log pseudolikelihood = -513.88068
Iteration 2:   log pseudolikelihood = -513.88068

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          272             Number of obs    =         272
No. of failures      =          191
Time at risk         =         6473
                                                Wald chi2(40)    =      840.56
Log pseudolikelihood =   -513.88068             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 236 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .4913765    .374237    -0.93   0.351     .1104412    2.186238
 only 12-18  |   .8185809   .7224517    -0.23   0.821      .145151    4.616397
      mixed  |   .3831293   .2991271    -1.23   0.219     .0829416    1.769777
             |
        age1 |   1.055018    .082993     0.68   0.496     .9042743    1.230892
        age2 |   .7598237   .3174313    -0.66   0.511     .3350477    1.723134
        age3 |   1.687171   1.490551     0.59   0.554     .2986452    9.531535
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.221767   .2058314     1.19   0.234     .8781851    1.699771
             |
   obese4cat |
Obese I ..)  |    1.19645   .2888355     0.74   0.458     .7454276    1.920363
Obese II..)  |   1.322242   .3627671     1.02   0.309     .7722847    2.263834
Obese II..)  |   1.552934   .5039206     1.36   0.175     .8221321    2.933353
             |
smoke_nomiss |
     Former  |   1.292004   .5799825     0.57   0.568     .5359918    3.114365
    Current  |   .9016136   .2494123    -0.37   0.708     .5242683    1.550556
             |
         imd |
          4  |    .900141   .1571262    -0.60   0.547     .6393329    1.267343
5 most de..  |    2.15868   .5176611     3.21   0.001     1.349169    3.453904
             |
tot_adults~h |
          2  |   21.90487   29.56805     2.29   0.022     1.554374    308.6923
          3  |   7.815049   10.59677     1.52   0.129      .547961    111.4586
             |
   ethnicity |
Asian or ..  |   1.297028   .2925975     1.15   0.249     .8335391    2.018239
      Other  |   1.135615   .2925834     0.49   0.622     .6853694    1.881643
             |
1.htdiag_o~p |   1.112355   .1866703     0.63   0.526     .8005691    1.545568
1.~y_disease |   .7164497   .1520169    -1.57   0.116     .4726907    1.085911
    1.asthma |   1.230026   .3837092     0.66   0.507     .6673904    2.266983
1.~c_disease |   1.198953   .2300737     0.95   0.344     .8231145      1.7464
             |
     diabcat |
T1DM, con..  |   .6004685    .364658    -0.84   0.401     .1826269    1.974311
T1DM, unc..  |   6.25e-14   7.28e-14   -26.08   0.000     6.36e-15    6.14e-13
T2DM, con..  |      1.371    .311282     1.39   0.165     .8785658    2.139442
T2DM, unc..  |   1.339802   .4562542     0.86   0.390     .6873432    2.611605
             |
cancer_exh~t |
2-5 years..  |   2.462449   .9688554     2.29   0.022     1.138834    5.324443
   5+ years  |   1.131561   .2304526     0.61   0.544     .7591425    1.686681
             |
cancer_hae~t |
  Last year  |   2.548293   1.367032     1.74   0.081     .8904759    7.292502
2-5 years..  |   .8282033   .5917805    -0.26   0.792     .2041378    3.360087
   5+ years  |   .8722513   .1921702    -0.62   0.535     .5663814    1.343304
             |
1.~r_disease |   .8754528   .1968257    -0.59   0.554     .5634552    1.360211
1.stroke_d~a |   1.233218   .2442181     1.06   0.290     .8365148    1.818051
1.other_ne~o |    1.05128   .2132797     0.25   0.805     .7063662    1.564613
             |
reduced_ki~t |
Stage 3a/..  |   2.904929   1.142371     2.71   0.007     1.343996    6.278746
      1.esrd |   .6836141    .133895    -1.94   0.052     .4656845     1.00353
1.other_tr~t |    1.07206   .2683792     0.28   0.781     .6563414    1.751091
  1.asplenia |    .839996   .1764672    -0.83   0.407     .5564882    1.267939
1.ra_sle_p~s |   1.357825   .3312627     1.25   0.210      .841744    2.190321
1.other_im~o |   .7333194   .1753009    -1.30   0.194     .4589996    1.171585
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          272             Number of obs    =         272
No. of failures      =          191
Time at risk         =         6473
                                                Wald chi2(40)    =      840.56
Log pseudolikelihood =   -513.88068             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 236 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .4913765    .374237    -0.93   0.351     .1104412    2.186238
 only 12-18  |   .8185809   .7224517    -0.23   0.821      .145151    4.616397
      mixed  |   .3831293   .2991271    -1.23   0.219     .0829416    1.769777
             |
        age1 |   1.055018    .082993     0.68   0.496     .9042743    1.230892
        age2 |   .7598237   .3174313    -0.66   0.511     .3350477    1.723134
        age3 |   1.687171   1.490551     0.59   0.554     .2986452    9.531535
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.221767   .2058314     1.19   0.234     .8781851    1.699771
             |
   obese4cat |
Obese I ..)  |    1.19645   .2888355     0.74   0.458     .7454276    1.920363
Obese II..)  |   1.322242   .3627671     1.02   0.309     .7722847    2.263834
Obese II..)  |   1.552934   .5039206     1.36   0.175     .8221321    2.933353
             |
smoke_nomiss |
     Former  |   1.292004   .5799825     0.57   0.568     .5359918    3.114365
    Current  |   .9016136   .2494123    -0.37   0.708     .5242683    1.550556
             |
         imd |
          4  |    .900141   .1571262    -0.60   0.547     .6393329    1.267343
5 most de..  |    2.15868   .5176611     3.21   0.001     1.349169    3.453904
             |
tot_adults~h |
          2  |   21.90487   29.56805     2.29   0.022     1.554374    308.6923
          3  |   7.815049   10.59677     1.52   0.129      .547961    111.4586
             |
   ethnicity |
Asian or ..  |   1.297028   .2925975     1.15   0.249     .8335391    2.018239
      Other  |   1.135615   .2925834     0.49   0.622     .6853694    1.881643
             |
1.htdiag_o~p |   1.112355   .1866703     0.63   0.526     .8005691    1.545568
1.~y_disease |   .7164497   .1520169    -1.57   0.116     .4726907    1.085911
    1.asthma |   1.230026   .3837092     0.66   0.507     .6673904    2.266983
1.~c_disease |   1.198953   .2300737     0.95   0.344     .8231145      1.7464
             |
     diabcat |
T1DM, con..  |   .6004685    .364658    -0.84   0.401     .1826269    1.974311
T1DM, unc..  |   6.25e-14   7.28e-14   -26.08   0.000     6.36e-15    6.14e-13
T2DM, con..  |      1.371    .311282     1.39   0.165     .8785658    2.139442
T2DM, unc..  |   1.339802   .4562542     0.86   0.390     .6873432    2.611605
             |
cancer_exh~t |
2-5 years..  |   2.462449   .9688554     2.29   0.022     1.138834    5.324443
   5+ years  |   1.131561   .2304526     0.61   0.544     .7591425    1.686681
             |
cancer_hae~t |
  Last year  |   2.548293   1.367032     1.74   0.081     .8904759    7.292502
2-5 years..  |   .8282033   .5917805    -0.26   0.792     .2041378    3.360087
   5+ years  |   .8722513   .1921702    -0.62   0.535     .5663814    1.343304
             |
1.~r_disease |   .8754528   .1968257    -0.59   0.554     .5634552    1.360211
1.stroke_d~a |   1.233218   .2442181     1.06   0.290     .8365148    1.818051
1.other_ne~o |    1.05128   .2132797     0.25   0.805     .7063662    1.564613
             |
reduced_ki~t |
Stage 3a/..  |   2.904929   1.142371     2.71   0.007     1.343996    6.278746
      1.esrd |   .6836141    .133895    -1.94   0.052     .4656845     1.00353
1.other_tr~t |    1.07206   .2683792     0.28   0.781     .6563414    1.751091
  1.asplenia |    .839996   .1764672    -0.83   0.407     .5564882    1.267939
1.ra_sle_p~s |   1.357825   .3312627     1.25   0.210      .841744    2.190321
1.other_im~o |   .7333194   .1753009    -1.30   0.194     .4589996    1.171585
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod4.ster not found)
file ./output/an_multivariate_cox_models_covid_tpp_prob_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_tpp_prob.log
  log type:  text
 closed on:  28 Oct 2021, 11:25:14
-------------------------------------------------------------------------------
