-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death.log
  log type:  text
 opened on:  28 Oct 2021, 11:20:40

. 
. 
. *****************************************************************************
> ********
. 
. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 19. 
. *Age spline model (not adj ethnicity)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id)
 20. if _rc==0{
 21. estimates
 22. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'", replace
 23.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 24. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 25. 
. }
 26. drop cat_time
 27. }
 28. }
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -16404.954
Iteration 1:   log pseudolikelihood = -16386.379
Iteration 2:   log pseudolikelihood = -16386.106
Iteration 3:   log pseudolikelihood = -16386.105
Iteration 4:   log pseudolikelihood = -16386.105
Refining estimates:
Iteration 0:   log pseudolikelihood = -16386.105

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,079             Number of obs    =      16,079
No. of failures      =        2,261
Time at risk         =      1306467
                                                Wald chi2(42)    =       41.04
Log pseudolikelihood =   -16386.105             Prob > chi2      =      0.5131

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.209826   .1944666     1.19   0.236     .8828791    1.657847
 only 12-18  |   1.218266   .2600922     0.92   0.355     .8017076    1.851264
      mixed  |    1.15632    .176206     0.95   0.341     .8577637    1.558794
             |
        age1 |   1.026433   .0083943     3.19   0.001     1.010111    1.043018
        age2 |   .9353044   .0239011    -2.62   0.009     .8896128    .9833427
        age3 |   1.182403   .0857131     2.31   0.021     1.025797    1.362918
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    .961846   .0424204    -0.88   0.378     .8821957    1.048688
             |
   obese4cat |
Obese I ..)  |   .8883269   .0592528    -1.78   0.076     .7794645    1.012393
Obese II..)  |   .9512773    .072302    -0.66   0.511     .8196178    1.104086
Obese II..)  |   1.157665   .0967679     1.75   0.080     .9827246    1.363747
             |
smoke_nomiss |
     Former  |   .9853747   .1435524    -0.10   0.919     .7406205    1.311013
    Current  |   1.020178   .0621813     0.33   0.743     .9053028    1.149629
             |
         imd |
          4  |   1.029561   .0544292     0.55   0.582     .9282227    1.141963
5 most de..  |    1.01228   .0714285     0.17   0.863      .881532     1.16242
             |
tot_adults~h |
          2  |   .8465618   .3139856    -0.45   0.653     .4092157    1.751318
          3  |   .8361045   .2349933    -0.64   0.524     .4819745    1.450431
             |
   ethnicity |
Asian or ..  |   1.027257   .0715306     0.39   0.699     .8962059    1.177472
      Other  |   .9541375   .0653966    -0.68   0.493     .8341988    1.091321
             |
1.htdiag_o~p |    1.05416   .0483274     1.15   0.250     .9635705    1.153265
1.~y_disease |   .9938728   .0525183    -0.12   0.907     .8960898    1.102326
    1.asthma |   .9638648   .0786305    -0.45   0.652     .8214412    1.130982
1.~c_disease |   1.023975   .0527414     0.46   0.646     .9256505    1.132744
             |
     diabcat |
T1DM, con..  |    .802176   .1124587    -1.57   0.116     .6094499    1.055848
T1DM, unc..  |   1.413748   .3547888     1.38   0.168     .8644854    2.311992
T2DM, con..  |   1.069923   .0574401     1.26   0.208     .9630635     1.18864
T2DM, unc..  |   .9416533   .1083024    -0.52   0.601     .7516087    1.179751
Diabetes,..  |   1.073928   .6414757     0.12   0.905      .333072    3.462681
             |
cancer_exh~t |
  Last year  |   1.271181   .4936492     0.62   0.537     .5938168    2.721211
2-5 years..  |   .9782969    .166325    -0.13   0.897     .7010578    1.365173
   5+ years  |   .9615731   .0559914    -0.67   0.501     .8578627    1.077822
             |
cancer_hae~t |
  Last year  |   1.008994   .3938066     0.02   0.982     .4695351     2.16825
2-5 years..  |   1.036012    .168283     0.22   0.828     .7535313    1.424388
   5+ years  |   1.029546   .0523513     0.57   0.567     .9318863    1.137439
             |
1.~r_disease |   .9913324   .0520957    -0.17   0.868      .894309    1.098882
1.stroke_d~a |   .9998929   .0527381    -0.00   0.998     .9016914    1.108789
1.other_ne~o |   .9878839   .0523953    -0.23   0.818     .8903484    1.096104
             |
reduced_ki~t |
Stage 3a/..  |   1.634693   .4638286     1.73   0.083     .9373801    2.850733
      1.esrd |   .9511794   .0421856    -1.13   0.259     .8719889    1.037562
1.other_tr~t |   .9843098   .0501015    -0.31   0.756      .890852    1.087572
  1.asplenia |   .9865523   .0511752    -0.26   0.794      .891181     1.09213
1.ra_sle_p~s |   .9567444   .0470837    -0.90   0.369     .8687729    1.053624
1.other_im~o |   .9934539   .0506491    -0.13   0.898     .8989822    1.097853
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,079             Number of obs    =      16,079
No. of failures      =        2,261
Time at risk         =      1306467
                                                Wald chi2(42)    =       41.04
Log pseudolikelihood =   -16386.105             Prob > chi2      =      0.5131

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.209826   .1944666     1.19   0.236     .8828791    1.657847
 only 12-18  |   1.218266   .2600922     0.92   0.355     .8017076    1.851264
      mixed  |    1.15632    .176206     0.95   0.341     .8577637    1.558794
             |
        age1 |   1.026433   .0083943     3.19   0.001     1.010111    1.043018
        age2 |   .9353044   .0239011    -2.62   0.009     .8896128    .9833427
        age3 |   1.182403   .0857131     2.31   0.021     1.025797    1.362918
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    .961846   .0424204    -0.88   0.378     .8821957    1.048688
             |
   obese4cat |
Obese I ..)  |   .8883269   .0592528    -1.78   0.076     .7794645    1.012393
Obese II..)  |   .9512773    .072302    -0.66   0.511     .8196178    1.104086
Obese II..)  |   1.157665   .0967679     1.75   0.080     .9827246    1.363747
             |
smoke_nomiss |
     Former  |   .9853747   .1435524    -0.10   0.919     .7406205    1.311013
    Current  |   1.020178   .0621813     0.33   0.743     .9053028    1.149629
             |
         imd |
          4  |   1.029561   .0544292     0.55   0.582     .9282227    1.141963
5 most de..  |    1.01228   .0714285     0.17   0.863      .881532     1.16242
             |
tot_adults~h |
          2  |   .8465618   .3139856    -0.45   0.653     .4092157    1.751318
          3  |   .8361045   .2349933    -0.64   0.524     .4819745    1.450431
             |
   ethnicity |
Asian or ..  |   1.027257   .0715306     0.39   0.699     .8962059    1.177472
      Other  |   .9541375   .0653966    -0.68   0.493     .8341988    1.091321
             |
1.htdiag_o~p |    1.05416   .0483274     1.15   0.250     .9635705    1.153265
1.~y_disease |   .9938728   .0525183    -0.12   0.907     .8960898    1.102326
    1.asthma |   .9638648   .0786305    -0.45   0.652     .8214412    1.130982
1.~c_disease |   1.023975   .0527414     0.46   0.646     .9256505    1.132744
             |
     diabcat |
T1DM, con..  |    .802176   .1124587    -1.57   0.116     .6094499    1.055848
T1DM, unc..  |   1.413748   .3547888     1.38   0.168     .8644854    2.311992
T2DM, con..  |   1.069923   .0574401     1.26   0.208     .9630635     1.18864
T2DM, unc..  |   .9416533   .1083024    -0.52   0.601     .7516087    1.179751
Diabetes,..  |   1.073928   .6414757     0.12   0.905      .333072    3.462681
             |
cancer_exh~t |
  Last year  |   1.271181   .4936492     0.62   0.537     .5938168    2.721211
2-5 years..  |   .9782969    .166325    -0.13   0.897     .7010578    1.365173
   5+ years  |   .9615731   .0559914    -0.67   0.501     .8578627    1.077822
             |
cancer_hae~t |
  Last year  |   1.008994   .3938066     0.02   0.982     .4695351     2.16825
2-5 years..  |   1.036012    .168283     0.22   0.828     .7535313    1.424388
   5+ years  |   1.029546   .0523513     0.57   0.567     .9318863    1.137439
             |
1.~r_disease |   .9913324   .0520957    -0.17   0.868      .894309    1.098882
1.stroke_d~a |   .9998929   .0527381    -0.00   0.998     .9016914    1.108789
1.other_ne~o |   .9878839   .0523953    -0.23   0.818     .8903484    1.096104
             |
reduced_ki~t |
Stage 3a/..  |   1.634693   .4638286     1.73   0.083     .9373801    2.850733
      1.esrd |   .9511794   .0421856    -1.13   0.259     .8719889    1.037562
1.other_tr~t |   .9843098   .0501015    -0.31   0.756      .890852    1.087572
  1.asplenia |   .9865523   .0511752    -0.26   0.794      .891181     1.09213
1.ra_sle_p~s |   .9567444   .0470837    -0.90   0.369     .8687729    1.053624
1.other_im~o |   .9934539   .0506491    -0.13   0.898     .8989822    1.097853
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod0.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -11378.174
Iteration 1:   log pseudolikelihood =   -11353.6
Iteration 2:   log pseudolikelihood =  -11352.29
Iteration 3:   log pseudolikelihood = -11351.897
Iteration 4:   log pseudolikelihood = -11351.753
Iteration 5:   log pseudolikelihood =   -11351.7
Iteration 6:   log pseudolikelihood =  -11351.68
Iteration 7:   log pseudolikelihood = -11351.673
Iteration 8:   log pseudolikelihood =  -11351.67
Iteration 9:   log pseudolikelihood = -11351.669
Iteration 10:  log pseudolikelihood = -11351.669
Iteration 11:  log pseudolikelihood = -11351.669
Iteration 12:  log pseudolikelihood = -11351.669
Iteration 13:  log pseudolikelihood = -11351.669
Iteration 14:  log pseudolikelihood = -11351.669
Iteration 15:  log pseudolikelihood = -11351.669
Iteration 16:  log pseudolikelihood = -11351.669
Iteration 17:  log pseudolikelihood = -11351.669
Iteration 18:  log pseudolikelihood = -11351.669
Iteration 19:  log pseudolikelihood = -11351.669
Iteration 20:  log pseudolikelihood = -11351.669
Iteration 21:  log pseudolikelihood = -11351.669
Iteration 22:  log pseudolikelihood = -11351.669
Iteration 23:  log pseudolikelihood = -11351.669
Iteration 24:  log pseudolikelihood = -11351.669
Iteration 25:  log pseudolikelihood = -11351.669
Iteration 26:  log pseudolikelihood = -11351.669
Iteration 27:  log pseudolikelihood = -11351.669
Iteration 28:  log pseudolikelihood = -11351.669
Iteration 29:  log pseudolikelihood = -11351.669
Refining estimates:
Iteration 0:   log pseudolikelihood = -11351.669
Iteration 1:   log pseudolikelihood = -11351.669

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,280             Number of obs    =      12,280
No. of failures      =        1,627
Time at risk         =       753835
                                                Wald chi2(42)    =    25818.61
Log pseudolikelihood =   -11351.669             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,084 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.285066   .2437538     1.32   0.186     .8860693     1.86373
 only 12-18  |   1.154322   .2900664     0.57   0.568     .7053928    1.888961
      mixed  |   1.243214   .2177114     1.24   0.214     .8820309    1.752299
             |
        age1 |   .9912933   .0085213    -1.02   0.309     .9747319    1.008136
        age2 |   1.007679   .0275462     0.28   0.780     .9551102    1.063141
        age3 |   .9856437     .07757    -0.18   0.854     .8447546     1.15003
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.053708   .0517485     1.07   0.287     .9570116    1.160175
             |
   obese4cat |
Obese I ..)  |   .9097755   .0715033    -1.20   0.229     .7798921     1.06129
Obese II..)  |   .9294623   .0841009    -0.81   0.419     .7784168    1.109817
Obese II..)  |   .9927272   .1084079    -0.07   0.947     .8014509    1.229654
             |
smoke_nomiss |
     Former  |   1.014126    .175084     0.08   0.935     .7229959    1.422485
    Current  |   .9923768   .0744551    -0.10   0.919     .8566698    1.149581
             |
         imd |
          4  |   1.009549   .0649708     0.15   0.883     .8899124    1.145269
5 most de..  |   1.071582   .0876045     0.85   0.398     .9129307    1.257805
             |
tot_adults~h |
          2  |   1.073409   .4563004     0.17   0.868     .4665774    2.469485
          3  |   .7417941   .2651243    -0.84   0.403     .3681763    1.494552
             |
   ethnicity |
Asian or ..  |   1.136486   .0879055     1.65   0.098     .9766184    1.322523
      Other  |   1.056668   .0905343     0.64   0.520     .8933229    1.249881
             |
1.htdiag_o~p |   .9154449   .0477699    -1.69   0.090     .8264462    1.014028
1.~y_disease |   .9595191   .0636213    -0.62   0.533     .8425862     1.09268
    1.asthma |   1.148482   .1022557     1.55   0.120     .9645777     1.36745
1.~c_disease |   1.019861    .065941     0.30   0.761     .8984728    1.157649
             |
     diabcat |
T1DM, con..  |   .7943564   .1334971    -1.37   0.171     .5714326    1.104246
T1DM, unc..  |    1.35979   .4153209     1.01   0.314     .7472903    2.474312
T2DM, con..  |   .9699956   .0624832    -0.47   0.636     .8549462    1.100527
T2DM, unc..  |   .8782616   .1145248    -1.00   0.319      .680186    1.134018
Diabetes,..  |   1.520459   .8677216     0.73   0.463     .4968173    4.653213
             |
cancer_exh~t |
  Last year  |   9.47e-14   1.83e-14  -155.18   0.000     6.48e-14    1.38e-13
2-5 years..  |   .8346936   .1760427    -0.86   0.392      .552081    1.261977
   5+ years  |   1.027442   .0659369     0.42   0.673     .9060053    1.165155
             |
cancer_hae~t |
  Last year  |   1.154224   .4390866     0.38   0.706     .5476191    2.432774
2-5 years..  |    .562847    .147029    -2.20   0.028     .3373155    .9391704
   5+ years  |   1.021315    .065152     0.33   0.741     .9012796    1.157337
             |
1.~r_disease |   1.049363   .0673621     0.75   0.453     .9253036    1.190055
1.stroke_d~a |   .9720134   .0604904    -0.46   0.648     .8603997    1.098106
1.other_ne~o |   .9053354   .0568942    -1.58   0.114     .8004188    1.024004
             |
reduced_ki~t |
Stage 3a/..  |   1.208849   .4780474     0.48   0.631      .556876     2.62413
      1.esrd |   .8957529   .0456562    -2.16   0.031     .8105928    .9898598
1.other_tr~t |   .9796201   .0624532    -0.32   0.747     .8645528    1.110002
  1.asplenia |    1.01026   .0635612     0.16   0.871     .8930574    1.142844
1.ra_sle_p~s |   1.035721   .0629712     0.58   0.564     .9193702    1.166797
1.other_im~o |   1.028756   .0617317     0.47   0.637     .9146084    1.157151
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,280             Number of obs    =      12,280
No. of failures      =        1,627
Time at risk         =       753835
                                                Wald chi2(42)    =    25818.61
Log pseudolikelihood =   -11351.669             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,084 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.285066   .2437538     1.32   0.186     .8860693     1.86373
 only 12-18  |   1.154322   .2900664     0.57   0.568     .7053928    1.888961
      mixed  |   1.243214   .2177114     1.24   0.214     .8820309    1.752299
             |
        age1 |   .9912933   .0085213    -1.02   0.309     .9747319    1.008136
        age2 |   1.007679   .0275462     0.28   0.780     .9551102    1.063141
        age3 |   .9856437     .07757    -0.18   0.854     .8447546     1.15003
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.053708   .0517485     1.07   0.287     .9570116    1.160175
             |
   obese4cat |
Obese I ..)  |   .9097755   .0715033    -1.20   0.229     .7798921     1.06129
Obese II..)  |   .9294623   .0841009    -0.81   0.419     .7784168    1.109817
Obese II..)  |   .9927272   .1084079    -0.07   0.947     .8014509    1.229654
             |
smoke_nomiss |
     Former  |   1.014126    .175084     0.08   0.935     .7229959    1.422485
    Current  |   .9923768   .0744551    -0.10   0.919     .8566698    1.149581
             |
         imd |
          4  |   1.009549   .0649708     0.15   0.883     .8899124    1.145269
5 most de..  |   1.071582   .0876045     0.85   0.398     .9129307    1.257805
             |
tot_adults~h |
          2  |   1.073409   .4563004     0.17   0.868     .4665774    2.469485
          3  |   .7417941   .2651243    -0.84   0.403     .3681763    1.494552
             |
   ethnicity |
Asian or ..  |   1.136486   .0879055     1.65   0.098     .9766184    1.322523
      Other  |   1.056668   .0905343     0.64   0.520     .8933229    1.249881
             |
1.htdiag_o~p |   .9154449   .0477699    -1.69   0.090     .8264462    1.014028
1.~y_disease |   .9595191   .0636213    -0.62   0.533     .8425862     1.09268
    1.asthma |   1.148482   .1022557     1.55   0.120     .9645777     1.36745
1.~c_disease |   1.019861    .065941     0.30   0.761     .8984728    1.157649
             |
     diabcat |
T1DM, con..  |   .7943564   .1334971    -1.37   0.171     .5714326    1.104246
T1DM, unc..  |    1.35979   .4153209     1.01   0.314     .7472903    2.474312
T2DM, con..  |   .9699956   .0624832    -0.47   0.636     .8549462    1.100527
T2DM, unc..  |   .8782616   .1145248    -1.00   0.319      .680186    1.134018
Diabetes,..  |   1.520459   .8677216     0.73   0.463     .4968173    4.653213
             |
cancer_exh~t |
  Last year  |   9.47e-14   1.83e-14  -155.18   0.000     6.48e-14    1.38e-13
2-5 years..  |   .8346936   .1760427    -0.86   0.392      .552081    1.261977
   5+ years  |   1.027442   .0659369     0.42   0.673     .9060053    1.165155
             |
cancer_hae~t |
  Last year  |   1.154224   .4390866     0.38   0.706     .5476191    2.432774
2-5 years..  |    .562847    .147029    -2.20   0.028     .3373155    .9391704
   5+ years  |   1.021315    .065152     0.33   0.741     .9012796    1.157337
             |
1.~r_disease |   1.049363   .0673621     0.75   0.453     .9253036    1.190055
1.stroke_d~a |   .9720134   .0604904    -0.46   0.648     .8603997    1.098106
1.other_ne~o |   .9053354   .0568942    -1.58   0.114     .8004188    1.024004
             |
reduced_ki~t |
Stage 3a/..  |   1.208849   .4780474     0.48   0.631      .556876     2.62413
      1.esrd |   .8957529   .0456562    -2.16   0.031     .8105928    .9898598
1.other_tr~t |   .9796201   .0624532    -0.32   0.747     .8645528    1.110002
  1.asplenia |    1.01026   .0635612     0.16   0.871     .8930574    1.142844
1.ra_sle_p~s |   1.035721   .0629712     0.58   0.564     .9193702    1.166797
1.other_im~o |   1.028756   .0617317     0.47   0.637     .9146084    1.157151
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod1.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -10562.599
Iteration 1:   log pseudolikelihood = -10537.743
Iteration 2:   log pseudolikelihood = -10537.027
Iteration 3:   log pseudolikelihood = -10536.867
Iteration 4:   log pseudolikelihood = -10536.808
Iteration 5:   log pseudolikelihood = -10536.786
Iteration 6:   log pseudolikelihood = -10536.778
Iteration 7:   log pseudolikelihood = -10536.775
Iteration 8:   log pseudolikelihood = -10536.774
Iteration 9:   log pseudolikelihood = -10536.774
Iteration 10:  log pseudolikelihood = -10536.774
Iteration 11:  log pseudolikelihood = -10536.774
Iteration 12:  log pseudolikelihood = -10536.774
Iteration 13:  log pseudolikelihood = -10536.774
Iteration 14:  log pseudolikelihood = -10536.774
Iteration 15:  log pseudolikelihood = -10536.774
Iteration 16:  log pseudolikelihood = -10536.774
Iteration 17:  log pseudolikelihood = -10536.774
Iteration 18:  log pseudolikelihood = -10536.774
Iteration 19:  log pseudolikelihood = -10536.774
Iteration 20:  log pseudolikelihood = -10536.774
Iteration 21:  log pseudolikelihood = -10536.774
Iteration 22:  log pseudolikelihood = -10536.774
Iteration 23:  log pseudolikelihood = -10536.774
Iteration 24:  log pseudolikelihood = -10536.774
Iteration 25:  log pseudolikelihood = -10536.774
Iteration 26:  log pseudolikelihood = -10536.774
Iteration 27:  log pseudolikelihood = -10536.774
Iteration 28:  log pseudolikelihood = -10536.774
Refining estimates:
Iteration 0:   log pseudolikelihood = -10536.774
Iteration 1:   log pseudolikelihood = -10536.774
Iteration 2:   log pseudolikelihood = -10536.774

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,516             Number of obs    =       9,516
No. of failures      =        1,574
Time at risk         =       503315
                                                Wald chi2(42)    =     7859.61
Log pseudolikelihood =   -10536.774             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,045 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.338567   .2602249     1.50   0.134     .9144537    1.959379
 only 12-18  |   1.455811   .3709795     1.47   0.141      .883479     2.39891
      mixed  |   1.277879   .2314312     1.35   0.176     .8960502    1.822415
             |
        age1 |   .9928675   .0092423    -0.77   0.442     .9749172    1.011148
        age2 |   .9930461   .0295244    -0.23   0.814      .936833    1.052632
        age3 |   1.045902   .0891053     0.53   0.598     .8850613    1.235973
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9650051   .0480608    -0.72   0.474     .8752591    1.063953
             |
   obese4cat |
Obese I ..)  |   .9321204   .0720415    -0.91   0.363     .8010959    1.084575
Obese II..)  |   1.007278   .0907965     0.08   0.936     .8441543    1.201925
Obese II..)  |   .9148526   .1054972    -0.77   0.440     .7297833    1.146855
             |
smoke_nomiss |
     Former  |   1.029225   .1865016     0.16   0.874      .721552    1.468091
    Current  |   1.026333   .0797927     0.33   0.738     .8812743    1.195268
             |
         imd |
          4  |   .9593324   .0619257    -0.64   0.520     .8453243    1.088717
5 most de..  |   1.050323   .0912087     0.57   0.572     .8859428    1.245203
             |
tot_adults~h |
          2  |   .5968621   .2712017    -1.14   0.256      .244966    1.454261
          3  |   .5951878   .1892614    -1.63   0.103     .3191419    1.110003
             |
   ethnicity |
Asian or ..  |   .9742661   .0869911    -0.29   0.770     .8178522    1.160594
      Other  |   1.021364   .0904108     0.24   0.811     .8586817    1.214866
             |
1.htdiag_o~p |     1.0771   .0586541     1.36   0.173     .9680623    1.198419
1.~y_disease |   .9795209   .0634071    -0.32   0.749     .8628059    1.112024
    1.asthma |   1.078591   .0955285     0.85   0.393     .9067085    1.283057
1.~c_disease |   1.102097   .0672743     1.59   0.111     .9778243    1.242164
             |
     diabcat |
T1DM, con..  |   1.213656   .1704952     1.38   0.168     .9215484    1.598354
T1DM, unc..  |   .5685852   .2874481    -1.12   0.264     .2110916    1.531511
T2DM, con..  |   1.087994    .075211     1.22   0.222     .9501329    1.245857
T2DM, unc..  |   1.253818   .1468938     1.93   0.054     .9965752    1.577462
Diabetes,..  |   9.52e-14   3.34e-14   -85.39   0.000     4.78e-14    1.89e-13
             |
cancer_exh~t |
  Last year  |   1.504633   .5586685     1.10   0.271     .7267423    3.115163
2-5 years..  |   .7533373   .1779267    -1.20   0.230      .474186    1.196824
   5+ years  |   .9538963   .0660197    -0.68   0.495     .8328926     1.09248
             |
cancer_hae~t |
  Last year  |   .5181349   .3037472    -1.12   0.262     .1642258    1.634723
2-5 years..  |   1.312394   .2138568     1.67   0.095     .9535852    1.806213
   5+ years  |   1.007449   .0645788     0.12   0.908     .8885055    1.142316
             |
1.~r_disease |   .8665025   .0564171    -2.20   0.028     .7626915    .9844434
1.stroke_d~a |   .9263809   .0598921    -1.18   0.237     .8161275    1.051529
1.other_ne~o |   1.076981   .0675631     1.18   0.237     .9523773    1.217888
             |
reduced_ki~t |
Stage 3a/..  |   .6044311   .3565163    -0.85   0.393     .1902287    1.920515
      1.esrd |   .9869274   .0539144    -0.24   0.810     .8867175    1.098462
1.other_tr~t |   1.095348   .0670097     1.49   0.137     .9715802    1.234883
  1.asplenia |   .9781495   .0610758    -0.35   0.723     .8654782    1.105489
1.ra_sle_p~s |   1.025255   .0637665     0.40   0.688     .9075925    1.158172
1.other_im~o |   1.072169   .0708227     1.05   0.291     .9419695    1.220365
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,516             Number of obs    =       9,516
No. of failures      =        1,574
Time at risk         =       503315
                                                Wald chi2(42)    =     7859.61
Log pseudolikelihood =   -10536.774             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,045 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.338567   .2602249     1.50   0.134     .9144537    1.959379
 only 12-18  |   1.455811   .3709795     1.47   0.141      .883479     2.39891
      mixed  |   1.277879   .2314312     1.35   0.176     .8960502    1.822415
             |
        age1 |   .9928675   .0092423    -0.77   0.442     .9749172    1.011148
        age2 |   .9930461   .0295244    -0.23   0.814      .936833    1.052632
        age3 |   1.045902   .0891053     0.53   0.598     .8850613    1.235973
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9650051   .0480608    -0.72   0.474     .8752591    1.063953
             |
   obese4cat |
Obese I ..)  |   .9321204   .0720415    -0.91   0.363     .8010959    1.084575
Obese II..)  |   1.007278   .0907965     0.08   0.936     .8441543    1.201925
Obese II..)  |   .9148526   .1054972    -0.77   0.440     .7297833    1.146855
             |
smoke_nomiss |
     Former  |   1.029225   .1865016     0.16   0.874      .721552    1.468091
    Current  |   1.026333   .0797927     0.33   0.738     .8812743    1.195268
             |
         imd |
          4  |   .9593324   .0619257    -0.64   0.520     .8453243    1.088717
5 most de..  |   1.050323   .0912087     0.57   0.572     .8859428    1.245203
             |
tot_adults~h |
          2  |   .5968621   .2712017    -1.14   0.256      .244966    1.454261
          3  |   .5951878   .1892614    -1.63   0.103     .3191419    1.110003
             |
   ethnicity |
Asian or ..  |   .9742661   .0869911    -0.29   0.770     .8178522    1.160594
      Other  |   1.021364   .0904108     0.24   0.811     .8586817    1.214866
             |
1.htdiag_o~p |     1.0771   .0586541     1.36   0.173     .9680623    1.198419
1.~y_disease |   .9795209   .0634071    -0.32   0.749     .8628059    1.112024
    1.asthma |   1.078591   .0955285     0.85   0.393     .9067085    1.283057
1.~c_disease |   1.102097   .0672743     1.59   0.111     .9778243    1.242164
             |
     diabcat |
T1DM, con..  |   1.213656   .1704952     1.38   0.168     .9215484    1.598354
T1DM, unc..  |   .5685852   .2874481    -1.12   0.264     .2110916    1.531511
T2DM, con..  |   1.087994    .075211     1.22   0.222     .9501329    1.245857
T2DM, unc..  |   1.253818   .1468938     1.93   0.054     .9965752    1.577462
Diabetes,..  |   9.52e-14   3.34e-14   -85.39   0.000     4.78e-14    1.89e-13
             |
cancer_exh~t |
  Last year  |   1.504633   .5586685     1.10   0.271     .7267423    3.115163
2-5 years..  |   .7533373   .1779267    -1.20   0.230      .474186    1.196824
   5+ years  |   .9538963   .0660197    -0.68   0.495     .8328926     1.09248
             |
cancer_hae~t |
  Last year  |   .5181349   .3037472    -1.12   0.262     .1642258    1.634723
2-5 years..  |   1.312394   .2138568     1.67   0.095     .9535852    1.806213
   5+ years  |   1.007449   .0645788     0.12   0.908     .8885055    1.142316
             |
1.~r_disease |   .8665025   .0564171    -2.20   0.028     .7626915    .9844434
1.stroke_d~a |   .9263809   .0598921    -1.18   0.237     .8161275    1.051529
1.other_ne~o |   1.076981   .0675631     1.18   0.237     .9523773    1.217888
             |
reduced_ki~t |
Stage 3a/..  |   .6044311   .3565163    -0.85   0.393     .1902287    1.920515
      1.esrd |   .9869274   .0539144    -0.24   0.810     .8867175    1.098462
1.other_tr~t |   1.095348   .0670097     1.49   0.137     .9715802    1.234883
  1.asplenia |   .9781495   .0610758    -0.35   0.723     .8654782    1.105489
1.ra_sle_p~s |   1.025255   .0637665     0.40   0.688     .9075925    1.158172
1.other_im~o |   1.072169   .0708227     1.05   0.291     .9419695    1.220365
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod2.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -7630.6889
Iteration 1:   log pseudolikelihood = -7609.2586
Iteration 2:   log pseudolikelihood = -7602.9151
Iteration 3:   log pseudolikelihood = -7602.7552
Iteration 4:   log pseudolikelihood = -7602.7497
Iteration 5:   log pseudolikelihood = -7602.7496
Refining estimates:
Iteration 0:   log pseudolikelihood = -7602.7496

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        6,896             Number of obs    =       6,896
No. of failures      =        1,196
Time at risk         =       284743
                                                Wald chi2(42)    =       65.80
Log pseudolikelihood =   -7602.7496             Prob > chi2      =      0.0109

                         (Std. Err. adjusted for 993 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.033927   .2203871     0.16   0.876     .6808501    1.570102
 only 12-18  |   1.503409    .400057     1.53   0.125      .892427    2.532689
      mixed  |   1.032392   .2010652     0.16   0.870     .7048028    1.512244
             |
        age1 |   .9978164   .0105145    -0.21   0.836     .9774197    1.018639
        age2 |   .9807247   .0332099    -0.57   0.565     .9177476    1.048023
        age3 |   1.084379   .1055115     0.83   0.405     .8961029    1.312212
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.143446   .0660474     2.32   0.020     1.021055    1.280509
             |
   obese4cat |
Obese I ..)  |   1.160076   .0974369     1.77   0.077      .983994    1.367667
Obese II..)  |    1.02085   .1113858     0.19   0.850     .8243025    1.264263
Obese II..)  |   1.267979   .1499369     2.01   0.045     1.005677    1.598695
             |
smoke_nomiss |
     Former  |   .8974171   .2026323    -0.48   0.632     .5764972    1.396984
    Current  |   1.053988   .0939095     0.59   0.555     .8851041    1.255097
             |
         imd |
          4  |   1.100636   .0755675     1.40   0.163     .9620597    1.259174
5 most de..  |    1.18648    .107696     1.88   0.060       .99311    1.417501
             |
tot_adults~h |
          2  |   .4636623   .2372062    -1.50   0.133     .1701114    1.263776
          3  |   .6315456   .2160072    -1.34   0.179     .3230493    1.234641
             |
   ethnicity |
Asian or ..  |   1.055577   .1045961     0.55   0.585     .8692505    1.281842
      Other  |   1.026332   .1022272     0.26   0.794     .8443148    1.247588
             |
1.htdiag_o~p |   1.098347   .0657922     1.57   0.117     .9766782    1.235172
1.~y_disease |   1.072212   .0762637     0.98   0.327     .9326888    1.232606
    1.asthma |   .9836324   .1061615    -0.15   0.878     .7960939     1.21535
1.~c_disease |   .9817885   .0740238    -0.24   0.807     .8469153    1.138141
             |
     diabcat |
T1DM, con..  |   .8405908   .1603165    -0.91   0.363     .5784215    1.221588
T1DM, unc..  |   .5683106    .315807    -1.02   0.309     .1912396     1.68886
T2DM, con..  |   1.049988   .0823814     0.62   0.534     .9003251    1.224529
T2DM, unc..  |   1.320253    .178306     2.06   0.040     1.013208    1.720346
Diabetes,..  |   4.941748   2.211361     3.57   0.000     2.055796    11.87903
             |
cancer_exh~t |
  Last year  |   1.316754   .6298131     0.58   0.565      .515666    3.362332
2-5 years..  |   .7798788   .1912405    -1.01   0.311     .4822774    1.261122
   5+ years  |   1.032927   .0834468     0.40   0.688      .881665    1.210139
             |
cancer_hae~t |
  Last year  |   .2022285   .2018862    -1.60   0.109     .0285813     1.43088
2-5 years..  |   1.019847   .2436003     0.08   0.934     .6385832    1.628744
   5+ years  |   1.066582   .0775544     0.89   0.375     .9249124     1.22995
             |
1.~r_disease |   1.083882   .0769724     1.13   0.257     .9430475    1.245749
1.stroke_d~a |   .9278535   .0716299    -0.97   0.332     .7975667    1.079423
1.other_ne~o |    1.07255   .0753327     1.00   0.319     .9346125    1.230845
             |
reduced_ki~t |
Stage 3a/..  |   1.532101   .7154836     0.91   0.361     .6134515    3.826435
      1.esrd |   .9916047   .0623059    -0.13   0.893     .8767075     1.12156
1.other_tr~t |   1.026107   .0733634     0.36   0.718     .8919378    1.180459
  1.asplenia |   1.025005    .075597     0.33   0.738     .8870488    1.184417
1.ra_sle_p~s |   .9837471   .0688333    -0.23   0.815     .8576783    1.128347
1.other_im~o |   1.001798   .0727243     0.02   0.980     .8689369    1.154974
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        6,896             Number of obs    =       6,896
No. of failures      =        1,196
Time at risk         =       284743
                                                Wald chi2(42)    =       65.80
Log pseudolikelihood =   -7602.7496             Prob > chi2      =      0.0109

                         (Std. Err. adjusted for 993 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.033927   .2203871     0.16   0.876     .6808501    1.570102
 only 12-18  |   1.503409    .400057     1.53   0.125      .892427    2.532689
      mixed  |   1.032392   .2010652     0.16   0.870     .7048028    1.512244
             |
        age1 |   .9978164   .0105145    -0.21   0.836     .9774197    1.018639
        age2 |   .9807247   .0332099    -0.57   0.565     .9177476    1.048023
        age3 |   1.084379   .1055115     0.83   0.405     .8961029    1.312212
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.143446   .0660474     2.32   0.020     1.021055    1.280509
             |
   obese4cat |
Obese I ..)  |   1.160076   .0974369     1.77   0.077      .983994    1.367667
Obese II..)  |    1.02085   .1113858     0.19   0.850     .8243025    1.264263
Obese II..)  |   1.267979   .1499369     2.01   0.045     1.005677    1.598695
             |
smoke_nomiss |
     Former  |   .8974171   .2026323    -0.48   0.632     .5764972    1.396984
    Current  |   1.053988   .0939095     0.59   0.555     .8851041    1.255097
             |
         imd |
          4  |   1.100636   .0755675     1.40   0.163     .9620597    1.259174
5 most de..  |    1.18648    .107696     1.88   0.060       .99311    1.417501
             |
tot_adults~h |
          2  |   .4636623   .2372062    -1.50   0.133     .1701114    1.263776
          3  |   .6315456   .2160072    -1.34   0.179     .3230493    1.234641
             |
   ethnicity |
Asian or ..  |   1.055577   .1045961     0.55   0.585     .8692505    1.281842
      Other  |   1.026332   .1022272     0.26   0.794     .8443148    1.247588
             |
1.htdiag_o~p |   1.098347   .0657922     1.57   0.117     .9766782    1.235172
1.~y_disease |   1.072212   .0762637     0.98   0.327     .9326888    1.232606
    1.asthma |   .9836324   .1061615    -0.15   0.878     .7960939     1.21535
1.~c_disease |   .9817885   .0740238    -0.24   0.807     .8469153    1.138141
             |
     diabcat |
T1DM, con..  |   .8405908   .1603165    -0.91   0.363     .5784215    1.221588
T1DM, unc..  |   .5683106    .315807    -1.02   0.309     .1912396     1.68886
T2DM, con..  |   1.049988   .0823814     0.62   0.534     .9003251    1.224529
T2DM, unc..  |   1.320253    .178306     2.06   0.040     1.013208    1.720346
Diabetes,..  |   4.941748   2.211361     3.57   0.000     2.055796    11.87903
             |
cancer_exh~t |
  Last year  |   1.316754   .6298131     0.58   0.565      .515666    3.362332
2-5 years..  |   .7798788   .1912405    -1.01   0.311     .4822774    1.261122
   5+ years  |   1.032927   .0834468     0.40   0.688      .881665    1.210139
             |
cancer_hae~t |
  Last year  |   .2022285   .2018862    -1.60   0.109     .0285813     1.43088
2-5 years..  |   1.019847   .2436003     0.08   0.934     .6385832    1.628744
   5+ years  |   1.066582   .0775544     0.89   0.375     .9249124     1.22995
             |
1.~r_disease |   1.083882   .0769724     1.13   0.257     .9430475    1.245749
1.stroke_d~a |   .9278535   .0716299    -0.97   0.332     .7975667    1.079423
1.other_ne~o |    1.07255   .0753327     1.00   0.319     .9346125    1.230845
             |
reduced_ki~t |
Stage 3a/..  |   1.532101   .7154836     0.91   0.361     .6134515    3.826435
      1.esrd |   .9916047   .0623059    -0.13   0.893     .8767075     1.12156
1.other_tr~t |   1.026107   .0733634     0.36   0.718     .8919378    1.180459
  1.asplenia |   1.025005    .075597     0.33   0.738     .8870488    1.184417
1.ra_sle_p~s |   .9837471   .0688333    -0.23   0.815     .8576783    1.128347
1.other_im~o |   1.001798   .0727243     0.02   0.980     .8689369    1.154974
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod3.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod3.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -5236.2066
Iteration 1:   log pseudolikelihood = -5216.7868
Iteration 2:   log pseudolikelihood =  -5216.001
Iteration 3:   log pseudolikelihood = -5215.9339
Iteration 4:   log pseudolikelihood = -5215.9134
Iteration 5:   log pseudolikelihood = -5215.9058
Iteration 6:   log pseudolikelihood =  -5215.903
Iteration 7:   log pseudolikelihood =  -5215.902
Iteration 8:   log pseudolikelihood = -5215.9016
Iteration 9:   log pseudolikelihood = -5215.9015
Iteration 10:  log pseudolikelihood = -5215.9014
Iteration 11:  log pseudolikelihood = -5215.9014
Iteration 12:  log pseudolikelihood = -5215.9014
Iteration 13:  log pseudolikelihood = -5215.9014
Iteration 14:  log pseudolikelihood = -5215.9014
Iteration 15:  log pseudolikelihood = -5215.9014
Iteration 16:  log pseudolikelihood = -5215.9014
Iteration 17:  log pseudolikelihood = -5215.9014
Iteration 18:  log pseudolikelihood = -5215.9014
Iteration 19:  log pseudolikelihood = -5215.9014
Iteration 20:  log pseudolikelihood = -5215.9014
Iteration 21:  log pseudolikelihood = -5215.9014
Iteration 22:  log pseudolikelihood = -5215.9014
Iteration 23:  log pseudolikelihood = -5215.9014
Iteration 24:  log pseudolikelihood = -5215.9014
Iteration 25:  log pseudolikelihood = -5215.9014
Iteration 26:  log pseudolikelihood = -5215.9014
Iteration 27:  log pseudolikelihood = -5215.9014
Iteration 28:  log pseudolikelihood = -5215.9014
Iteration 29:  log pseudolikelihood = -5215.9014
Refining estimates:
Iteration 0:   log pseudolikelihood = -5215.9014
Iteration 1:   log pseudolikelihood = -5215.9014

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,916             Number of obs    =       4,916
No. of failures      =          867
Time at risk         =       151399
                                                Wald chi2(42)    =     3487.81
Log pseudolikelihood =   -5215.9014             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 932 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.015047   .2640831     0.06   0.954     .6095799    1.690215
 only 12-18  |   1.151011   .4642391     0.35   0.727     .5221109    2.537441
      mixed  |   1.043811   .2530687     0.18   0.860     .6490091    1.678777
             |
        age1 |   .9834962   .0129529    -1.26   0.206     .9584339    1.009214
        age2 |   1.045442   .0424748     1.09   0.274     .9654215    1.132096
        age3 |   .9210561     .10531    -0.72   0.472     .7361443    1.152416
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9750917   .0659671    -0.37   0.709     .8540038    1.113348
             |
   obese4cat |
Obese I ..)  |   1.092199   .1037664     0.93   0.353     .9066334    1.315745
Obese II..)  |   .8707477   .1156205    -1.04   0.297     .6712236    1.129581
Obese II..)  |   .9784015   .1472273    -0.15   0.885     .7285017    1.314025
             |
smoke_nomiss |
     Former  |   .9981073   .2352178    -0.01   0.994     .6288974    1.584071
    Current  |   1.113743   .1116883     1.07   0.283     .9150074    1.355642
             |
         imd |
          4  |   .9780339   .0826594    -0.26   0.793     .8287315    1.154234
5 most de..  |    1.02764    .118288     0.24   0.813      .820091    1.287715
             |
tot_adults~h |
          2  |   1.038147   .6213661     0.06   0.950     .3212077    3.355304
          3  |   .7150644   .3532959    -0.68   0.497     .2715108    1.883229
             |
   ethnicity |
Asian or ..  |   .9003432   .1066165    -0.89   0.375     .7138563    1.135548
      Other  |   .9200672   .1075431    -0.71   0.476      .731688    1.156946
             |
1.htdiag_o~p |   1.058252   .0768679     0.78   0.436     .9178267    1.220162
1.~y_disease |   1.022144   .0829545     0.27   0.787     .8718283    1.198377
    1.asthma |   .8996589   .1249162    -0.76   0.446     .6853144    1.181043
1.~c_disease |   .9696311   .0871821    -0.34   0.732     .8129666    1.156486
             |
     diabcat |
T1DM, con..  |   .9165701   .1905941    -0.42   0.675     .6097678    1.377739
T1DM, unc..  |   .8781731     .49204    -0.23   0.817     .2928548    2.633346
T2DM, con..  |   1.018804   .0911541     0.21   0.835      .854933    1.214085
T2DM, unc..  |   1.059157   .1935079     0.31   0.753     .7403646    1.515216
Diabetes,..  |   1.12e-13   5.95e-14   -56.22   0.000     3.97e-14    3.17e-13
             |
cancer_exh~t |
  Last year  |   .4925122   .4865159    -0.72   0.473     .0710524    3.413935
2-5 years..  |   1.016122   .2577636     0.06   0.950     .6180429    1.670604
   5+ years  |   1.013704   .0895877     0.15   0.878     .8524818    1.205418
             |
cancer_hae~t |
  Last year  |    2.34324   .8386589     2.38   0.017     1.161895    4.725705
2-5 years..  |   1.387188   .3315165     1.37   0.171     .8683833    2.215947
   5+ years  |   1.155677   .1009562     1.66   0.098     .9738194    1.371497
             |
1.~r_disease |   .9937634   .0863201    -0.07   0.943      .838197    1.178202
1.stroke_d~a |   .8412598   .0751174    -1.94   0.053     .7061956    1.002156
1.other_ne~o |   1.053412   .0862349     0.64   0.525     .8972573    1.236744
             |
reduced_ki~t |
Stage 3a/..  |   .6544722    .453801    -0.61   0.541     .1681439    2.547425
      1.esrd |   1.047077   .0713535     0.68   0.500     .9161635    1.196696
1.other_tr~t |   .9957669   .0883661    -0.05   0.962     .8367979    1.184936
  1.asplenia |   1.020259   .0902388     0.23   0.821     .8578759     1.21338
1.ra_sle_p~s |   1.028258    .085867     0.33   0.739     .8730127     1.21111
1.other_im~o |   1.256874   .0996013     2.89   0.004     1.076064    1.468066
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,916             Number of obs    =       4,916
No. of failures      =          867
Time at risk         =       151399
                                                Wald chi2(42)    =     3487.81
Log pseudolikelihood =   -5215.9014             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 932 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.015047   .2640831     0.06   0.954     .6095799    1.690215
 only 12-18  |   1.151011   .4642391     0.35   0.727     .5221109    2.537441
      mixed  |   1.043811   .2530687     0.18   0.860     .6490091    1.678777
             |
        age1 |   .9834962   .0129529    -1.26   0.206     .9584339    1.009214
        age2 |   1.045442   .0424748     1.09   0.274     .9654215    1.132096
        age3 |   .9210561     .10531    -0.72   0.472     .7361443    1.152416
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9750917   .0659671    -0.37   0.709     .8540038    1.113348
             |
   obese4cat |
Obese I ..)  |   1.092199   .1037664     0.93   0.353     .9066334    1.315745
Obese II..)  |   .8707477   .1156205    -1.04   0.297     .6712236    1.129581
Obese II..)  |   .9784015   .1472273    -0.15   0.885     .7285017    1.314025
             |
smoke_nomiss |
     Former  |   .9981073   .2352178    -0.01   0.994     .6288974    1.584071
    Current  |   1.113743   .1116883     1.07   0.283     .9150074    1.355642
             |
         imd |
          4  |   .9780339   .0826594    -0.26   0.793     .8287315    1.154234
5 most de..  |    1.02764    .118288     0.24   0.813      .820091    1.287715
             |
tot_adults~h |
          2  |   1.038147   .6213661     0.06   0.950     .3212077    3.355304
          3  |   .7150644   .3532959    -0.68   0.497     .2715108    1.883229
             |
   ethnicity |
Asian or ..  |   .9003432   .1066165    -0.89   0.375     .7138563    1.135548
      Other  |   .9200672   .1075431    -0.71   0.476      .731688    1.156946
             |
1.htdiag_o~p |   1.058252   .0768679     0.78   0.436     .9178267    1.220162
1.~y_disease |   1.022144   .0829545     0.27   0.787     .8718283    1.198377
    1.asthma |   .8996589   .1249162    -0.76   0.446     .6853144    1.181043
1.~c_disease |   .9696311   .0871821    -0.34   0.732     .8129666    1.156486
             |
     diabcat |
T1DM, con..  |   .9165701   .1905941    -0.42   0.675     .6097678    1.377739
T1DM, unc..  |   .8781731     .49204    -0.23   0.817     .2928548    2.633346
T2DM, con..  |   1.018804   .0911541     0.21   0.835      .854933    1.214085
T2DM, unc..  |   1.059157   .1935079     0.31   0.753     .7403646    1.515216
Diabetes,..  |   1.12e-13   5.95e-14   -56.22   0.000     3.97e-14    3.17e-13
             |
cancer_exh~t |
  Last year  |   .4925122   .4865159    -0.72   0.473     .0710524    3.413935
2-5 years..  |   1.016122   .2577636     0.06   0.950     .6180429    1.670604
   5+ years  |   1.013704   .0895877     0.15   0.878     .8524818    1.205418
             |
cancer_hae~t |
  Last year  |    2.34324   .8386589     2.38   0.017     1.161895    4.725705
2-5 years..  |   1.387188   .3315165     1.37   0.171     .8683833    2.215947
   5+ years  |   1.155677   .1009562     1.66   0.098     .9738194    1.371497
             |
1.~r_disease |   .9937634   .0863201    -0.07   0.943      .838197    1.178202
1.stroke_d~a |   .8412598   .0751174    -1.94   0.053     .7061956    1.002156
1.other_ne~o |   1.053412   .0862349     0.64   0.525     .8972573    1.236744
             |
reduced_ki~t |
Stage 3a/..  |   .6544722    .453801    -0.61   0.541     .1681439    2.547425
      1.esrd |   1.047077   .0713535     0.68   0.500     .9161635    1.196696
1.other_tr~t |   .9957669   .0883661    -0.05   0.962     .8367979    1.184936
  1.asplenia |   1.020259   .0902388     0.23   0.821     .8578759     1.21338
1.ra_sle_p~s |   1.028258    .085867     0.33   0.739     .8730127     1.21111
1.other_im~o |   1.256874   .0996013     2.89   0.004     1.076064    1.468066
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod4.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod4.ster saved
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood =  -4040.444
Iteration 1:   log pseudolikelihood = -4016.3812
Iteration 2:   log pseudolikelihood = -4015.7587
Iteration 3:   log pseudolikelihood = -4015.6898
Iteration 4:   log pseudolikelihood = -4015.6697
Iteration 5:   log pseudolikelihood = -4015.6624
Iteration 6:   log pseudolikelihood = -4015.6597
Iteration 7:   log pseudolikelihood = -4015.6587
Iteration 8:   log pseudolikelihood = -4015.6583
Iteration 9:   log pseudolikelihood = -4015.6582
Iteration 10:  log pseudolikelihood = -4015.6581
Iteration 11:  log pseudolikelihood = -4015.6581
Iteration 12:  log pseudolikelihood = -4015.6581
Iteration 13:  log pseudolikelihood = -4015.6581
Iteration 14:  log pseudolikelihood = -4015.6581
Iteration 15:  log pseudolikelihood = -4015.6581
Iteration 16:  log pseudolikelihood = -4015.6581
Iteration 17:  log pseudolikelihood = -4015.6581
Iteration 18:  log pseudolikelihood = -4015.6581
Iteration 19:  log pseudolikelihood = -4015.6581
Iteration 20:  log pseudolikelihood = -4015.6581
Iteration 21:  log pseudolikelihood = -4015.6581
Iteration 22:  log pseudolikelihood = -4015.6581
Iteration 23:  log pseudolikelihood = -4015.6581
Iteration 24:  log pseudolikelihood = -4015.6581
Iteration 25:  log pseudolikelihood = -4015.6581
Iteration 26:  log pseudolikelihood = -4015.6581
Iteration 27:  log pseudolikelihood = -4015.6581
Refining estimates:
Iteration 0:   log pseudolikelihood = -4015.6581
Iteration 1:   log pseudolikelihood = -4015.6581
Iteration 2:   log pseudolikelihood = -4015.6581

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,549             Number of obs    =       4,549
No. of failures      =          674
Time at risk         =       366077
                                                Wald chi2(42)    =     3470.56
Log pseudolikelihood =   -4015.6581             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8683168   .2473999    -0.50   0.620     .4967693    1.517755
 only 12-18  |   .5551277   .2137793    -1.53   0.126     .2609731    1.180837
      mixed  |   .8169607   .2225814    -0.74   0.458     .4789507    1.393515
             |
        age1 |   .9782886   .0343887    -0.62   0.532     .9131574    1.048065
        age2 |   1.077411    .203495     0.39   0.693     .7440665    1.560096
        age3 |   .8828357   .3581527    -0.31   0.759     .3986215    1.955236
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.066403    .085986     0.80   0.425     .9105155    1.248979
             |
   obese4cat |
Obese I ..)  |   .8593806   .0982926    -1.32   0.185     .6867971    1.075332
Obese II..)  |   1.011209   .1326537     0.08   0.932     .7819473    1.307689
Obese II..)  |   1.123632   .1872259     0.70   0.484     .8105727      1.5576
             |
smoke_nomiss |
     Former  |    1.29073   .3241965     1.02   0.310     .7889269     2.11171
    Current  |   .9838322    .117101    -0.14   0.891     .7791238    1.242326
             |
         imd |
          4  |   .8800056   .0913733    -1.23   0.218     .7179645    1.078619
5 most de..  |   .9911365    .133767    -0.07   0.947     .7607685    1.291262
             |
tot_adults~h |
          2  |   .3724297   .4040055    -0.91   0.363     .0444299     3.12186
          3  |   1.570903   .7996366     0.89   0.375     .5792453    4.260263
             |
   ethnicity |
Asian or ..  |   .9879111    .129223    -0.09   0.926     .7644992    1.276611
      Other  |    1.00413   .1298613     0.03   0.975     .7793031    1.293819
             |
1.htdiag_o~p |   1.047828   .0905503     0.54   0.589     .8845687    1.241219
1.~y_disease |   .9037262   .0879574    -1.04   0.298      .746778     1.09366
    1.asthma |    .961915   .1377132    -0.27   0.786      .726564    1.273502
1.~c_disease |   .8609751   .0873377    -1.48   0.140     .7057393    1.050357
             |
     diabcat |
T1DM, con..  |    1.50428   .2983156     2.06   0.039     1.019826    2.218868
T1DM, unc..  |   1.496657    .603894     1.00   0.318     .6786822    3.300487
T2DM, con..  |   .8821254   .0959392    -1.15   0.249     .7127782    1.091707
T2DM, unc..  |   .8932887   .1850358    -0.54   0.586     .5952152    1.340632
Diabetes,..  |   2.44e-13   1.25e-13   -56.93   0.000     8.99e-14    6.64e-13
             |
cancer_exh~t |
  Last year  |   1.568477   .6959893     1.01   0.310     .6573087    3.742714
2-5 years..  |   .8914071   .2943066    -0.35   0.728     .4667064    1.702584
   5+ years  |   1.187865   .1121186     1.82   0.068     .9872457    1.429254
             |
cancer_hae~t |
  Last year  |   .9493195   .4604068    -0.11   0.915      .366937    2.456028
2-5 years..  |   .5643623   .2334236    -1.38   0.167     .2508973    1.269463
   5+ years  |   .7556254   .0823201    -2.57   0.010     .6103432    .9354898
             |
1.~r_disease |   1.267281   .1155427     2.60   0.009     1.059902    1.515236
1.stroke_d~a |   .9982481    .094965    -0.02   0.985     .8284424    1.202859
1.other_ne~o |   1.057733   .0961273     0.62   0.537     .8851529    1.263961
             |
reduced_ki~t |
Stage 3a/..  |   1.166462   .2253603     0.80   0.425     .7987646    1.703424
      1.esrd |   1.096958   .0885478     1.15   0.252       .93644    1.284991
1.other_tr~t |   1.089812   .1048465     0.89   0.371     .9025281    1.315959
  1.asplenia |   1.184598   .1132791     1.77   0.076     .9821404    1.428791
1.ra_sle_p~s |   1.087572   .1001688     0.91   0.362      .907945    1.302735
1.other_im~o |   1.091583   .1029255     0.93   0.353     .9073957    1.313157
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,549             Number of obs    =       4,549
No. of failures      =          674
Time at risk         =       366077
                                                Wald chi2(42)    =     3470.56
Log pseudolikelihood =   -4015.6581             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8683168   .2473999    -0.50   0.620     .4967693    1.517755
 only 12-18  |   .5551277   .2137793    -1.53   0.126     .2609731    1.180837
      mixed  |   .8169607   .2225814    -0.74   0.458     .4789507    1.393515
             |
        age1 |   .9782886   .0343887    -0.62   0.532     .9131574    1.048065
        age2 |   1.077411    .203495     0.39   0.693     .7440665    1.560096
        age3 |   .8828357   .3581527    -0.31   0.759     .3986215    1.955236
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.066403    .085986     0.80   0.425     .9105155    1.248979
             |
   obese4cat |
Obese I ..)  |   .8593806   .0982926    -1.32   0.185     .6867971    1.075332
Obese II..)  |   1.011209   .1326537     0.08   0.932     .7819473    1.307689
Obese II..)  |   1.123632   .1872259     0.70   0.484     .8105727      1.5576
             |
smoke_nomiss |
     Former  |    1.29073   .3241965     1.02   0.310     .7889269     2.11171
    Current  |   .9838322    .117101    -0.14   0.891     .7791238    1.242326
             |
         imd |
          4  |   .8800056   .0913733    -1.23   0.218     .7179645    1.078619
5 most de..  |   .9911365    .133767    -0.07   0.947     .7607685    1.291262
             |
tot_adults~h |
          2  |   .3724297   .4040055    -0.91   0.363     .0444299     3.12186
          3  |   1.570903   .7996366     0.89   0.375     .5792453    4.260263
             |
   ethnicity |
Asian or ..  |   .9879111    .129223    -0.09   0.926     .7644992    1.276611
      Other  |    1.00413   .1298613     0.03   0.975     .7793031    1.293819
             |
1.htdiag_o~p |   1.047828   .0905503     0.54   0.589     .8845687    1.241219
1.~y_disease |   .9037262   .0879574    -1.04   0.298      .746778     1.09366
    1.asthma |    .961915   .1377132    -0.27   0.786      .726564    1.273502
1.~c_disease |   .8609751   .0873377    -1.48   0.140     .7057393    1.050357
             |
     diabcat |
T1DM, con..  |    1.50428   .2983156     2.06   0.039     1.019826    2.218868
T1DM, unc..  |   1.496657    .603894     1.00   0.318     .6786822    3.300487
T2DM, con..  |   .8821254   .0959392    -1.15   0.249     .7127782    1.091707
T2DM, unc..  |   .8932887   .1850358    -0.54   0.586     .5952152    1.340632
Diabetes,..  |   2.44e-13   1.25e-13   -56.93   0.000     8.99e-14    6.64e-13
             |
cancer_exh~t |
  Last year  |   1.568477   .6959893     1.01   0.310     .6573087    3.742714
2-5 years..  |   .8914071   .2943066    -0.35   0.728     .4667064    1.702584
   5+ years  |   1.187865   .1121186     1.82   0.068     .9872457    1.429254
             |
cancer_hae~t |
  Last year  |   .9493195   .4604068    -0.11   0.915      .366937    2.456028
2-5 years..  |   .5643623   .2334236    -1.38   0.167     .2508973    1.269463
   5+ years  |   .7556254   .0823201    -2.57   0.010     .6103432    .9354898
             |
1.~r_disease |   1.267281   .1155427     2.60   0.009     1.059902    1.515236
1.stroke_d~a |   .9982481    .094965    -0.02   0.985     .8284424    1.202859
1.other_ne~o |   1.057733   .0961273     0.62   0.537     .8851529    1.263961
             |
reduced_ki~t |
Stage 3a/..  |   1.166462   .2253603     0.80   0.425     .7987646    1.703424
      1.esrd |   1.096958   .0885478     1.15   0.252       .93644    1.284991
1.other_tr~t |   1.089812   .1048465     0.89   0.371     .9025281    1.315959
  1.asplenia |   1.184598   .1132791     1.77   0.076     .9821404    1.428791
1.ra_sle_p~s |   1.087572   .1001688     0.91   0.362      .907945    1.302735
1.other_im~o |   1.091583   .1029255     0.93   0.353     .9073957    1.313157
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod0.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod0.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2637.5026
Iteration 1:   log pseudolikelihood = -2621.6081
Iteration 2:   log pseudolikelihood = -2617.7948
Iteration 3:   log pseudolikelihood = -2617.4183
Iteration 4:   log pseudolikelihood = -2617.3988
Iteration 5:   log pseudolikelihood = -2617.3938
Iteration 6:   log pseudolikelihood =  -2617.392
Iteration 7:   log pseudolikelihood = -2617.3913
Iteration 8:   log pseudolikelihood = -2617.3911
Iteration 9:   log pseudolikelihood =  -2617.391
Iteration 10:  log pseudolikelihood = -2617.3909
Iteration 11:  log pseudolikelihood = -2617.3909
Iteration 12:  log pseudolikelihood = -2617.3909
Iteration 13:  log pseudolikelihood = -2617.3909
Iteration 14:  log pseudolikelihood = -2617.3909
Iteration 15:  log pseudolikelihood = -2617.3909
Iteration 16:  log pseudolikelihood = -2617.3909
Iteration 17:  log pseudolikelihood = -2617.3909
Iteration 18:  log pseudolikelihood = -2617.3909
Iteration 19:  log pseudolikelihood = -2617.3909
Iteration 20:  log pseudolikelihood = -2617.3909
Iteration 21:  log pseudolikelihood = -2617.3909
Iteration 22:  log pseudolikelihood = -2617.3909
Iteration 23:  log pseudolikelihood = -2617.3909
Iteration 24:  log pseudolikelihood = -2617.3909
Iteration 25:  log pseudolikelihood = -2617.3909
Iteration 26:  log pseudolikelihood = -2617.3909
Iteration 27:  log pseudolikelihood = -2617.3909
Refining estimates:
Iteration 0:   log pseudolikelihood = -2617.3909
Iteration 1:   log pseudolikelihood = -2617.3909
Iteration 2:   log pseudolikelihood = -2617.3909
Iteration 3:   log pseudolikelihood = -2617.3909

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,427             Number of obs    =       3,427
No. of failures      =          461
Time at risk         =       209290
                                                Wald chi2(42)    =     2894.17
Log pseudolikelihood =   -2617.3909             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 886 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.190985   .4005265     0.52   0.603     .6160963    2.302312
 only 12-18  |   2.062474   .8556765     1.74   0.081     .9146254    4.650867
      mixed  |   1.406255   .4421648     1.08   0.278      .759317    2.604384
             |
        age1 |   .9204235   .0402366    -1.90   0.058     .8448454    1.002763
        age2 |   1.486323   .3409065     1.73   0.084      .948156    2.329951
        age3 |   .4640341   .2273632    -1.57   0.117     .1776176     1.21231
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    .995966   .0921414    -0.04   0.965      .830799    1.193969
             |
   obese4cat |
Obese I ..)  |   .7831899   .1091738    -1.75   0.080     .5959541    1.029251
Obese II..)  |   .9489225   .1684084    -0.30   0.768     .6701395    1.343681
Obese II..)  |   .8580057   .1873423    -0.70   0.483     .5592854    1.316275
             |
smoke_nomiss |
     Former  |    .843132   .3072532    -0.47   0.640     .4127639    1.722224
    Current  |   .9153571   .1464418    -0.55   0.580     .6689791    1.252473
             |
         imd |
          4  |   .9539009   .1122133    -0.40   0.688     .7574798    1.201256
5 most de..  |   1.027026   .1644361     0.17   0.868     .7504062    1.405615
             |
tot_adults~h |
          2  |    .312733    .367697    -0.99   0.323     .0312155    3.133122
          3  |   .8664287   .4913625    -0.25   0.800     .2851057    2.633054
             |
   ethnicity |
Asian or ..  |   1.130433   .1742864     0.80   0.426     .8356213    1.529256
      Other  |   .9913205   .1484239    -0.06   0.954     .7392124     1.32941
             |
1.htdiag_o~p |   1.032847   .1040051     0.32   0.748     .8478562    1.258201
1.~y_disease |   1.027319   .1215928     0.23   0.820      .814625    1.295547
    1.asthma |   .9768096   .1719928    -0.13   0.894     .6917254    1.379387
1.~c_disease |   .9493562   .1139128    -0.43   0.665     .7504018    1.201059
             |
     diabcat |
T1DM, con..  |   1.210194   .3453138     0.67   0.504     .6917916    2.117068
T1DM, unc..  |   .8206267   .5807822    -0.28   0.780     .2049862    3.285236
T2DM, con..  |   .9848369    .124995    -0.12   0.904     .7679452    1.262985
T2DM, unc..  |   .8269525   .2249938    -0.70   0.485     .4851647    1.409522
Diabetes,..  |   8.31e-14   4.95e-14   -50.59   0.000     2.59e-14    2.67e-13
             |
cancer_exh~t |
  Last year  |   3.425972    1.45179     2.91   0.004     1.493064    7.861203
2-5 years..  |     .71787   .3301027    -0.72   0.471     .2914959    1.767906
   5+ years  |   1.151693   .1386893     1.17   0.241     .9095643    1.458278
             |
cancer_hae~t |
  Last year  |   1.385398   .8633323     0.52   0.601     .4084461    4.699093
2-5 years..  |   1.449403   .4807838     1.12   0.263     .7565465    2.776787
   5+ years  |    1.19631   .1337779     1.60   0.109     .9608543    1.489463
             |
1.~r_disease |    .958961   .1132124    -0.35   0.723     .7608697    1.208625
1.stroke_d~a |   .8968069   .1095766    -0.89   0.373      .705821    1.139471
1.other_ne~o |   1.287862   .1417632     2.30   0.022      1.03794    1.597962
             |
reduced_ki~t |
Stage 3a/..  |   .8788867   .2225074    -0.51   0.610     .5350995    1.443548
      1.esrd |   1.030058   .1032779     0.30   0.768     .8462849    1.253737
1.other_tr~t |   .9450191   .1204593    -0.44   0.657     .7361054    1.213225
  1.asplenia |   .8612658   .1093301    -1.18   0.239     .6715597    1.104561
1.ra_sle_p~s |   .9763439   .1165692    -0.20   0.841     .7726357     1.23376
1.other_im~o |   1.085795   .1261198     0.71   0.479     .8647231    1.363385
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,427             Number of obs    =       3,427
No. of failures      =          461
Time at risk         =       209290
                                                Wald chi2(42)    =     2894.17
Log pseudolikelihood =   -2617.3909             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 886 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.190985   .4005265     0.52   0.603     .6160963    2.302312
 only 12-18  |   2.062474   .8556765     1.74   0.081     .9146254    4.650867
      mixed  |   1.406255   .4421648     1.08   0.278      .759317    2.604384
             |
        age1 |   .9204235   .0402366    -1.90   0.058     .8448454    1.002763
        age2 |   1.486323   .3409065     1.73   0.084      .948156    2.329951
        age3 |   .4640341   .2273632    -1.57   0.117     .1776176     1.21231
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    .995966   .0921414    -0.04   0.965      .830799    1.193969
             |
   obese4cat |
Obese I ..)  |   .7831899   .1091738    -1.75   0.080     .5959541    1.029251
Obese II..)  |   .9489225   .1684084    -0.30   0.768     .6701395    1.343681
Obese II..)  |   .8580057   .1873423    -0.70   0.483     .5592854    1.316275
             |
smoke_nomiss |
     Former  |    .843132   .3072532    -0.47   0.640     .4127639    1.722224
    Current  |   .9153571   .1464418    -0.55   0.580     .6689791    1.252473
             |
         imd |
          4  |   .9539009   .1122133    -0.40   0.688     .7574798    1.201256
5 most de..  |   1.027026   .1644361     0.17   0.868     .7504062    1.405615
             |
tot_adults~h |
          2  |    .312733    .367697    -0.99   0.323     .0312155    3.133122
          3  |   .8664287   .4913625    -0.25   0.800     .2851057    2.633054
             |
   ethnicity |
Asian or ..  |   1.130433   .1742864     0.80   0.426     .8356213    1.529256
      Other  |   .9913205   .1484239    -0.06   0.954     .7392124     1.32941
             |
1.htdiag_o~p |   1.032847   .1040051     0.32   0.748     .8478562    1.258201
1.~y_disease |   1.027319   .1215928     0.23   0.820      .814625    1.295547
    1.asthma |   .9768096   .1719928    -0.13   0.894     .6917254    1.379387
1.~c_disease |   .9493562   .1139128    -0.43   0.665     .7504018    1.201059
             |
     diabcat |
T1DM, con..  |   1.210194   .3453138     0.67   0.504     .6917916    2.117068
T1DM, unc..  |   .8206267   .5807822    -0.28   0.780     .2049862    3.285236
T2DM, con..  |   .9848369    .124995    -0.12   0.904     .7679452    1.262985
T2DM, unc..  |   .8269525   .2249938    -0.70   0.485     .4851647    1.409522
Diabetes,..  |   8.31e-14   4.95e-14   -50.59   0.000     2.59e-14    2.67e-13
             |
cancer_exh~t |
  Last year  |   3.425972    1.45179     2.91   0.004     1.493064    7.861203
2-5 years..  |     .71787   .3301027    -0.72   0.471     .2914959    1.767906
   5+ years  |   1.151693   .1386893     1.17   0.241     .9095643    1.458278
             |
cancer_hae~t |
  Last year  |   1.385398   .8633323     0.52   0.601     .4084461    4.699093
2-5 years..  |   1.449403   .4807838     1.12   0.263     .7565465    2.776787
   5+ years  |    1.19631   .1337779     1.60   0.109     .9608543    1.489463
             |
1.~r_disease |    .958961   .1132124    -0.35   0.723     .7608697    1.208625
1.stroke_d~a |   .8968069   .1095766    -0.89   0.373      .705821    1.139471
1.other_ne~o |   1.287862   .1417632     2.30   0.022      1.03794    1.597962
             |
reduced_ki~t |
Stage 3a/..  |   .8788867   .2225074    -0.51   0.610     .5350995    1.443548
      1.esrd |   1.030058   .1032779     0.30   0.768     .8462849    1.253737
1.other_tr~t |   .9450191   .1204593    -0.44   0.657     .7361054    1.213225
  1.asplenia |   .8612658   .1093301    -1.18   0.239     .6715597    1.104561
1.ra_sle_p~s |   .9763439   .1165692    -0.20   0.841     .7726357     1.23376
1.other_im~o |   1.085795   .1261198     0.71   0.479     .8647231    1.363385
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod1.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod1.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2380.2034
Iteration 1:   log pseudolikelihood = -2364.7427
Iteration 2:   log pseudolikelihood =  -2364.135
Iteration 3:   log pseudolikelihood = -2364.0836
Iteration 4:   log pseudolikelihood = -2364.0675
Iteration 5:   log pseudolikelihood = -2364.0616
Iteration 6:   log pseudolikelihood = -2364.0594
Iteration 7:   log pseudolikelihood = -2364.0586
Iteration 8:   log pseudolikelihood = -2364.0583
Iteration 9:   log pseudolikelihood = -2364.0582
Iteration 10:  log pseudolikelihood = -2364.0581
Iteration 11:  log pseudolikelihood = -2364.0581
Iteration 12:  log pseudolikelihood = -2364.0581
Iteration 13:  log pseudolikelihood = -2364.0581
Iteration 14:  log pseudolikelihood = -2364.0581
Iteration 15:  log pseudolikelihood = -2364.0581
Iteration 16:  log pseudolikelihood = -2364.0581
Iteration 17:  log pseudolikelihood = -2364.0581
Iteration 18:  log pseudolikelihood = -2364.0581
Iteration 19:  log pseudolikelihood = -2364.0581
Iteration 20:  log pseudolikelihood = -2364.0581
Iteration 21:  log pseudolikelihood = -2364.0581
Iteration 22:  log pseudolikelihood = -2364.0581
Iteration 23:  log pseudolikelihood = -2364.0581
Iteration 24:  log pseudolikelihood = -2364.0581
Iteration 25:  log pseudolikelihood = -2364.0581
Iteration 26:  log pseudolikelihood = -2364.0581
Iteration 27:  log pseudolikelihood = -2364.0581
Iteration 28:  log pseudolikelihood = -2364.0581
Iteration 29:  log pseudolikelihood = -2364.0581
Iteration 30:  log pseudolikelihood = -2364.0581
Iteration 31:  log pseudolikelihood = -2364.0581
Iteration 32:  log pseudolikelihood = -2364.0581
Refining estimates:
Iteration 0:   log pseudolikelihood = -2364.0581
Iteration 1:   log pseudolikelihood = -2364.0581

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,658             Number of obs    =       2,658
No. of failures      =          438
Time at risk         =       140582
                                                Wald chi2(42)    =     3400.76
Log pseudolikelihood =   -2364.0581             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 836 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .713255   .2099783    -1.15   0.251     .4005492    1.270088
 only 12-18  |   .4283882   .2127454    -1.71   0.088      .161851    1.133861
      mixed  |   .7448266   .1996001    -1.10   0.272     .4405026    1.259395
             |
        age1 |    1.06129   .0538228     1.17   0.241     .9608723    1.172201
        age2 |   .7552185   .1962234    -1.08   0.280     .4538481    1.256709
        age3 |    1.75768   .9697491     1.02   0.307     .5960933    5.182814
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9112685   .0924882    -0.92   0.360     .7468865    1.111829
             |
   obese4cat |
Obese I ..)  |   1.082169   .1503169     0.57   0.570     .8242524     1.42079
Obese II..)  |   1.072578   .1922644     0.39   0.696     .7548265     1.52409
Obese II..)  |   1.193713   .2567299     0.82   0.410     .7831292     1.81956
             |
smoke_nomiss |
     Former  |    .627076   .2584149    -1.13   0.257     .2796045    1.406359
    Current  |   1.273416   .1778973     1.73   0.084     .9684043    1.674495
             |
         imd |
          4  |    1.00039    .121236     0.00   0.997     .7888848    1.268602
5 most de..  |   1.032437     .16949     0.19   0.846     .7483864    1.424298
             |
tot_adults~h |
          2  |   .6015315   .4200319    -0.73   0.467     .1530697    2.363892
          3  |   .5240426   .2703474    -1.25   0.210     .1906522    1.440428
             |
   ethnicity |
Asian or ..  |   1.203979   .1888192     1.18   0.237     .8853712    1.637239
      Other  |   .8528962   .1434286    -0.95   0.344     .6134124    1.185877
             |
1.htdiag_o~p |   1.268955   .1340121     2.26   0.024     1.031697    1.560774
1.~y_disease |    .991404   .1162537    -0.07   0.941     .7878387    1.247567
    1.asthma |   1.012741   .1754955     0.07   0.942     .7211001    1.422332
1.~c_disease |   1.009554     .11513     0.08   0.934     .8073427    1.262411
             |
     diabcat |
T1DM, con..  |   1.211606   .3405166     0.68   0.495     .6984493    2.101783
T1DM, unc..  |   1.015422   .5934003     0.03   0.979     .3230089    3.192114
T2DM, con..  |    .971507    .130451    -0.22   0.830     .7467052    1.263987
T2DM, unc..  |   .8457771   .2238115    -0.63   0.527      .503511    1.420702
Diabetes,..  |   4.39e-15   2.69e-15   -53.94   0.000     1.32e-15    1.46e-14
             |
cancer_exh~t |
  Last year  |   .7586442   .8131112    -0.26   0.797     .0928377    6.199431
2-5 years..  |   1.033855    .391651     0.09   0.930     .4920424    2.172285
   5+ years  |   1.059097    .135623     0.45   0.654     .8240144    1.361246
             |
cancer_hae~t |
  Last year  |   .8940029   .6284525    -0.16   0.873     .2254105    3.545713
2-5 years..  |    1.05616   .4240014     0.14   0.892     .4808507    2.319794
   5+ years  |   .9328769   .1163467    -0.56   0.577     .7305737      1.1912
             |
1.~r_disease |   .9751469   .1219729    -0.20   0.841     .7631333    1.246062
1.stroke_d~a |   .8875494    .104739    -1.01   0.312     .7042761    1.118516
1.other_ne~o |   1.125251   .1355015     0.98   0.327     .8886867    1.424788
             |
reduced_ki~t |
Stage 3a/..  |   1.128084   .2493464     0.55   0.586     .7314691    1.739751
      1.esrd |   .9673714   .1015102    -0.32   0.752      .787541    1.188265
1.other_tr~t |   1.053442    .120205     0.46   0.648     .8423312    1.317464
  1.asplenia |   1.008065   .1178838     0.07   0.945     .8015832    1.267736
1.ra_sle_p~s |   1.299091   .1513645     2.25   0.025     1.033859    1.632367
1.other_im~o |   .9524922   .1174745    -0.39   0.693      .747962    1.212951
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,658             Number of obs    =       2,658
No. of failures      =          438
Time at risk         =       140582
                                                Wald chi2(42)    =     3400.76
Log pseudolikelihood =   -2364.0581             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 836 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .713255   .2099783    -1.15   0.251     .4005492    1.270088
 only 12-18  |   .4283882   .2127454    -1.71   0.088      .161851    1.133861
      mixed  |   .7448266   .1996001    -1.10   0.272     .4405026    1.259395
             |
        age1 |    1.06129   .0538228     1.17   0.241     .9608723    1.172201
        age2 |   .7552185   .1962234    -1.08   0.280     .4538481    1.256709
        age3 |    1.75768   .9697491     1.02   0.307     .5960933    5.182814
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9112685   .0924882    -0.92   0.360     .7468865    1.111829
             |
   obese4cat |
Obese I ..)  |   1.082169   .1503169     0.57   0.570     .8242524     1.42079
Obese II..)  |   1.072578   .1922644     0.39   0.696     .7548265     1.52409
Obese II..)  |   1.193713   .2567299     0.82   0.410     .7831292     1.81956
             |
smoke_nomiss |
     Former  |    .627076   .2584149    -1.13   0.257     .2796045    1.406359
    Current  |   1.273416   .1778973     1.73   0.084     .9684043    1.674495
             |
         imd |
          4  |    1.00039    .121236     0.00   0.997     .7888848    1.268602
5 most de..  |   1.032437     .16949     0.19   0.846     .7483864    1.424298
             |
tot_adults~h |
          2  |   .6015315   .4200319    -0.73   0.467     .1530697    2.363892
          3  |   .5240426   .2703474    -1.25   0.210     .1906522    1.440428
             |
   ethnicity |
Asian or ..  |   1.203979   .1888192     1.18   0.237     .8853712    1.637239
      Other  |   .8528962   .1434286    -0.95   0.344     .6134124    1.185877
             |
1.htdiag_o~p |   1.268955   .1340121     2.26   0.024     1.031697    1.560774
1.~y_disease |    .991404   .1162537    -0.07   0.941     .7878387    1.247567
    1.asthma |   1.012741   .1754955     0.07   0.942     .7211001    1.422332
1.~c_disease |   1.009554     .11513     0.08   0.934     .8073427    1.262411
             |
     diabcat |
T1DM, con..  |   1.211606   .3405166     0.68   0.495     .6984493    2.101783
T1DM, unc..  |   1.015422   .5934003     0.03   0.979     .3230089    3.192114
T2DM, con..  |    .971507    .130451    -0.22   0.830     .7467052    1.263987
T2DM, unc..  |   .8457771   .2238115    -0.63   0.527      .503511    1.420702
Diabetes,..  |   4.39e-15   2.69e-15   -53.94   0.000     1.32e-15    1.46e-14
             |
cancer_exh~t |
  Last year  |   .7586442   .8131112    -0.26   0.797     .0928377    6.199431
2-5 years..  |   1.033855    .391651     0.09   0.930     .4920424    2.172285
   5+ years  |   1.059097    .135623     0.45   0.654     .8240144    1.361246
             |
cancer_hae~t |
  Last year  |   .8940029   .6284525    -0.16   0.873     .2254105    3.545713
2-5 years..  |    1.05616   .4240014     0.14   0.892     .4808507    2.319794
   5+ years  |   .9328769   .1163467    -0.56   0.577     .7305737      1.1912
             |
1.~r_disease |   .9751469   .1219729    -0.20   0.841     .7631333    1.246062
1.stroke_d~a |   .8875494    .104739    -1.01   0.312     .7042761    1.118516
1.other_ne~o |   1.125251   .1355015     0.98   0.327     .8886867    1.424788
             |
reduced_ki~t |
Stage 3a/..  |   1.128084   .2493464     0.55   0.586     .7314691    1.739751
      1.esrd |   .9673714   .1015102    -0.32   0.752      .787541    1.188265
1.other_tr~t |   1.053442    .120205     0.46   0.648     .8423312    1.317464
  1.asplenia |   1.008065   .1178838     0.07   0.945     .8015832    1.267736
1.ra_sle_p~s |   1.299091   .1513645     2.25   0.025     1.033859    1.632367
1.other_im~o |   .9524922   .1174745    -0.39   0.693      .747962    1.212951
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod2.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod2.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1750.1713
Iteration 1:   log pseudolikelihood = -1735.2567
Iteration 2:   log pseudolikelihood = -1734.8921
Iteration 3:   log pseudolikelihood = -1734.8389
Iteration 4:   log pseudolikelihood = -1734.8195
Iteration 5:   log pseudolikelihood = -1734.8123
Iteration 6:   log pseudolikelihood = -1734.8097
Iteration 7:   log pseudolikelihood = -1734.8087
Iteration 8:   log pseudolikelihood = -1734.8083
Iteration 9:   log pseudolikelihood = -1734.8082
Iteration 10:  log pseudolikelihood = -1734.8082
Iteration 11:  log pseudolikelihood = -1734.8081
Iteration 12:  log pseudolikelihood = -1734.8081
Iteration 13:  log pseudolikelihood = -1734.8081
Iteration 14:  log pseudolikelihood = -1734.8081
Iteration 15:  log pseudolikelihood = -1734.8081
Iteration 16:  log pseudolikelihood = -1734.8081
Iteration 17:  log pseudolikelihood = -1734.8081
Iteration 18:  log pseudolikelihood = -1734.8081
Iteration 19:  log pseudolikelihood = -1734.8081
Iteration 20:  log pseudolikelihood = -1734.8081
Iteration 21:  log pseudolikelihood = -1734.8081
Iteration 22:  log pseudolikelihood = -1734.8081
Iteration 23:  log pseudolikelihood = -1734.8081
Iteration 24:  log pseudolikelihood = -1734.8081
Iteration 25:  log pseudolikelihood = -1734.8081
Iteration 26:  log pseudolikelihood = -1734.8081
Iteration 27:  log pseudolikelihood = -1734.8081
Iteration 28:  log pseudolikelihood = -1734.8081
Iteration 29:  log pseudolikelihood = -1734.8081
Iteration 30:  log pseudolikelihood = -1734.8081
Iteration 31:  log pseudolikelihood = -1734.8081
Iteration 32:  log pseudolikelihood = -1734.8081
Refining estimates:
Iteration 0:   log pseudolikelihood = -1734.8081
Iteration 1:   log pseudolikelihood = -1734.8081
Iteration 2:   log pseudolikelihood = -1734.8081
Iteration 3:   log pseudolikelihood = -1734.8081

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,946             Number of obs    =       1,946
No. of failures      =          342
Time at risk         =        79767
                                                Wald chi2(42)    =     3631.85
Log pseudolikelihood =   -1734.8081             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 758 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.059536   .4303785     0.14   0.887     .4779271    2.348928
 only 12-18  |   .8283502   .4608662    -0.34   0.735     .2783774    2.464869
      mixed  |   .9150599    .351611    -0.23   0.817     .4308996    1.943225
             |
        age1 |   1.055221   .0552263     1.03   0.304     .9523458    1.169209
        age2 |   .8542017   .2325519    -0.58   0.563     .5009857     1.45645
        age3 |   1.276975   .7433018     0.42   0.674     .4080512    3.996225
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |     1.0305    .117237     0.26   0.792     .8245356    1.287914
             |
   obese4cat |
Obese I ..)  |   .9751666    .144695    -0.17   0.865     .7290843    1.304307
Obese II..)  |   .8816781   .1853995    -0.60   0.549     .5838741    1.331377
Obese II..)  |   .6684505   .2060799    -1.31   0.191     .3652988     1.22318
             |
smoke_nomiss |
     Former  |   1.143808   .3776704     0.41   0.684     .5988216    2.184785
    Current  |   .8694661   .1562359    -0.78   0.436     .6113624    1.236535
             |
         imd |
          4  |   1.086995     .14047     0.65   0.519     .8437789    1.400317
5 most de..  |   .6899421   .1531441    -1.67   0.095     .4465543    1.065985
             |
tot_adults~h |
          2  |   .8782584   1.052259    -0.11   0.914     .0839037    9.193137
          3  |   1.264862   1.017915     0.29   0.770     .2612324    6.124343
             |
   ethnicity |
Asian or ..  |   1.028356   .2023705     0.14   0.887     .6992542    1.512348
      Other  |   .7296495   .1450872    -1.59   0.113     .4941479    1.077387
             |
1.htdiag_o~p |   .9604807   .1116298    -0.35   0.729     .7648205    1.206196
1.~y_disease |   .8783677   .1268696    -0.90   0.369     .6618058    1.165795
    1.asthma |   .9646405   .2057433    -0.17   0.866     .6350633    1.465257
1.~c_disease |   1.120862   .1531457     0.84   0.404      .857533    1.465054
             |
     diabcat |
T1DM, con..  |    1.04123   .3475927     0.12   0.904     .5412415    2.003099
T1DM, unc..  |   .9683616   .7180138    -0.04   0.965     .2264095    4.141717
T2DM, con..  |    .762269   .1246871    -1.66   0.097     .5531898     1.05037
T2DM, unc..  |   1.506072    .359109     1.72   0.086     .9438099    2.403294
Diabetes,..  |   7.04e-16   4.39e-16   -55.88   0.000     2.07e-16    2.39e-15
             |
cancer_exh~t |
  Last year  |   1.395788   .8946068     0.52   0.603     .3974258    4.902107
2-5 years..  |   1.667002   .6456136     1.32   0.187      .780322    3.561214
   5+ years  |   1.017994   .1507666     0.12   0.904     .7615191    1.360848
             |
cancer_hae~t |
  Last year  |   1.021097   .6704548     0.03   0.975     .2819463    3.698009
2-5 years..  |   1.187165   .5069161     0.40   0.688     .5141034    2.741396
   5+ years  |   1.041222   .1370386     0.31   0.759     .8044781    1.347637
             |
1.~r_disease |   .9927422    .134876    -0.05   0.957     .7606599    1.295634
1.stroke_d~a |   1.034866   .1381641     0.26   0.797      .796601    1.344396
1.other_ne~o |   1.082585   .1537855     0.56   0.576     .8194938    1.430141
             |
reduced_ki~t |
Stage 3a/..  |   1.083022   .3030722     0.29   0.776     .6258026     1.87429
      1.esrd |   1.053867   .1280058     0.43   0.666     .8306079    1.337135
1.other_tr~t |   1.195251   .1541785     1.38   0.167     .9282407    1.539068
  1.asplenia |   .8257292   .1161634    -1.36   0.173     .6267449    1.087889
1.ra_sle_p~s |   .9971599   .1439929    -0.02   0.984     .7513611    1.323369
1.other_im~o |    1.15019   .1584715     1.02   0.310     .8779955     1.50677
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,946             Number of obs    =       1,946
No. of failures      =          342
Time at risk         =        79767
                                                Wald chi2(42)    =     3631.85
Log pseudolikelihood =   -1734.8081             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 758 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.059536   .4303785     0.14   0.887     .4779271    2.348928
 only 12-18  |   .8283502   .4608662    -0.34   0.735     .2783774    2.464869
      mixed  |   .9150599    .351611    -0.23   0.817     .4308996    1.943225
             |
        age1 |   1.055221   .0552263     1.03   0.304     .9523458    1.169209
        age2 |   .8542017   .2325519    -0.58   0.563     .5009857     1.45645
        age3 |   1.276975   .7433018     0.42   0.674     .4080512    3.996225
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |     1.0305    .117237     0.26   0.792     .8245356    1.287914
             |
   obese4cat |
Obese I ..)  |   .9751666    .144695    -0.17   0.865     .7290843    1.304307
Obese II..)  |   .8816781   .1853995    -0.60   0.549     .5838741    1.331377
Obese II..)  |   .6684505   .2060799    -1.31   0.191     .3652988     1.22318
             |
smoke_nomiss |
     Former  |   1.143808   .3776704     0.41   0.684     .5988216    2.184785
    Current  |   .8694661   .1562359    -0.78   0.436     .6113624    1.236535
             |
         imd |
          4  |   1.086995     .14047     0.65   0.519     .8437789    1.400317
5 most de..  |   .6899421   .1531441    -1.67   0.095     .4465543    1.065985
             |
tot_adults~h |
          2  |   .8782584   1.052259    -0.11   0.914     .0839037    9.193137
          3  |   1.264862   1.017915     0.29   0.770     .2612324    6.124343
             |
   ethnicity |
Asian or ..  |   1.028356   .2023705     0.14   0.887     .6992542    1.512348
      Other  |   .7296495   .1450872    -1.59   0.113     .4941479    1.077387
             |
1.htdiag_o~p |   .9604807   .1116298    -0.35   0.729     .7648205    1.206196
1.~y_disease |   .8783677   .1268696    -0.90   0.369     .6618058    1.165795
    1.asthma |   .9646405   .2057433    -0.17   0.866     .6350633    1.465257
1.~c_disease |   1.120862   .1531457     0.84   0.404      .857533    1.465054
             |
     diabcat |
T1DM, con..  |    1.04123   .3475927     0.12   0.904     .5412415    2.003099
T1DM, unc..  |   .9683616   .7180138    -0.04   0.965     .2264095    4.141717
T2DM, con..  |    .762269   .1246871    -1.66   0.097     .5531898     1.05037
T2DM, unc..  |   1.506072    .359109     1.72   0.086     .9438099    2.403294
Diabetes,..  |   7.04e-16   4.39e-16   -55.88   0.000     2.07e-16    2.39e-15
             |
cancer_exh~t |
  Last year  |   1.395788   .8946068     0.52   0.603     .3974258    4.902107
2-5 years..  |   1.667002   .6456136     1.32   0.187      .780322    3.561214
   5+ years  |   1.017994   .1507666     0.12   0.904     .7615191    1.360848
             |
cancer_hae~t |
  Last year  |   1.021097   .6704548     0.03   0.975     .2819463    3.698009
2-5 years..  |   1.187165   .5069161     0.40   0.688     .5141034    2.741396
   5+ years  |   1.041222   .1370386     0.31   0.759     .8044781    1.347637
             |
1.~r_disease |   .9927422    .134876    -0.05   0.957     .7606599    1.295634
1.stroke_d~a |   1.034866   .1381641     0.26   0.797      .796601    1.344396
1.other_ne~o |   1.082585   .1537855     0.56   0.576     .8194938    1.430141
             |
reduced_ki~t |
Stage 3a/..  |   1.083022   .3030722     0.29   0.776     .6258026     1.87429
      1.esrd |   1.053867   .1280058     0.43   0.666     .8306079    1.337135
1.other_tr~t |   1.195251   .1541785     1.38   0.167     .9282407    1.539068
  1.asplenia |   .8257292   .1161634    -1.36   0.173     .6267449    1.087889
1.ra_sle_p~s |   .9971599   .1439929    -0.02   0.984     .7513611    1.323369
1.other_im~o |    1.15019   .1584715     1.02   0.310     .8779955     1.50677
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod3.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod3.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1205.0131
Iteration 1:   log pseudolikelihood = -1184.6649
Iteration 2:   log pseudolikelihood = -1180.8526
Iteration 3:   log pseudolikelihood = -1180.6486
Iteration 4:   log pseudolikelihood = -1180.6465
Iteration 5:   log pseudolikelihood = -1180.6465
Refining estimates:
Iteration 0:   log pseudolikelihood = -1180.6465

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,372             Number of obs    =       1,372
No. of failures      =          253
Time at risk         =        41696
                                                Wald chi2(42)    =       70.01
Log pseudolikelihood =   -1180.6465             Prob > chi2      =      0.0043

                         (Std. Err. adjusted for 669 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8540036   .3344847    -0.40   0.687     .3963442    1.840123
 only 12-18  |   .5112906   .3126224    -1.10   0.273      .154245    1.694824
      mixed  |   .8324069   .3089724    -0.49   0.621      .402149    1.722996
             |
        age1 |   .8958597   .0552986    -1.78   0.075     .7937761    1.011072
        age2 |   1.708976   .5736529     1.60   0.110     .8851417    3.299585
        age3 |   .3273986   .2356859    -1.55   0.121      .079858    1.342255
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9467051   .1228768    -0.42   0.673     .7340636    1.220944
             |
   obese4cat |
Obese I ..)  |   .8565981   .1620144    -0.82   0.413     .5912666    1.240997
Obese II..)  |   1.234984   .2627076     0.99   0.321     .8139397    1.873829
Obese II..)  |   .5164415   .1769727    -1.93   0.054     .2638358    1.010901
             |
smoke_nomiss |
     Former  |   1.479224   .5403967     1.07   0.284     .7228851    3.026904
    Current  |   1.359821   .2316205     1.80   0.071     .9738573    1.898752
             |
         imd |
          4  |   .9670388   .1547828    -0.21   0.834     .7066459    1.323384
5 most de..  |   1.137598   .2457429     0.60   0.551     .7449261     1.73726
             |
tot_adults~h |
          2  |   .9947696   .7939269    -0.01   0.995     .2081505    4.754091
          3  |   .4473013   .3006628    -1.20   0.231     .1197975     1.67014
             |
   ethnicity |
Asian or ..  |   .8977508   .1998203    -0.48   0.628     .5803585    1.388722
      Other  |   .8867553   .1952337    -0.55   0.585     .5759673    1.365242
             |
1.htdiag_o~p |   .9252412   .1390099    -0.52   0.605     .6892375    1.242056
1.~y_disease |   1.024528   .1595442     0.16   0.876     .7550413    1.390199
    1.asthma |    1.30132   .2611769     1.31   0.189     .8781051    1.928508
1.~c_disease |   .8750542   .1420233    -0.82   0.411      .636624    1.202782
             |
     diabcat |
T1DM, con..  |   .7050596    .362433    -0.68   0.497      .257436    1.931001
T1DM, unc..  |   1.422078   1.169684     0.43   0.669      .283658    7.129377
T2DM, con..  |   .8999493   .1600174    -0.59   0.553     .6351383    1.275169
T2DM, unc..  |   1.350543   .3816801     1.06   0.288     .7761546    2.350003
Diabetes,..  |   2.988693   3.568076     0.92   0.359     .2879171    31.02382
             |
cancer_exh~t |
  Last year  |   1.097103   1.187618     0.09   0.932     .1314676    9.155373
2-5 years..  |   .2757282   .2893024    -1.23   0.219     .0352675    2.155697
   5+ years  |   1.410772   .2380275     2.04   0.041      1.01354    1.963689
             |
cancer_hae~t |
  Last year  |   .6489354   .6024984    -0.47   0.641     .1051746    4.003981
2-5 years..  |   1.853513   .9134868     1.25   0.211      .705487    4.869703
   5+ years  |   1.377525    .202755     2.18   0.030     1.032317    1.838172
             |
1.~r_disease |   1.056642   .1658444     0.35   0.726      .776834    1.437234
1.stroke_d~a |    .853968   .1402595    -0.96   0.336     .6189227    1.178275
1.other_ne~o |   1.041008   .1696177     0.25   0.805     .7564196    1.432668
             |
reduced_ki~t |
Stage 3a/..  |   1.711671   .4506298     2.04   0.041     1.021704    2.867578
      1.esrd |   1.125164   .1571781     0.84   0.399     .8556739    1.479528
1.other_tr~t |   1.021838   .1762893     0.13   0.900     .7286704    1.432956
  1.asplenia |   1.188094   .1916481     1.07   0.285     .8660562    1.629881
1.ra_sle_p~s |   .8589406   .1581984    -0.83   0.409     .5986736    1.232356
1.other_im~o |   1.002328    .167588     0.01   0.989     .7222541    1.391008
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,372             Number of obs    =       1,372
No. of failures      =          253
Time at risk         =        41696
                                                Wald chi2(42)    =       70.01
Log pseudolikelihood =   -1180.6465             Prob > chi2      =      0.0043

                         (Std. Err. adjusted for 669 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8540036   .3344847    -0.40   0.687     .3963442    1.840123
 only 12-18  |   .5112906   .3126224    -1.10   0.273      .154245    1.694824
      mixed  |   .8324069   .3089724    -0.49   0.621      .402149    1.722996
             |
        age1 |   .8958597   .0552986    -1.78   0.075     .7937761    1.011072
        age2 |   1.708976   .5736529     1.60   0.110     .8851417    3.299585
        age3 |   .3273986   .2356859    -1.55   0.121      .079858    1.342255
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9467051   .1228768    -0.42   0.673     .7340636    1.220944
             |
   obese4cat |
Obese I ..)  |   .8565981   .1620144    -0.82   0.413     .5912666    1.240997
Obese II..)  |   1.234984   .2627076     0.99   0.321     .8139397    1.873829
Obese II..)  |   .5164415   .1769727    -1.93   0.054     .2638358    1.010901
             |
smoke_nomiss |
     Former  |   1.479224   .5403967     1.07   0.284     .7228851    3.026904
    Current  |   1.359821   .2316205     1.80   0.071     .9738573    1.898752
             |
         imd |
          4  |   .9670388   .1547828    -0.21   0.834     .7066459    1.323384
5 most de..  |   1.137598   .2457429     0.60   0.551     .7449261     1.73726
             |
tot_adults~h |
          2  |   .9947696   .7939269    -0.01   0.995     .2081505    4.754091
          3  |   .4473013   .3006628    -1.20   0.231     .1197975     1.67014
             |
   ethnicity |
Asian or ..  |   .8977508   .1998203    -0.48   0.628     .5803585    1.388722
      Other  |   .8867553   .1952337    -0.55   0.585     .5759673    1.365242
             |
1.htdiag_o~p |   .9252412   .1390099    -0.52   0.605     .6892375    1.242056
1.~y_disease |   1.024528   .1595442     0.16   0.876     .7550413    1.390199
    1.asthma |    1.30132   .2611769     1.31   0.189     .8781051    1.928508
1.~c_disease |   .8750542   .1420233    -0.82   0.411      .636624    1.202782
             |
     diabcat |
T1DM, con..  |   .7050596    .362433    -0.68   0.497      .257436    1.931001
T1DM, unc..  |   1.422078   1.169684     0.43   0.669      .283658    7.129377
T2DM, con..  |   .8999493   .1600174    -0.59   0.553     .6351383    1.275169
T2DM, unc..  |   1.350543   .3816801     1.06   0.288     .7761546    2.350003
Diabetes,..  |   2.988693   3.568076     0.92   0.359     .2879171    31.02382
             |
cancer_exh~t |
  Last year  |   1.097103   1.187618     0.09   0.932     .1314676    9.155373
2-5 years..  |   .2757282   .2893024    -1.23   0.219     .0352675    2.155697
   5+ years  |   1.410772   .2380275     2.04   0.041      1.01354    1.963689
             |
cancer_hae~t |
  Last year  |   .6489354   .6024984    -0.47   0.641     .1051746    4.003981
2-5 years..  |   1.853513   .9134868     1.25   0.211      .705487    4.869703
   5+ years  |   1.377525    .202755     2.18   0.030     1.032317    1.838172
             |
1.~r_disease |   1.056642   .1658444     0.35   0.726      .776834    1.437234
1.stroke_d~a |    .853968   .1402595    -0.96   0.336     .6189227    1.178275
1.other_ne~o |   1.041008   .1696177     0.25   0.805     .7564196    1.432668
             |
reduced_ki~t |
Stage 3a/..  |   1.711671   .4506298     2.04   0.041     1.021704    2.867578
      1.esrd |   1.125164   .1571781     0.84   0.399     .8556739    1.479528
1.other_tr~t |   1.021838   .1762893     0.13   0.900     .7286704    1.432956
  1.asplenia |   1.188094   .1916481     1.07   0.285     .8660562    1.629881
1.ra_sle_p~s |   .8589406   .1581984    -0.83   0.409     .5986736    1.232356
1.other_im~o |   1.002328    .167588     0.01   0.989     .7222541    1.391008
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod4.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death.log
  log type:  text
 closed on:  28 Oct 2021, 11:22:03
-------------------------------------------------------------------------------
