-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death_2ndVac
> cCensor.log
  log type:  text
 opened on:  28 Oct 2021, 11:23:38

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. forvalues period=0/4 {
  3. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  4. 
. *Censor at date of second vacc_7ds
. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
  5. replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>s
> econd_vacc_plus_7d
  6. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7.         
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  8. stsplit cat_time, at(0,85,154, 216, 263, 400)
  9. recode cat_time 85=1 154=2 216=3 263=4 
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. }
 14. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 15. stsplit cat_time, at(0,92,161,222,270, 400)
 16. recode cat_time 92=1 161=2 222=3 270=4
 17. recode `outcome' .=0 
 18. tab cat_time
 19. tab cat_time `outcome'
 20. }
 21. keep if cat_time==`period'
 22. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 23. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 24. if _rc==0{
 25. estimates
 26. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_2ndVaccCensor", replace
 27.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 28. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 29. 
. }
 30. }
 31. }
(12,880 missing values generated)
(2,893 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
     15,882  observations remaining, representing
     15,882  subjects
      7,420  failures in single-failure-per-subject data
  2,515,199  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(26,925 observations (episodes) created)
(cat_time: 26925 changes made)
(covid_death: 26925 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,882       37.10       37.10
          1 |      9,853       23.02       60.12
          2 |      7,635       17.84       77.95
          3 |      5,512       12.88       90.83
          4 |      3,925        9.17      100.00
------------+-----------------------------------
      Total |     42,807      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,657      3,225 |    15,882 
         1 |     8,531      1,322 |     9,853 
         2 |     6,379      1,256 |     7,635 
         3 |     4,559        953 |     5,512 
         4 |     3,261        664 |     3,925 
-----------+----------------------+----------
     Total |    35,387      7,420 |    42,807 
(27,125 observations deleted)
   1:      9.94 /        1 =       9.9370

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,882             Number of obs    =      15,882
No. of failures      =        3,225
Time at risk         =      1158478
                                                Wald chi2(42)    =       43.23
Log pseudolikelihood =   -23036.594             Prob > chi2      =      0.4184

                       (Std. Err. adjusted for 1,115 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.013192   .1245304     0.11   0.915       .79629    1.289175
 only 12-18  |   1.166489   .1853962     0.97   0.333     .8542694     1.59282
      mixed  |   .9690623   .1116457    -0.27   0.785     .7731874    1.214559
             |
        age1 |   1.019602    .006833     2.90   0.004     1.006297    1.033083
        age2 |   .9451288   .0199988    -2.67   0.008     .9067335      .98515
        age3 |   1.157674   .0696239     2.43   0.015      1.02895    1.302503
      1.male |   .9703293   .0343971    -0.85   0.396     .9052009    1.040144
             |
   obese4cat |
Obese I ..)  |   .9533811    .052743    -0.86   0.388      .855414    1.062568
Obese II..)  |   .9213193   .0576042    -1.31   0.190     .8150609    1.041431
Obese II..)  |     1.2097   .0882899     2.61   0.009     1.048462    1.395734
             |
smoke_nomiss |
     Former  |   .9861314   .1237292    -0.11   0.911     .7711435    1.261056
    Current  |    .995963   .0509627    -0.08   0.937     .9009233    1.101029
             |
         imd |
          4  |   1.044772   .0468044     0.98   0.328     .9569493    1.140655
5 most de..  |   1.040895   .0622675     0.67   0.503     .9257355    1.170379
             |
tot_adults~h |
          2  |   .7662017   .2378636    -0.86   0.391     .4169574    1.407974
          3  |   .9275325    .219255    -0.32   0.750     .5836031    1.474147
             |
   ethnicity |
Asian or ..  |   1.001213   .0603317     0.02   0.984     .8896809    1.126727
      Other  |   .9451266   .0552206    -0.97   0.334     .8428632    1.059797
             |
1.htdiag_o~p |   1.043269   .0393377     1.12   0.261     .9689482     1.12329
1.~y_disease |   .9954208   .0432816    -0.11   0.916     .9141044    1.083971
    1.asthma |   1.069852    .065988     1.09   0.274     .9480295    1.207328
1.~c_disease |   .9795441   .0420554    -0.48   0.630     .9004898    1.065539
             |
     diabcat |
T1DM, con..  |   .8280083    .095041    -1.64   0.100      .661198    1.036902
T1DM, unc..  |   1.299629   .2804417     1.21   0.225     .8514162    1.983795
T2DM, con..  |   1.076104   .0524574     1.50   0.132     .9780486    1.183991
T2DM, unc..  |   1.049375   .0957069     0.53   0.597     .8776029    1.254768
Diabetes,..  |   .7703389   .4597841    -0.44   0.662       .23913    2.481587
             |
cancer_exh~t |
  Last year  |   1.288995   .4206461     0.78   0.437     .6799443    2.443596
2-5 years..  |    .944189   .1382478    -0.39   0.695     .7086411    1.258032
   5+ years  |   .9350651   .0453051    -1.39   0.166     .8503546    1.028214
             |
cancer_hae~t |
  Last year  |   .8736278   .2969444    -0.40   0.691     .4487503     1.70078
2-5 years..  |   .9923531   .1414216    -0.05   0.957     .7505167    1.312116
   5+ years  |   1.030653   .0456704     0.68   0.496      .944918    1.124168
             |
1.~r_disease |   1.004646   .0438851     0.11   0.915     .9222122    1.094449
1.stroke_d~a |   .9923486   .0434516    -0.18   0.861     .9107372    1.081273
1.other_ne~o |   .9979524     .04505    -0.05   0.964     .9134494    1.090273
             |
reduced_ki~t |
Stage 3a/..  |   1.454138   .3757687     1.45   0.147      .876282    2.413057
      1.esrd |   .9679935   .0353175    -0.89   0.373     .9011895     1.03975
1.other_tr~t |   .9823695   .0413489    -0.42   0.673     .9045799    1.066849
  1.asplenia |   .9786557   .0427809    -0.49   0.622     .8982983    1.066201
1.ra_sle_p~s |   1.012968   .0418867     0.31   0.755     .9341106    1.098483
1.other_im~o |   .9970933   .0426834    -0.07   0.946     .9168488    1.084361
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod0_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,893 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
     15,882  observations remaining, representing
     15,882  subjects
      7,420  failures in single-failure-per-subject data
  2,515,199  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(26,925 observations (episodes) created)
(cat_time: 26925 changes made)
(covid_death: 26925 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,882       37.10       37.10
          1 |      9,853       23.02       60.12
          2 |      7,635       17.84       77.95
          3 |      5,512       12.88       90.83
          4 |      3,925        9.17      100.00
------------+-----------------------------------
      Total |     42,807      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,657      3,225 |    15,882 
         1 |     8,531      1,322 |     9,853 
         2 |     6,379      1,256 |     7,635 
         3 |     4,559        953 |     5,512 
         4 |     3,261        664 |     3,925 
-----------+----------------------+----------
     Total |    35,387      7,420 |    42,807 
(33,154 observations deleted)
   1:     11.62 /        1 =      11.6210

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,853             Number of obs    =       9,853
No. of failures      =        1,322
Time at risk         =       604772
                                                Wald chi2(42)    =    25986.98
Log pseudolikelihood =   -8928.4799             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,049 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.097809   .2257424     0.45   0.650     .7336595    1.642704
 only 12-18  |   1.066741   .2870417     0.24   0.810     .6295282    1.807601
      mixed  |   1.122632   .2110927     0.62   0.538     .7765741    1.622901
             |
        age1 |   .9830115   .0092371    -1.82   0.068     .9650728    1.001284
        age2 |   1.036816   .0315952     1.19   0.235     .9767038    1.100628
        age3 |   .9090043   .0799637    -1.08   0.278     .7650451    1.080052
      1.male |   1.054536   .0572636     0.98   0.328     .9480673     1.17296
             |
   obese4cat |
Obese I ..)  |   .8682825   .0749741    -1.64   0.102     .7330978    1.028396
Obese II..)  |   .9112803   .0912381    -0.93   0.353     .7489089    1.108856
Obese II..)  |   1.043551   .1205453     0.37   0.712     .8321227    1.308699
             |
smoke_nomiss |
     Former  |   1.009621   .1931608     0.05   0.960     .6939147    1.468961
    Current  |   1.017736    .083157     0.22   0.830     .8671321    1.194497
             |
         imd |
          4  |   1.027402   .0718926     0.39   0.699     .8957311    1.178429
5 most de..  |   1.035459   .0960316     0.38   0.707     .8633557    1.241869
             |
tot_adults~h |
          2  |   1.310604    .624308     0.57   0.570     .5152293    3.333823
          3  |   .9960318   .4173002    -0.01   0.992     .4381789    2.264097
             |
   ethnicity |
Asian or ..  |   1.105536   .0966606     1.15   0.251     .9314285    1.312188
      Other  |   1.011603   .0974222     0.12   0.905     .8375973    1.221757
             |
1.htdiag_o~p |     .88234   .0535415    -2.06   0.039     .7834009    .9937747
1.~y_disease |   .9397931   .0689876    -0.85   0.398     .8138567    1.085217
    1.asthma |   1.083697   .1034025     0.84   0.400      .898854    1.306551
1.~c_disease |   1.101962   .0747707     1.43   0.152     .9647407    1.258701
             |
     diabcat |
T1DM, con..  |   .9377319   .1644726    -0.37   0.714     .6649409    1.322435
T1DM, unc..  |   1.480311   .4776131     1.22   0.224     .7865348    2.786043
T2DM, con..  |   .9505521   .0704444    -0.68   0.494     .8220426    1.099151
T2DM, unc..  |   .8129603   .1263596    -1.33   0.183     .5994677    1.102485
Diabetes,..  |   1.823675   1.008591     1.09   0.277      .616861    5.391477
             |
cancer_exh~t |
  Last year  |   1.75e-15   3.83e-16  -155.18   0.000     1.14e-15    2.68e-15
2-5 years..  |   .9868503   .2189783    -0.06   0.952     .6388117    1.524508
   5+ years  |   1.044849   .0736898     0.62   0.534     .9099577    1.199737
             |
cancer_hae~t |
  Last year  |   1.358105   .5197771     0.80   0.424     .6414453    2.875459
2-5 years..  |   .6395589   .1720551    -1.66   0.097     .3774757    1.083608
   5+ years  |   .9996155   .0704951    -0.01   0.996     .8705713    1.147788
             |
1.~r_disease |   1.077383   .0757045     1.06   0.289     .9387694    1.236464
1.stroke_d~a |    .997987   .0678022    -0.03   0.976     .8735648    1.140131
1.other_ne~o |   .8645908   .0613433    -2.05   0.040     .7523454    .9935825
             |
reduced_ki~t |
Stage 3a/..  |   1.696756   .6824611     1.31   0.189     .7713529    3.732378
      1.esrd |   .8895896   .0515897    -2.02   0.044     .7940104    .9966742
1.other_tr~t |   .9549931   .0659798    -0.67   0.505     .8340485    1.093476
  1.asplenia |   .9838434   .0676257    -0.24   0.813     .8598399     1.12573
1.ra_sle_p~s |   1.053384   .0710185     0.77   0.440     .9229946    1.202193
1.other_im~o |   1.108036   .0726982     1.56   0.118     .9743312    1.260089
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod1_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,893 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
     15,882  observations remaining, representing
     15,882  subjects
      7,420  failures in single-failure-per-subject data
  2,515,199  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(26,925 observations (episodes) created)
(cat_time: 26925 changes made)
(covid_death: 26925 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,882       37.10       37.10
          1 |      9,853       23.02       60.12
          2 |      7,635       17.84       77.95
          3 |      5,512       12.88       90.83
          4 |      3,925        9.17      100.00
------------+-----------------------------------
      Total |     42,807      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,657      3,225 |    15,882 
         1 |     8,531      1,322 |     9,853 
         2 |     6,379      1,256 |     7,635 
         3 |     4,559        953 |     5,512 
         4 |     3,261        664 |     3,925 
-----------+----------------------+----------
     Total |    35,387      7,420 |    42,807 
(35,372 observations deleted)
   1:      8.62 /        1 =       8.6190

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        7,635             Number of obs    =       7,635
No. of failures      =        1,256
Time at risk         =       403126
                                                Wald chi2(42)    =     9995.71
Log pseudolikelihood =   -8128.2126             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,007 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.468546   .3275039     1.72   0.085     .9485477     2.27361
 only 12-18  |    1.43571   .4408094     1.18   0.239     .7865394    2.620675
      mixed  |   1.383039   .2889064     1.55   0.121     .9183855    2.082783
             |
        age1 |   .9886721   .0097948    -1.15   0.250     .9696599    1.008057
        age2 |   .9971334   .0319813    -0.09   0.929     .9363808    1.061828
        age3 |   1.045246   .0963073     0.48   0.631     .8725497    1.252123
      1.male |   1.004819   .0565717     0.09   0.932     .8998391    1.122046
             |
   obese4cat |
Obese I ..)  |   .8908159   .0768936    -1.34   0.180     .7521662    1.055023
Obese II..)  |    .987244   .0991348    -0.13   0.898     .8108686    1.201984
Obese II..)  |   .9238401   .1219763    -0.60   0.549     .7131996    1.196692
             |
smoke_nomiss |
     Former  |   .9570277   .2007549    -0.21   0.834      .634408    1.443711
    Current  |   1.038277    .091244     0.43   0.669     .8739962    1.233437
             |
         imd |
          4  |   1.029585   .0733026     0.41   0.682      .895488    1.183762
5 most de..  |   .9998232   .0971855    -0.00   0.999     .8263882    1.209657
             |
tot_adults~h |
          2  |   .3995829   .2108853    -1.74   0.082     .1420279    1.124191
          3  |   .5102085   .1770073    -1.94   0.052     .2584873    1.007062
             |
   ethnicity |
Asian or ..  |   .9654175   .0920755    -0.37   0.712     .8008162    1.163851
      Other  |   .9629191   .0970828    -0.37   0.708     .7902609      1.1733
             |
1.htdiag_o~p |   1.038281   .0639805     0.61   0.542     .9201585    1.171567
1.~y_disease |   .9630353    .069941    -0.52   0.604     .8352629    1.110354
    1.asthma |   .9976962   .1013114    -0.02   0.982     .8176413    1.217402
1.~c_disease |   1.108804   .0749256     1.53   0.126     .9712617    1.265824
             |
     diabcat |
T1DM, con..  |    1.13425     .18579     0.77   0.442     .8227767    1.563635
T1DM, unc..  |   .3596871   .2596565    -1.42   0.157     .0873869    1.480483
T2DM, con..  |   1.088495   .0848056     1.09   0.276     .9343474    1.268073
T2DM, unc..  |   1.195704   .1638467     1.30   0.192     .9140792    1.564095
Diabetes,..  |   2.34e-16   8.74e-17   -96.43   0.000     1.13e-16    4.86e-16
             |
cancer_exh~t |
  Last year  |   1.533406   .6030308     1.09   0.277     .7094331    3.314383
2-5 years..  |   .8827988   .2306233    -0.48   0.633     .5290454    1.473094
   5+ years  |   .9822453   .0765302    -0.23   0.818     .8431403      1.1443
             |
cancer_hae~t |
  Last year  |    .401538   .2921468    -1.25   0.210     .0964758    1.671225
2-5 years..  |   1.426799   .2564652     1.98   0.048     1.003137    2.029388
   5+ years  |   1.007946   .0738037     0.11   0.914      .873194    1.163493
             |
1.~r_disease |   .8582187   .0635111    -2.07   0.039     .7423456    .9921784
1.stroke_d~a |   .9283456   .0668553    -1.03   0.302     .8061391    1.069078
1.other_ne~o |   1.070641   .0748492     0.98   0.329     .9335459    1.227868
             |
reduced_ki~t |
Stage 3a/..  |   .9435099    .563375    -0.10   0.922     .2927449     3.04091
      1.esrd |   1.020598   .0623183     0.33   0.738     .9054818    1.150349
1.other_tr~t |   1.036217   .0700154     0.53   0.599      .907688    1.182946
  1.asplenia |   .9939837   .0704281    -0.09   0.932     .8651031    1.142064
1.ra_sle_p~s |   1.018918   .0736022     0.26   0.795     .8844069    1.173887
1.other_im~o |   1.069913   .0797568     0.91   0.365     .9244754     1.23823
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod2_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,893 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
     15,882  observations remaining, representing
     15,882  subjects
      7,420  failures in single-failure-per-subject data
  2,515,199  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(26,925 observations (episodes) created)
(cat_time: 26925 changes made)
(covid_death: 26925 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,882       37.10       37.10
          1 |      9,853       23.02       60.12
          2 |      7,635       17.84       77.95
          3 |      5,512       12.88       90.83
          4 |      3,925        9.17      100.00
------------+-----------------------------------
      Total |     42,807      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,657      3,225 |    15,882 
         1 |     8,531      1,322 |     9,853 
         2 |     6,379      1,256 |     7,635 
         3 |     4,559        953 |     5,512 
         4 |     3,261        664 |     3,925 
-----------+----------------------+----------
     Total |    35,387      7,420 |    42,807 
(37,495 observations deleted)
   1:      6.82 /        1 =       6.8150

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,512             Number of obs    =       5,512
No. of failures      =          953
Time at risk         =       227808
                                                Wald chi2(42)    =    23409.82
Log pseudolikelihood =   -5841.8457             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 950 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.373247   .3619992     1.20   0.229      .819153    2.302144
 only 12-18  |   1.805541   .5696184     1.87   0.061     .9728984    3.350792
      mixed  |   1.266909   .3122075     0.96   0.337     .7815947    2.053568
             |
        age1 |   1.001362   .0118989     0.11   0.909     .9783103    1.024957
        age2 |   .9768193   .0364513    -0.63   0.530     .9079262     1.05094
        age3 |   1.090714   .1161714     0.82   0.415     .8852175    1.343916
      1.male |   1.094888   .0702561     1.41   0.158      .965496    1.241621
             |
   obese4cat |
Obese I ..)  |   1.155609   .1046661     1.60   0.110     .9676438    1.380086
Obese II..)  |   1.040628   .1239511     0.33   0.738     .8239625    1.314267
Obese II..)  |   1.190529   .1643611     1.26   0.207      .908292    1.560467
             |
smoke_nomiss |
     Former  |   .7467646   .2064873    -1.06   0.291     .4343288    1.283952
    Current  |   1.103906   .1105563     0.99   0.324     .9071609    1.343322
             |
         imd |
          4  |   1.047734   .0814139     0.60   0.548     .8997226    1.220095
5 most de..  |   1.196778   .1190305     1.81   0.071     .9848127    1.454364
             |
tot_adults~h |
          2  |   .4281954   .2273918    -1.60   0.110     .1512217    1.212467
          3  |   .4957657   .1898791    -1.83   0.067     .2340264    1.050239
             |
   ethnicity |
Asian or ..  |   1.041703    .117001     0.36   0.716     .8358718     1.29822
      Other  |   1.064397   .1145337     0.58   0.562     .8620073    1.314307
             |
1.htdiag_o~p |   1.115294   .0735399     1.65   0.098     .9800838    1.269158
1.~y_disease |   1.048972   .0831666     0.60   0.546     .8980024    1.225323
    1.asthma |   .9216069   .1187248    -0.63   0.526     .7159634    1.186317
1.~c_disease |   .9614365   .0840535    -0.45   0.653     .8100361    1.141134
             |
     diabcat |
T1DM, con..  |   .9391968   .1896298    -0.31   0.756     .6322569    1.395146
T1DM, unc..  |   .4599336   .3197039    -1.12   0.264     .1177653    1.796275
T2DM, con..  |   1.045874   .0914443     0.51   0.608     .8811622    1.241374
T2DM, unc..  |   1.324305   .2075375     1.79   0.073     .9740757     1.80046
Diabetes,..  |   6.178684   2.648282     4.25   0.000     2.667211    14.31313
             |
cancer_exh~t |
  Last year  |   .8267491   .5844305    -0.27   0.788      .206851    3.304378
2-5 years..  |   .8552278   .2412514    -0.55   0.579     .4920013    1.486611
   5+ years  |   .9719495   .0891158    -0.31   0.756     .8120804    1.163291
             |
cancer_hae~t |
  Last year  |   7.50e-15   1.66e-15  -147.40   0.000     4.87e-15    1.16e-14
2-5 years..  |   .9931833   .2723238    -0.02   0.980     .5802778    1.699898
   5+ years  |   1.079389    .086358     0.95   0.340     .9227342     1.26264
             |
1.~r_disease |   1.038257   .0835503     0.47   0.641     .8867622    1.215633
1.stroke_d~a |   .9546757   .0825967    -0.54   0.592      .805771    1.131098
1.other_ne~o |   1.032108   .0837259     0.39   0.697     .8803894    1.209974
             |
reduced_ki~t |
Stage 3a/..  |   .8488302   .6491543    -0.21   0.830     .1896064    3.800044
      1.esrd |   .9738081   .0681942    -0.38   0.705     .8489168    1.117073
1.other_tr~t |   1.038838   .0818146     0.48   0.629     .8902469    1.212229
  1.asplenia |   1.051014   .0854983     0.61   0.541     .8961165    1.232685
1.ra_sle_p~s |   .9712817   .0761307    -0.37   0.710     .8329646    1.132567
1.other_im~o |   .9965086   .0834443    -0.04   0.967     .8456766    1.174243
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod3_2ndVaccCensor.ster saved
(12,880 missing values generated)
(2,893 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
     15,882  observations remaining, representing
     15,882  subjects
      7,420  failures in single-failure-per-subject data
  2,515,199  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(26,925 observations (episodes) created)
(cat_time: 26925 changes made)
(covid_death: 26925 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,882       37.10       37.10
          1 |      9,853       23.02       60.12
          2 |      7,635       17.84       77.95
          3 |      5,512       12.88       90.83
          4 |      3,925        9.17      100.00
------------+-----------------------------------
      Total |     42,807      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    12,657      3,225 |    15,882 
         1 |     8,531      1,322 |     9,853 
         2 |     6,379      1,256 |     7,635 
         3 |     4,559        953 |     5,512 
         4 |     3,261        664 |     3,925 
-----------+----------------------+----------
     Total |    35,387      7,420 |    42,807 
(39,082 observations deleted)
   1:      4.63 /        1 =       4.6320

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,925             Number of obs    =       3,925
No. of failures      =          664
Time at risk         =       121015
                                                Wald chi2(42)    =     3080.27
Log pseudolikelihood =   -3841.2884             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 883 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8007269   .2025407    -0.88   0.380     .4877265    1.314596
 only 12-18  |   .9181334   .3444819    -0.23   0.820      .440085    1.915468
      mixed  |   .8795002   .2016308    -0.56   0.575     .5611678    1.378412
             |
        age1 |    .977869   .0144983    -1.51   0.131     .9498618    1.006702
        age2 |   1.048558   .0489904     1.01   0.310      .956804    1.149111
        age3 |   .9344916   .1235924    -0.51   0.608     .7211051    1.211022
      1.male |   1.027577   .0823317     0.34   0.734      .878242    1.202304
             |
   obese4cat |
Obese I ..)  |   1.122591   .1258771     1.03   0.302     .9011051    1.398516
Obese II..)  |   .9963518   .1450481    -0.03   0.980     .7490235    1.325348
Obese II..)  |   1.010625   .1753336     0.06   0.951     .7193084    1.419925
             |
smoke_nomiss |
     Former  |   1.139827   .2859496     0.52   0.602     .6971034     1.86372
    Current  |   1.136351   .1321347     1.10   0.272     .9047635    1.427217
             |
         imd |
          4  |   .9301889   .0903539    -0.75   0.456     .7689351    1.125259
5 most de..  |   1.088977   .1444654     0.64   0.521     .8396472    1.412344
             |
tot_adults~h |
          2  |   1.430459   .9669945     0.53   0.596     .3802426    5.381336
          3  |   1.067738   .6189418     0.11   0.910     .3428021    3.325719
             |
   ethnicity |
Asian or ..  |   .9233197   .1240407    -0.59   0.553     .7095776    1.201446
      Other  |   .9811465   .1287371    -0.15   0.885     .7586596    1.268881
             |
1.htdiag_o~p |   1.092208   .0897237     1.07   0.283     .9297801    1.283012
1.~y_disease |   .9847035   .0923591    -0.16   0.869     .8193472    1.183431
    1.asthma |   .9785168   .1461197    -0.15   0.884      .730231    1.311222
1.~c_disease |   1.023259   .1037141     0.23   0.821     .8389013    1.248132
             |
     diabcat |
T1DM, con..  |   .8983942   .2202788    -0.44   0.662     .5555963    1.452695
T1DM, unc..  |    .694303   .4708533    -0.54   0.591     .1837775    2.623045
T2DM, con..  |   1.001593   .1071806     0.01   0.988     .8120904    1.235318
T2DM, unc..  |   1.242117   .2534409     1.06   0.288     .8326909    1.852854
Diabetes,..  |   1.43e-14   8.68e-15   -52.49   0.000     4.35e-15    4.70e-14
             |
cancer_exh~t |
  Last year  |   .6540327    .648896    -0.43   0.669     .0935585    4.572101
2-5 years..  |   1.083276   .3321072     0.26   0.794     .5939915    1.975594
   5+ years  |   1.060269   .1052696     0.59   0.556     .8727785    1.288037
             |
cancer_hae~t |
  Last year  |   2.752928   1.000043     2.79   0.005     1.350775    5.610569
2-5 years..  |    1.22841   .3428801     0.74   0.461     .7108071    2.122927
   5+ years  |   1.140144   .1131161     1.32   0.186     .9386643    1.384871
             |
1.~r_disease |   .9922568   .0997978    -0.08   0.938      .814729    1.208468
1.stroke_d~a |   .7944001   .0859399    -2.13   0.033     .6426204    .9820285
1.other_ne~o |   1.136439   .1032212     1.41   0.159     .9511143    1.357875
             |
reduced_ki~t |
Stage 3a/..  |   .4082586   .3936825    -0.93   0.353     .0616772    2.702379
      1.esrd |   1.131483   .0844365     1.66   0.098     .9775244    1.309691
1.other_tr~t |   1.031515   .1035953     0.31   0.757      .847206     1.25592
  1.asplenia |   1.018355   .1026297     0.18   0.857     .8358245    1.240747
1.ra_sle_p~s |   .9810927   .0953071    -0.20   0.844     .8110004    1.186859
1.other_im~o |   1.277832   .1141336     2.74   0.006      1.07262    1.522304
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_0_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_0_timeperiod4_2ndVaccCensor.ster saved
(3,628 missing values generated)
(829 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         65  observations end on or before enter()
------------------------------------------------------------------------------
      4,486  observations remaining, representing
      4,486  subjects
      2,140  failures in single-failure-per-subject data
    702,396  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(7,549 observations (episodes) created)
(cat_time: 7549 changes made)
(covid_death: 7549 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,486       37.27       37.27
          1 |      2,738       22.75       60.02
          2 |      2,130       17.70       77.72
          3 |      1,574       13.08       90.80
          4 |      1,107        9.20      100.00
------------+-----------------------------------
      Total |     12,035      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,548        938 |     4,486 
         1 |     2,365        373 |     2,738 
         2 |     1,792        338 |     2,130 
         3 |     1,293        281 |     1,574 
         4 |       897        210 |     1,107 
-----------+----------------------+----------
     Total |     9,895      2,140 |    12,035 
(7,614 observations deleted)
   1:      6.82 /        1 =       6.8240

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,486             Number of obs    =       4,486
No. of failures      =          938
Time at risk         =       323463
                                                Wald chi2(42)    =     4441.25
Log pseudolikelihood =   -5496.0077             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 919 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9697532   .2304945    -0.13   0.897     .6086176    1.545176
 only 12-18  |   .8540149   .2622487    -0.51   0.607      .467822    1.559015
      mixed  |   .8889969   .2031613    -0.51   0.607     .5680365    1.391311
             |
        age1 |   .9575599    .029507    -1.41   0.159     .9014391    1.017175
        age2 |   1.155935   .1912683     0.88   0.381     .8357726    1.598743
        age3 |   .7690479   .2723792    -0.74   0.458     .3841291    1.539677
      1.male |   1.023123   .0715463     0.33   0.744     .8920803    1.173416
             |
   obese4cat |
Obese I ..)  |   .9807346    .090925    -0.21   0.834     .8177784    1.176163
Obese II..)  |   .8899558   .1054425    -0.98   0.325     .7055334    1.122585
Obese II..)  |   1.065801   .1485399     0.46   0.647     .8110446    1.400578
             |
smoke_nomiss |
     Former  |   1.011947   .2377604     0.05   0.960     .6385061    1.603801
    Current  |   .9720179   .0988982    -0.28   0.780      .796285    1.186533
             |
         imd |
          4  |   .9243387     .07677    -0.95   0.343     .7854805    1.087744
5 most de..  |   1.004853   .1144096     0.04   0.966      .803873    1.256082
             |
tot_adults~h |
          2  |   1.363127   1.105018     0.38   0.702     .2782981    6.676708
          3  |   2.770419   1.603891     1.76   0.078     .8907493    8.616591
             |
   ethnicity |
Asian or ..  |   .9382962    .104153    -0.57   0.566     .7548396     1.16634
      Other  |   .9499088   .1044214    -0.47   0.640     .7657927    1.178291
             |
1.htdiag_o~p |   1.067467   .0771495     0.90   0.366     .9264782    1.229911
1.~y_disease |   .9306119   .0762925    -0.88   0.380     .7924762    1.092826
    1.asthma |   1.010105    .117989     0.09   0.931     .8034129    1.269972
1.~c_disease |   .9834602   .0815172    -0.20   0.841     .8359922    1.156941
             |
     diabcat |
T1DM, con..  |   1.526634   .2593647     2.49   0.013     1.094263    2.129847
T1DM, unc..  |    1.21588   .4722588     0.50   0.615     .5679058    2.603185
T2DM, con..  |   .8663264   .0809145    -1.54   0.124      .721406    1.040359
T2DM, unc..  |   .8975852   .1630227    -0.59   0.552      .628749    1.281369
Diabetes,..  |   4.61e-15   2.37e-15   -64.16   0.000     1.68e-15    1.26e-14
             |
cancer_exh~t |
  Last year  |   1.091882   .4831934     0.20   0.843     .4586605    2.599322
2-5 years..  |   1.282017   .3219266     0.99   0.322     .7836984    2.097193
   5+ years  |   1.237939   .1028897     2.57   0.010     1.051848    1.456954
             |
cancer_hae~t |
  Last year  |   .6506402   .3183226    -0.88   0.380     .2493989    1.697412
2-5 years..  |   .7826459   .2323151    -0.83   0.409     .4374221    1.400329
   5+ years  |   .7782066   .0690301    -2.83   0.005     .6540183    .9259764
             |
1.~r_disease |   1.143903    .093542     1.64   0.100     .9745018    1.342752
1.stroke_d~a |    .925862   .0723162    -0.99   0.324     .7944408    1.079024
1.other_ne~o |   1.016826     .07961     0.21   0.831     .8721752    1.185467
             |
reduced_ki~t |
Stage 3a/..  |   1.174824    .186376     1.02   0.310     .8608682    1.603278
      1.esrd |   1.127281   .0756811     1.78   0.074     .9882932    1.285815
1.other_tr~t |   1.014454   .0824662     0.18   0.860     .8650417    1.189672
  1.asplenia |   1.129626   .0928093     1.48   0.138     .9616138    1.326994
1.ra_sle_p~s |   1.029243   .0838643     0.35   0.724     .8773257    1.207467
1.other_im~o |   1.046027   .0824068     0.57   0.568     .8963643    1.220678
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod0_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod0_2ndVaccCensor.ster saved
(3,628 missing values generated)
(829 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         65  observations end on or before enter()
------------------------------------------------------------------------------
      4,486  observations remaining, representing
      4,486  subjects
      2,140  failures in single-failure-per-subject data
    702,396  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(7,549 observations (episodes) created)
(cat_time: 7549 changes made)
(covid_death: 7549 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,486       37.27       37.27
          1 |      2,738       22.75       60.02
          2 |      2,130       17.70       77.72
          3 |      1,574       13.08       90.80
          4 |      1,107        9.20      100.00
------------+-----------------------------------
      Total |     12,035      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,548        938 |     4,486 
         1 |     2,365        373 |     2,738 
         2 |     1,792        338 |     2,130 
         3 |     1,293        281 |     1,574 
         4 |       897        210 |     1,107 
-----------+----------------------+----------
     Total |     9,895      2,140 |    12,035 
(9,362 observations deleted)
   1:      3.41 /        1 =       3.4060

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,738             Number of obs    =       2,738
No. of failures      =          373
Time at risk         =       167890
                                                Wald chi2(40)    =       46.72
Log pseudolikelihood =   -2030.1502             Prob > chi2      =      0.2157

                         (Std. Err. adjusted for 840 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.170157   .4339227     0.42   0.672     .5657153    2.420418
 only 12-18  |   1.266889   .6493377     0.46   0.644     .4639373    3.459535
      mixed  |   1.205904   .4152092     0.54   0.587     .6140907    2.368062
             |
        age1 |   .9560408   .0477339    -0.90   0.368     .8669161    1.054328
        age2 |   1.233262   .3149155     0.82   0.412     .7476525    2.034282
        age3 |   .6765808   .3667491    -0.72   0.471     .2338381    1.957601
      1.male |   .9686128   .0986136    -0.31   0.754     .7933962    1.182525
             |
   obese4cat |
Obese I ..)  |   .7815069   .1212749    -1.59   0.112     .5765575     1.05931
Obese II..)  |   1.143347   .2135839     0.72   0.473      .792809    1.648874
Obese II..)  |   .7027065   .1961925    -1.26   0.206     .4065578    1.214579
             |
smoke_nomiss |
     Former  |   .9097712   .3496111    -0.25   0.806     .4283793    1.932128
    Current  |   1.050687   .1746226     0.30   0.766     .7585865    1.455264
             |
         imd |
          4  |   .9703815   .1305505    -0.22   0.823     .7454627    1.263162
5 most de..  |   .9746405    .180542    -0.14   0.890     .6779041    1.401266
             |
tot_adults~h |
          2  |   2.66e-20          .        .       .            .           .
          3  |   .8763716   .5002522    -0.23   0.817     .2862883    2.682705
             |
   ethnicity |
Asian or ..  |   1.183923   .2009065     0.99   0.320     .8489424    1.651081
      Other  |   1.239224   .1936351     1.37   0.170     .9123163    1.683273
             |
1.htdiag_o~p |   1.024384   .1137754     0.22   0.828      .823991    1.273513
1.~y_disease |   1.108886    .143795     0.80   0.425     .8600173    1.429772
    1.asthma |   .9639986   .1865959    -0.19   0.850     .6596507    1.408766
1.~c_disease |   1.025792    .134565     0.19   0.846     .7932267    1.326543
             |
     diabcat |
T1DM, con..  |    .862226   .3214303    -0.40   0.691     .4152414    1.790365
T1DM, unc..  |   .9089628   .6345016    -0.14   0.891     .2314007    3.570487
T2DM, con..  |   .9780433   .1393202    -0.16   0.876     .7397862    1.293034
T2DM, unc..  |   .9100873   .2676052    -0.32   0.749     .5114378    1.619471
Diabetes,..  |   1.79e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   3.319632   1.385749     2.87   0.004     1.464752    7.523431
2-5 years..  |   .4051061     .28674    -1.28   0.202     .1011756    1.622041
   5+ years  |   1.115987   .1568148     0.78   0.435     .8473267     1.46983
             |
cancer_hae~t |
  Last year  |   1.683313   1.058799     0.83   0.408     .4906381    5.775217
2-5 years..  |   1.640242     .58304     1.39   0.164     .8172218    3.292121
   5+ years  |    1.28074    .155283     2.04   0.041     1.009851    1.624294
             |
1.~r_disease |   .9565785   .1243752    -0.34   0.733     .7413898    1.234226
1.stroke_d~a |   .8733119   .1183797    -1.00   0.318     .6695558    1.139074
1.other_ne~o |   1.261879   .1526121     1.92   0.054     .9955727    1.599419
             |
reduced_ki~t |
Stage 3a/..  |   .8731534   .2446171    -0.48   0.628     .5042239    1.512021
      1.esrd |   .9116639   .1024348    -0.82   0.410      .731465    1.136255
1.other_tr~t |   .8724679   .1214486    -0.98   0.327     .6641423     1.14614
  1.asplenia |   .9023091   .1247498    -0.74   0.457     .6881315    1.183149
1.ra_sle_p~s |   1.037707   .1351732     0.28   0.776     .8038889    1.339533
1.other_im~o |   1.001735    .132637     0.01   0.990     .7727654    1.298548
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod1_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod1_2ndVaccCensor.ster saved
(3,628 missing values generated)
(829 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         65  observations end on or before enter()
------------------------------------------------------------------------------
      4,486  observations remaining, representing
      4,486  subjects
      2,140  failures in single-failure-per-subject data
    702,396  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(7,549 observations (episodes) created)
(cat_time: 7549 changes made)
(covid_death: 7549 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,486       37.27       37.27
          1 |      2,738       22.75       60.02
          2 |      2,130       17.70       77.72
          3 |      1,574       13.08       90.80
          4 |      1,107        9.20      100.00
------------+-----------------------------------
      Total |     12,035      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,548        938 |     4,486 
         1 |     2,365        373 |     2,738 
         2 |     1,792        338 |     2,130 
         3 |     1,293        281 |     1,574 
         4 |       897        210 |     1,107 
-----------+----------------------+----------
     Total |     9,895      2,140 |    12,035 
(9,970 observations deleted)
   1:      2.43 /        1 =       2.4280

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,130             Number of obs    =       2,130
No. of failures      =          338
Time at risk         =       113300
                                                Wald chi2(42)    =     3577.61
Log pseudolikelihood =   -1748.0337             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 790 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .581434   .2022772    -1.56   0.119     .2940172    1.149815
 only 12-18  |   .3893714    .225169    -1.63   0.103     .1253499    1.209495
      mixed  |   .6574997   .2047929    -1.35   0.178     .3570836    1.210657
             |
        age1 |   1.072831   .0610259     1.24   0.216     .9596492    1.199362
        age2 |   .7222744   .2106534    -1.12   0.265     .4077997    1.279256
        age3 |   1.906493   1.182673     1.04   0.298     .5651985    6.430863
      1.male |   1.023879   .1173526     0.21   0.837     .8178759    1.281768
             |
   obese4cat |
Obese I ..)  |   1.273056   .1943513     1.58   0.114      .943841    1.717103
Obese II..)  |   1.160875   .2312399     0.75   0.454     .7856526      1.7153
Obese II..)  |   1.480775   .3417087     1.70   0.089     .9420257    2.327637
             |
smoke_nomiss |
     Former  |   .7640513   .3218026    -0.64   0.523     .3346679     1.74434
    Current  |   1.218412   .1999754     1.20   0.229     .8832592    1.680738
             |
         imd |
          4  |   .9974918   .1397117    -0.02   0.986     .7580319    1.312596
5 most de..  |   .9164714   .1750757    -0.46   0.648     .6302486     1.33268
             |
tot_adults~h |
          2  |   .7988467   .5642375    -0.32   0.751     .2000999    3.189187
          3  |   .5916018   .3141333    -0.99   0.323     .2089546     1.67497
             |
   ethnicity |
Asian or ..  |   1.245443   .2196528     1.24   0.213     .8814577    1.759731
      Other  |   .8080453    .159099    -1.08   0.279     .5493379    1.188589
             |
1.htdiag_o~p |   1.155181   .1373748     1.21   0.225      .915007    1.458395
1.~y_disease |   1.045746   .1398067     0.33   0.738     .8046895    1.359014
    1.asthma |   .9695731   .1902368    -0.16   0.875     .6600382    1.424269
1.~c_disease |   .9192955   .1239638    -0.62   0.533     .7057868    1.197393
             |
     diabcat |
T1DM, con..  |   .9315425   .3318885    -0.20   0.842     .4633807    1.872697
T1DM, unc..  |   .8395738    .576501    -0.25   0.799     .2185615    3.225107
T2DM, con..  |   .9340189   .1440458    -0.44   0.658     .6903703    1.263657
T2DM, unc..  |   1.094157   .3049851     0.32   0.747     .6336008    1.889484
Diabetes,..  |   1.65e-15   1.02e-15   -55.17   0.000     4.94e-16    5.54e-15
             |
cancer_exh~t |
  Last year  |   .7049915   .7683865    -0.32   0.748     .0832606    5.969364
2-5 years..  |   1.098967   .4592847     0.23   0.821     .4844477    2.492999
   5+ years  |    1.00874   .1501424     0.06   0.953     .7535036    1.350435
             |
cancer_hae~t |
  Last year  |   .5396718   .5243979    -0.63   0.526     .0803561    3.624435
2-5 years..  |   .9596492   .4664625    -0.08   0.932     .3701381    2.488062
   5+ years  |   .9972447    .139873    -0.02   0.984     .7575524    1.312777
             |
1.~r_disease |   .9969097   .1401218    -0.02   0.982     .7568575    1.313099
1.stroke_d~a |   .9254497   .1221257    -0.59   0.557     .7145378    1.198617
1.other_ne~o |   1.215083   .1624177     1.46   0.145     .9350342    1.579008
             |
reduced_ki~t |
Stage 3a/..  |    1.16717   .3095979     0.58   0.560     .6939823    1.962997
      1.esrd |   .8835162   .1078578    -1.01   0.310     .6955072    1.122348
1.other_tr~t |   1.087499   .1426464     0.64   0.523      .840964    1.406307
  1.asplenia |   1.010967   .1360445     0.08   0.935     .7765904     1.31608
1.ra_sle_p~s |   1.279377   .1728132     1.82   0.068     .9817968    1.667153
1.other_im~o |   .9150969   .1271961    -0.64   0.523     .6968708    1.201661
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod2_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod2_2ndVaccCensor.ster saved
(3,628 missing values generated)
(829 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         65  observations end on or before enter()
------------------------------------------------------------------------------
      4,486  observations remaining, representing
      4,486  subjects
      2,140  failures in single-failure-per-subject data
    702,396  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(7,549 observations (episodes) created)
(cat_time: 7549 changes made)
(covid_death: 7549 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,486       37.27       37.27
          1 |      2,738       22.75       60.02
          2 |      2,130       17.70       77.72
          3 |      1,574       13.08       90.80
          4 |      1,107        9.20      100.00
------------+-----------------------------------
      Total |     12,035      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,548        938 |     4,486 
         1 |     2,365        373 |     2,738 
         2 |     1,792        338 |     2,130 
         3 |     1,293        281 |     1,574 
         4 |       897        210 |     1,107 
-----------+----------------------+----------
     Total |     9,895      2,140 |    12,035 
(10,526 observations deleted)
   1:      1.66 /        1 =       1.6620

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,574             Number of obs    =       1,574
No. of failures      =          281
Time at risk         =        64359
                                                Wald chi2(42)    =     2932.83
Log pseudolikelihood =   -1360.8183             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 699 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .6846102   .2985731    -0.87   0.385     .2912167    1.609424
 only 12-18  |   .4951819   .3441659    -1.01   0.312     .1268104    1.933636
      mixed  |   .6747656    .272517    -0.97   0.330     .3057587    1.489111
             |
        age1 |   1.027021   .0569273     0.48   0.631     .9212927    1.144883
        age2 |   1.034477   .3014688     0.12   0.907     .5843355    1.831383
        age3 |   .8419414    .525333    -0.28   0.783     .2478398    2.860176
      1.male |   1.056975   .1344011     0.44   0.663     .8238135    1.356127
             |
   obese4cat |
Obese I ..)  |   .9890659   .1690877    -0.06   0.949     .7074673    1.382751
Obese II..)  |   1.139748   .2515177     0.59   0.553     .7395489    1.756509
Obese II..)  |   .8524021   .2792278    -0.49   0.626     .4485491    1.619866
             |
smoke_nomiss |
     Former  |   1.063928   .3897144     0.17   0.866     .5189427     2.18125
    Current  |   .8948723   .1724421    -0.58   0.564     .6133867    1.305533
             |
         imd |
          4  |   1.093908   .1622605     0.61   0.545     .8179391    1.462986
5 most de..  |   .7010024   .1680502    -1.48   0.138     .4381898    1.121442
             |
tot_adults~h |
          2  |   1.086796   1.300878     0.07   0.945     .1040573    11.35072
          3  |    1.49117   1.209918     0.49   0.622     .3039991    7.314459
             |
   ethnicity |
Asian or ..  |   1.002452   .2140964     0.01   0.991     .6595839    1.523551
      Other  |   .7452517   .1670278    -1.31   0.190     .4803186    1.156316
             |
1.htdiag_o~p |   1.086238   .1370156     0.66   0.512     .8483138    1.390893
1.~y_disease |   .8836611   .1431315    -0.76   0.445     .6432976    1.213835
    1.asthma |   .9195235   .2240942    -0.34   0.731     .5703208     1.48254
1.~c_disease |   1.179909   .1819002     1.07   0.283     .8722145     1.59615
             |
     diabcat |
T1DM, con..  |   1.185034   .4001543     0.50   0.615     .6113684    2.296989
T1DM, unc..  |   1.178957   .9272788     0.21   0.834     .2523522    5.507937
T2DM, con..  |   .7179234   .1316811    -1.81   0.071     .5011309    1.028502
T2DM, unc..  |   1.947519   .5012582     2.59   0.010     1.175972    3.225273
Diabetes,..  |   4.57e-14   2.89e-14   -48.63   0.000     1.33e-14    1.58e-13
             |
cancer_exh~t |
  Last year  |     1.3149    .854263     0.42   0.673     .3680316    4.697865
2-5 years..  |   1.694995   .8007431     1.12   0.264     .6715019    4.278483
   5+ years  |   1.041362   .1702305     0.25   0.804     .7558869    1.434653
             |
cancer_hae~t |
  Last year  |   1.024157   .6556417     0.04   0.970     .2920432    3.591585
2-5 years..  |    .971879    .506419    -0.05   0.956     .3500055    2.698669
   5+ years  |   1.136755    .166072     0.88   0.380     .8537137    1.513636
             |
1.~r_disease |   .9219051   .1378151    -0.54   0.586     .6877657    1.235754
1.stroke_d~a |   1.097321   .1586285     0.64   0.521     .8265789    1.456744
1.other_ne~o |   .9382923   .1498865    -0.40   0.690     .6860628    1.283253
             |
reduced_ki~t |
Stage 3a/..  |   1.219663   .3640177     0.67   0.506     .6795047     2.18921
      1.esrd |   1.142791    .147691     1.03   0.302     .8870742    1.472223
1.other_tr~t |   1.220236   .1708707     1.42   0.155     .9273621    1.605604
  1.asplenia |   .7600471   .1247508    -1.67   0.095       .55097    1.048463
1.ra_sle_p~s |   1.119807   .1751946     0.72   0.470     .8240857    1.521649
1.other_im~o |   1.165008   .1762716     1.01   0.313     .8660397    1.567184
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod3_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod3_2ndVaccCensor.ster saved
(3,628 missing values generated)
(829 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         65  observations end on or before enter()
------------------------------------------------------------------------------
      4,486  observations remaining, representing
      4,486  subjects
      2,140  failures in single-failure-per-subject data
    702,396  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(7,549 observations (episodes) created)
(cat_time: 7549 changes made)
(covid_death: 7549 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,486       37.27       37.27
          1 |      2,738       22.75       60.02
          2 |      2,130       17.70       77.72
          3 |      1,574       13.08       90.80
          4 |      1,107        9.20      100.00
------------+-----------------------------------
      Total |     12,035      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,548        938 |     4,486 
         1 |     2,365        373 |     2,738 
         2 |     1,792        338 |     2,130 
         3 |     1,293        281 |     1,574 
         4 |       897        210 |     1,107 
-----------+----------------------+----------
     Total |     9,895      2,140 |    12,035 
(10,993 observations deleted)
   1:      1.74 /        1 =       1.7370

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,107             Number of obs    =       1,107
No. of failures      =          210
Time at risk         =        33384
                                                Wald chi2(42)    =    16440.36
Log pseudolikelihood =   -931.52444             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 596 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8954864   .4277998    -0.23   0.817     .3510875    2.284034
 only 12-18  |   .4833489   .3607543    -0.97   0.330      .111932    2.087215
      mixed  |   .8276283   .3784181    -0.41   0.679     .3377838    2.027832
             |
        age1 |   .9771933   .0654999    -0.34   0.731     .8568911    1.114385
        age2 |   1.111556    .399061     0.29   0.768     .5499722    2.246582
        age3 |   .8130196   .6230243    -0.27   0.787      .181058     3.65077
      1.male |   .9158794   .1307921    -0.62   0.538     .6922812    1.211697
             |
   obese4cat |
Obese I ..)  |   .7685562   .1762056    -1.15   0.251     .4903679    1.204562
Obese II..)  |   1.205514   .2839577     0.79   0.427     .7597536    1.912811
Obese II..)  |   .5698849   .2204245    -1.45   0.146     .2670256    1.216246
             |
smoke_nomiss |
     Former  |   1.671664   .6193598     1.39   0.165     .8086762      3.4556
    Current  |   1.277364    .264864     1.18   0.238     .8507785    1.917843
             |
         imd |
          4  |   .9285233   .1638359    -0.42   0.674     .6570526    1.312156
5 most de..  |   1.084739   .2622628     0.34   0.737     .6753454    1.742306
             |
tot_adults~h |
          2  |   .7806468   .6418858    -0.30   0.763     .1557956    3.911595
          3  |   .4239875   .2750953    -1.32   0.186     .1188691    1.512297
             |
   ethnicity |
Asian or ..  |   .8342509   .1984412    -0.76   0.446     .5233877     1.32975
      Other  |   .8732742   .2203451    -0.54   0.591     .5325678    1.431945
             |
1.htdiag_o~p |   .9331963   .1512863    -0.43   0.670     .6791714    1.282232
1.~y_disease |   1.112816   .1852464     0.64   0.521     .8030211    1.542126
    1.asthma |   1.091581   .2442652     0.39   0.695     .7040136    1.692509
1.~c_disease |   .8161186   .1529256    -1.08   0.278     .5652673    1.178292
             |
     diabcat |
T1DM, con..  |   .7851165   .4021098    -0.47   0.637     .2877251     2.14235
T1DM, unc..  |   2.251489   1.941211     0.94   0.347     .4155017     12.2002
T2DM, con..  |   .8303486   .1639479    -0.94   0.346     .5638912    1.222716
T2DM, unc..  |   1.003152   .3541192     0.01   0.993     .5022121    2.003764
Diabetes,..  |   2.565978   3.075672     0.79   0.432     .2448908    26.88644
             |
cancer_exh~t |
  Last year  |   1.118565   1.182039     0.11   0.916       .14098    8.874936
2-5 years..  |   1.77e-15   5.24e-16  -114.91   0.000     9.93e-16    3.16e-15
   5+ years  |   1.338076    .254451     1.53   0.126     .9217529    1.942436
             |
cancer_hae~t |
  Last year  |   .6850876   .6066689    -0.43   0.669     .1207751    3.886106
2-5 years..  |    1.85075   1.004412     1.13   0.257     .6388461    5.361661
   5+ years  |   1.388799   .2255776     2.02   0.043     1.010141      1.9094
             |
1.~r_disease |   .9686342   .1651156    -0.19   0.852     .6935249    1.352875
1.stroke_d~a |   .9712568   .1726384    -0.16   0.870     .6855438    1.376046
1.other_ne~o |     1.1786   .2050208     0.94   0.345     .8381037    1.657431
             |
reduced_ki~t |
Stage 3a/..  |   1.688183   .4921039     1.80   0.072     .9534434    2.989124
      1.esrd |   .9787131   .1593518    -0.13   0.895     .7113196    1.346623
1.other_tr~t |   1.018247   .1861788     0.10   0.921     .7115692    1.457098
  1.asplenia |   1.183924   .2089804     0.96   0.339     .8376716      1.6733
1.ra_sle_p~s |   .7337946   .1542029    -1.47   0.141     .4860703    1.107771
1.other_im~o |   .9395981   .1680346    -0.35   0.728     .6617838    1.334038
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJM
> ODEL_ageband_1_timeperiod4_2ndVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covid_death_kids_cat4_FULLYADJMODEL_ag
> eband_1_timeperiod4_2ndVaccCensor.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covid_death_2ndVac
> cCensor.log
  log type:  text
 closed on:  28 Oct 2021, 11:24:45
-------------------------------------------------------------------------------
