-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission_1st
> VaccCensor.log
  log type:  text
 opened on:  28 Oct 2021, 11:31:55

. 
. 
. *****************************************************************************
> ********
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , exposure(string) age(string) 
  2. 
. timer clear
  3. timer on 1
  4.         capture stcox   `exposure'                              ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                                ///
>                         `if'                                                 
>    ///
>                         , strata(stp) vce(cluster household_id)
  5. timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. local outcome `1'

. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. forvalues period=0/4 {
  3. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  4. 
. /*Censor at date of second vacc_7ds
> gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
> replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>seco
> nd_vacc_plus_7d
> stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)*/
.         
. *Censor at date of first vacc_7ds
. gen second_vacc_plus_7d=covid_vacc_date+7
  5. replace stime_`outcome'         = second_vacc_plus_7d if stime_`outcome'>s
> econd_vacc_plus_7d
  6. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  7. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  8. stsplit cat_time, at(0,85,154, 216, 263, 400)
  9. recode cat_time 85=1 154=2 216=3 263=4 
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. }
 14. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 15. stsplit cat_time, at(0,92,161,222,270, 400)
 16. recode cat_time 92=1 161=2 222=3 270=4
 17. recode `outcome' .=0 
 18. tab cat_time
 19. tab cat_time `outcome'
 20. }
 21. 
. keep if cat_time==`period'
 22. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. 
. 
. foreach exposure_type in kids_cat4  {
 23. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, exposure("i.`exposure_type'") age("age1 age2 age3") 
 24. if _rc==0{
 25. estimates
 26. estimates save "./output/an_multivariate_cox_models_`outcome'_`exposure_ty
> pe'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_1stVaccCensor", replace
 27.         /*  Proportional Hazards test 
>         * Based on Schoenfeld residuals 
>         timer clear 
>         timer on 1
>         if e(N_fail)>0 estat phtest, d
>         timer off 1
>         timer list */
.         
. }
 28. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
 29. 
. }
 30. }
 31. }
(8,043 missing values generated)
(5,500 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        212  observations end on or before enter()
------------------------------------------------------------------------------
     15,870  observations remaining, representing
     15,870  subjects
      2,142  failures in single-failure-per-subject data
  2,025,960  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(19,011 observations (episodes) created)
(cat_time: 19011 changes made)
(covidadmission: 19011 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,870       45.50       45.50
          1 |      8,944       25.64       71.14
          2 |      5,221       14.97       86.11
          3 |      2,896        8.30       94.41
          4 |      1,950        5.59      100.00
------------+-----------------------------------
      Total |     34,881      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,640      1,230 |    15,870 
         1 |     8,440        504 |     8,944 
         2 |     4,962        259 |     5,221 
         3 |     2,795        101 |     2,896 
         4 |     1,902         48 |     1,950 
-----------+----------------------+----------
     Total |    32,739      2,142 |    34,881 
(19,223 observations deleted)
   1:      9.19 /        1 =       9.1890

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,870             Number of obs    =      15,870
No. of failures      =        1,230
Time at risk         =      1124913
                                                Wald chi2(42)    =       44.30
Log pseudolikelihood =   -8732.1441             Prob > chi2      =      0.3751

                       (Std. Err. adjusted for 1,115 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.171814   .2339461     0.79   0.427     .7923571    1.732991
 only 12-18  |   1.438437   .3548325     1.47   0.141     .8869868     2.33273
      mixed  |   1.192681   .2204244     0.95   0.340     .8302522     1.71332
             |
        age1 |   1.013708   .0107179     1.29   0.198      .992918    1.034934
        age2 |   .9641236   .0322951    -1.09   0.275     .9028594    1.029545
        age3 |   1.096719   .1042198     0.97   0.331     .9103471    1.321247
      1.male |   1.072949   .0630474     1.20   0.231     .9562282    1.203916
             |
   obese4cat |
Obese I ..)  |   1.008743   .0886469     0.10   0.921     .8491381    1.198348
Obese II..)  |   .9701678   .0989386    -0.30   0.766     .7944024    1.184822
Obese II..)  |   .9030246   .1192093    -0.77   0.440     .6971585    1.169681
             |
smoke_nomiss |
     Former  |   1.215778   .2259299     1.05   0.293     .8446454    1.749986
    Current  |   .8672315   .0823512    -1.50   0.134      .719956    1.044634
             |
         imd |
          4  |   1.017316    .073001     0.24   0.811     .8838422    1.170945
5 most de..  |   .9433872   .0925681    -0.59   0.553     .7783367    1.143438
             |
tot_adults~h |
          2  |   1.128759    .455482     0.30   0.764     .5118236    2.489327
          3  |   .6218907   .2112099    -1.40   0.162      .319613    1.210051
             |
   ethnicity |
Asian or ..  |   .9718788   .0995237    -0.28   0.781     .7951448    1.187895
      Other  |   .9507324   .0926035    -0.52   0.604     .7855056    1.150714
             |
1.htdiag_o~p |    1.04252   .0648556     0.67   0.503     .9228497    1.177709
1.~y_disease |   .9565658   .0716463    -0.59   0.553     .8259625    1.107821
    1.asthma |   1.039098   .1124026     0.35   0.723     .8405801    1.284499
1.~c_disease |   .9329598   .0698378    -0.93   0.354     .8056478     1.08039
             |
     diabcat |
T1DM, con..  |   1.116499   .1876355     0.66   0.512      .803171    1.552061
T1DM, unc..  |   1.451696   .4754686     1.14   0.255      .763985    2.758459
T2DM, con..  |   .8546955   .0693689    -1.93   0.053     .7289975    1.002067
T2DM, unc..  |    1.17715   .1669203     1.15   0.250     .8915199    1.554292
Diabetes,..  |    2.10689   1.237981     1.27   0.205     .6660198    6.664946
             |
cancer_exh~t |
  Last year  |   .9719856   .5759663    -0.05   0.962     .3042749    3.104942
2-5 years..  |    .691005   .1793313    -1.42   0.154     .4155041    1.149177
   5+ years  |    .904726   .0731991    -1.24   0.216     .7720554    1.060195
             |
cancer_hae~t |
  Last year  |   .6041192   .3529494    -0.86   0.388     .1922287    1.898572
2-5 years..  |   .8225612   .2054339    -0.78   0.434     .5041751    1.342008
   5+ years  |    .829936   .0670624    -2.31   0.021      .708376    .9723562
             |
1.~r_disease |   1.011176   .0689333     0.16   0.871     .8847058    1.155724
1.stroke_d~a |    .882249   .0644032    -1.72   0.086     .7646354    1.017954
1.other_ne~o |   1.048564   .0706282     0.70   0.481     .9188836    1.196546
             |
reduced_ki~t |
Stage 3a/..  |   .6920279   .4103305    -0.62   0.535     .2164775    2.212251
      1.esrd |   .9814419   .0605524    -0.30   0.761     .8696564    1.107596
1.other_tr~t |    .965856   .0695153    -0.48   0.629      .838782    1.112182
  1.asplenia |   .9826562   .0710412    -0.24   0.809     .8528328    1.132242
1.ra_sle_p~s |   1.063694    .071418     0.92   0.358     .9325363    1.213298
1.other_im~o |   .9664494   .0691182    -0.48   0.633     .8400462    1.111873
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod0_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod0_1stVaccCensor.ster saved
(8,043 missing values generated)
(5,500 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        212  observations end on or before enter()
------------------------------------------------------------------------------
     15,870  observations remaining, representing
     15,870  subjects
      2,142  failures in single-failure-per-subject data
  2,025,960  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(19,011 observations (episodes) created)
(cat_time: 19011 changes made)
(covidadmission: 19011 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,870       45.50       45.50
          1 |      8,944       25.64       71.14
          2 |      5,221       14.97       86.11
          3 |      2,896        8.30       94.41
          4 |      1,950        5.59      100.00
------------+-----------------------------------
      Total |     34,881      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,640      1,230 |    15,870 
         1 |     8,440        504 |     8,944 
         2 |     4,962        259 |     5,221 
         3 |     2,795        101 |     2,896 
         4 |     1,902         48 |     1,950 
-----------+----------------------+----------
     Total |    32,739      2,142 |    34,881 
(26,149 observations deleted)
   1:      9.65 /        1 =       9.6480

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        8,944             Number of obs    =       8,944
No. of failures      =          504
Time at risk         =       482706
                                                Wald chi2(42)    =    34574.45
Log pseudolikelihood =    -3278.677             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,030 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.378539   .4283526     1.03   0.302     .7497657    2.534617
 only 12-18  |   1.021924   .4705589     0.05   0.962     .4144491      2.5198
      mixed  |   1.266454   .3717581     0.80   0.421     .7124027    2.251403
             |
        age1 |   .9949037   .0159386    -0.32   0.750     .9641501    1.026638
        age2 |   .9915228   .0512099    -0.16   0.869     .8960662    1.097148
        age3 |   1.057751   .1560727     0.38   0.704     .7921135    1.412471
      1.male |   .9804424   .0887056    -0.22   0.827     .8211255     1.17067
             |
   obese4cat |
Obese I ..)  |   1.149935   .1490501     1.08   0.281      .891957    1.482527
Obese II..)  |   .7841975     .13995    -1.36   0.173     .5527361    1.112585
Obese II..)  |   .9124996    .189556    -0.44   0.659     .6073098    1.371056
             |
smoke_nomiss |
     Former  |   .5159162   .2098391    -1.63   0.104     .2324712    1.144957
    Current  |   .7330367   .1114043    -2.04   0.041     .5442057    .9873891
             |
         imd |
          4  |   .9775093   .1113047    -0.20   0.842     .7819848    1.221922
5 most de..  |   1.263995   .1727074     1.71   0.086     .9670317    1.652153
             |
tot_adults~h |
          2  |   2.376087   1.897428     1.08   0.278     .4967455    11.36556
          3  |   .9754436   .7175533    -0.03   0.973     .2306978      4.1244
             |
   ethnicity |
Asian or ..  |   .7363262   .1242393    -1.81   0.070     .5289909    1.024926
      Other  |   .9783731   .1509338    -0.14   0.887     .7230852    1.323791
             |
1.htdiag_o~p |   .7835271   .0759081    -2.52   0.012     .6480218    .9473674
1.~y_disease |   .9208182   .1112017    -0.68   0.495     .7267406    1.166725
    1.asthma |   .7421863   .1456547    -1.52   0.129     .5052007     1.09034
1.~c_disease |   1.017136   .1127301     0.15   0.878     .8185395    1.263917
             |
     diabcat |
T1DM, con..  |    1.10017   .2802499     0.37   0.708     .6677758    1.812547
T1DM, unc..  |   .3984906   .3922959    -0.93   0.350     .0578694     2.74402
T2DM, con..  |   .9852975   .1194083    -0.12   0.903     .7769807    1.249466
T2DM, unc..  |   .7533639   .2108971    -1.01   0.312     .4352301    1.304039
Diabetes,..  |   1.24e-14   4.61e-15   -86.34   0.000     6.01e-15    2.57e-14
             |
cancer_exh~t |
  Last year  |   3.080615   1.763427     1.97   0.049     1.003199    9.459932
2-5 years..  |   .8125021   .3108052    -0.54   0.587     .3838978    1.719623
   5+ years  |   1.155398    .128623     1.30   0.194     .9289081    1.437111
             |
cancer_hae~t |
  Last year  |   .5333907   .5355723    -0.63   0.531     .0745353    3.817056
2-5 years..  |   1.354515   .4084731     1.01   0.314     .7500532    2.446108
   5+ years  |    1.19239   .1367602     1.53   0.125     .9523363    1.492953
             |
1.~r_disease |   1.056353   .1207393     0.48   0.631     .8443421      1.3216
1.stroke_d~a |   1.036901   .1120828     0.34   0.737     .8389331    1.281584
1.other_ne~o |   .9451413   .1082618    -0.49   0.622     .7550841    1.183037
             |
reduced_ki~t |
Stage 3a/..  |   1.31e-14   2.78e-15  -150.34   0.000     8.61e-15    1.98e-14
      1.esrd |   1.049912   .0957708     0.53   0.593     .8780277    1.255445
1.other_tr~t |   .9586517   .1122514    -0.36   0.718     .7620633    1.205954
  1.asplenia |   1.088971   .1158681     0.80   0.423     .8839893    1.341483
1.ra_sle_p~s |   .9358182   .1051888    -0.59   0.555      .750782    1.166458
1.other_im~o |    .811397   .0972967    -1.74   0.081     .6414512    1.026368
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod1_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod1_1stVaccCensor.ster saved
(8,043 missing values generated)
(5,500 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        212  observations end on or before enter()
------------------------------------------------------------------------------
     15,870  observations remaining, representing
     15,870  subjects
      2,142  failures in single-failure-per-subject data
  2,025,960  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(19,011 observations (episodes) created)
(cat_time: 19011 changes made)
(covidadmission: 19011 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,870       45.50       45.50
          1 |      8,944       25.64       71.14
          2 |      5,221       14.97       86.11
          3 |      2,896        8.30       94.41
          4 |      1,950        5.59      100.00
------------+-----------------------------------
      Total |     34,881      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,640      1,230 |    15,870 
         1 |     8,440        504 |     8,944 
         2 |     4,962        259 |     5,221 
         3 |     2,795        101 |     2,896 
         4 |     1,902         48 |     1,950 
-----------+----------------------+----------
     Total |    32,739      2,142 |    34,881 
(29,872 observations deleted)
   1:      1.93 /        1 =       1.9300

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,221             Number of obs    =       5,221
No. of failures      =          259
Time at risk         =       243134
                                                Wald chi2(42)    =       58.95
Log pseudolikelihood =   -1532.6015             Prob > chi2      =      0.0429

                         (Std. Err. adjusted for 927 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9891275   .4580648    -0.02   0.981     .3990809    2.451566
 only 12-18  |   1.761454   .9142975     1.09   0.275     .6368662    4.871858
      mixed  |   1.022312   .4415167     0.05   0.959     .4384963    2.383421
             |
        age1 |   .9633515   .0220405    -1.63   0.103     .9211071    1.007533
        age2 |    1.12189   .0836564     1.54   0.123     .9693448     1.29844
        age3 |   .7312282   .1559777    -1.47   0.142     .4813753    1.110765
      1.male |   1.207602   .1495799     1.52   0.128     .9473041    1.539423
             |
   obese4cat |
Obese I ..)  |   1.292341   .2207329     1.50   0.133     .9246796    1.806189
Obese II..)  |   .9351494   .2169819    -0.29   0.773     .5934409    1.473617
Obese II..)  |    1.02749   .2752089     0.10   0.919     .6078365    1.736874
             |
smoke_nomiss |
     Former  |   1.364477   .4819625     0.88   0.379     .6828159    2.726646
    Current  |   .7394145   .1558577    -1.43   0.152     .4891783    1.117658
             |
         imd |
          4  |   .8459672   .1399969    -1.01   0.312     .6116323    1.170083
5 most de..  |   .6392828   .1546115    -1.85   0.064     .3979501    1.026969
             |
tot_adults~h |
          2  |   2.403158   2.714279     0.78   0.438     .2626524    21.98788
          3  |   .9948923   1.003636    -0.01   0.996     .1377506    7.185526
             |
   ethnicity |
Asian or ..  |   .9082288   .2003004    -0.44   0.662     .5894836    1.399326
      Other  |   1.166244   .2368034     0.76   0.449     .7833477    1.736297
             |
1.htdiag_o~p |   1.007284   .1347919     0.05   0.957     .7749018    1.309355
1.~y_disease |    1.17846   .1800651     1.07   0.283     .8734819    1.589922
    1.asthma |   .6989436   .1890014    -1.32   0.185     .4114042    1.187451
1.~c_disease |   1.004509   .1717176     0.03   0.979     .7185276    1.404313
             |
     diabcat |
T1DM, con..  |   1.214943   .4398861     0.54   0.591     .5975402    2.470271
T1DM, unc..  |   1.036981   1.083884     0.03   0.972     .1336809    8.044006
T2DM, con..  |   1.096658   .1764597     0.57   0.566     .8000317    1.503264
T2DM, unc..  |   1.540315    .433454     1.54   0.125     .8873121    2.673886
Diabetes,..  |   8.580887   10.29764     1.79   0.073      .816644    90.16367
             |
cancer_exh~t |
  Last year  |   1.834331   1.747025     0.64   0.524     .2836541    11.86222
2-5 years..  |   2.750476   .8414525     3.31   0.001      1.51008    5.009747
   5+ years  |   .9283398   .1600609    -0.43   0.666      .662134    1.301571
             |
cancer_hae~t |
  Last year  |   3.384276   2.312113     1.78   0.074      .887015    12.91221
2-5 years..  |    1.21731   .5569227     0.43   0.667     .4965629    2.984202
   5+ years  |   .9635444   .1578838    -0.23   0.821     .6988695    1.328457
             |
1.~r_disease |   .9662523   .1579458    -0.21   0.834     .7013764    1.331159
1.stroke_d~a |   .6757556   .1182618    -2.24   0.025     .4795387    .9522603
1.other_ne~o |   .8769465   .1448584    -0.79   0.427     .6344061    1.212213
             |
reduced_ki~t |
Stage 3a/..  |   .7471886   .7282105    -0.30   0.765     .1106238     5.04675
      1.esrd |   .8330458   .1114347    -1.37   0.172     .6409226     1.08276
1.other_tr~t |   .7935769    .133726    -1.37   0.170     .5703647    1.104143
  1.asplenia |   1.130799   .1665394     0.83   0.404      .847274      1.5092
1.ra_sle_p~s |   .8832752   .1431284    -0.77   0.444     .6429318    1.213465
1.other_im~o |   .9421403   .1510134    -0.37   0.710     .6881428     1.28989
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod2_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod2_1stVaccCensor.ster saved
(8,043 missing values generated)
(5,500 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        212  observations end on or before enter()
------------------------------------------------------------------------------
     15,870  observations remaining, representing
     15,870  subjects
      2,142  failures in single-failure-per-subject data
  2,025,960  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(19,011 observations (episodes) created)
(cat_time: 19011 changes made)
(covidadmission: 19011 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,870       45.50       45.50
          1 |      8,944       25.64       71.14
          2 |      5,221       14.97       86.11
          3 |      2,896        8.30       94.41
          4 |      1,950        5.59      100.00
------------+-----------------------------------
      Total |     34,881      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,640      1,230 |    15,870 
         1 |     8,440        504 |     8,944 
         2 |     4,962        259 |     5,221 
         3 |     2,795        101 |     2,896 
         4 |     1,902         48 |     1,950 
-----------+----------------------+----------
     Total |    32,739      2,142 |    34,881 
(32,197 observations deleted)
   1:      2.92 /        1 =       2.9250

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,896             Number of obs    =       2,896
No. of failures      =          101
Time at risk         =       116246
                                                Wald chi2(42)    =    17960.05
Log pseudolikelihood =   -528.05674             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 802 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |     1.2426   .9115765     0.30   0.767     .2950436    5.233309
 only 12-18  |    1.49707   1.369927     0.44   0.659     .2490757    8.998144
      mixed  |   1.718316   1.268063     0.73   0.463     .4045231    7.298992
             |
        age1 |   1.024283   .0435093     0.56   0.572     .9424597     1.11321
        age2 |      .9246   .1249062    -0.58   0.562     .7095177    1.204882
        age3 |   1.259291    .487721     0.60   0.552     .5894643    2.690263
      1.male |   1.069797   .2292097     0.31   0.753     .7029542     1.62808
             |
   obese4cat |
Obese I ..)  |   .8319489    .270825    -0.57   0.572      .439546    1.574668
Obese II..)  |   1.153091   .4180229     0.39   0.694     .5666079    2.346629
Obese II..)  |   .7051616   .3233181    -0.76   0.446     .2870852    1.732074
             |
smoke_nomiss |
     Former  |   2.403805   1.030614     2.05   0.041     1.037415     5.56988
    Current  |   1.332151   .3941244     0.97   0.332     .7459685    2.378955
             |
         imd |
          4  |   1.352634   .3603916     1.13   0.257     .8023956    2.280194
5 most de..  |   1.245931   .3913077     0.70   0.484     .6732219    2.305842
             |
tot_adults~h |
          2  |   .3252599   .3541139    -1.03   0.302     .0385051    2.747531
          3  |   .0959749   .0752879    -2.99   0.003     .0206267    .4465664
             |
   ethnicity |
Asian or ..  |   .5499029   .2244191    -1.47   0.143     .2471183    1.223678
      Other  |   .5120361   .2214069    -1.55   0.122     .2194001     1.19499
             |
1.htdiag_o~p |   .6743592   .1611866    -1.65   0.099     .4221196    1.077326
1.~y_disease |   1.540374   .3778805     1.76   0.078      .952383    2.491384
    1.asthma |   .7023928    .335895    -0.74   0.460     .2751202    1.793237
1.~c_disease |   1.039848   .2590965     0.16   0.875     .6380839    1.694578
             |
     diabcat |
T1DM, con..  |    1.05005   .6479122     0.08   0.937     .3133239    3.519061
T1DM, unc..  |   3.67e-16   1.65e-16   -78.94   0.000     1.52e-16    8.88e-16
T2DM, con..  |   .8864392   .2625322    -0.41   0.684     .4960813    1.583963
T2DM, unc..  |   .5323459   .3939388    -0.85   0.394     .1248246    2.270323
Diabetes,..  |   2.86e-16   3.09e-16   -33.10   0.000     3.44e-17    2.38e-15
             |
cancer_exh~t |
  Last year  |   5.61e-16   3.82e-16   -51.53   0.000     1.48e-16    2.13e-15
2-5 years..  |   4.586687   1.956971     3.57   0.000     1.987571    10.58463
   5+ years  |   .4058798   .1527218    -2.40   0.017      .194139     .848559
             |
cancer_hae~t |
  Last year  |   3.42e-16   2.00e-16   -60.86   0.000     1.09e-16    1.08e-15
2-5 years..  |   1.602858   1.162948     0.65   0.516     .3866416    6.644792
   5+ years  |   1.309175   .3300398     1.07   0.285     .7987519    2.145772
             |
1.~r_disease |   .9402826   .2361267    -0.25   0.806     .5747804    1.538207
1.stroke_d~a |   .6697269   .1961602    -1.37   0.171     .3772111     1.18908
1.other_ne~o |   .7928526     .20983    -0.88   0.380     .4719763    1.331879
             |
reduced_ki~t |
Stage 3a/..  |   1.264817   1.570883     0.19   0.850     .1108787    14.42803
      1.esrd |   .6493814     .13688    -2.05   0.041     .4296146    .9815685
1.other_tr~t |   1.620372   .3455078     2.26   0.024     1.066879    2.461015
  1.asplenia |   .9995257   .2514903    -0.00   0.998     .6104125    1.636683
1.ra_sle_p~s |    1.13744   .2860902     0.51   0.609     .6947575    1.862188
1.other_im~o |   .9432677   .2283459    -0.24   0.809     .5869166     1.51598
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod3_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod3_1stVaccCensor.ster saved
(8,043 missing values generated)
(5,500 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
        212  observations end on or before enter()
------------------------------------------------------------------------------
     15,870  observations remaining, representing
     15,870  subjects
      2,142  failures in single-failure-per-subject data
  2,025,960  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(19,011 observations (episodes) created)
(cat_time: 19011 changes made)
(covidadmission: 19011 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,870       45.50       45.50
          1 |      8,944       25.64       71.14
          2 |      5,221       14.97       86.11
          3 |      2,896        8.30       94.41
          4 |      1,950        5.59      100.00
------------+-----------------------------------
      Total |     34,881      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,640      1,230 |    15,870 
         1 |     8,440        504 |     8,944 
         2 |     4,962        259 |     5,221 
         3 |     2,795        101 |     2,896 
         4 |     1,902         48 |     1,950 
-----------+----------------------+----------
     Total |    32,739      2,142 |    34,881 
(33,143 observations deleted)
   1:      2.72 /        1 =       2.7230

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,950             Number of obs    =       1,950
No. of failures      =           48
Time at risk         =        58961
                                                Wald chi2(32)    =       65.90
Log pseudolikelihood =   -225.47323             Prob > chi2      =      0.0004

                         (Std. Err. adjusted for 724 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8388636   .9733548    -0.15   0.880     .0863019     8.15384
 only 12-18  |   6.37e-20          .        .       .            .           .
      mixed  |    .818997   .8859516    -0.18   0.854     .0982864    6.824505
             |
        age1 |   1.086211    .076345     1.18   0.239     .9464263    1.246641
        age2 |     .83831   .1640542    -0.90   0.367     .5712519    1.230217
        age3 |   1.484266   .7872988     0.74   0.457     .5248184    4.197728
      1.male |   .9678707   .3068856    -0.10   0.918     .5199055    1.801816
             |
   obese4cat |
Obese I ..)  |   1.842029   .7278051     1.55   0.122     .8491368    3.995905
Obese II..)  |   1.419488   .6394713     0.78   0.437     .5870438    3.432363
Obese II..)  |    1.80507   .9668696     1.10   0.270     .6317648     5.15742
             |
smoke_nomiss |
     Former  |   6.60e-20          .        .       .            .           .
    Current  |    2.38499   .8461711     2.45   0.014      1.18984    4.780623
             |
         imd |
          4  |   .5314214   .2339676    -1.44   0.151     .2242243    1.259492
5 most de..  |   .5380278   .3325311    -1.00   0.316     .1602193    1.806736
             |
tot_adults~h |
          2  |   .0037493          .        .       .            .           .
          3  |   2.23e+16          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .7034075   .3482199    -0.71   0.477     .2665766    1.856059
      Other  |   .2147911   .2284053    -1.45   0.148     .0267216    1.726514
             |
1.htdiag_o~p |   .9570912   .3282239    -0.13   0.898     .4887009    1.874405
1.~y_disease |   .6961293   .2848563    -0.89   0.376     .3121606    1.552394
    1.asthma |   1.173768   .6601211     0.28   0.776     .3898258    3.534221
1.~c_disease |   .9598199    .345127    -0.11   0.909     .4743721     1.94205
             |
     diabcat |
T1DM, con..  |   .7961922   .7558413    -0.24   0.810     .1238669    5.117769
T1DM, unc..  |   8.57e-19          .        .       .            .           .
T2DM, con..  |   1.113777   .4379845     0.27   0.784     .5153111    2.407281
T2DM, unc..  |    .517209   .4697525    -0.73   0.468     .0872101    3.067366
Diabetes,..  |   3.90e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.09e-18          .        .       .            .           .
2-5 years..  |   6.30e-20          .        .       .            .           .
   5+ years  |    .465381   .2278626    -1.56   0.118     .1782536    1.215008
             |
cancer_hae~t |
  Last year  |   3.11e-19          .        .       .            .           .
2-5 years..  |   1.626144   1.536146     0.51   0.607     .2553097    10.35741
   5+ years  |   .6871914   .2998524    -0.86   0.390     .2921866      1.6162
             |
1.~r_disease |   1.296905   .4467094     0.75   0.450      .660265    2.547407
1.stroke_d~a |   .5096793   .2373065    -1.45   0.148      .204634    1.269452
1.other_ne~o |   1.085925   .4337174     0.21   0.836     .4963991    2.375576
             |
reduced_ki~t |
Stage 3a/..  |   2.53e-19          .        .       .            .           .
      1.esrd |   1.078419    .313048     0.26   0.795     .6105161    1.904925
1.other_tr~t |   2.063373   .6954195     2.15   0.032     1.065852    3.994464
  1.asplenia |   1.201502   .4327986     0.51   0.610     .5930747    2.434108
1.ra_sle_p~s |   .8984716   .3427557    -0.28   0.779     .4253844    1.897698
1.other_im~o |     1.0303   .3799479     0.08   0.935     .5001066    2.122583
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_0_timeperiod4_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_0_timeperiod4_1stVaccCensor.ster saved
(2,302 missing values generated)
(1,507 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
      4,497  observations remaining, representing
      4,497  subjects
        613  failures in single-failure-per-subject data
    573,105  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(5,413 observations (episodes) created)
(cat_time: 5413 changes made)
(covidadmission: 5413 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,497       45.38       45.38
          1 |      2,487       25.10       70.47
          2 |      1,515       15.29       85.76
          3 |        845        8.53       94.29
          4 |        566        5.71      100.00
------------+-----------------------------------
      Total |      9,910      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,169        328 |     4,497 
         1 |     2,349        138 |     2,487 
         2 |     1,427         88 |     1,515 
         3 |       805         40 |       845 
         4 |       547         19 |       566 
-----------+----------------------+----------
     Total |     9,297        613 |     9,910 
(5,467 observations deleted)
   1:      5.43 /        1 =       5.4270

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,497             Number of obs    =       4,497
No. of failures      =          328
Time at risk         =       315326
                                                Wald chi2(42)    =    34518.15
Log pseudolikelihood =    -1903.221             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 923 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.756644   1.051027     0.94   0.346     .5437471    5.675062
 only 12-18  |   1.659044   1.030247     0.82   0.415     .4912146    5.603305
      mixed  |   1.733623    .994472     0.96   0.337     .5632138     5.33625
             |
        age1 |   .9676086   .0499121    -0.64   0.523     .8745653    1.070551
        age2 |   1.236109   .3427637     0.76   0.445     .7178359    2.128573
        age3 |   .5962375   .3564096    -0.87   0.387     .1847571    1.924143
      1.male |   .8894514   .1014534    -1.03   0.304     .7112656    1.112276
             |
   obese4cat |
Obese I ..)  |   .8755477   .1413802    -0.82   0.410      .638015    1.201514
Obese II..)  |   .7479743   .1695158    -1.28   0.200     .4797072    1.166265
Obese II..)  |   1.591718     .33682     2.20   0.028     1.051345    2.409833
             |
smoke_nomiss |
     Former  |   1.649489   .5135032     1.61   0.108     .8961106    3.036249
    Current  |   .8825415   .1525377    -0.72   0.470     .6289473    1.238386
             |
         imd |
          4  |   .9097941   .1334086    -0.64   0.519     .6825371    1.212718
5 most de..  |   1.063854    .202489     0.33   0.745     .7326027    1.544884
             |
tot_adults~h |
          2  |   1.188888   .9883076     0.21   0.835      .233103    6.063649
          3  |   .4976712   .3536046    -0.98   0.326     .1236369    2.003258
             |
   ethnicity |
Asian or ..  |   .9566373   .1799274    -0.24   0.814     .6616839     1.38307
      Other  |   1.127417   .2021909     0.67   0.504      .793287    1.602282
             |
1.htdiag_o~p |   .7891201   .1012422    -1.85   0.065     .6136716    1.014729
1.~y_disease |   .8476499   .1241171    -1.13   0.259     .6361791    1.129415
    1.asthma |    1.21036   .2298898     1.01   0.315     .8341447    1.756255
1.~c_disease |   1.139721   .1483443     1.00   0.315      .883095    1.470922
             |
     diabcat |
T1DM, con..  |   .8700269   .3041152    -0.40   0.690     .4385286    1.726106
T1DM, unc..  |   4.08e-18   1.06e-18  -153.65   0.000     2.45e-18    6.79e-18
T2DM, con..  |   1.019681   .1495416     0.13   0.894     .7649471    1.359245
T2DM, unc..  |   1.026484   .2932038     0.09   0.927     .5864293    1.796753
Diabetes,..  |   3.75e-18   2.07e-18   -72.77   0.000     1.27e-18    1.11e-17
             |
cancer_exh~t |
  Last year  |   1.261613   .8943059     0.33   0.743     .3144449    5.061836
2-5 years..  |   1.058619   .4713236     0.13   0.898     .4423472    2.533471
   5+ years  |   1.016708   .1474363     0.11   0.909     .7651749    1.350927
             |
cancer_hae~t |
  Last year  |   1.003155   .7173181     0.00   0.996      .247005    4.074085
2-5 years..  |   .9367339   .4108603    -0.15   0.882     .3965256    2.212897
   5+ years  |   1.153938   .1599131     1.03   0.302     .8794733    1.514057
             |
1.~r_disease |   .9085002   .1305714    -0.67   0.504     .6854704    1.204097
1.stroke_d~a |   1.034684    .144302     0.24   0.807     .7872177    1.359941
1.other_ne~o |   1.050604   .1498857     0.35   0.729     .7943306    1.389558
             |
reduced_ki~t |
Stage 3a/..  |   .7098777   .2456802    -0.99   0.322     .3602408     1.39886
      1.esrd |   1.005078   .1165796     0.04   0.965     .8006974    1.261628
1.other_tr~t |   .8230425   .1195752    -1.34   0.180     .6190932    1.094179
  1.asplenia |   1.081391   .1509696     0.56   0.575     .8225247    1.421727
1.ra_sle_p~s |   1.027334   .1433979     0.19   0.847     .7814459    1.350593
1.other_im~o |   1.147378   .1573119     1.00   0.316     .8770051    1.501105
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod0_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod0_1stVaccCensor.ster saved
(2,302 missing values generated)
(1,507 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
      4,497  observations remaining, representing
      4,497  subjects
        613  failures in single-failure-per-subject data
    573,105  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(5,413 observations (episodes) created)
(cat_time: 5413 changes made)
(covidadmission: 5413 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,497       45.38       45.38
          1 |      2,487       25.10       70.47
          2 |      1,515       15.29       85.76
          3 |        845        8.53       94.29
          4 |        566        5.71      100.00
------------+-----------------------------------
      Total |      9,910      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,169        328 |     4,497 
         1 |     2,349        138 |     2,487 
         2 |     1,427         88 |     1,515 
         3 |       805         40 |       845 
         4 |       547         19 |       566 
-----------+----------------------+----------
     Total |     9,297        613 |     9,910 
(7,477 observations deleted)
   1:      2.55 /        1 =       2.5530

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,487             Number of obs    =       2,487
No. of failures      =          138
Time at risk         =       136383
                                                Wald chi2(42)    =    24853.86
Log pseudolikelihood =   -707.61649             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 807 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.193965   1.940328     0.89   0.374     .3876435    12.41729
 only 12-18  |   .6355366   .7597294    -0.38   0.705     .0610383     6.61727
      mixed  |   2.504495   2.194712     1.05   0.295     .4495772    13.95199
             |
        age1 |   .9720365   .0727453    -0.38   0.705     .8394219    1.125602
        age2 |   1.157417   .4529162     0.37   0.709     .5375276    2.492177
        age3 |   .7232425    .603552    -0.39   0.698     .1409123    3.712093
      1.male |   1.000069   .1882005     0.00   1.000     .6915833    1.446157
             |
   obese4cat |
Obese I ..)  |   1.136025   .2570553     0.56   0.573     .7290905    1.770087
Obese II..)  |    .544273   .2294616    -1.44   0.149      .238208     1.24359
Obese II..)  |   1.053048   .4287482     0.13   0.899     .4741129    2.338916
             |
smoke_nomiss |
     Former  |   3.922114   1.401181     3.83   0.000     1.947274     7.89975
    Current  |   .9104061   .2566459    -0.33   0.739     .5239372    1.581944
             |
         imd |
          4  |   .9444467   .2120844    -0.25   0.799       .60818    1.466637
5 most de..  |    .758297   .2489353    -0.84   0.399     .3984787    1.443024
             |
tot_adults~h |
          2  |   2.124091   2.178066     0.73   0.463     .2846701    15.84909
          3  |   .4330405   .4496405    -0.81   0.420     .0565845    3.314055
             |
   ethnicity |
Asian or ..  |   1.062022   .3102865     0.21   0.837     .5990203    1.882892
      Other  |    1.19633   .3454624     0.62   0.535     .6792835    2.106936
             |
1.htdiag_o~p |   1.340272   .2459229     1.60   0.110     .9354231    1.920337
1.~y_disease |   .8002744   .1784225    -1.00   0.318     .5169662    1.238841
    1.asthma |   1.498284   .4008294     1.51   0.131     .8869024    2.531118
1.~c_disease |   1.863157   .3493062     3.32   0.001     1.290225    2.690503
             |
     diabcat |
T1DM, con..  |   .8334493   .5263234    -0.29   0.773     .2417382    2.873513
T1DM, unc..  |   1.73e-15   7.14e-16   -82.25   0.000     7.68e-16    3.88e-15
T2DM, con..  |   1.323591   .2853376     1.30   0.193     .8674674    2.019549
T2DM, unc..  |   .7129236     .36416    -0.66   0.508     .2619696    1.940149
Diabetes,..  |   2.01e-15   1.45e-15   -46.89   0.000     4.88e-16    8.26e-15
             |
cancer_exh~t |
  Last year  |   2.07e-15   1.04e-15   -66.93   0.000     7.68e-16    5.57e-15
2-5 years..  |   .4983001   .5226801    -0.66   0.507     .0637739    3.893487
   5+ years  |   1.160094   .2533271     0.68   0.496     .7561682    1.779788
             |
cancer_hae~t |
  Last year  |   1.73e-15   6.52e-16   -90.21   0.000     8.27e-16    3.62e-15
2-5 years..  |   .9458611   .6973378    -0.08   0.940     .2229859    4.012151
   5+ years  |      .8496   .2072807    -0.67   0.504     .5266755    1.370522
             |
1.~r_disease |   .9208832   .2136238    -0.36   0.722     .5844472    1.450988
1.stroke_d~a |   .7596564   .1783798    -1.17   0.242     .4794475    1.203631
1.other_ne~o |   .7509118   .1713528    -1.26   0.209      .480121     1.17443
             |
reduced_ki~t |
Stage 3a/..  |   1.478783   .5813803     1.00   0.320     .6843157      3.1956
      1.esrd |   1.142308   .2022515     0.75   0.452     .8073723    1.616192
1.other_tr~t |   1.360518   .2845132     1.47   0.141     .9030259    2.049787
  1.asplenia |   .8467824   .1988948    -0.71   0.479     .5343663    1.341852
1.ra_sle_p~s |   .9672703   .2134207    -0.15   0.880     .6276779    1.490592
1.other_im~o |   .9180866   .2070465    -0.38   0.705     .5900938    1.428388
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod1_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod1_1stVaccCensor.ster saved
(2,302 missing values generated)
(1,507 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
      4,497  observations remaining, representing
      4,497  subjects
        613  failures in single-failure-per-subject data
    573,105  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(5,413 observations (episodes) created)
(cat_time: 5413 changes made)
(covidadmission: 5413 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,497       45.38       45.38
          1 |      2,487       25.10       70.47
          2 |      1,515       15.29       85.76
          3 |        845        8.53       94.29
          4 |        566        5.71      100.00
------------+-----------------------------------
      Total |      9,910      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,169        328 |     4,497 
         1 |     2,349        138 |     2,487 
         2 |     1,427         88 |     1,515 
         3 |       805         40 |       845 
         4 |       547         19 |       566 
-----------+----------------------+----------
     Total |     9,297        613 |     9,910 
(8,449 observations deleted)
   1:      1.75 /        1 =       1.7510

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,515             Number of obs    =       1,515
No. of failures      =           88
Time at risk         =        70627
                                                Wald chi2(42)    =    60659.08
Log pseudolikelihood =   -399.66936             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 679 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.631555   1.742251     0.46   0.647     .2012099    13.22984
 only 12-18  |   3.679926   4.205035     1.14   0.254     .3918997    34.55439
      mixed  |   1.320762   1.354455     0.27   0.786     .1769738    9.856897
             |
        age1 |   .9677516   .0897812    -0.35   0.724     .8068549    1.160733
        age2 |    1.05822    .551955     0.11   0.914     .3807147     2.94139
        age3 |   .8914023   1.010104    -0.10   0.919     .0967216    8.215311
      1.male |   .8139518    .181383    -0.92   0.356     .5259141    1.259745
             |
   obese4cat |
Obese I ..)  |   .9287307   .2991095    -0.23   0.818     .4940256    1.745943
Obese II..)  |   1.540105   .5038291     1.32   0.187     .8111266    2.924232
Obese II..)  |    .959473   .4885095    -0.08   0.935     .3537113    2.602655
             |
smoke_nomiss |
     Former  |   1.46e-18   4.61e-19  -130.42   0.000     7.90e-19    2.71e-18
    Current  |   .9663964   .3318086    -0.10   0.921     .4930585    1.894141
             |
         imd |
          4  |   .6492938   .1862105    -1.51   0.132     .3701057    1.139087
5 most de..  |   .4780314   .2117227    -1.67   0.096     .2006571    1.138828
             |
tot_adults~h |
          2  |    .004328   .0143848    -1.64   0.102     6.41e-06    2.919986
          3  |   3.80e+15   1.26e+16    10.78   0.000     5.59e+12    2.58e+18
             |
   ethnicity |
Asian or ..  |   .7525081   .3124124    -0.68   0.493     .3335224    1.697842
      Other  |   .7287718   .2808927    -0.82   0.412     .3423815    1.551218
             |
1.htdiag_o~p |   .8532158   .2028824    -0.67   0.504     .5353718     1.35976
1.~y_disease |   .7990142   .2139943    -0.84   0.402     .4726974    1.350597
    1.asthma |   .8769814   .3701253    -0.31   0.756     .3834823    2.005559
1.~c_disease |   1.400695    .351727     1.34   0.180     .8562474    2.291331
             |
     diabcat |
T1DM, con..  |   1.824123   .9861134     1.11   0.266     .6322635    5.262719
T1DM, unc..  |   1.38e-18   6.63e-19   -85.47   0.000     5.37e-19    3.54e-18
T2DM, con..  |   .6939812   .2333001    -1.09   0.277     .3590822    1.341225
T2DM, unc..  |   .7674962   .4576848    -0.44   0.657     .2384927    2.469889
Diabetes,..  |   1.25e-18   1.10e-18   -46.93   0.000     2.23e-19    6.98e-18
             |
cancer_exh~t |
  Last year  |   1.50e-18   7.87e-19   -78.20   0.000     5.36e-19    4.19e-18
2-5 years..  |   .5481142   .5617723    -0.59   0.557     .0735291    4.085856
   5+ years  |   .5355956   .1950868    -1.71   0.086     .2622969    1.093656
             |
cancer_hae~t |
  Last year  |   1.73e-18   7.27e-19   -97.54   0.000     7.63e-19    3.95e-18
2-5 years..  |   1.32e-18   4.09e-19  -133.39   0.000     7.23e-19    2.43e-18
   5+ years  |   1.095731   .2974184     0.34   0.736     .6436634      1.8653
             |
1.~r_disease |   .9207078   .2830861    -0.27   0.788     .5039721    1.682043
1.stroke_d~a |   .7748786   .2252821    -0.88   0.380     .4382905    1.369952
1.other_ne~o |   .9321654   .2388653    -0.27   0.784     .5641239    1.540322
             |
reduced_ki~t |
Stage 3a/..  |   1.534302   .8074371     0.81   0.416     .5469656    4.303894
      1.esrd |   .8115887   .1898431    -0.89   0.372     .5131294    1.283645
1.other_tr~t |   .8339311   .2254053    -0.67   0.502     .4909722    1.416457
  1.asplenia |   .9074273   .2845964    -0.31   0.757     .4907378    1.677931
1.ra_sle_p~s |   1.032618   .2961733     0.11   0.911      .588572    1.811671
1.other_im~o |   .8571748    .260833    -0.51   0.613     .4721217    1.556269
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod2_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod2_1stVaccCensor.ster saved
(2,302 missing values generated)
(1,507 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
      4,497  observations remaining, representing
      4,497  subjects
        613  failures in single-failure-per-subject data
    573,105  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(5,413 observations (episodes) created)
(cat_time: 5413 changes made)
(covidadmission: 5413 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,497       45.38       45.38
          1 |      2,487       25.10       70.47
          2 |      1,515       15.29       85.76
          3 |        845        8.53       94.29
          4 |        566        5.71      100.00
------------+-----------------------------------
      Total |      9,910      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,169        328 |     4,497 
         1 |     2,349        138 |     2,487 
         2 |     1,427         88 |     1,515 
         3 |       805         40 |       845 
         4 |       547         19 |       566 
-----------+----------------------+----------
     Total |     9,297        613 |     9,910 
(9,119 observations deleted)
   1:      0.92 /        1 =       0.9170

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          845             Number of obs    =         845
No. of failures      =           40
Time at risk         =        33822
                                                Wald chi2(41)    =    26126.27
Log pseudolikelihood =   -149.08494             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 505 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   4.82e+08   4.85e+08    19.89   0.000     6.73e+07    3.46e+09
 only 12-18  |   2.18e+09          .        .       .            .           .
      mixed  |   4.87e+08   4.15e+08    23.45   0.000     9.14e+07    2.59e+09
             |
        age1 |   1.138008    .169748     0.87   0.386     .8495286    1.524448
        age2 |   .4990584   .3647516    -0.95   0.342     .1191312     2.09063
        age3 |   3.869523   5.917861     0.88   0.376     .1931395    77.52537
      1.male |   1.021862   .3534881     0.06   0.950     .5187282    2.013004
             |
   obese4cat |
Obese I ..)  |   .7428115   .4766947    -0.46   0.643     .2111666    2.612955
Obese II..)  |    1.38343   .7422562     0.60   0.545      .483347    3.959635
Obese II..)  |   2.272791   1.544913     1.21   0.227     .5997377    8.613062
             |
smoke_nomiss |
     Former  |   1.30e-17   1.47e-17   -34.38   0.000     1.42e-18    1.20e-16
    Current  |   .8362264   .4780335    -0.31   0.754      .272728       2.564
             |
         imd |
          4  |    .403599   .1955214    -1.87   0.061     .1561672    1.043062
5 most de..  |    .314859   .2404927    -1.51   0.130     .0704627    1.406931
             |
tot_adults~h |
          2  |   .0870599   .3824774    -0.56   0.578     .0000159    477.9386
          3  |   2.72e+15   1.21e+16     8.01   0.000     4.55e+11    1.62e+19
             |
   ethnicity |
Asian or ..  |   1.541624   .9020641     0.74   0.459     .4896743    4.853439
      Other  |   .6684791    .445811    -0.60   0.546     .1808917    2.470342
             |
1.htdiag_o~p |   .7094243   .2472659    -0.98   0.325     .3582815    1.404713
1.~y_disease |   .7179852   .2914214    -0.82   0.414     .3240584    1.590771
    1.asthma |   2.132044   1.208833     1.34   0.182      .701745    6.477582
1.~c_disease |   1.813124   .6838659     1.58   0.115     .8657154    3.797343
             |
     diabcat |
T1DM, con..  |   1.257696     1.0915     0.26   0.792     .2295382    6.891228
T1DM, unc..  |   9.01e-18   7.86e-18   -45.00   0.000     1.63e-18    4.98e-17
T2DM, con..  |   .5983052   .3226189    -0.95   0.341     .2079395    1.721507
T2DM, unc..  |   1.369009    .860285     0.50   0.617     .3994951    4.691386
Diabetes,..  |   1.67e-17   2.27e-17   -28.41   0.000     1.16e-18    2.40e-16
             |
cancer_exh~t |
  Last year  |   29.03671   22.00902     4.44   0.000      6.57295    128.2728
2-5 years..  |   1.268508   1.442204     0.21   0.834     .1366273    11.77739
   5+ years  |   .8528148   .4522586    -0.30   0.764     .3016141    2.411336
             |
cancer_hae~t |
  Last year  |   2.95e-17   1.74e-17   -64.52   0.000     9.28e-18    9.37e-17
2-5 years..  |   1.23e-17   7.57e-18   -63.48   0.000     3.71e-18    4.11e-17
   5+ years  |   1.344778   .6604939     0.60   0.546     .5135457    3.521455
             |
1.~r_disease |   .4241042   .2078802    -1.75   0.080     .1622726    1.108409
1.stroke_d~a |   1.138567   .5204137     0.28   0.776     .4648291    2.788842
1.other_ne~o |   .7942301   .3343056    -0.55   0.584      .348065    1.812309
             |
reduced_ki~t |
Stage 3a/..  |   .8721216   .9000779    -0.13   0.895     .1153692    6.592715
      1.esrd |   .7435934   .2697327    -0.82   0.414      .365232    1.513918
1.other_tr~t |   1.260343   .5158095     0.57   0.572        .5651    2.810946
  1.asplenia |    .660147   .3266267    -0.84   0.401     .2503135    1.740993
1.ra_sle_p~s |   .5679198   .3221579    -1.00   0.319      .186825    1.726391
1.other_im~o |   1.944956   .7806756     1.66   0.097     .8856264    4.271389
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod3_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod3_1stVaccCensor.ster saved
(2,302 missing values generated)
(1,507 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
      4,497  observations remaining, representing
      4,497  subjects
        613  failures in single-failure-per-subject data
    573,105  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(5,413 observations (episodes) created)
(cat_time: 5413 changes made)
(covidadmission: 5413 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,497       45.38       45.38
          1 |      2,487       25.10       70.47
          2 |      1,515       15.29       85.76
          3 |        845        8.53       94.29
          4 |        566        5.71      100.00
------------+-----------------------------------
      Total |      9,910      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,169        328 |     4,497 
         1 |     2,349        138 |     2,487 
         2 |     1,427         88 |     1,515 
         3 |       805         40 |       845 
         4 |       547         19 |       566 
-----------+----------------------+----------
     Total |     9,297        613 |     9,910 
(9,398 observations deleted)
   1:      0.79 /        1 =       0.7860

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects      =          566             Number of obs    =         566
No. of failures      =           19
Time at risk         =        16947
                                                Wald chi2(32)    =      157.53
Log pseudolikelihood =   -53.663466             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 389 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .2964222   .2933149    -1.23   0.219     .0426218    2.061529
 only 12-18  |   1.22e-20          .        .       .            .           .
      mixed  |   .1342119    .134293    -2.01   0.045     .0188832    .9539088
             |
        age1 |   .8510686   .2323907    -0.59   0.555     .4983536    1.453421
        age2 |   3.848087   5.509557     0.94   0.347     .2325542    63.67451
        age3 |   .0533128   .1622341    -0.96   0.335      .000137    20.75347
      1.male |   1.312774   .7562191     0.47   0.637     .4244807     4.05996
             |
   obese4cat |
Obese I ..)  |   .7230058   .6009726    -0.39   0.696     .1417787    3.686995
Obese II..)  |     .27333   .2752078    -1.29   0.198     .0379873    1.966693
Obese II..)  |   .6309276   .7755735    -0.37   0.708     .0567064    7.019833
             |
smoke_nomiss |
     Former  |   6.50e-20          .        .       .            .           .
    Current  |   .5373364   .5062178    -0.66   0.510     .0847891    3.405277
             |
         imd |
          4  |   1.339534   .5511079     0.71   0.477     .5980729     3.00022
5 most de..  |   1.295707   1.157328     0.29   0.772     .2250155    7.461077
             |
tot_adults~h |
          2  |   .0644854          .        .       .            .           .
          3  |   2.68e+17          .        .       .            .           .
             |
   ethnicity |
Asian or ..  |   .8818099   .7141002    -0.16   0.877     .1803274    4.312093
      Other  |   3.040123   1.822195     1.86   0.064     .9390664     9.84206
             |
1.htdiag_o~p |   1.720762    1.04949     0.89   0.374     .5206843    5.686789
1.~y_disease |   .5290737   .4537568    -0.74   0.458     .0985119    2.841475
    1.asthma |   3.605728   2.754388     1.68   0.093     .8068016    16.11459
1.~c_disease |   .6953586    .654864    -0.39   0.700     .1097937    4.403928
             |
     diabcat |
T1DM, con..  |   1.006666   .9989837     0.01   0.995     .1439394    7.040299
T1DM, unc..  |   1.53e-20          .        .       .            .           .
T2DM, con..  |   .2055335   .2648224    -1.23   0.219      .016449    2.568177
T2DM, unc..  |   2.354912   2.742366     0.74   0.462      .240284     23.0794
Diabetes,..  |   4.18e-18          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.25e-18          .        .       .            .           .
2-5 years..  |   1.66e-19          .        .       .            .           .
   5+ years  |   2.079127    1.31405     1.16   0.247     .6024268    7.175591
             |
cancer_hae~t |
  Last year  |   2.717508    3.64765     0.74   0.456      .195714    37.73286
2-5 years..  |   1.18e-19          .        .       .            .           .
   5+ years  |   .9160862   .4827227    -0.17   0.868       .32614    2.573171
             |
1.~r_disease |   .8022511   .7184898    -0.25   0.806     .1386695    4.641301
1.stroke_d~a |   1.641362    1.24479     0.65   0.514     .3712465    7.256816
1.other_ne~o |   2.676757   1.632227     1.61   0.106     .8101493    8.844083
             |
reduced_ki~t |
Stage 3a/..  |   6.22e-20          .        .       .            .           .
      1.esrd |   .7043967   .3065845    -0.81   0.421     .3001491    1.653095
1.other_tr~t |   .1036628   .0913854    -2.57   0.010     .0184177    .5834606
  1.asplenia |   .2350607   .2999783    -1.13   0.257     .0192708    2.867221
1.ra_sle_p~s |   2.781046   1.652519     1.72   0.085     .8677957    8.912482
1.other_im~o |   .2339672   .2039963    -1.67   0.096     .0423635    1.292167
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYA
> DJMODEL_ageband_1_timeperiod4_1stVaccCensor.ster not found)
file ./output/an_multivariate_cox_models_covidadmission_kids_cat4_FULLYADJMODEL
> _ageband_1_timeperiod4_1stVaccCensor.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/07b_an_multivariable_cox_models_covidadmission_1st
> VaccCensor.log
  log type:  text
 closed on:  28 Oct 2021, 11:32:42
-------------------------------------------------------------------------------
