-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covid_death.log
  log type:  text
 opened on:  28 Oct 2021, 11:34:50

. 
. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents ("Exposure") _tab ("exposure_level") _tab ("time_
> period") _tab ("events") _tab ("person_years") _tab ("rate") _tab ("age_sex_a
> dj_hr") _tab ("demog_adj_hr") _tab ("full_adj_hr") _n
  3. foreach period in 0 1 2 3 4  {
  4. forvalues x=0/1 {
  5. file write tablecontents ("age") ("`x'") _n
  6. forvalues i=`min'/`max'{
  7. local endwith "_tab"
  8. 
. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  9. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
 10. stsplit cat_time, at(0,85,154, 216, 263, 400)
 11. recode cat_time 85=1 154=2 216=3 263=4 
 12. recode `outcome' .=0 
 13. tab cat_time
 14. tab cat_time `outcome'
 15. }
 16. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" {
 17. stsplit cat_time, at(0,92,161,222,270, 400)
 18. recode cat_time 92=1 161=2 222=3 270=4
 19. recode `outcome' .=0 
 20. tab cat_time
 21. tab cat_time `outcome'
 22. }
 23. 
. if  "`outcome'"=="covid_death" {
 24. stsplit cat_time, at(0,92,161,222,270, 400)
 25. recode cat_time 92=1 161=2 222=3 270=4
 26. recode `outcome' .=0 
 27. tab cat_time
 28. tab cat_time `outcome'
 29. }
 30. 
. keep if cat_time==`period'
 31. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents ("`variable'") _tab ("`i'") _tab ("`period'"
> ) _tab 
 32.         
.         *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 33.         local event = r(N)
 34.     bysort `variable': egen total_follow_up = total(_t)
 35.         su total_follow_up if `variable' == `i'
 36.         local person_days = r(mean)
 37.         local person_years=`person_days'/365.25
 38.         local rate = 100000*(`event'/`person_years')
 39.         
.         file write tablecontents (`event') _tab %10.0f (`person_years') _tab 
> %3.2f (`rate') _tab
 40.         drop total_follow_up
 41.         
.         
.         *models
.         foreach modeltype of any minadj demogadj fulladj  {
 42.         
.                 local noestimatesflag 0 /*reset*/
 43. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 44. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
.                 
.                 if "`modeltype'"=="minadj" {
 45.                         cap estimates use ./output/an_univariable_cox_mode
> ls_`variable'_`outcome'_AGESEX_ageband_`x'_timeperiod`period'
 46.                         if _rc!=0 local noestimatesflag 1
 47.                         }
 48.                 if "`modeltype'"=="demogadj" {
 49.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_DEMOGADJ_ageband_`x'_timeperiod`period'
 50.                         if _rc!=0 local noestimatesflag 1
 51.                         }
 52.                 if "`modeltype'"=="fulladj" {
 53.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_FULLYADJMODEL_ageband_`x'_timeperiod`period' 
 54.                         if _rc!=0 local noestimatesflag 1
 55.                         }
 56.                 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
.                 
.                 if `noestimatesflag'==0{
 57.                         cap lincom `i'.`variable', eform
 58.                         if _rc==0 file write tablecontents %4.2f (r(estima
> te)) (" (") %4.2f (r(lb)) ("-") %4.2f (r(ub)) (")") `endwith'
 59.                                 else file write tablecontents %4.2f ("ERR 
> IN MODEL") `endwith'
 60.                         }
 61.                         else file write tablecontents %4.2f ("DID NOT FIT"
> ) `endwith' 
 62.                         
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 63.                         if "`modeltype'"=="fulladj" {
 64.                                 local hr = r(estimate)
 65.                                 local lb = r(lb)
 66.                                 local ub = r(ub)
 67.                                 cap gen `variable'=.
 68.                                 testparm i.`variable'
 69.                                 *drop `variable'
.                                 }
 70.                 }       
 71.                 } /*min adj, full adj*/
 72.                 
. } /*variable levels*/
 73. 
. } /*agebands*/
 74. 
. } /*Waves*/
 75. end

. *****************************************************************************
> ******************************************
. /*Generic code to write a full row of "ref category" to the output file
> cap prog drop refline
> prog define refline
> file write tablecontents _tab _tab ("1.00 (ref)") _tab ("1.00 (ref)")  _n
> end*/
. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. cap file close tablecontents

. file open tablecontents using ./output/an_tablecontents_HRtable_`outcome'.txt
> , t w replace 
(note: file ./output/an_tablecontents_HRtable_covid_death.txt not found)

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(33,611 observations deleted)
  56

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        440       36064           0      36064      36064

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.61
         Prob > chi2 =    0.6579
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(33,611 observations deleted)
  245

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,651      134601           0     134601     134601

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.61
         Prob > chi2 =    0.6579
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(33,611 observations deleted)
  37

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        259       20658           0      20658      20658

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.61
         Prob > chi2 =    0.6579
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(33,611 observations deleted)
  1,923

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,729     1115144           0    1115144    1115144

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.61
         Prob > chi2 =    0.6579
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(9,405 observations deleted)
  19

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        132       10572           0      10572      10572

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.78
         Prob > chi2 =    0.4274
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(9,405 observations deleted)
  76

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        475       38730           0      38730      38730

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.78
         Prob > chi2 =    0.4274
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(9,405 observations deleted)
  10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         93        7640           0       7640       7640

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.78
         Prob > chi2 =    0.4274
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(9,405 observations deleted)
  569

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      3,849      309135           0     309135     309135

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.78
         Prob > chi2 =    0.4274
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(37,410 observations deleted)
  41

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        341       52598           0      52598      52598

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.85
         Prob > chi2 =    0.6035
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(37,410 observations deleted)
  173

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,256      192469           0     192469     192469

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.85
         Prob > chi2 =    0.6035
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(37,410 observations deleted)
  25

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        193       29692           0      29692      29692

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.85
         Prob > chi2 =    0.6035
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(37,410 observations deleted)
  1,388

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     10,490     1608836           0    1608836    1608836

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.85
         Prob > chi2 =    0.6035
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(10,527 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         99       15177           0      15177      15177

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.37
         Prob > chi2 =    0.2239
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(10,527 observations deleted)
  44

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        365       56426           0      56426      56426

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.37
         Prob > chi2 =    0.2239
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(10,527 observations deleted)
  14

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         71       10616           0      10616      10616

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.37
         Prob > chi2 =    0.2239
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(10,527 observations deleted)
  394

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,892      442355           0     442355     442355

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.37
         Prob > chi2 =    0.2239
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(40,174 observations deleted)
  40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        276       59222           0      59222      59222

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.82
         Prob > chi2 =    0.4204
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(40,174 observations deleted)
  167

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        955      203820           0     203820     203820

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.82
         Prob > chi2 =    0.4204
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(40,174 observations deleted)
  30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        155       33170           0      33170      33170

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.82
         Prob > chi2 =    0.4204
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(40,174 observations deleted)
  1,337

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      8,130     1739179           0    1739179    1739179

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.82
         Prob > chi2 =    0.4204
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(11,296 observations deleted)
  17

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         77       16408           0      16408      16408

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.17
         Prob > chi2 =    0.3662
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(11,296 observations deleted)
  47

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        296       63390           0      63390      63390

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.17
         Prob > chi2 =    0.3662
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(11,296 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         49       10637           0      10637      10637

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.17
         Prob > chi2 =    0.3662
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(11,296 observations deleted)
  369

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,236      478085           0     478085     478085

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.17
         Prob > chi2 =    0.3662
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(42,794 observations deleted)
  36

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        205       53787           0      53787      53787

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.60
         Prob > chi2 =    0.3083
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(42,794 observations deleted)
  116

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        682      179353           0     179353     179353

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.60
         Prob > chi2 =    0.3083
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(42,794 observations deleted)
  27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        111       29096           0      29096      29096

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.60
         Prob > chi2 =    0.3083
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(42,794 observations deleted)
  1,017

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      5,898     1553419           0    1553419    1553419

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.60
         Prob > chi2 =    0.3083
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(12,008 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         52       13834           0      13834      13834

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.01
         Prob > chi2 =    0.7997
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(12,008 observations deleted)
  44

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        220       57782           0      57782      57782

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.01
         Prob > chi2 =    0.7997
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(12,008 observations deleted)
  6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         40       10551           0      10551      10551

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.01
         Prob > chi2 =    0.7997
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(12,008 observations deleted)
  283

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,634      429612           0     429612     429612

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.01
         Prob > chi2 =    0.7997
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(44,774 observations deleted)
  27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        142       42826           0      42826      42826

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.18
         Prob > chi2 =    0.9800
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(44,774 observations deleted)
  83

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        483      145144           0     145144     145144

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.18
         Prob > chi2 =    0.9800
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(44,774 observations deleted)
  14

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         73       21950           0      21950      21950

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.18
         Prob > chi2 =    0.9800
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 
(44,774 observations deleted)
  743

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      4,218     1268799           0    1268799    1268799

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.18
         Prob > chi2 =    0.9800
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(12,582 observations deleted)
  10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         39       11621           0      11621      11621

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.24
         Prob > chi2 =    0.7435
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(12,582 observations deleted)
  30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        153       45997           0      45997      45997

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.24
         Prob > chi2 =    0.7435
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(12,582 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         28        8498           0       8498       8498

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.24
         Prob > chi2 =    0.7435
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 
(12,582 observations deleted)
  209

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,152      346020           0     346020     346020

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.24
         Prob > chi2 =    0.7435

. file write tablecontents _n

. 
. file close tablecontents

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covid_death.log
  log type:  text
 closed on:  28 Oct 2021, 11:35:24
-------------------------------------------------------------------------------
