-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covidadmission.log
  log type:  text
 opened on:  17 Aug 2021, 07:50:41

. 
. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. foreach period in 0 1 2  {
  3. forvalues x=0/1 {
  4. file write tablecontents ("age") ("`x'") _n
  5. forvalues i=`min'/`max'{
  6. local endwith "_tab"
  7. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  8. 
. stsplit cat_time, at(0,78,147,400)
  9. recode cat_time 78=1 147=2 400=3
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. 
. keep if cat_time==`period'
 14. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents ("`variable'") _tab ("`i'") _tab ("`period'"
> ) _tab 
 15.         
.         *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 16.         local event = r(N)
 17.     bysort `variable': egen total_follow_up = total(_t)
 18.         su total_follow_up if `variable' == `i'
 19.         local person_days = r(mean)
 20.         local person_years=`person_days'/365.25
 21.         local rate = 100000*(`event'/`person_years')
 22.         
.         file write tablecontents (`event') _tab %10.0f (`person_years') _tab 
> %3.2f (`rate') _tab
 23.         drop total_follow_up
 24.         
.         
.         *models
.         foreach modeltype of any minadj demogadj fulladj  {
 25.         
.                 local noestimatesflag 0 /*reset*/
 26. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 27. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
.                 
.                 if "`modeltype'"=="minadj" {
 28.                         cap estimates use ./output/an_univariable_cox_mode
> ls_`variable'_`outcome'_AGESEX_ageband_`x'_timeperiod`period'
 29.                         if _rc!=0 local noestimatesflag 1
 30.                         }
 31.                 if "`modeltype'"=="demogadj" {
 32.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_DEMOGADJ_ageband_`x'_timeperiod`period'
 33.                         if _rc!=0 local noestimatesflag 1
 34.                         }
 35.                 if "`modeltype'"=="fulladj" {
 36.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_FULLYADJMODEL_ageband_`x'_timeperiod`period' 
 37.                         if _rc!=0 local noestimatesflag 1
 38.                         }
 39.                 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
.                 
.                 if `noestimatesflag'==0{
 40.                         cap lincom `i'.`variable', eform
 41.                         if _rc==0 file write tablecontents %4.2f (r(estima
> te)) (" (") %4.2f (r(lb)) ("-") %4.2f (r(ub)) (")") `endwith'
 42.                                 else file write tablecontents %4.2f ("ERR 
> IN MODEL") `endwith'
 43.                         }
 44.                         else file write tablecontents %4.2f ("DID NOT FIT"
> ) `endwith' 
 45.                         
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 46.                         if "`modeltype'"=="fulladj" {
 47.                                 local hr = r(estimate)
 48.                                 local lb = r(lb)
 49.                                 local ub = r(ub)
 50.                                 cap gen `variable'=.
 51.                                 testparm i.`variable'
 52.                                 *drop `variable'
.                                 }
 53.                 }       
 54.                 } /*min adj, full adj*/
 55.                 
. } /*variable levels*/
 56. 
. } /*agebands*/
 57. 
. } /*Waves*/
 58. end

. *****************************************************************************
> ******************************************
. /*Generic code to write a full row of "ref category" to the output file
> cap prog drop refline
> prog define refline
> file write tablecontents _tab _tab ("1.00 (ref)") _tab ("1.00 (ref)")  _n
> end*/
. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. cap file close tablecontents

. file open tablecontents using ./output/an_tablecontents_HRtable_`outcome'.txt
> , t w replace 
(note: file ./output/an_tablecontents_HRtable_covidadmission.txt not found)

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(18,164 observations deleted)
  26

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        472       30538           0      30538      30538

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.16
         Prob > chi2 =    0.7624
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(18,164 observations deleted)
  108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,663      108728           0     108728     108728

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.16
         Prob > chi2 =    0.7624
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(18,164 observations deleted)
  16

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        265       17658           0      17658      17658

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.16
         Prob > chi2 =    0.7624
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(18,164 observations deleted)
  820

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,729      903240           0     903240     903240

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.16
         Prob > chi2 =    0.7624
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(5,060 observations deleted)
  10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        133        8915           0       8915       8915

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.25
         Prob > chi2 =    0.2358
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(5,060 observations deleted)
  38

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        490       32132           0      32132      32132

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.25
         Prob > chi2 =    0.2358
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(5,060 observations deleted)
  6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         59        3635           0       3635       3635

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.25
         Prob > chi2 =    0.2358
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(5,060 observations deleted)
  222

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      3,820      251095           0     251095     251095

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.25
         Prob > chi2 =    0.2358
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(23,203 observations deleted)
  27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        316       42277           0      42277      42277

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.24
         Prob > chi2 =    0.0647
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(23,203 observations deleted)
  72

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,121      150454           0     150454     150454

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.24
         Prob > chi2 =    0.0647
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(23,203 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        184       24252           0      24252      24252

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.24
         Prob > chi2 =    0.0647
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(23,203 observations deleted)
  584

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      9,469     1273105           0    1273105    1273105

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    7.24
         Prob > chi2 =    0.0647
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(6,471 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         90       11680           0      11680      11680

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.35
         Prob > chi2 =    0.5032
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(6,471 observations deleted)
  24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        334       44534           0      44534      44534

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.35
         Prob > chi2 =    0.5032
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(6,471 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         37        4914           0       4914       4914

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.35
         Prob > chi2 =    0.5032
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(6,471 observations deleted)
  144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,630      354573           0     354573     354573

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.35
         Prob > chi2 =    0.5032
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(27,239 observations deleted)
  6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        196       34191           0      34191      34191

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.38
         Prob > chi2 =    0.7111
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(27,239 observations deleted)
  28

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        713      124430           0     124430     124430

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.38
         Prob > chi2 =    0.7111
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(27,239 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        105       18311           0      18311      18311

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.38
         Prob > chi2 =    0.7111
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(27,239 observations deleted)
  180

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      6,040     1053468           0    1053468    1053468

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.38
         Prob > chi2 =    0.7111
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(7,596 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         51        8828           0       8828       8828

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.20
         Prob > chi2 =    0.9779
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(7,596 observations deleted)
  7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        211       36737           0      36737      36737

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.20
         Prob > chi2 =    0.9779
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(7,596 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         24        4214           0       4214       4214

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.20
         Prob > chi2 =    0.9779
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(7,596 observations deleted)
  46

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,680      293457           0     293457     293457

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.20
         Prob > chi2 =    0.9779

. file write tablecontents _n

. 
. *Number kids
. outputHRsforvar, variable("gp_number_kids") min(0) max(4) outcome(`outcome')
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(18,164 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(18,164 observations deleted)
  25

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        373       24106           0      24106      24106
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(18,164 observations deleted)
  12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        307       20181           0      20181      20181
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(18,164 observations deleted)
  13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        227       15365           0      15365      15365
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(18,164 observations deleted)
  58

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        756       49076           0      49076      49076
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(5,060 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(5,060 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        135        8722           0       8722       8722
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(5,060 observations deleted)
  7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         85        5657           0       5657       5657
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(5,060 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         61        4124           0       4124       4124
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(5,060 observations deleted)
  24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        209       13629           0      13629      13629
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(23,203 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(23,203 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        245       33130           0      33130      33130
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(23,203 observations deleted)
  14

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        217       28941           0      28941      28941
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(23,203 observations deleted)
  12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        154       20915           0      20915      20915
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(23,203 observations deleted)
  38

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        505       67468           0      67468      67468
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(6,471 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(6,471 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         91       12127           0      12127      12127
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(6,471 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         62        8179           0       8179       8179
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(6,471 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         43        5805           0       5805       5805
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(6,471 observations deleted)
  10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        138       18423           0      18423      18423
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(27,239 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(27,239 observations deleted)
  7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        168       29382           0      29382      29382
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(27,239 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        131       22604           0      22604      22604
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(27,239 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        105       18328           0      18328      18328
(18,144 observations (episodes) created)
(cat_time: 18144 changes made)
(covidadmission: 18144 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,129       47.06       47.06
          1 |     11,090       32.36       79.42
          2 |      7,054       20.58      100.00
------------+-----------------------------------
      Total |     34,273      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,159        970 |    16,129 
         1 |    10,396        694 |    11,090 
         2 |     6,836        218 |     7,054 
-----------+----------------------+----------
     Total |    32,391      1,882 |    34,273 
(27,239 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        309       54116           0      54116      54116
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(7,596 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(7,596 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         61       10651           0      10651      10651
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(7,596 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         36        6225           0       6225       6225
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(7,596 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         26        4540           0       4540       4540
(5,057 observations (episodes) created)
(cat_time: 5057 changes made)
(covidadmission: 5057 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,502       47.10       47.10
          1 |      3,091       32.34       79.43
          2 |      1,966       20.57      100.00
------------+-----------------------------------
      Total |      9,559      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,226        276 |     4,502 
         1 |     2,916        175 |     3,091 
         2 |     1,911         55 |     1,966 
-----------+----------------------+----------
     Total |     9,053        506 |     9,559 
(7,596 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         88       15321           0      15321      15321

. file write tablecontents _n 

. 
. file close tablecontents

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covidadmission.log
  log type:  text
 closed on:  17 Aug 2021, 07:50:54
-------------------------------------------------------------------------------
