-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covid_tpp_prob.log
  log type:  text
 opened on:  25 Jul 2021, 08:15:11

. 
. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. foreach period in 1 2 3 {
  3. forvalues x=0/1 {
  4. file write tablecontents ("age") ("`x'") _n
  5. forvalues i=`min'/`max'{
  6. local endwith "_tab"
  7. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents ("`variable'") _tab ("`i'") _tab ("`period'"
> ) _tab 
  8.         
.         use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.
> dta", clear
  9.         *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1
 10.         local event = r(N)
 11.     bysort `variable': egen total_follow_up = total(_t)
 12.         su total_follow_up if `variable' == `i'
 13.         local person_days = r(mean)
 14.         local person_years=`person_days'/365.25
 15.         local rate = 100000*(`event'/`person_years')
 16.         
.         file write tablecontents (`event') _tab %10.0f (`person_years') _tab 
> %3.2f (`rate') _tab
 17.         drop total_follow_up
 18.         
.         
.         *models
.         foreach modeltype of any minadj demogadj fulladj  {
 19.         
.                 local noestimatesflag 0 /*reset*/
 20. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 21. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
.                 
.                 if "`modeltype'"=="minadj" {
 22.                         cap estimates use ./output/an_univariable_cox_mode
> ls_`variable'_`outcome'_AGESEX_ageband_`x'_timeperiod`period'
 23.                         if _rc!=0 local noestimatesflag 1
 24.                         }
 25.                 if "`modeltype'"=="demogadj" {
 26.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_DEMOGADJ_ageband_`x'_timeperiod`period'
 27.                         if _rc!=0 local noestimatesflag 1
 28.                         }
 29.                 if "`modeltype'"=="fulladj" {
 30.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_FULLYADJMODEL_ageband_`x'_timeperiod`period' 
 31.                         if _rc!=0 local noestimatesflag 1
 32.                         }
 33.                 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
.                 
.                 if `noestimatesflag'==0{
 34.                         cap lincom `i'.`variable', eform
 35.                         if _rc==0 file write tablecontents %4.2f (r(estima
> te)) (" (") %4.2f (r(lb)) ("-") %4.2f (r(ub)) (")") `endwith'
 36.                                 else file write tablecontents %4.2f ("ERR 
> IN MODEL") `endwith'
 37.                         }
 38.                         else file write tablecontents %4.2f ("DID NOT FIT"
> ) `endwith' 
 39.                         
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 40.                         if "`modeltype'"=="fulladj" {
 41.                                 local hr = r(estimate)
 42.                                 local lb = r(lb)
 43.                                 local ub = r(ub)
 44.                                 cap gen `variable'=.
 45.                                 testparm i.`variable'
 46.                                 *drop `variable'
.                                 }
 47.                 }       
 48.                 } /*min adj, full adj*/
 49.                 
. } /*variable levels*/
 50. 
. } /*agebands*/
 51. 
. } /*Waves*/
 52. end

. *****************************************************************************
> ******************************************
. /*Generic code to write a full row of "ref category" to the output file
> cap prog drop refline
> prog define refline
> file write tablecontents _tab _tab ("1.00 (ref)") _tab ("1.00 (ref)")  _n
> end*/
. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. cap file close tablecontents

. file open tablecontents using ./output/an_tablecontents_HRtable_`outcome'.txt
> , t w replace 
(note: file ./output/an_tablecontents_HRtable_covid_tpp_prob.txt not found)

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
  369

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        405       34267           0      34267      34267

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    9.93
         Prob > chi2 =    0.0192
  1,446

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,561      124434           0     124434     124434

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    9.93
         Prob > chi2 =    0.0192
  252

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        273       21713           0      21713      21713

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    9.93
         Prob > chi2 =    0.0192
  12,840

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,768     1118026           0    1118026    1118026

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    9.93
         Prob > chi2 =    0.0192
  132

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        143       11110           0      11110      11110

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.12
         Prob > chi2 =    0.7729
  422

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        455       37121           0      37121      37121

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.12
         Prob > chi2 =    0.7729
  82

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         85        6802           0       6802       6802

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.12
         Prob > chi2 =    0.7729
  3,635

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      3,922      318862           0     318862     318862

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.12
         Prob > chi2 =    0.7729
  369

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        405       34267           0      34267      34267

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.20
         Prob > chi2 =    0.7526
  1,446

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,561      124434           0     124434     124434

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.20
         Prob > chi2 =    0.7526
  252

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        273       21713           0      21713      21713

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.20
         Prob > chi2 =    0.7526
  12,840

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,768     1118026           0    1118026    1118026

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.20
         Prob > chi2 =    0.7526
  132

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        143       11110           0      11110      11110

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.49
         Prob > chi2 =    0.9221
  422

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        455       37121           0      37121      37121

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.49
         Prob > chi2 =    0.9221
  82

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         85        6802           0       6802       6802

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.49
         Prob > chi2 =    0.9221
  3,635

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      3,922      318862           0     318862     318862

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.49
         Prob > chi2 =    0.9221
  369

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        405       34267           0      34267      34267
  1,446

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,561      124434           0     124434     124434
  252

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        273       21713           0      21713      21713
  12,840

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,768     1118026           0    1118026    1118026
  132

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        143       11110           0      11110      11110
  422

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        455       37121           0      37121      37121
  82

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         85        6802           0       6802       6802
  3,635

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      3,922      318862           0     318862     318862

. file write tablecontents _n

. 
. *Number kids
. outputHRsforvar, variable("gp_number_kids") min(0) max(4) outcome(`outcome')
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    0.95
         Prob > chi2 =    0.8131
  394

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        424       33920           0      33920      33920

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    0.95
         Prob > chi2 =    0.8131
  265

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        284       21963           0      21963      21963

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    0.95
         Prob > chi2 =    0.8131
  261

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        279       23415           0      23415      23415

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    0.95
         Prob > chi2 =    0.8131
  526

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        574       45136           0      45136      45136

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    0.95
         Prob > chi2 =    0.8131
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    2.96
         Prob > chi2 =    0.3981
  124

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        136       10959           0      10959      10959

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    2.96
         Prob > chi2 =    0.3981
  71

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         76        7134           0       7134       7134

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    2.96
         Prob > chi2 =    0.3981
  67

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         74        5805           0       5805       5805

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    2.96
         Prob > chi2 =    0.3981
  160

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        169       13223           0      13223      13223

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    2.96
         Prob > chi2 =    0.3981
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =   10.82
         Prob > chi2 =    0.0127
  394

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        424       33920           0      33920      33920

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =   10.82
         Prob > chi2 =    0.0127
  265

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        284       21963           0      21963      21963

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =   10.82
         Prob > chi2 =    0.0127
  261

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        279       23415           0      23415      23415

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =   10.82
         Prob > chi2 =    0.0127
  526

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        574       45136           0      45136      45136

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =   10.82
         Prob > chi2 =    0.0127
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    3.19
         Prob > chi2 =    0.3638
  124

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        136       10959           0      10959      10959

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    3.19
         Prob > chi2 =    0.3638
  71

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         76        7134           0       7134       7134

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    3.19
         Prob > chi2 =    0.3638
  67

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         74        5805           0       5805       5805

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    3.19
         Prob > chi2 =    0.3638
  160

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        169       13223           0      13223      13223

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    3.19
         Prob > chi2 =    0.3638
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
  394

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        424       33920           0      33920      33920
  265

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        284       21963           0      21963      21963
  261

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        279       23415           0      23415      23415
  526

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        574       45136           0      45136      45136
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
  124

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        136       10959           0      10959      10959
  71

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         76        7134           0       7134       7134
  67

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         74        5805           0       5805       5805
  160

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        169       13223           0      13223      13223

. file write tablecontents _n 

. 
. file close tablecontents

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covid_tpp_prob.log
  log type:  text
 closed on:  25 Jul 2021, 08:15:14
-------------------------------------------------------------------------------
