-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covidadmission.log
  log type:  text
 opened on:  28 Oct 2021, 11:39:09

. 
. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents ("Exposure") _tab ("exposure_level") _tab ("time_
> period") _tab ("events") _tab ("person_years") _tab ("rate") _tab ("age_sex_a
> dj_hr") _tab ("demog_adj_hr") _tab ("full_adj_hr") _n
  3. foreach period in 0 1 2 3 4  {
  4. forvalues x=0/1 {
  5. file write tablecontents ("age") ("`x'") _n
  6. forvalues i=`min'/`max'{
  7. local endwith "_tab"
  8. 
. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  9. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
 10. stsplit cat_time, at(0,85,154, 216, 263, 400)
 11. recode cat_time 85=1 154=2 216=3 263=4 
 12. recode `outcome' .=0 
 13. tab cat_time
 14. tab cat_time `outcome'
 15. }
 16. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" {
 17. stsplit cat_time, at(0,92,161,222,270, 400)
 18. recode cat_time 92=1 161=2 222=3 270=4
 19. recode `outcome' .=0 
 20. tab cat_time
 21. tab cat_time `outcome'
 22. }
 23. 
. if  "`outcome'"=="covid_death" {
 24. stsplit cat_time, at(0,92,161,222,270, 400)
 25. recode cat_time 92=1 161=2 222=3 270=4
 26. recode `outcome' .=0 
 27. tab cat_time
 28. tab cat_time `outcome'
 29. }
 30. 
. keep if cat_time==`period'
 31. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents ("`variable'") _tab ("`i'") _tab ("`period'"
> ) _tab 
 32.         
.         *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 33.         local event = r(N)
 34.     bysort `variable': egen total_follow_up = total(_t)
 35.         su total_follow_up if `variable' == `i'
 36.         local person_days = r(mean)
 37.         local person_years=`person_days'/365.25
 38.         local rate = 100000*(`event'/`person_years')
 39.         
.         file write tablecontents (`event') _tab %10.0f (`person_years') _tab 
> %3.2f (`rate') _tab
 40.         drop total_follow_up
 41.         
.         
.         *models
.         foreach modeltype of any minadj demogadj fulladj  {
 42.         
.                 local noestimatesflag 0 /*reset*/
 43. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 44. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
.                 
.                 if "`modeltype'"=="minadj" {
 45.                         cap estimates use ./output/an_univariable_cox_mode
> ls_`variable'_`outcome'_AGESEX_ageband_`x'_timeperiod`period'
 46.                         if _rc!=0 local noestimatesflag 1
 47.                         }
 48.                 if "`modeltype'"=="demogadj" {
 49.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_DEMOGADJ_ageband_`x'_timeperiod`period'
 50.                         if _rc!=0 local noestimatesflag 1
 51.                         }
 52.                 if "`modeltype'"=="fulladj" {
 53.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_FULLYADJMODEL_ageband_`x'_timeperiod`period' 
 54.                         if _rc!=0 local noestimatesflag 1
 55.                         }
 56.                 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
.                 
.                 if `noestimatesflag'==0{
 57.                         cap lincom `i'.`variable', eform
 58.                         if _rc==0 file write tablecontents %4.2f (r(estima
> te)) (" (") %4.2f (r(lb)) ("-") %4.2f (r(ub)) (")") `endwith'
 59.                                 else file write tablecontents %4.2f ("ERR 
> IN MODEL") `endwith'
 60.                         }
 61.                         else file write tablecontents %4.2f ("DID NOT FIT"
> ) `endwith' 
 62.                         
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 63.                         if "`modeltype'"=="fulladj" {
 64.                                 local hr = r(estimate)
 65.                                 local lb = r(lb)
 66.                                 local ub = r(ub)
 67.                                 cap gen `variable'=.
 68.                                 testparm i.`variable'
 69.                                 *drop `variable'
.                                 }
 70.                 }       
 71.                 } /*min adj, full adj*/
 72.                 
. } /*variable levels*/
 73. 
. } /*agebands*/
 74. 
. } /*Waves*/
 75. end

. *****************************************************************************
> ******************************************
. /*Generic code to write a full row of "ref category" to the output file
> cap prog drop refline
> prog define refline
> file write tablecontents _tab _tab ("1.00 (ref)") _tab ("1.00 (ref)")  _n
> end*/
. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. cap file close tablecontents

. file open tablecontents using ./output/an_tablecontents_HRtable_`outcome'.txt
> , t w replace 
(note: file ./output/an_tablecontents_HRtable_covidadmission.txt not found)

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(29,590 observations deleted)
  25

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        440       34847           0      34847      34847

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.30
         Prob > chi2 =    0.7293
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(29,590 observations deleted)
  93

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,648      130801           0     130801     130801

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.30
         Prob > chi2 =    0.7293
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(29,590 observations deleted)
  16

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        259       20101           0      20101      20101

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.30
         Prob > chi2 =    0.7293
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(29,590 observations deleted)
  830

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,718     1078132           0    1078132    1078132

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.30
         Prob > chi2 =    0.7293
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(8,322 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        132       10300           0      10300      10300

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.56
         Prob > chi2 =    0.9066
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(8,322 observations deleted)
  30

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        474       37094           0      37094      37094

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.56
         Prob > chi2 =    0.9066
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(8,322 observations deleted)
  5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         93        7552           0       7552       7552

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.56
         Prob > chi2 =    0.9066
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(8,322 observations deleted)
  218

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      3,847      298910           0     298910     298910

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.56
         Prob > chi2 =    0.9066
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(34,216 observations deleted)
  14

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        319       48616           0      48616      48616

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7178
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(34,216 observations deleted)
  54

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,177      178801           0     178801     178801

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7178
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(34,216 observations deleted)
  10

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        179       27354           0      27354      27354

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7178
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(34,216 observations deleted)
  451

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      9,764     1482291           0    1482291    1482291

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.35
         Prob > chi2 =    0.7178
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(9,673 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         92       14051           0      14051      14051

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.60
         Prob > chi2 =    0.4581
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(9,673 observations deleted)
  12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        336       51643           0      51643      51643

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.60
         Prob > chi2 =    0.4581
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(9,673 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         66        9846           0       9846       9846

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.60
         Prob > chi2 =    0.4581
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(9,673 observations deleted)
  125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,701      409338           0     409338     409338

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.60
         Prob > chi2 =    0.4581
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(37,253 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        246       52605           0      52605      52605

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =   12.81
         Prob > chi2 =    0.0051
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(37,253 observations deleted)
  37

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        858      182142           0     182142     182142

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =   12.81
         Prob > chi2 =    0.0051
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(37,253 observations deleted)
  13

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        136       28735           0      28735      28735

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =   12.81
         Prob > chi2 =    0.0051
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(37,253 observations deleted)
  305

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      7,162     1524217           0    1524217    1524217

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =   12.81
         Prob > chi2 =    0.0051
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(10,502 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         70       14901           0      14901      14901

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.42
         Prob > chi2 =    0.4904
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(10,502 observations deleted)
  15

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        264       56209           0      56209      56209

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.42
         Prob > chi2 =    0.4904
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(10,502 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         45        9636           0       9636       9636

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.42
         Prob > chi2 =    0.4904
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(10,502 observations deleted)
  95

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,987      422467           0     422467     422467

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.42
         Prob > chi2 =    0.4904
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(39,865 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        177       46363           0      46363      46363

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.41
         Prob > chi2 =    0.4925
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(39,865 observations deleted)
  28

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        583      152571           0     152571     152571

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.41
         Prob > chi2 =    0.4925
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(39,865 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         87       22566           0      22566      22566

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.41
         Prob > chi2 =    0.4925
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(39,865 observations deleted)
  164

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      4,943     1297716           0    1297716    1297716

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.41
         Prob > chi2 =    0.4925
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(11,220 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         47       12484           0      12484      12484

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0
       Constraint 2 dropped

           chi2(  2) =  941.69
         Prob > chi2 =    0.0000
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(11,220 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        188       49201           0      49201      49201

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0
       Constraint 2 dropped

           chi2(  2) =  941.69
         Prob > chi2 =    0.0000
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(11,220 observations deleted)
  3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         33        8627           0       8627       8627

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0
       Constraint 2 dropped

           chi2(  2) =  941.69
         Prob > chi2 =    0.0000
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(11,220 observations deleted)
  59

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,380      361958           0     361958     361958

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0
       Constraint 2 dropped

           chi2(  2) =  941.69
         Prob > chi2 =    0.0000
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(41,713 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        119       35823           0      35823      35823

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.28
         Prob > chi2 =    0.9646
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(41,713 observations deleted)
  9

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        387      116189           0     116189     116189

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.28
         Prob > chi2 =    0.9646
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(41,713 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         49       14738           0      14738      14738

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.28
         Prob > chi2 =    0.9646
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 
(41,713 observations deleted)
  92

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      3,387     1017296           0    1017296    1017296

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    0.28
         Prob > chi2 =    0.9646
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(11,760 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         34       10058           0      10058      10058

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0
       Constraint 2 dropped

           chi2(  2) =    0.99
         Prob > chi2 =    0.6101
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(11,760 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        124       37223           0      37223      37223

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0
       Constraint 2 dropped

           chi2(  2) =    0.99
         Prob > chi2 =    0.6101
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(11,760 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         21        6356           0       6356       6356

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0
       Constraint 2 dropped

           chi2(  2) =    0.99
         Prob > chi2 =    0.6101
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 
(11,760 observations deleted)
  24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        929      278728           0     278728     278728

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0
       Constraint 2 dropped

           chi2(  2) =    0.99
         Prob > chi2 =    0.6101

. file write tablecontents _n

. 
. file close tablecontents

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covidadmission.log
  log type:  text
 closed on:  28 Oct 2021, 11:39:33
-------------------------------------------------------------------------------
