-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covid_icu.log
  log type:  text
 opened on:  25 Jul 2021, 08:16:52

. 
. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. foreach period in 1 2 3 {
  3. forvalues x=0/1 {
  4. file write tablecontents ("age") ("`x'") _n
  5. forvalues i=`min'/`max'{
  6. local endwith "_tab"
  7. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents ("`variable'") _tab ("`i'") _tab ("`period'"
> ) _tab 
  8.         
.         use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.
> dta", clear
  9.         *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1
 10.         local event = r(N)
 11.     bysort `variable': egen total_follow_up = total(_t)
 12.         su total_follow_up if `variable' == `i'
 13.         local person_days = r(mean)
 14.         local person_years=`person_days'/365.25
 15.         local rate = 100000*(`event'/`person_years')
 16.         
.         file write tablecontents (`event') _tab %10.0f (`person_years') _tab 
> %3.2f (`rate') _tab
 17.         drop total_follow_up
 18.         
.         
.         *models
.         foreach modeltype of any minadj demogadj fulladj  {
 19.         
.                 local noestimatesflag 0 /*reset*/
 20. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 21. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
.                 
.                 if "`modeltype'"=="minadj" {
 22.                         cap estimates use ./output/an_univariable_cox_mode
> ls_`variable'_`outcome'_AGESEX_ageband_`x'_timeperiod`period'
 23.                         if _rc!=0 local noestimatesflag 1
 24.                         }
 25.                 if "`modeltype'"=="demogadj" {
 26.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_DEMOGADJ_ageband_`x'_timeperiod`period'
 27.                         if _rc!=0 local noestimatesflag 1
 28.                         }
 29.                 if "`modeltype'"=="fulladj" {
 30.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_FULLYADJMODEL_ageband_`x'_timeperiod`period' 
 31.                         if _rc!=0 local noestimatesflag 1
 32.                         }
 33.                 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
.                 
.                 if `noestimatesflag'==0{
 34.                         cap lincom `i'.`variable', eform
 35.                         if _rc==0 file write tablecontents %4.2f (r(estima
> te)) (" (") %4.2f (r(lb)) ("-") %4.2f (r(ub)) (")") `endwith'
 36.                                 else file write tablecontents %4.2f ("ERR 
> IN MODEL") `endwith'
 37.                         }
 38.                         else file write tablecontents %4.2f ("DID NOT FIT"
> ) `endwith' 
 39.                         
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 40.                         if "`modeltype'"=="fulladj" {
 41.                                 local hr = r(estimate)
 42.                                 local lb = r(lb)
 43.                                 local ub = r(ub)
 44.                                 cap gen `variable'=.
 45.                                 testparm i.`variable'
 46.                                 *drop `variable'
.                                 }
 47.                 }       
 48.                 } /*min adj, full adj*/
 49.                 
. } /*variable levels*/
 50. 
. } /*agebands*/
 51. 
. } /*Waves*/
 52. end

. *****************************************************************************
> ******************************************
. /*Generic code to write a full row of "ref category" to the output file
> cap prog drop refline
> prog define refline
> file write tablecontents _tab _tab ("1.00 (ref)") _tab ("1.00 (ref)")  _n
> end*/
. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. cap file close tablecontents

. file open tablecontents using ./output/an_tablecontents_HRtable_`outcome'.txt
> , t w replace 
(note: file ./output/an_tablecontents_HRtable_covid_icu.txt not found)

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
  312

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        405       36584           0      36584      36584

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.89
         Prob > chi2 =    0.2733
  1,197

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,561      139257           0     139257     139257

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.89
         Prob > chi2 =    0.2733
  203

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        273       26458           0      26458      26458

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.89
         Prob > chi2 =    0.2733
  10,706

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,768     1214002           0    1214002    1214002

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    3.89
         Prob > chi2 =    0.2733
  109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        143       12174           0      12174      12174

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.74
         Prob > chi2 =    0.6272
  342

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        455       40410           0      40410      40410

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.74
         Prob > chi2 =    0.6272
  70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         85        7136           0       7136       7136

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.74
         Prob > chi2 =    0.6272
  3,067

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      3,922      351069           0     351069     351069

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.74
         Prob > chi2 =    0.6272
  312

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        405       36584           0      36584      36584

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.32
         Prob > chi2 =    0.1496
  1,197

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,561      139257           0     139257     139257

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.32
         Prob > chi2 =    0.1496
  203

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        273       26458           0      26458      26458

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.32
         Prob > chi2 =    0.1496
  10,706

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,768     1214002           0    1214002    1214002

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.32
         Prob > chi2 =    0.1496
  109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        143       12174           0      12174      12174

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.22
         Prob > chi2 =    0.1561
  342

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        455       40410           0      40410      40410

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.22
         Prob > chi2 =    0.1561
  70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         85        7136           0       7136       7136

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.22
         Prob > chi2 =    0.1561
  3,067

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      3,922      351069           0     351069     351069

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    5.22
         Prob > chi2 =    0.1561
  312

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        405       36584           0      36584      36584
  1,197

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,561      139257           0     139257     139257
  203

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        273       26458           0      26458      26458
  10,706

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,768     1214002           0    1214002    1214002
  109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        143       12174           0      12174      12174
  342

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        455       40410           0      40410      40410
  70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         85        7136           0       7136       7136
  3,067

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      3,922      351069           0     351069     351069

. file write tablecontents _n

. 
. *Number kids
. outputHRsforvar, variable("gp_number_kids") min(0) max(4) outcome(`outcome')
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    1.36
         Prob > chi2 =    0.7153
  341

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        424       37327           0      37327      37327

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    1.36
         Prob > chi2 =    0.7153
  211

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        284       25294           0      25294      25294

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    1.36
         Prob > chi2 =    0.7153
  205

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        279       25815           0      25815      25815

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    1.36
         Prob > chi2 =    0.7153
  440

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        574       50821           0      50821      50821

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    1.36
         Prob > chi2 =    0.7153
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    7.61
         Prob > chi2 =    0.0547
  111

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        136       11442           0      11442      11442

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    7.61
         Prob > chi2 =    0.0547
  54

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         76        7394           0       7394       7394

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    7.61
         Prob > chi2 =    0.0547
  58

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         74        6699           0       6699       6699

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    7.61
         Prob > chi2 =    0.0547
  119

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        169       14875           0      14875      14875

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    7.61
         Prob > chi2 =    0.0547
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    1.23
         Prob > chi2 =    0.7455
  341

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        424       37327           0      37327      37327

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    1.23
         Prob > chi2 =    0.7455
  211

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        284       25294           0      25294      25294

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    1.23
         Prob > chi2 =    0.7455
  205

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        279       25815           0      25815      25815

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    1.23
         Prob > chi2 =    0.7455
  440

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        574       50821           0      50821      50821

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    1.23
         Prob > chi2 =    0.7455
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    3.68
         Prob > chi2 =    0.2986
  111

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        136       11442           0      11442      11442

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    3.68
         Prob > chi2 =    0.2986
  54

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         76        7394           0       7394       7394

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    3.68
         Prob > chi2 =    0.2986
  58

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         74        6699           0       6699       6699

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    3.68
         Prob > chi2 =    0.2986
  119

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        169       14875           0      14875      14875

 ( 1)  2.gp_number_kids = 0
 ( 2)  3.gp_number_kids = 0
 ( 3)  4.gp_number_kids = 0

           chi2(  3) =    3.68
         Prob > chi2 =    0.2986
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
  341

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        424       37327           0      37327      37327
  211

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        284       25294           0      25294      25294
  205

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        279       25815           0      25815      25815
  440

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        574       50821           0      50821      50821
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
  111

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        136       11442           0      11442      11442
  54

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         76        7394           0       7394       7394
  58

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         74        6699           0       6699       6699
  119

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        169       14875           0      14875      14875

. file write tablecontents _n 

. 
. file close tablecontents

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covid_icu.log
  log type:  text
 closed on:  25 Jul 2021, 08:16:55
-------------------------------------------------------------------------------
