-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covid_tpp_prob.log
  log type:  text
 opened on:  17 Aug 2021, 07:49:10

. 
. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. foreach period in 0 1 2  {
  3. forvalues x=0/1 {
  4. file write tablecontents ("age") ("`x'") _n
  5. forvalues i=`min'/`max'{
  6. local endwith "_tab"
  7. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  8. 
. stsplit cat_time, at(0,78,147,400)
  9. recode cat_time 78=1 147=2 400=3
 10. recode `outcome' .=0 
 11. tab cat_time
 12. tab cat_time `outcome'
 13. 
. keep if cat_time==`period'
 14. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents ("`variable'") _tab ("`i'") _tab ("`period'"
> ) _tab 
 15.         
.         *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 16.         local event = r(N)
 17.     bysort `variable': egen total_follow_up = total(_t)
 18.         su total_follow_up if `variable' == `i'
 19.         local person_days = r(mean)
 20.         local person_years=`person_days'/365.25
 21.         local rate = 100000*(`event'/`person_years')
 22.         
.         file write tablecontents (`event') _tab %10.0f (`person_years') _tab 
> %3.2f (`rate') _tab
 23.         drop total_follow_up
 24.         
.         
.         *models
.         foreach modeltype of any minadj demogadj fulladj  {
 25.         
.                 local noestimatesflag 0 /*reset*/
 26. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 27. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
.                 
.                 if "`modeltype'"=="minadj" {
 28.                         cap estimates use ./output/an_univariable_cox_mode
> ls_`variable'_`outcome'_AGESEX_ageband_`x'_timeperiod`period'
 29.                         if _rc!=0 local noestimatesflag 1
 30.                         }
 31.                 if "`modeltype'"=="demogadj" {
 32.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_DEMOGADJ_ageband_`x'_timeperiod`period'
 33.                         if _rc!=0 local noestimatesflag 1
 34.                         }
 35.                 if "`modeltype'"=="fulladj" {
 36.                         cap estimates use ./output/an_multivariate_cox_mod
> els_`outcome'_`variable'_FULLYADJMODEL_ageband_`x'_timeperiod`period' 
 37.                         if _rc!=0 local noestimatesflag 1
 38.                         }
 39.                 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
.                 
.                 if `noestimatesflag'==0{
 40.                         cap lincom `i'.`variable', eform
 41.                         if _rc==0 file write tablecontents %4.2f (r(estima
> te)) (" (") %4.2f (r(lb)) ("-") %4.2f (r(ub)) (")") `endwith'
 42.                                 else file write tablecontents %4.2f ("ERR 
> IN MODEL") `endwith'
 43.                         }
 44.                         else file write tablecontents %4.2f ("DID NOT FIT"
> ) `endwith' 
 45.                         
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 46.                         if "`modeltype'"=="fulladj" {
 47.                                 local hr = r(estimate)
 48.                                 local lb = r(lb)
 49.                                 local ub = r(ub)
 50.                                 cap gen `variable'=.
 51.                                 testparm i.`variable'
 52.                                 *drop `variable'
.                                 }
 53.                 }       
 54.                 } /*min adj, full adj*/
 55.                 
. } /*variable levels*/
 56. 
. } /*agebands*/
 57. 
. } /*Waves*/
 58. end

. *****************************************************************************
> ******************************************
. /*Generic code to write a full row of "ref category" to the output file
> cap prog drop refline
> prog define refline
> file write tablecontents _tab _tab ("1.00 (ref)") _tab ("1.00 (ref)")  _n
> end*/
. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. cap file close tablecontents

. file open tablecontents using ./output/an_tablecontents_HRtable_`outcome'.txt
> , t w replace 
(note: file ./output/an_tablecontents_HRtable_covid_tpp_prob.txt not found)

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(11,517 observations deleted)
  204

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        472       27174           0      27174      27174

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.13
         Prob > chi2 =    0.5465
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(11,517 observations deleted)
  775

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,664       95315           0      95315      95315

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.13
         Prob > chi2 =    0.5465
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(11,517 observations deleted)
  121

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        265       15305           0      15305      15305

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.13
         Prob > chi2 =    0.5465
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(11,517 observations deleted)
  6,146

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     13,745      796674           0     796674     796674

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.13
         Prob > chi2 =    0.5465
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(3,272 observations deleted)
  60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        133        7762           0       7762       7762

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.87
         Prob > chi2 =    0.4120
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(3,272 observations deleted)
  229

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        490       27949           0      27949      27949

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.87
         Prob > chi2 =    0.4120
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(3,272 observations deleted)
  28

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         59        3318           0       3318       3318

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.87
         Prob > chi2 =    0.4120
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(3,272 observations deleted)
  1,696

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      3,822      222853           0     222853     222853

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    2.87
         Prob > chi2 =    0.4120
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(19,523 observations deleted)
  121

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        237       29442           0      29442      29442

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.90
         Prob > chi2 =    0.5930
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(19,523 observations deleted)
  426

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        810      101222           0     101222     101222

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.90
         Prob > chi2 =    0.5930
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(19,523 observations deleted)
  71

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        131       16077           0      16077      16077

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.90
         Prob > chi2 =    0.5930
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(19,523 observations deleted)
  3,524

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      6,962      875181           0     875181     875181

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.90
         Prob > chi2 =    0.5930
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(5,473 observations deleted)
  37

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         66        8021           0       8021       8021

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.61
         Prob > chi2 =    0.6576
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(5,473 observations deleted)
  112

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        243       30462           0      30462      30462

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.61
         Prob > chi2 =    0.6576
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(5,473 observations deleted)
  16

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         29        3659           0       3659       3659

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.61
         Prob > chi2 =    0.6576
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(5,473 observations deleted)
  994

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,965      247483           0     247483     247483

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.61
         Prob > chi2 =    0.6576
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(24,289 observations deleted)
  51

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         94       17540           0      17540      17540

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.53
         Prob > chi2 =    0.6758
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(24,289 observations deleted)
  197

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        326       59272           0      59272      59272

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.53
         Prob > chi2 =    0.6758
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(24,289 observations deleted)
  27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         48        8723           0       8723       8723

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.53
         Prob > chi2 =    0.6758
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(24,289 observations deleted)
  1,730

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,906      531605           0     531605     531605

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    1.53
         Prob > chi2 =    0.6758
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(6,808 observations deleted)
  17

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         23        4053           0       4053       4053

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.39
         Prob > chi2 =    0.2227
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(6,808 observations deleted)
  63

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        107       19715           0      19715      19715

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.39
         Prob > chi2 =    0.2227
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(6,808 observations deleted)
  7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         12        2155           0       2155       2155

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.39
         Prob > chi2 =    0.2227
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(6,808 observations deleted)
  477

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        826      151208           0     151208     151208

 ( 1)  1.kids_cat4 = 0
 ( 2)  2.kids_cat4 = 0
 ( 3)  3.kids_cat4 = 0

           chi2(  3) =    4.39
         Prob > chi2 =    0.2227

. file write tablecontents _n

. 
. *Number kids
. outputHRsforvar, variable("gp_number_kids") min(0) max(4) outcome(`outcome')
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(11,517 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(11,517 observations deleted)
  184

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        373       20956           0      20956      20956
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(11,517 observations deleted)
  131

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        307       17517           0      17517      17517
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(11,517 observations deleted)
  112

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        227       13145           0      13145      13145
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(11,517 observations deleted)
  348

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        757       43697           0      43697      43697
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(3,272 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(3,272 observations deleted)
  74

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        135        7080           0       7080       7080
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(3,272 observations deleted)
  36

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         85        5039           0       5039       5039
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(3,272 observations deleted)
  27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         61        3638           0       3638       3638
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(3,272 observations deleted)
  92

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        209       12192           0      12192      12192
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(19,523 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(19,523 observations deleted)
  82

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        163       20351           0      20351      20351
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(19,523 observations deleted)
  86

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        157       19673           0      19673      19673
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(19,523 observations deleted)
  58

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        105       13189           0      13189      13189
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(19,523 observations deleted)
  200

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        385       48009           0      48009      48009
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(5,473 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(5,473 observations deleted)
  27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         58        7316           0       7316       7316
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(5,473 observations deleted)
  21

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         46        5615           0       5615       5615
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(5,473 observations deleted)
  15

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         31        3882           0       3882       3882
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(5,473 observations deleted)
  49

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        108       13649           0      13649      13649
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(24,289 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(24,289 observations deleted)
  42

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         70       12579           0      12579      12579
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(24,289 observations deleted)
  36

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         61       11078           0      11078      11078
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(24,289 observations deleted)
  24

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         40        7081           0       7081       7081
(11,514 observations (episodes) created)
(cat_time: 11514 changes made)
(covid_tpp_prob: 11514 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,146       58.37       58.37
          1 |      8,140       29.43       87.80
          2 |      3,374       12.20      100.00
------------+-----------------------------------
      Total |     27,660      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     8,900      7,246 |    16,146 
         1 |     3,998      4,142 |     8,140 
         2 |     1,369      2,005 |     3,374 
-----------+----------------------+----------
     Total |    14,267     13,393 |    27,660 
(24,289 observations deleted)
  95

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        155       28534           0      28534      28534
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(6,808 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(6,808 observations deleted)
  18

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         25        4535           0       4535       4535
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(6,808 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         20        3652           0       3652       3652
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(6,808 observations deleted)
  7

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         13        2408           0       2408       2408
(3,271 observations (episodes) created)
(cat_time: 3271 changes made)
(covid_tpp_prob: 3271 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,504       57.93       57.93
          1 |      2,303       29.62       87.55
          2 |        968       12.45      100.00
------------+-----------------------------------
      Total |      7,775      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,491      2,013 |     4,504 
         1 |     1,144      1,159 |     2,303 
         2 |       404        564 |       968 
-----------+----------------------+----------
     Total |     4,039      3,736 |     7,775 
(6,808 observations deleted)
  27

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         49        9120           0       9120       9120

. file write tablecontents _n 

. 
. file close tablecontents

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/08_an_tablecontent_HRtable_covid_tpp_prob.log
  log type:  text
 closed on:  17 Aug 2021, 07:49:23
-------------------------------------------------------------------------------
