-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_sex_covidadmission.lo
> g
  log type:  text
 opened on:  28 Oct 2021, 11:42:11

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. foreach int_type in  male  {
 19. 
. tab male `outcome'
 20. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 21. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposu
> re_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id) 
 22.         if _rc==0{
 23. testparm 1.`int_type'#i.`exposure_type'
 24. di _n "`exposure_type' " _n "****************"
 25. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 26. di "`exposure_type'" _n "****************"
 27. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 28. di "`exposure_type'" _n "****************"
 29. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 30. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod`period', replace
 31. }
 32. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 33. }
 34. drop cat_time
 35. }
 36. }
 37. }
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,355      1,077 |    23,432 
         1 |    21,120      1,103 |    22,223 
-----------+----------------------+----------
     Total |    43,475      2,180 |    45,655 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -6966.0636
Iteration 1:   log pseudolikelihood = -6950.5071
Iteration 2:   log pseudolikelihood = -6950.0867
Iteration 3:   log pseudolikelihood = -6950.0852
Iteration 4:   log pseudolikelihood = -6950.0852
Refining estimates:
Iteration 0:   log pseudolikelihood = -6950.0852

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,065             Number of obs    =      16,065
No. of failures      =          964
Time at risk         =      1263881
                                                Wald chi2(45)    =       36.92
Log pseudolikelihood =   -6950.0852             Prob > chi2      =      0.7988

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.019919   .3249316     0.06   0.951     .5462422    1.904348
 only 12-18  |   .9127064   .4499871    -0.19   0.853     .3472701    2.398804
      mixed  |   1.167357   .3423005     0.53   0.598     .6570654    2.073953
             |
        age1 |    1.01276   .0123798     1.04   0.300     .9887847    1.037317
        age2 |   .9716729   .0376042    -0.74   0.458     .9006959    1.048243
        age3 |   1.065347   .1162329     0.58   0.562     .8602451     1.31935
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8964764   .3563032    -0.27   0.783     .4113675    1.953654
             |
   ethnicity |
Asian or ..  |   1.023134   .1165154     0.20   0.841     .8184591    1.278993
      Other  |   1.025267   .1128268     0.23   0.821     .8263526    1.272063
             |
   obese4cat |
Obese I ..)  |    1.02709   .0972301     0.28   0.778     .8531565    1.236482
Obese II..)  |   1.030015   .1156751     0.26   0.792     .8265131    1.283621
Obese II..)  |    .944639   .1384656    -0.39   0.698     .7087554    1.259028
             |
smoke_nomiss |
     Former  |   1.501379   .2918617     2.09   0.037       1.0257    2.197659
    Current  |    .931733    .095284    -0.69   0.489     .7625057    1.138518
             |
         imd |
          4  |   .9675851   .0800854    -0.40   0.691     .8226909    1.137998
5 most de..  |   .9358701   .1062166    -0.58   0.559     .7492184    1.169022
             |
tot_adults~h |
          2  |   .8375669   .4228281    -0.35   0.726     .3113925    2.252842
          3  |   .5823731   .2301467    -1.37   0.171     .2684212     1.26353
             |
1.htdiag_o~p |   1.069688   .0753297     0.96   0.339      .931781    1.228006
1.~y_disease |   .9819186   .0824469    -0.22   0.828     .8329219    1.157568
    1.asthma |   .9501268   .1213074    -0.40   0.689     .7397832    1.220278
1.~c_disease |   .9520473   .0804911    -0.58   0.561     .8066655    1.123631
             |
     diabcat |
T1DM, con..  |   1.003628   .1961376     0.02   0.985     .6842643    1.472048
T1DM, unc..  |    1.69689    .600989     1.49   0.135     .8475844    3.397226
T2DM, con..  |   .9016737   .0806921    -1.16   0.247     .7566136    1.074545
T2DM, unc..  |    1.06848   .1736281     0.41   0.684     .7770444    1.469219
Diabetes,..  |   1.822368   1.303612     0.84   0.401     .4484748    7.405155
             |
cancer_exh~t |
  Last year  |   1.278265   .7562914     0.41   0.678     .4008702    4.076038
2-5 years..  |   .5500311   .1862921    -1.76   0.078     .2831983    1.068277
   5+ years  |   .9319939   .0812953    -0.81   0.419      .785534    1.105761
             |
cancer_hae~t |
  Last year  |   .5523349   .3916779    -0.84   0.403     .1375906    2.217257
2-5 years..  |   .9694556   .2522283    -0.12   0.905     .5821922    1.614319
   5+ years  |   .8550031   .0742517    -1.80   0.071     .7211841    1.013653
             |
1.~r_disease |   .9875275   .0794983    -0.16   0.876     .8433842    1.156306
1.stroke_d~a |   .8716499   .0729805    -1.64   0.101     .7397307    1.027095
1.other_ne~o |   1.048463   .0797351     0.62   0.534     .9032744    1.216989
             |
reduced_ki~t |
Stage 3a/..  |   .9116872   .5429614    -0.16   0.877     .2837312     2.92944
      1.esrd |   1.016026   .0692925     0.23   0.816     .8889009    1.161332
1.other_tr~t |   .9504386   .0767488    -0.63   0.529     .8113137    1.113421
  1.asplenia |   .9897154   .0809257    -0.13   0.899     .8431609    1.161743
1.ra_sle_p~s |   1.131971   .0834322     1.68   0.093     .9797091    1.307896
1.other_im~o |   .9908717   .0809358    -0.11   0.911      .844287    1.162906
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.287443   .5739842     0.57   0.571     .5373222    3.084761
          1 #|
 only 12-18  |   1.822105   1.143381     0.96   0.339     .5326474    6.233141
    1#mixed  |   1.157752   .4675463     0.36   0.717     .5246464    2.554845
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    1.22
         Prob > chi2 =    0.7471

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.313088   .4541157     0.79   0.431      .666678    2.586257
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.663047   .7245857     1.17   0.243     .7080076    3.906349
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.35151   .4350648     0.94   0.349     .7191326    2.539977
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_0_
> timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_0_timeper
> iod0.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,355      1,077 |    23,432 
         1 |    21,120      1,103 |    22,223 
-----------+----------------------+----------
     Total |    43,475      2,180 |    45,655 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -3652.3094
Iteration 1:   log pseudolikelihood = -3628.3966
Iteration 2:   log pseudolikelihood = -3624.1864
Iteration 3:   log pseudolikelihood = -3623.5999
Iteration 4:   log pseudolikelihood = -3623.4447
Iteration 5:   log pseudolikelihood =  -3623.388
Iteration 6:   log pseudolikelihood = -3623.3672
Iteration 7:   log pseudolikelihood = -3623.3595
Iteration 8:   log pseudolikelihood = -3623.3567
Iteration 9:   log pseudolikelihood = -3623.3556
Iteration 10:  log pseudolikelihood = -3623.3553
Iteration 11:  log pseudolikelihood = -3623.3551
Iteration 12:  log pseudolikelihood = -3623.3551
Iteration 13:  log pseudolikelihood = -3623.3551
Iteration 14:  log pseudolikelihood =  -3623.355
Iteration 15:  log pseudolikelihood =  -3623.355
Iteration 16:  log pseudolikelihood =  -3623.355
Iteration 17:  log pseudolikelihood =  -3623.355
Iteration 18:  log pseudolikelihood =  -3623.355
Iteration 19:  log pseudolikelihood =  -3623.355
Iteration 20:  log pseudolikelihood =  -3623.355
Iteration 21:  log pseudolikelihood =  -3623.355
Iteration 22:  log pseudolikelihood =  -3623.355
Iteration 23:  log pseudolikelihood =  -3623.355
Iteration 24:  log pseudolikelihood =  -3623.355
Iteration 25:  log pseudolikelihood =  -3623.355
Iteration 26:  log pseudolikelihood =  -3623.355
Iteration 27:  log pseudolikelihood =  -3623.355
Iteration 28:  log pseudolikelihood =  -3623.355
Iteration 29:  log pseudolikelihood =  -3623.355
Iteration 30:  log pseudolikelihood =  -3623.355
Refining estimates:
Iteration 0:   log pseudolikelihood =  -3623.355
Iteration 1:   log pseudolikelihood =  -3623.355

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       11,439             Number of obs    =      11,439
No. of failures      =          529
Time at risk         =       684674
                                                Wald chi2(45)    =    65715.91
Log pseudolikelihood =    -3623.355             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,069 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.890602   .9762687     1.23   0.217      .687158    5.201677
 only 12-18  |   1.252974   .9216063     0.31   0.759     .2963834    5.297007
      mixed  |   2.075794   1.019382     1.49   0.137     .7928219    5.434917
             |
        age1 |   .9980495   .0155577    -0.13   0.900      .968018    1.029013
        age2 |   .9838032   .0499697    -0.32   0.748     .8905815    1.086783
        age3 |   1.084366   .1577141     0.56   0.578     .8154059    1.442041
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   2.060599   1.177022     1.27   0.206     .6726419    6.312525
             |
   ethnicity |
Asian or ..  |   .7806733   .1246185    -1.55   0.121     .5709426    1.067447
      Other  |   .8889913   .1444688    -0.72   0.469      .646502    1.222433
             |
   obese4cat |
Obese I ..)  |   1.219573   .1448309     1.67   0.095     .9663249    1.539192
Obese II..)  |     .75556   .1295308    -1.63   0.102     .5399353    1.057295
Obese II..)  |   .9320073   .1914064    -0.34   0.732      .623172    1.393897
             |
smoke_nomiss |
     Former  |   .7105501    .251862    -0.96   0.335     .3547132    1.423351
    Current  |   .8074626   .1194712    -1.45   0.148     .6041985    1.079109
             |
         imd |
          4  |   .9457622   .1063493    -0.50   0.620     .7586926    1.178957
5 most de..  |   1.036819   .1465681     0.26   0.798      .785913    1.367829
             |
tot_adults~h |
          2  |   2.372011   1.534124     1.34   0.182     .6677176    8.426371
          3  |   .7285712   .4410527    -0.52   0.601     .2224247    2.386498
             |
1.htdiag_o~p |   .8380648   .0792718    -1.87   0.062     .6962467     1.00877
1.~y_disease |   .9356091    .107088    -0.58   0.561     .7475969    1.170904
    1.asthma |   .6658953   .1289631    -2.10   0.036     .4555697    .9733233
1.~c_disease |   .9447783   .1048241    -0.51   0.609     .7601306     1.17428
             |
     diabcat |
T1DM, con..  |   1.285592   .2994357     1.08   0.281     .8144122    2.029374
T1DM, unc..  |   3.26e-14   5.90e-15  -171.84   0.000     2.29e-14    4.65e-14
T2DM, con..  |   .9260409   .1123921    -0.63   0.527     .7299972    1.174733
T2DM, unc..  |   1.029629   .2447368     0.12   0.902     .6461828    1.640614
Diabetes,..  |   3.30e-14   1.11e-14   -92.56   0.000     1.71e-14    6.38e-14
             |
cancer_exh~t |
  Last year  |   2.332409   1.322618     1.49   0.135     .7675764    7.087416
2-5 years..  |   1.112159   .3555432     0.33   0.739     .5943588    2.081063
   5+ years  |   .9453671   .1110644    -0.48   0.632     .7509291    1.190151
             |
cancer_hae~t |
  Last year  |   .5124092   .5146185    -0.67   0.506     .0715724    3.668499
2-5 years..  |   1.117516   .3542011     0.35   0.726     .6004299    2.079915
   5+ years  |   .9411787   .1118685    -0.51   0.610     .7455869    1.188081
             |
1.~r_disease |   1.069545   .1156448     0.62   0.534     .8652917    1.322012
1.stroke_d~a |   1.071306   .1119539     0.66   0.510     .8728931    1.314819
1.other_ne~o |   1.009571   .1105168     0.09   0.931     .8146228    1.251172
             |
reduced_ki~t |
Stage 3a/..  |   3.95e-14   7.81e-15  -156.25   0.000     2.69e-14    5.82e-14
      1.esrd |    .952177   .0832106    -0.56   0.575       .80229    1.130067
1.other_tr~t |   .9185663   .0982185    -0.79   0.427      .744895    1.132729
  1.asplenia |   1.016564   .1089139     0.15   0.878     .8240194    1.254099
1.ra_sle_p~s |   .8064749   .0892971    -1.94   0.052     .6491445    1.001937
1.other_im~o |    .820951   .0955668    -1.69   0.090      .653475    1.031349
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .5809306   .3682615    -0.86   0.392     .1677002    2.012403
          1 #|
 only 12-18  |   1.195443   1.058696     0.20   0.840     .2107156     6.78205
    1#mixed  |   .5172582    .299314    -1.14   0.255     .1664008    1.607901
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    2.83
         Prob > chi2 =    0.4189

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.098308   .4269798     0.24   0.809     .5126371     2.35309
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.497859   .7159034     0.85   0.398     .5870003    3.822114
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.073721   .3762008     0.20   0.839     .5403254    2.133673
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_0_
> timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_0_timeper
> iod1.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,355      1,077 |    23,432 
         1 |    21,120      1,103 |    22,223 
-----------+----------------------+----------
     Total |    43,475      2,180 |    45,655 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2386.9024
Iteration 1:   log pseudolikelihood = -2361.6343
Iteration 2:   log pseudolikelihood = -2356.1051
Iteration 3:   log pseudolikelihood = -2356.0089
Iteration 4:   log pseudolikelihood = -2356.0083
Iteration 5:   log pseudolikelihood = -2356.0083
Refining estimates:
Iteration 0:   log pseudolikelihood = -2356.0083

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        8,402             Number of obs    =       8,402
No. of failures      =          363
Time at risk         =       434977
                                                Wald chi2(45)    =       86.89
Log pseudolikelihood =   -2356.0083             Prob > chi2      =      0.0002

                       (Std. Err. adjusted for 1,019 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.213214   .5945963     0.39   0.693     .4642623     3.17038
 only 12-18  |    1.10286   .7259064     0.15   0.882      .303568    4.006677
      mixed  |   1.208003   .5256646     0.43   0.664      .514833    2.834457
             |
        age1 |   .9814086   .0194381    -0.95   0.343     .9440406    1.020256
        age2 |   1.071771      .0681     1.09   0.275     .9462744    1.213912
        age3 |   .8146406   .1487421    -1.12   0.262     .5695718    1.165155
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .4046798   .3291034    -1.11   0.266      .082201     1.99226
             |
   ethnicity |
Asian or ..  |   .8584179   .1658282    -0.79   0.429     .5878475    1.253525
      Other  |   1.087612   .1900136     0.48   0.631     .7722594     1.53174
             |
   obese4cat |
Obese I ..)  |   .9555737   .1484289    -0.29   0.770     .7047699     1.29563
Obese II..)  |   1.048837   .1940608     0.26   0.797     .7298186    1.507306
Obese II..)  |   1.014092   .2305332     0.06   0.951     .6494927    1.583364
             |
smoke_nomiss |
     Former  |   .8321814    .338495    -0.45   0.652     .3749613    1.846926
    Current  |   .6397065   .1146095    -2.49   0.013     .4502772    .9088278
             |
         imd |
          4  |   1.049401   .1367054     0.37   0.711     .8129348    1.354651
5 most de..  |   .8811474   .1592303    -0.70   0.484     .6183434    1.255647
             |
tot_adults~h |
          2  |   4.658408   5.045191     1.42   0.155     .5576497    38.91469
          3  |   1.237491   1.273739     0.21   0.836     .1645916    9.304145
             |
1.htdiag_o~p |   .9623208    .109025    -0.34   0.735     .7706975    1.201588
1.~y_disease |   .9649392   .1285565    -0.27   0.789     .7431841    1.252863
    1.asthma |   1.003131   .1964324     0.02   0.987     .6834012    1.472445
1.~c_disease |   .9838283    .132988    -0.12   0.904     .7548472     1.28227
             |
     diabcat |
T1DM, con..  |    .986292   .3202763    -0.04   0.966     .5219114    1.863864
T1DM, unc..  |   .6277316   .6173495    -0.47   0.636     .0913378    4.314172
T2DM, con..  |   .9438435   .1393222    -0.39   0.695     .7067289    1.260512
T2DM, unc..  |   1.269036   .2991963     1.01   0.312     .7994457    2.014461
Diabetes,..  |   6.934866   5.156373     2.60   0.009     1.614853    29.78127
             |
cancer_exh~t |
  Last year  |    1.00732   .9244557     0.01   0.994     .1667199    6.086216
2-5 years..  |   2.210685   .6368063     2.75   0.006     1.256988    3.887967
   5+ years  |   1.165148   .1562668     1.14   0.254     .8958183    1.515452
             |
cancer_hae~t |
  Last year  |   .7603042    .745611    -0.28   0.780     .1112335    5.196838
2-5 years..  |   1.158992   .4861309     0.35   0.725     .5093898    2.637004
   5+ years  |   1.248624   .1606141     1.73   0.084     .9703745    1.606661
             |
1.~r_disease |   1.034329   .1361732     0.26   0.798     .7990885    1.338821
1.stroke_d~a |   .8498831   .1148171    -1.20   0.229     .6521748    1.107527
1.other_ne~o |   .8967217   .1198482    -0.82   0.415     .6900702    1.165258
             |
reduced_ki~t |
Stage 3a/..  |   .7390123    .728183    -0.31   0.759      .107133    5.097767
      1.esrd |   .8452455   .0947441    -1.50   0.134     .6785333    1.052918
1.other_tr~t |   .9191573   .1229737    -0.63   0.529     .7071441    1.194735
  1.asplenia |   1.390326   .1669741     2.74   0.006     1.098727    1.759314
1.ra_sle_p~s |   .9100462   .1148381    -0.75   0.455     .7106421    1.165402
1.other_im~o |   1.123881   .1483138     0.88   0.376     .8677423    1.455626
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   2.969086   2.613972     1.24   0.216     .5287229    16.67314
          1 #|
 only 12-18  |   10.92968   11.55279     2.26   0.024     1.376824    86.76344
    1#mixed  |   2.802009   2.303258     1.25   0.210     .5594738    14.03328
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    5.67
         Prob > chi2 =    0.1287

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.602136   2.857892     1.62   0.106     .7607235    17.05663
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    12.0539   9.764971     3.07   0.002     2.463554    58.97846
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.384836   2.623549     1.57   0.116     .7409358    15.46303
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_0_
> timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_0_timeper
> iod2.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,355      1,077 |    23,432 
         1 |    21,120      1,103 |    22,223 
-----------+----------------------+----------
     Total |    43,475      2,180 |    45,655 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1264.5024
Iteration 1:   log pseudolikelihood = -1233.8332
Iteration 2:   log pseudolikelihood = -1230.4168
Iteration 3:   log pseudolikelihood = -1230.2246
Iteration 4:   log pseudolikelihood = -1230.1777
Iteration 5:   log pseudolikelihood = -1230.1605
Iteration 6:   log pseudolikelihood = -1230.1542
Iteration 7:   log pseudolikelihood = -1230.1519
Iteration 8:   log pseudolikelihood =  -1230.151
Iteration 9:   log pseudolikelihood = -1230.1507
Iteration 10:  log pseudolikelihood = -1230.1506
Iteration 11:  log pseudolikelihood = -1230.1505
Iteration 12:  log pseudolikelihood = -1230.1505
Iteration 13:  log pseudolikelihood = -1230.1505
Iteration 14:  log pseudolikelihood = -1230.1505
Iteration 15:  log pseudolikelihood = -1230.1505
Iteration 16:  log pseudolikelihood = -1230.1505
Iteration 17:  log pseudolikelihood = -1230.1505
Iteration 18:  log pseudolikelihood = -1230.1505
Iteration 19:  log pseudolikelihood = -1230.1505
Iteration 20:  log pseudolikelihood = -1230.1505
Iteration 21:  log pseudolikelihood = -1230.1505
Iteration 22:  log pseudolikelihood = -1230.1505
Iteration 23:  log pseudolikelihood = -1230.1505
Iteration 24:  log pseudolikelihood = -1230.1505
Iteration 25:  log pseudolikelihood = -1230.1505
Iteration 26:  log pseudolikelihood = -1230.1505
Iteration 27:  log pseudolikelihood = -1230.1505
Iteration 28:  log pseudolikelihood = -1230.1505
Iteration 29:  log pseudolikelihood = -1230.1505
Iteration 30:  log pseudolikelihood = -1230.1505
Iteration 31:  log pseudolikelihood = -1230.1505
Refining estimates:
Iteration 0:   log pseudolikelihood = -1230.1505
Iteration 1:   log pseudolikelihood = -1230.1505

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,790             Number of obs    =       5,790
No. of failures      =          204
Time at risk         =       233836
                                                Wald chi2(45)    =    28095.36
Log pseudolikelihood =   -1230.1505             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 960 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.759836   1.972955     1.42   0.156      .679791    11.20447
 only 12-18  |   2.969314   2.487363     1.30   0.194     .5749283    15.33552
      mixed  |   1.936428   1.306051     0.98   0.327     .5162935    7.262832
             |
        age1 |   1.003331   .0277548     0.12   0.904     .9503807    1.059231
        age2 |   .9701122   .0873358    -0.34   0.736     .8131886    1.157318
        age3 |   1.145385   .2939914     0.53   0.597     .6925793    1.894233
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   4.040282   3.068255     1.84   0.066     .9120014    17.89896
             |
   ethnicity |
Asian or ..  |    .613726   .1703819    -1.76   0.079     .3561763    1.057509
      Other  |   .6124993   .1728307    -1.74   0.082     .3523057    1.064858
             |
   obese4cat |
Obese I ..)  |   1.109638   .2268991     0.51   0.611     .7432371    1.656667
Obese II..)  |   .9530381   .2649006    -0.17   0.863     .5527332    1.643255
Obese II..)  |   .5491975   .2084736    -1.58   0.114     .2609848    1.155692
             |
smoke_nomiss |
     Former  |   1.795943   .6718778     1.57   0.118     .8626822    3.738819
    Current  |   1.128517   .2403576     0.57   0.570     .7433863    1.713174
             |
         imd |
          4  |   .9256544   .1797204    -0.40   0.691     .6326797    1.354297
5 most de..  |   1.038497   .2438234     0.16   0.872     .6554745    1.645335
             |
tot_adults~h |
          2  |   .9728083   .9645434    -0.03   0.978     .1393341    6.791991
          3  |   .7036223   .6255131    -0.40   0.693     .1232055    4.018362
             |
1.htdiag_o~p |   .6479054   .1084166    -2.59   0.009     .4667418    .8993869
1.~y_disease |   1.060408   .1958994     0.32   0.751     .7382823    1.523084
    1.asthma |   .7843202   .2289217    -0.83   0.405     .4426402    1.389747
1.~c_disease |   1.002333   .1822803     0.01   0.990      .701804    1.431555
             |
     diabcat |
T1DM, con..  |   1.365424   .5039426     0.84   0.399     .6623856    2.814647
T1DM, unc..  |   1.421621   1.392805     0.36   0.720     .2083704    9.699107
T2DM, con..  |    1.10386   .2171262     0.50   0.615     .7507326    1.623092
T2DM, unc..  |   .4387877   .2568231    -1.41   0.159     .1393301     1.38186
Diabetes,..  |   1.06e-14   7.90e-15   -43.08   0.000     2.45e-15    4.57e-14
             |
cancer_exh~t |
  Last year  |   1.12e-14   3.74e-15   -95.90   0.000     5.80e-15    2.15e-14
2-5 years..  |   2.129958   .8102686     1.99   0.047     1.010557    4.489326
   5+ years  |   .5544383    .124875    -2.62   0.009     .3565651    .8621197
             |
cancer_hae~t |
  Last year  |   1.27e-14   3.50e-15  -116.38   0.000     7.43e-15    2.18e-14
2-5 years..  |   1.949527   .8205418     1.59   0.113     .8544071    4.448298
   5+ years  |   .9921993   .1909212    -0.04   0.968     .6804698    1.446735
             |
1.~r_disease |   1.122764   .1831295     0.71   0.478     .8155534    1.545697
1.stroke_d~a |   .7518626   .1465145    -1.46   0.143     .5131756    1.101567
1.other_ne~o |   .7264766   .1335218    -1.74   0.082     .5067295    1.041519
             |
reduced_ki~t |
Stage 3a/..  |   1.330884   1.482843     0.26   0.798      .149882    11.81764
      1.esrd |   .8757949   .1311715    -0.89   0.376     .6530018    1.174601
1.other_tr~t |   1.433263   .2310234     2.23   0.026     1.045017    1.965752
  1.asplenia |   .7347666   .1456425    -1.55   0.120     .4982275    1.083605
1.ra_sle_p~s |   1.186614   .2040663     0.99   0.320     .8470819     1.66224
1.other_im~o |   .8545025   .1510134    -0.89   0.374     .6043428    1.208213
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .1984185   .1715707    -1.87   0.061     .0364381    1.080459
          1 #|
 only 12-18  |   .1141646   .1609794    -1.54   0.124     .0071992    1.810421
    1#mixed  |   .2120003   .1649585    -1.99   0.046     .0461331    .9742282
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    4.30
         Prob > chi2 =    0.2307

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5476024   .3235071    -1.02   0.308     .1720287     1.74313
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3389906    .411893    -0.89   0.373     .0313278    3.668142
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4105234   .2156325    -1.70   0.090     .1466337    1.149323
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_0_
> timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_0_timeper
> iod3.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    22,355      1,077 |    23,432 
         1 |    21,120      1,103 |    22,223 
-----------+----------------------+----------
     Total |    43,475      2,180 |    45,655 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -618.16006
Iteration 1:   log pseudolikelihood = -609.32966
Iteration 2:   log pseudolikelihood = -601.82592
Iteration 3:   log pseudolikelihood = -600.73385
Iteration 4:   log pseudolikelihood = -600.59615
Iteration 5:   log pseudolikelihood = -600.55817
Iteration 6:   log pseudolikelihood = -600.54423
Iteration 7:   log pseudolikelihood =  -600.5391
Iteration 8:   log pseudolikelihood = -600.53721
Iteration 9:   log pseudolikelihood = -600.53652
Iteration 10:  log pseudolikelihood = -600.53626
Iteration 11:  log pseudolikelihood = -600.53617
Iteration 12:  log pseudolikelihood = -600.53614
Iteration 13:  log pseudolikelihood = -600.53612
Iteration 14:  log pseudolikelihood = -600.53612
Iteration 15:  log pseudolikelihood = -600.53612
Iteration 16:  log pseudolikelihood = -600.53612
Iteration 17:  log pseudolikelihood = -600.53612
Iteration 18:  log pseudolikelihood = -600.53612
Iteration 19:  log pseudolikelihood = -600.53612
Iteration 20:  log pseudolikelihood = -600.53612
Iteration 21:  log pseudolikelihood = -600.53612
Iteration 22:  log pseudolikelihood = -600.53612
Iteration 23:  log pseudolikelihood = -600.53612
Iteration 24:  log pseudolikelihood = -600.53612
Iteration 25:  log pseudolikelihood = -600.53612
Iteration 26:  log pseudolikelihood = -600.53612
Iteration 27:  log pseudolikelihood = -600.53612
Iteration 28:  log pseudolikelihood = -600.53612
Iteration 29:  log pseudolikelihood = -600.53612
Iteration 30:  log pseudolikelihood = -600.53612
Iteration 31:  log pseudolikelihood = -600.53612
Iteration 32:  log pseudolikelihood = -600.53612
Iteration 33:  log pseudolikelihood = -600.53612
Refining estimates:
Iteration 0:   log pseudolikelihood = -600.53612
Iteration 1:   log pseudolikelihood = -600.53612

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,942             Number of obs    =       3,942
No. of failures      =          106
Time at risk         =       119706
                                                Wald chi2(45)    =    57620.80
Log pseudolikelihood =   -600.53612             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 882 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .3347264   .3753359    -0.98   0.329     .0371723     3.01412
 only 12-18  |   1.078509   1.356846     0.06   0.952     .0916111    12.69696
      mixed  |   .8321096   .7430092    -0.21   0.837     .1445852    4.788918
             |
        age1 |   .9973431   .0370253    -0.07   0.943      .927352    1.072617
        age2 |   .9784826    .114512    -0.19   0.853     .7779235    1.230749
        age3 |    1.07656   .3591576     0.22   0.825     .5598401    2.070202
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.110399    1.04518     0.11   0.911      .175498    7.025635
             |
   ethnicity |
Asian or ..  |   .6786579     .24725    -1.06   0.287      .332307    1.385997
      Other  |    .659558   .2677203    -1.03   0.305     .2976754     1.46138
             |
   obese4cat |
Obese I ..)  |   1.108619   .3018711     0.38   0.705     .6501369    1.890428
Obese II..)  |   1.005679   .3488201     0.02   0.987     .5095888    1.984718
Obese II..)  |   1.298616   .4711148     0.72   0.471     .6377935    2.644123
             |
smoke_nomiss |
     Former  |   .5160729   .5423139    -0.63   0.529     .0658003    4.047566
    Current  |   1.239625   .3472032     0.77   0.443     .7159446    2.146352
             |
         imd |
          4  |   .7481922   .1997409    -1.09   0.277     .4433762    1.262566
5 most de..  |   1.271867   .3758713     0.81   0.416     .7126699    2.269838
             |
tot_adults~h |
          2  |   3.33e-16   2.44e-16   -48.67   0.000     7.94e-17    1.40e-15
          3  |   .2784187   .2005169    -1.78   0.076     .0678678    1.142176
             |
1.htdiag_o~p |   1.023938   .2222912     0.11   0.913     .6690871    1.566985
1.~y_disease |   .9293439   .2494263    -0.27   0.785     .5491901    1.572643
    1.asthma |   1.021482    .378109     0.06   0.954     .4944841     2.11013
1.~c_disease |   .8288846   .2127056    -0.73   0.465     .5012583     1.37065
             |
     diabcat |
T1DM, con..  |   .7528093   .5467143    -0.39   0.696     .1813489    3.125035
T1DM, unc..  |   2.353582   2.188152     0.92   0.357     .3805024    14.55798
T2DM, con..  |   .9562503   .2684262    -0.16   0.873     .5516116    1.657715
T2DM, unc..  |   .7479157   .4339358    -0.50   0.617     .2398784    2.331923
Diabetes,..  |   1.32e-15   1.21e-15   -37.27   0.000     2.18e-16    8.00e-15
             |
cancer_exh~t |
  Last year  |   1.31e-15   6.14e-16   -73.26   0.000     5.25e-16    3.28e-15
2-5 years..  |   1.24e-15   2.58e-16  -165.34   0.000     8.29e-16    1.87e-15
   5+ years  |    .613128   .1839075    -1.63   0.103     .3405913    1.103745
             |
cancer_hae~t |
  Last year  |   3.565618   2.665533     1.70   0.089     .8237699    15.43347
2-5 years..  |   .7509421   .7377555    -0.29   0.771     .1094844    5.150635
   5+ years  |    .693809   .1941876    -1.31   0.192     .4008669    1.200825
             |
1.~r_disease |   1.019289   .2603131     0.07   0.940     .6178905    1.681447
1.stroke_d~a |   .6213542   .1714234    -1.72   0.085     .3618295    1.067025
1.other_ne~o |   .9879664    .244551    -0.05   0.961     .6081974     1.60487
             |
reduced_ki~t |
Stage 3a/..  |   2.63e-15   1.27e-15   -69.31   0.000     1.02e-15    6.80e-15
      1.esrd |   1.001814   .2073102     0.01   0.993     .6677962    1.502901
1.other_tr~t |   1.276793   .3234246     0.96   0.335     .7771455    2.097676
  1.asplenia |   1.000381   .2437514     0.00   0.999     .6205298    1.612753
1.ra_sle_p~s |   1.062516   .2678645     0.24   0.810     .6482529    1.741514
1.other_im~o |    .941068   .2482767    -0.23   0.818     .5611168    1.578297
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   4.013477   5.063725     1.10   0.271     .3385139    47.58445
          1 #|
 only 12-18  |   1.13e-15   1.62e-15   -23.96   0.000     6.77e-17    1.89e-14
    1#mixed  |   1.154414   1.115993     0.15   0.882      .173576    7.677742
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =  861.17
         Prob > chi2 =    0.0000

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.343416   .8044289     0.49   0.622     .4154482    4.344147
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.22e-15   6.89e-16   -60.79   0.000     4.03e-16    3.69e-15
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9605991   .4601516    -0.08   0.933     .3756599    2.456346
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_0_
> timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_0_timeper
> iod4.ster saved
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,318        333 |     6,651 
         1 |     5,929        288 |     6,217 
-----------+----------------------+----------
     Total |    12,247        621 |    12,868 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1557.2082
Iteration 1:   log pseudolikelihood = -1537.2614
Iteration 2:   log pseudolikelihood = -1536.2366
Iteration 3:   log pseudolikelihood = -1536.0774
Iteration 4:   log pseudolikelihood = -1536.0207
Iteration 5:   log pseudolikelihood = -1535.9999
Iteration 6:   log pseudolikelihood = -1535.9922
Iteration 7:   log pseudolikelihood = -1535.9894
Iteration 8:   log pseudolikelihood = -1535.9884
Iteration 9:   log pseudolikelihood =  -1535.988
Iteration 10:  log pseudolikelihood = -1535.9878
Iteration 11:  log pseudolikelihood = -1535.9878
Iteration 12:  log pseudolikelihood = -1535.9878
Iteration 13:  log pseudolikelihood = -1535.9878
Iteration 14:  log pseudolikelihood = -1535.9878
Iteration 15:  log pseudolikelihood = -1535.9878
Iteration 16:  log pseudolikelihood = -1535.9878
Iteration 17:  log pseudolikelihood = -1535.9878
Iteration 18:  log pseudolikelihood = -1535.9878
Iteration 19:  log pseudolikelihood = -1535.9878
Iteration 20:  log pseudolikelihood = -1535.9878
Iteration 21:  log pseudolikelihood = -1535.9878
Iteration 22:  log pseudolikelihood = -1535.9878
Iteration 23:  log pseudolikelihood = -1535.9878
Iteration 24:  log pseudolikelihood = -1535.9878
Iteration 25:  log pseudolikelihood = -1535.9878
Iteration 26:  log pseudolikelihood = -1535.9878
Iteration 27:  log pseudolikelihood = -1535.9878
Iteration 28:  log pseudolikelihood = -1535.9878
Iteration 29:  log pseudolikelihood = -1535.9878
Iteration 30:  log pseudolikelihood = -1535.9878
Iteration 31:  log pseudolikelihood = -1535.9878
Iteration 32:  log pseudolikelihood = -1535.9878
Refining estimates:
Iteration 0:   log pseudolikelihood = -1535.9878
Iteration 1:   log pseudolikelihood = -1535.9878
Iteration 2:   log pseudolikelihood = -1535.9878
Iteration 3:   log pseudolikelihood = -1535.9878
Iteration 4:   log pseudolikelihood = -1535.9878
Iteration 5:   log pseudolikelihood = -1535.9878

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,546             Number of obs    =       4,546
No. of failures      =          261
Time at risk         =       353856
                                                Wald chi2(45)    =    29891.95
Log pseudolikelihood =   -1535.9878             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.103106   .7318474     0.15   0.882      .300534    4.048933
 only 12-18  |   .9336488   .7145772    -0.09   0.929      .208309    4.184648
      mixed  |   1.079001    .668484     0.12   0.902     .3203827    3.633917
             |
        age1 |   .9241133   .0528244    -1.38   0.167     .8261685     1.03367
        age2 |   1.506081   .4669988     1.32   0.187     .8201848    2.765573
        age3 |     .40777   .2732689    -1.34   0.181     .1096424    1.516533
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .6414777   .4381729    -0.65   0.516     .1681717    2.446866
             |
   ethnicity |
Asian or ..  |    .931853   .2013552    -0.33   0.744     .6101259    1.423231
      Other  |   1.000325   .2028083     0.00   0.999     .6723052    1.488387
             |
   obese4cat |
Obese I ..)  |    .820181   .1562659    -1.04   0.298     .5645905    1.191477
Obese II..)  |   .7017576    .184594    -1.35   0.178     .4190661    1.175146
Obese II..)  |   1.174942    .307655     0.62   0.538     .7032858    1.962913
             |
smoke_nomiss |
     Former  |   1.954929   .6540204     2.00   0.045     1.014757    3.766171
    Current  |   1.028547   .1924697     0.15   0.880     .7127557    1.484252
             |
         imd |
          4  |     .73768   .1297462    -1.73   0.084     .5225829    1.041312
5 most de..  |   1.103749   .2336937     0.47   0.641     .7288663    1.671448
             |
tot_adults~h |
          2  |   1.929281   1.867576     0.68   0.497     .2893464     12.8639
          3  |    .792498   .6175961    -0.30   0.765     .1720498    3.650414
             |
1.htdiag_o~p |   .7385185   .1089192    -2.06   0.040      .553125    .9860512
1.~y_disease |   .9025915     .14722    -0.63   0.530     .6556218    1.242594
    1.asthma |   1.096057   .2351395     0.43   0.669     .7198187     1.66895
1.~c_disease |   1.065038   .1555819     0.43   0.666     .7998728    1.418109
             |
     diabcat |
T1DM, con..  |   .9899845   .3732639    -0.03   0.979     .4728149    2.072839
T1DM, unc..  |   7.90e-17   2.07e-17  -141.86   0.000     4.74e-17    1.32e-16
T2DM, con..  |   1.055477   .1747798     0.33   0.744     .7629489    1.460165
T2DM, unc..  |   .9050137   .3106796    -0.29   0.771     .4617943    1.773625
Diabetes,..  |   6.68e-17   3.68e-17   -67.63   0.000     2.27e-17    1.97e-16
             |
cancer_exh~t |
  Last year  |   .8180031    .798352    -0.21   0.837      .120782    5.539975
2-5 years..  |   .7167435   .4176056    -0.57   0.568     .2287795    2.245486
   5+ years  |   .9046405   .1582743    -0.57   0.567     .6420241    1.274679
             |
cancer_hae~t |
  Last year  |   1.173421   .8632591     0.22   0.828     .2774878    4.962077
2-5 years..  |   1.157442   .5047564     0.34   0.737     .4923721    2.720854
   5+ years  |   1.161937   .1802259     0.97   0.333     .8573421    1.574747
             |
1.~r_disease |   .7635054   .1335819    -1.54   0.123     .5418599    1.075814
1.stroke_d~a |   .9758133   .1602084    -0.15   0.881     .7073217    1.346221
1.other_ne~o |   1.051119   .1698737     0.31   0.758     .7657505    1.442835
             |
reduced_ki~t |
Stage 3a/..  |   .4629394    .212511    -1.68   0.093     .1882706    1.138324
      1.esrd |    1.13054   .1453815     0.95   0.340     .8786703    1.454608
1.other_tr~t |   .8112302   .1329274    -1.28   0.202     .5883924    1.118462
  1.asplenia |   1.114562   .1757962     0.69   0.492     .8181761    1.518313
1.ra_sle_p~s |   .8072249   .1393897    -1.24   0.215     .5754546    1.132343
1.other_im~o |   1.203556   .1762622     1.27   0.206     .9032476     1.60371
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.544333   1.193899     0.56   0.574     .3393835    7.027345
          1 #|
 only 12-18  |   1.151086   1.283953     0.13   0.900     .1293164    10.24618
    1#mixed  |   1.310308    .914961     0.39   0.699     .3334243    5.149319
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.37
         Prob > chi2 =    0.9455

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.703562   1.243317     0.73   0.465     .4074952    7.121862
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.07471   1.023286     0.08   0.940     .1662718    6.946462
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.413825   .9758616     0.50   0.616     .3654873    5.469137
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_1_
> timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_1_timeper
> iod0.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,318        333 |     6,651 
         1 |     5,929        288 |     6,217 
-----------+----------------------+----------
     Total |    12,247        621 |    12,868 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -797.54704
Iteration 1:   log pseudolikelihood = -778.72773
Iteration 2:   log pseudolikelihood = -766.79069
Iteration 3:   log pseudolikelihood = -765.51345
Iteration 4:   log pseudolikelihood =  -765.3753
Iteration 5:   log pseudolikelihood = -765.33358
Iteration 6:   log pseudolikelihood = -765.31826
Iteration 7:   log pseudolikelihood = -765.31263
Iteration 8:   log pseudolikelihood = -765.31056
Iteration 9:   log pseudolikelihood = -765.30979
Iteration 10:  log pseudolikelihood = -765.30951
Iteration 11:  log pseudolikelihood = -765.30941
Iteration 12:  log pseudolikelihood = -765.30937
Iteration 13:  log pseudolikelihood = -765.30936
Iteration 14:  log pseudolikelihood = -765.30935
Iteration 15:  log pseudolikelihood = -765.30935
Iteration 16:  log pseudolikelihood = -765.30935
Iteration 17:  log pseudolikelihood = -765.30935
Iteration 18:  log pseudolikelihood = -765.30935
Iteration 19:  log pseudolikelihood = -765.30935
Iteration 20:  log pseudolikelihood = -765.30935
Iteration 21:  log pseudolikelihood = -765.30935
Iteration 22:  log pseudolikelihood = -765.30935
Iteration 23:  log pseudolikelihood = -765.30935
Iteration 24:  log pseudolikelihood = -765.30935
Iteration 25:  log pseudolikelihood = -765.30935
Iteration 26:  log pseudolikelihood = -765.30935
Iteration 27:  log pseudolikelihood = -765.30935
Iteration 28:  log pseudolikelihood = -765.30935
Iteration 29:  log pseudolikelihood = -765.30935
Iteration 30:  log pseudolikelihood = -765.30935
Iteration 31:  log pseudolikelihood = -765.30935
Iteration 32:  log pseudolikelihood = -765.30935
Iteration 33:  log pseudolikelihood = -765.30935
Iteration 34:  log pseudolikelihood = -765.30935
Iteration 35:  log pseudolikelihood = -765.30935
Iteration 36:  log pseudolikelihood = -765.30935
Iteration 37:  log pseudolikelihood = -765.30935
Iteration 38:  log pseudolikelihood = -765.30935
Refining estimates:
Iteration 0:   log pseudolikelihood = -765.30935
Iteration 1:   log pseudolikelihood = -765.30935
Iteration 2:   log pseudolikelihood = -765.30935
Iteration 3:   log pseudolikelihood = -765.30935

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,195             Number of obs    =       3,195
No. of failures      =          142
Time at risk         =       190938
                                                Wald chi2(45)    =    35909.77
Log pseudolikelihood =   -765.30935             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 865 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.18603   1.019804     0.20   0.843     .2198838    6.397322
 only 12-18  |   .8045663   .9477899    -0.18   0.854     .0799531    8.096338
      mixed  |   1.523412   1.214916     0.53   0.598      .319144      7.2719
             |
        age1 |   1.023505   .0773156     0.31   0.758     .8826536    1.186834
        age2 |   .9841284   .3798769    -0.04   0.967     .4618331    2.097097
        age3 |   .9579735   .7870311    -0.05   0.958      .191444    4.793638
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .4196307   .5267129    -0.69   0.489     .0358471    4.912245
             |
   ethnicity |
Asian or ..  |   1.133074   .2995888     0.47   0.637     .6748351    1.902476
      Other  |   1.171923   .3367539     0.55   0.581     .6672751    2.058226
             |
   obese4cat |
Obese I ..)  |   1.159772   .2448336     0.70   0.483     .7667958    1.754145
Obese II..)  |   .4592726   .1827652    -1.96   0.051     .2105422    1.001848
Obese II..)  |   1.539553   .5243453     1.27   0.205     .7897511     3.00123
             |
smoke_nomiss |
     Former  |   4.666512   1.595061     4.51   0.000     2.388048    9.118884
    Current  |   .7267139   .2177757    -1.07   0.287     .4039078    1.307509
             |
         imd |
          4  |   1.378856   .2993729     1.48   0.139      .900967    2.110227
5 most de..  |   .9547276   .2870595    -0.15   0.878     .5295992    1.721122
             |
tot_adults~h |
          2  |   2.467843    2.34627     0.95   0.342     .3828675    15.90693
          3  |   .6001253   .5623376    -0.54   0.586     .0956395    3.765707
             |
1.htdiag_o~p |   1.376685   .2498422     1.76   0.078     .9646236    1.964769
1.~y_disease |   .9612594   .2041804    -0.19   0.852     .6339244    1.457618
    1.asthma |   1.623103   .4039473     1.95   0.052     .9965625     2.64355
1.~c_disease |   2.047293   .3783072     3.88   0.000     1.425252    2.940821
             |
     diabcat |
T1DM, con..  |   1.179475   .6379876     0.31   0.760     .4085707    3.404949
T1DM, unc..  |   1.97e-18   8.77e-19   -91.52   0.000     8.22e-19    4.71e-18
T2DM, con..  |   1.289058   .2860918     1.14   0.253     .8343683     1.99153
T2DM, unc..  |   .9165398   .4085037    -0.20   0.845     .3826211    2.195501
Diabetes,..  |   1.24e-18   8.51e-19   -59.92   0.000     3.21e-19    4.76e-18
             |
cancer_exh~t |
  Last year  |   2.05e-18   1.15e-18   -72.69   0.000     6.84e-19    6.15e-18
2-5 years..  |    .869168   .6525734    -0.19   0.852     .1995352    3.786063
   5+ years  |   1.289638    .254188     1.29   0.197     .8763867    1.897754
             |
cancer_hae~t |
  Last year  |   1.61e-18   5.41e-19  -121.73   0.000     8.31e-19    3.11e-18
2-5 years..  |   .8544739    .616869    -0.22   0.828     .2075832    3.517267
   5+ years  |   .6723374   .1693131    -1.58   0.115     .4104226    1.101395
             |
1.~r_disease |   .9638489   .2202289    -0.16   0.872     .6159121     1.50834
1.stroke_d~a |    .672398   .1654046    -1.61   0.107     .4151811    1.088969
1.other_ne~o |   .9693813   .2118444    -0.14   0.887     .6316503     1.48769
             |
reduced_ki~t |
Stage 3a/..  |    1.26422   .4413232     0.67   0.502     .6377919    2.505915
      1.esrd |   1.091041   .1931319     0.49   0.623     .7711959    1.543539
1.other_tr~t |   1.248429   .2460998     1.13   0.260     .8483367    1.837211
  1.asplenia |   .9739854   .2099423    -0.12   0.903     .6383755    1.486034
1.ra_sle_p~s |   .9866834   .2140509    -0.06   0.951     .6449386    1.509514
1.other_im~o |   .9883945   .2083501    -0.06   0.956      .653883    1.494035
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.681866   2.286604     0.38   0.702     .1170925    24.15761
          1 #|
 only 12-18  |   2.764103   5.130586     0.55   0.584     .0727106    105.0777
    1#mixed  |   2.233294   2.837039     0.63   0.527     .1851961    26.93146
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.58
         Prob > chi2 =    0.9005

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.994744   2.578849     0.53   0.593     .1582834    25.13849
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.223904   3.478969     0.51   0.609     .1036423    47.71941
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.402226   4.417709     0.94   0.346      .266992    43.35389
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_1_
> timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_1_timeper
> iod1.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,318        333 |     6,651 
         1 |     5,929        288 |     6,217 
-----------+----------------------+----------
     Total |    12,247        621 |    12,868 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood =  -612.4298
Iteration 1:   log pseudolikelihood = -588.53969
Iteration 2:   log pseudolikelihood = -585.97604
Iteration 3:   log pseudolikelihood = -585.22501
Iteration 4:   log pseudolikelihood = -584.94473
Iteration 5:   log pseudolikelihood = -584.84051
Iteration 6:   log pseudolikelihood = -584.80201
Iteration 7:   log pseudolikelihood = -584.78782
Iteration 8:   log pseudolikelihood = -584.78259
Iteration 9:   log pseudolikelihood = -584.78067
Iteration 10:  log pseudolikelihood = -584.77996
Iteration 11:  log pseudolikelihood =  -584.7797
Iteration 12:  log pseudolikelihood = -584.77961
Iteration 13:  log pseudolikelihood = -584.77957
Iteration 14:  log pseudolikelihood = -584.77956
Iteration 15:  log pseudolikelihood = -584.77955
Iteration 16:  log pseudolikelihood = -584.77955
Iteration 17:  log pseudolikelihood = -584.77955
Iteration 18:  log pseudolikelihood = -584.77955
Iteration 19:  log pseudolikelihood = -584.77955
Iteration 20:  log pseudolikelihood = -584.77955
Iteration 21:  log pseudolikelihood = -584.77955
Iteration 22:  log pseudolikelihood = -584.77955
Iteration 23:  log pseudolikelihood = -584.77955
Iteration 24:  log pseudolikelihood = -584.77955
Iteration 25:  log pseudolikelihood = -584.77955
Iteration 26:  log pseudolikelihood = -584.77955
Iteration 27:  log pseudolikelihood = -584.77955
Iteration 28:  log pseudolikelihood = -584.77955
Iteration 29:  log pseudolikelihood = -584.77955
Iteration 30:  log pseudolikelihood = -584.77955
Iteration 31:  log pseudolikelihood = -584.77955
Iteration 32:  log pseudolikelihood = -584.77955
Iteration 33:  log pseudolikelihood = -584.77955
Iteration 34:  log pseudolikelihood = -584.77955
Iteration 35:  log pseudolikelihood = -584.77955
Iteration 36:  log pseudolikelihood = -584.77955
Iteration 37:  log pseudolikelihood = -584.77955
Iteration 38:  log pseudolikelihood = -584.77955
Iteration 39:  log pseudolikelihood = -584.77955
Iteration 40:  log pseudolikelihood = -584.77955
Iteration 41:  log pseudolikelihood = -584.77955
Refining estimates:
Iteration 0:   log pseudolikelihood = -584.77955
Iteration 1:   log pseudolikelihood = -584.77955

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,366             Number of obs    =       2,366
No. of failures      =          115
Time at risk         =       122287
                                                Wald chi2(43)    =    76675.44
Log pseudolikelihood =   -584.77955             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 804 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   5.34e+08   5.87e+08    18.28   0.000     6.19e+07    4.61e+09
 only 12-18  |   5.44e+08   7.58e+08    14.43   0.000     3.54e+07    8.35e+09
      mixed  |   2.93e+08   3.32e+08    17.21   0.000     3.18e+07    2.70e+09
             |
        age1 |   .9556649   .0758553    -0.57   0.568     .8179789    1.116527
        age2 |   1.218135    .531889     0.45   0.651     .5176364    2.866592
        age3 |    .617764   .5859978    -0.51   0.612     .0962478    3.965102
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   2.92e+08   1.59e+08    35.86   0.000     1.01e+08    8.48e+08
             |
   ethnicity |
Asian or ..  |   .7229131   .2558957    -0.92   0.359      .361226    1.446749
      Other  |   .9566379   .2881865    -0.15   0.883     .5300584    1.726519
             |
   obese4cat |
Obese I ..)  |   .6663887   .2096435    -1.29   0.197     .3597018    1.234561
Obese II..)  |   1.319555   .3879593     0.94   0.346     .7415962    2.347941
Obese II..)  |   1.007151   .4289326     0.02   0.987     .4370976    2.320654
             |
smoke_nomiss |
     Former  |   5.50e-19   1.39e-19  -166.08   0.000     3.35e-19    9.04e-19
    Current  |   .6932968    .226804    -1.12   0.263     .3651392    1.316376
             |
         imd |
          4  |   .6361561   .1731423    -1.66   0.097     .3731578    1.084513
5 most de..  |   .6372228   .2255393    -1.27   0.203     .3184316    1.275165
             |
tot_adults~h |
          2  |   .0044149   .0104894    -2.28   0.022     .0000419    .4648302
          3  |   4.83e+15   1.16e+16    15.06   0.000     4.39e+13    5.31e+17
             |
1.htdiag_o~p |   .7619784   .1705036    -1.21   0.224     .4914441    1.181439
1.~y_disease |   .6126768   .1627025    -1.84   0.065     .3640712    1.031042
    1.asthma |   .9985009   .3502802    -0.00   0.997     .5020441     1.98589
1.~c_disease |   1.367529   .2858105     1.50   0.134     .9078989    2.059851
             |
     diabcat |
T1DM, con..  |   1.320612   .6720598     0.55   0.585      .487078    3.580568
T1DM, unc..  |   8.88e-19   4.22e-19   -87.41   0.000     3.50e-19    2.25e-18
T2DM, con..  |   .9316541   .2392501    -0.28   0.783      .563203    1.541148
T2DM, unc..  |    .915035   .4746911    -0.17   0.864     .3310254     2.52938
Diabetes,..  |   4.23e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   2.759216     2.6821     1.04   0.296     .4105576    18.54374
2-5 years..  |   .4856289   .4943374    -0.71   0.478     .0660448    3.570838
   5+ years  |     .70075   .2009032    -1.24   0.215     .3995084    1.229137
             |
cancer_hae~t |
  Last year  |   5.97e-19   2.18e-19  -115.12   0.000     2.92e-19    1.22e-18
2-5 years..  |   5.02e-19   1.38e-19  -152.76   0.000     2.92e-19    8.62e-19
   5+ years  |   1.030512   .2483545     0.12   0.901     .6425586    1.652699
             |
1.~r_disease |   1.227869   .2849795     0.88   0.376     .7791021    1.935128
1.stroke_d~a |   .8144512   .1953713    -0.86   0.392     .5089535    1.303323
1.other_ne~o |    1.04864   .2426111     0.21   0.837     .6663377    1.650284
             |
reduced_ki~t |
Stage 3a/..  |   1.581609   .7398594     0.98   0.327     .6322899    3.956233
      1.esrd |   .6802535   .1437521    -1.82   0.068     .4495663    1.029314
1.other_tr~t |     .90515   .2050712    -0.44   0.660     .5805931    1.411137
  1.asplenia |    .765229   .2013928    -1.02   0.309     .4568487    1.281771
1.ra_sle_p~s |   1.408887   .3237166     1.49   0.136     .8980438    2.210318
1.other_im~o |   .9198041   .2319685    -0.33   0.740     .5610841    1.507866
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.24e-09          .        .       .            .           .
          1 #|
 only 12-18  |   3.78e-09   4.57e-09   -16.06   0.000     3.55e-10    4.03e-08
    1#mixed  |   3.63e-09   2.06e-09   -34.21   0.000     1.19e-09    1.11e-08
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  2) = 1171.94
         Prob > chi2 =    0.0000

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6638491    .729736    -0.37   0.709     .0769815    5.724698
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.057342   2.463497     0.60   0.547     .1968174    21.50551
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.064113   1.068806     0.06   0.951     .1486047    7.619797
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_1_
> timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_1_timeper
> iod2.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,318        333 |     6,651 
         1 |     5,929        288 |     6,217 
-----------+----------------------+----------
     Total |    12,247        621 |    12,868 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -352.69518
Iteration 1:   log pseudolikelihood = -351.00473
Iteration 2:   log pseudolikelihood =  -326.9017
Iteration 3:   log pseudolikelihood = -325.99318
Iteration 4:   log pseudolikelihood = -325.72419
Iteration 5:   log pseudolikelihood = -325.62457
Iteration 6:   log pseudolikelihood =  -325.5878
Iteration 7:   log pseudolikelihood = -325.57425
Iteration 8:   log pseudolikelihood = -325.56927
Iteration 9:   log pseudolikelihood = -325.56743
Iteration 10:  log pseudolikelihood = -325.56676
Iteration 11:  log pseudolikelihood = -325.56651
Iteration 12:  log pseudolikelihood = -325.56642
Iteration 13:  log pseudolikelihood = -325.56638
Iteration 14:  log pseudolikelihood = -325.56637
Iteration 15:  log pseudolikelihood = -325.56637
Iteration 16:  log pseudolikelihood = -325.56636
Iteration 17:  log pseudolikelihood = -325.56636
Iteration 18:  log pseudolikelihood = -325.56636
Iteration 19:  log pseudolikelihood = -325.56636
Iteration 20:  log pseudolikelihood = -325.56636
Iteration 21:  log pseudolikelihood = -325.56636
Iteration 22:  log pseudolikelihood = -325.56636
Iteration 23:  log pseudolikelihood = -325.56636
Iteration 24:  log pseudolikelihood = -325.56636
Iteration 25:  log pseudolikelihood = -325.56636
Iteration 26:  log pseudolikelihood = -325.56636
Iteration 27:  log pseudolikelihood = -325.56636
Iteration 28:  log pseudolikelihood = -325.56636
Iteration 29:  log pseudolikelihood = -325.56636
Iteration 30:  log pseudolikelihood = -325.56636
Iteration 31:  log pseudolikelihood = -325.56636
Iteration 32:  log pseudolikelihood = -325.56636
Iteration 33:  log pseudolikelihood = -325.56636
Iteration 34:  log pseudolikelihood = -325.56636
Iteration 35:  log pseudolikelihood = -325.56636
Iteration 36:  log pseudolikelihood = -325.56636
Iteration 37:  log pseudolikelihood = -325.56636
Iteration 38:  log pseudolikelihood = -325.56636
Refining estimates:
Iteration 0:   log pseudolikelihood = -325.56636
Iteration 1:   log pseudolikelihood = -325.56636

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,648             Number of obs    =       1,648
No. of failures      =           71
Time at risk         =        66414
                                                Wald chi2(43)    =    37598.91
Log pseudolikelihood =   -325.56636             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 706 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.13e+09   1.25e+09    18.87   0.000     1.30e+08    9.87e+09
 only 12-18  |   2.17e+09          .        .       .            .           .
      mixed  |   7.92e+08   8.25e+08    19.67   0.000     1.03e+08    6.10e+09
             |
        age1 |   1.249436   .1411123     1.97   0.049     1.001333    1.559011
        age2 |   .4004699   .2277838    -1.61   0.108     .1313451    1.221029
        age3 |   5.659272   6.788188     1.45   0.148     .5392133    59.39644
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .6353954   .3990929    -0.72   0.470     .1855252    2.176132
             |
   ethnicity |
Asian or ..  |    1.26933   .4944247     0.61   0.540     .5915854    2.723525
      Other  |   .9554123   .3911391    -0.11   0.911     .4282672    2.131409
             |
   obese4cat |
Obese I ..)  |   1.127867   .4080343     0.33   0.739     .5550275    2.291931
Obese II..)  |   1.049646   .4997317     0.10   0.919     .4128474    2.668677
Obese II..)  |   3.174447   1.356401     2.70   0.007     1.373917    7.334586
             |
smoke_nomiss |
     Former  |   8.29e-18   5.50e-18   -59.29   0.000     2.26e-18    3.04e-17
    Current  |   .9333654   .3476955    -0.19   0.853     .4497422    1.937045
             |
         imd |
          4  |   .4521867   .1569821    -2.29   0.022     .2289881    .8929408
5 most de..  |   .3231186   .1886018    -1.94   0.053     .1029254    1.014382
             |
tot_adults~h |
          2  |   4.72e-18   6.16e-18   -30.58   0.000     3.66e-19    6.09e-17
          3  |   .1920524   .2213372    -1.43   0.152     .0200643    1.838295
             |
1.htdiag_o~p |   1.004585   .2549692     0.02   0.986     .6108674    1.652062
1.~y_disease |   .9413193   .2649385    -0.21   0.830     .5422037    1.634224
    1.asthma |   1.454911   .5959145     0.92   0.360     .6519199    3.246972
1.~c_disease |   1.222644    .362288     0.68   0.498     .6840313    2.185365
             |
     diabcat |
T1DM, con..  |   .3574061   .3905293    -0.94   0.346     .0419831    3.042635
T1DM, unc..  |   7.57e-18   5.81e-18   -51.34   0.000     1.68e-18    3.41e-17
T2DM, con..  |   .6309208   .2422438    -1.20   0.230     .2972717    1.339048
T2DM, unc..  |   .7027925   .4653841    -0.53   0.594      .191941    2.573277
Diabetes,..  |   1.95e-17   1.45e-17   -51.91   0.000     4.57e-18    8.34e-17
             |
cancer_exh~t |
  Last year  |   31.71581   23.00203     4.77   0.000     7.654877    131.4055
2-5 years..  |   1.546636   1.109291     0.61   0.543      .379212    6.308032
   5+ years  |    .942291   .3274011    -0.17   0.864     .4769064    1.861817
             |
cancer_hae~t |
  Last year  |   1.65e-17   8.43e-18   -75.70   0.000     6.07e-18    4.49e-17
2-5 years..  |   1.28e-17   4.76e-18  -104.45   0.000     6.16e-18    2.65e-17
   5+ years  |   1.171461   .3779984     0.49   0.624     .6223985    2.204892
             |
1.~r_disease |   .5822777   .1977166    -1.59   0.111     .2992944    1.132822
1.stroke_d~a |   1.139415   .3294309     0.45   0.652     .6465172    2.008093
1.other_ne~o |   .6128333   .2111128    -1.42   0.155     .3119715    1.203843
             |
reduced_ki~t |
Stage 3a/..  |   .7578128   .5794792    -0.36   0.717     .1693054    3.391977
      1.esrd |   .9093323   .2407422    -0.36   0.720     .5412156     1.52783
1.other_tr~t |   1.055702   .3364673     0.17   0.865      .565264    1.971657
  1.asplenia |   .6159262   .2139424    -1.40   0.163     .3117908     1.21673
1.ra_sle_p~s |   .9012963   .2916166    -0.32   0.748     .4780345    1.699323
1.other_im~o |   .9725785   .3173424    -0.09   0.932     .5130814    1.843584
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.264024          .        .       .            .           .
          1 #|
 only 12-18  |    1.69325   2.469165     0.36   0.718     .0971549    29.51056
    1#mixed  |   1.817899   1.241562     0.88   0.382      .476682    6.932833
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  2) =    0.77
         Prob > chi2 =    0.6811

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.43e+09   1.58e+09    19.08   0.000     1.64e+08    1.25e+10
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.67e+09   5.35e+09    15.10   0.000     2.10e+08    6.39e+10
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.44e+09   1.72e+09    17.62   0.000     1.38e+08    1.50e+10
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_1_
> timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_1_timeper
> iod3.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,318        333 |     6,651 
         1 |     5,929        288 |     6,217 
-----------+----------------------+----------
     Total |    12,247        621 |    12,868 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -130.67699
Iteration 1:   log pseudolikelihood =  -116.6355
Iteration 2:   log pseudolikelihood = -109.82055
Iteration 3:   log pseudolikelihood = -109.22952
Iteration 4:   log pseudolikelihood = -109.11819
Iteration 5:   log pseudolikelihood = -109.07595
Iteration 6:   log pseudolikelihood = -109.05999
Iteration 7:   log pseudolikelihood = -109.05403
Iteration 8:   log pseudolikelihood = -109.05182
Iteration 9:   log pseudolikelihood = -109.05101
Iteration 10:  log pseudolikelihood = -109.05071
Iteration 11:  log pseudolikelihood =  -109.0506
Iteration 12:  log pseudolikelihood = -109.05056
Iteration 13:  log pseudolikelihood = -109.05054
Iteration 14:  log pseudolikelihood = -109.05054
Iteration 15:  log pseudolikelihood = -109.05054
Iteration 16:  log pseudolikelihood = -109.05054
Iteration 17:  log pseudolikelihood = -109.05054
Iteration 18:  log pseudolikelihood = -109.05054
Iteration 19:  log pseudolikelihood = -109.05054
Iteration 20:  log pseudolikelihood = -109.05054
Iteration 21:  log pseudolikelihood = -109.05054
Iteration 22:  log pseudolikelihood = -109.05054
Iteration 23:  log pseudolikelihood = -109.05054
Iteration 24:  log pseudolikelihood = -109.05054
Iteration 25:  log pseudolikelihood = -109.05054
Iteration 26:  log pseudolikelihood = -109.05054
Iteration 27:  log pseudolikelihood = -109.05054
Iteration 28:  log pseudolikelihood = -109.05054
Iteration 29:  log pseudolikelihood = -109.05054
Iteration 30:  log pseudolikelihood = -109.05054
Iteration 31:  log pseudolikelihood = -109.05054
Iteration 32:  log pseudolikelihood = -109.05054
Iteration 33:  log pseudolikelihood = -109.05054
Refining estimates:
Iteration 0:   log pseudolikelihood = -109.05054
Iteration 1:   log pseudolikelihood = -109.05054
Iteration 2:   log pseudolikelihood = -109.05054
Iteration 3:   log pseudolikelihood = -109.05054
Iteration 4:   log pseudolikelihood = -109.05054

Stratified Cox regr. -- no ties

No. of subjects      =        1,108             Number of obs    =       1,108
No. of failures      =           29
Time at risk         =        33205
                                                Wald chi2(43)    =    30964.95
Log pseudolikelihood =   -109.05054             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 593 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .2012079   .1997477    -1.62   0.106     .0287489    1.408216
 only 12-18  |   4.45e-18   5.83e-18   -30.54   0.000     3.43e-19    5.78e-17
      mixed  |    .121997   .1117264    -2.30   0.022     .0202678    .7343285
             |
        age1 |   .8233797   .1666695    -0.96   0.337     .5537311    1.224338
        age2 |   2.868655   2.921121     1.03   0.301     .3898601    21.10804
        age3 |   .1129032   .2392662    -1.03   0.303     .0017735    7.187629
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.59e-10   1.81e-10   -19.84   0.000     1.72e-11    1.48e-09
             |
   ethnicity |
Asian or ..  |   .2471392   .2388285    -1.45   0.148     .0371847    1.642552
      Other  |   1.260117   .6647802     0.44   0.661     .4480802    3.543773
             |
   obese4cat |
Obese I ..)  |    .746538   .4747077    -0.46   0.646     .2146797    2.596049
Obese II..)  |   1.035602   .6948753     0.05   0.958     .2780022    3.857783
Obese II..)  |    1.22211   1.087626     0.23   0.822     .2135879    6.992683
             |
smoke_nomiss |
     Former  |   2.83e-17   1.63e-17   -66.35   0.000     9.19e-18    8.73e-17
    Current  |   .5600215   .3962393    -0.82   0.413     .1399403    2.241127
             |
         imd |
          4  |   1.485599   .6167308     0.95   0.340     .6584677     3.35173
5 most de..  |    .776562   .5709038    -0.34   0.731      .183823    3.280594
             |
tot_adults~h |
          2  |   .1207138    .127547    -2.00   0.045     .0152185    .9575073
          3  |   4.93e+14          .        .       .            .           .
             |
1.htdiag_o~p |   1.430809   .5533682     0.93   0.354     .6704674    3.053413
1.~y_disease |   .8523435   .4017755    -0.34   0.735     .3383587    2.147098
    1.asthma |   3.595712   2.296391     2.00   0.045     1.028413    12.57194
1.~c_disease |   .9585014   .5050496    -0.08   0.936     .3412566    2.692182
             |
     diabcat |
T1DM, con..  |   .6818208   .4369133    -0.60   0.550     .1941857    2.393996
T1DM, unc..  |   3.20e-17   3.03e-17   -40.06   0.000     4.98e-18    2.05e-16
T2DM, con..  |   .4135639   .3183826    -1.15   0.251     .0914628    1.869997
T2DM, unc..  |    4.14247   2.474069     2.38   0.017     1.284942    13.35473
Diabetes,..  |   4.08e-17   3.93e-17   -39.17   0.000     6.17e-18    2.69e-16
             |
cancer_exh~t |
  Last year  |   1.23e-16   1.95e-16   -23.09   0.000     5.50e-18    2.76e-15
2-5 years..  |   5.69e-17   3.79e-17   -56.16   0.000     1.54e-17    2.10e-16
   5+ years  |    1.10165   .6195865     0.17   0.863      .365859    3.317216
             |
cancer_hae~t |
  Last year  |   4.326896   4.934578     1.28   0.199     .4628385    40.45045
2-5 years..  |   9.37e-17   6.77e-17   -51.06   0.000     2.27e-17    3.86e-16
   5+ years  |   .7309957   .4115584    -0.56   0.578     .2424819     2.20369
             |
1.~r_disease |   1.292952    .719033     0.46   0.644      .434725    3.845478
1.stroke_d~a |   1.618969   .6928852     1.13   0.260     .6997484    3.745719
1.other_ne~o |   2.149527   .8945387     1.84   0.066     .9508458    4.859321
             |
reduced_ki~t |
Stage 3a/..  |   7.03e-17   3.85e-17   -67.99   0.000     2.41e-17    2.05e-16
      1.esrd |   1.182421   .4920457     0.40   0.687     .5230677    2.672921
1.other_tr~t |   .4629449   .3257008    -1.09   0.274     .1165934    1.838166
  1.asplenia |   .2882929   .2189438    -1.64   0.101     .0650714    1.277257
1.ra_sle_p~s |   2.376709   1.126144     1.83   0.068     .9389776    6.015845
1.other_im~o |   .3999294   .3059994    -1.20   0.231     .0892689    1.791704
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   4.04e+09          .        .       .            .           .
          1 #|
 only 12-18  |   2.10e+10   3.38e+10    14.78   0.000     8.99e+08    4.91e+11
    1#mixed  |   8.09e+09   1.02e+10    18.07   0.000     6.82e+08    9.61e+10
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  2) =  330.90
         Prob > chi2 =    0.0000

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   8.13e+08   8.07e+08    20.67   0.000     1.16e+08    5.69e+09
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   9.35e-08   1.72e-07    -8.82   0.000     2.57e-09    3.41e-06
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   9.87e+08   1.54e+09    13.32   0.000     4.69e+07    2.08e+10
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_1_
> timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_male_1_timeper
> iod4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_sex_covidadmission.lo
> g
  log type:  text
 closed on:  28 Oct 2021, 11:43:25
-------------------------------------------------------------------------------
