-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_sex_covid_death.log
  log type:  text
 opened on:  28 Oct 2021, 11:40:01

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. foreach int_type in  male  {
 19. 
. tab male `outcome'
 20. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 21. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposu
> re_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id) 
 22.         if _rc==0{
 23. testparm 1.`int_type'#i.`exposure_type'
 24. di _n "`exposure_type' " _n "****************"
 25. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 26. di "`exposure_type'" _n "****************"
 27. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 28. di "`exposure_type'" _n "****************"
 29. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 30. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod`period', replace
 31. }
 32. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 33. }
 34. drop cat_time
 35. }
 36. }
 37. }
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    21,574      3,842 |    25,416 
         1 |    20,589      3,685 |    24,274 
-----------+----------------------+----------
     Total |    42,163      7,527 |    49,690 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -16404.954
Iteration 1:   log pseudolikelihood = -16384.516
Iteration 2:   log pseudolikelihood = -16384.221
Iteration 3:   log pseudolikelihood =  -16384.22
Iteration 4:   log pseudolikelihood =  -16384.22
Refining estimates:
Iteration 0:   log pseudolikelihood =  -16384.22

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,079             Number of obs    =      16,079
No. of failures      =        2,261
Time at risk         =      1306467
                                                Wald chi2(45)    =       43.71
Log pseudolikelihood =    -16384.22             Prob > chi2      =      0.5264

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.34779   .3429255     1.17   0.241     .8185524    2.219209
 only 12-18  |   1.590525   .5170125     1.43   0.153     .8411066     3.00767
      mixed  |   1.401873   .3358909     1.41   0.159     .8765157    2.242115
             |
        age1 |   1.026484   .0084051     3.19   0.001     1.010142    1.043091
        age2 |    .935036   .0239417    -2.62   0.009     .8892691    .9831583
        age3 |   1.183402   .0859776     2.32   0.020     1.026337    1.364503
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.367519   .3880523     1.10   0.270     .7841395    2.384918
             |
   ethnicity |
Asian or ..  |    1.02607   .0715007     0.37   0.712     .8950794    1.176229
      Other  |   .9540053   .0653721    -0.69   0.492     .8341097    1.091135
             |
   obese4cat |
Obese I ..)  |   .8897465   .0592849    -1.75   0.080     .7808178    1.013871
Obese II..)  |   .9513848    .072325    -0.66   0.512     .8196855    1.104244
Obese II..)  |    1.15326   .0965157     1.70   0.088     .9787928    1.358826
             |
smoke_nomiss |
     Former  |   .9868266   .1436803    -0.09   0.927     .7418351    1.312727
    Current  |    1.02032   .0621896     0.33   0.741     .9054294    1.149789
             |
         imd |
          4  |   1.029195   .0544245     0.54   0.586     .9278663    1.141588
5 most de..  |   1.012513   .0714538     0.18   0.860     .8817196    1.162707
             |
tot_adults~h |
          2  |   .8445472   .3120868    -0.46   0.648     .4093344    1.742488
          3  |   .8336005   .2337799    -0.65   0.516     .4811073    1.444355
             |
1.htdiag_o~p |   1.054064   .0483031     1.15   0.251     .9635183    1.153118
1.~y_disease |   .9942336   .0525945    -0.11   0.913     .8963141     1.10285
    1.asthma |   .9652944   .0788161    -0.43   0.665     .8225444    1.132818
1.~c_disease |   1.023117   .0527699     0.44   0.658     .9247454    1.131952
             |
     diabcat |
T1DM, con..  |   .8001648   .1121827    -1.59   0.112      .607913    1.053216
T1DM, unc..  |   1.417038   .3553126     1.39   0.164      .866859    2.316405
T2DM, con..  |   1.070162   .0574921     1.26   0.207     .9632093    1.188991
T2DM, unc..  |   .9415092   .1082126    -0.52   0.600     .7516082    1.179391
Diabetes,..  |   1.081348   .6453783     0.13   0.896     .3356948    3.483261
             |
cancer_exh~t |
  Last year  |   1.273269   .4937028     0.62   0.533     .5954859    2.722505
2-5 years..  |    .980429   .1667453    -0.12   0.907     .7025044    1.368306
   5+ years  |   .9606581    .055984    -0.69   0.491     .8569661    1.076897
             |
cancer_hae~t |
  Last year  |    1.01781    .397046     0.05   0.964     .4738208    2.186346
2-5 years..  |   1.034238   .1678975     0.21   0.836     .7523798    1.421687
   5+ years  |   1.029501   .0523631     0.57   0.568     .9318204     1.13742
             |
1.~r_disease |   .9909373   .0520669    -0.17   0.862      .893967    1.098426
1.stroke_d~a |   .9988917    .052673    -0.02   0.983     .9008102    1.107652
1.other_ne~o |   .9867245   .0523522    -0.25   0.801     .8892709    1.094858
             |
reduced_ki~t |
Stage 3a/..  |   1.650757   .4681531     1.77   0.077     .9468541    2.877949
      1.esrd |   .9515849   .0422493    -1.12   0.264     .8722784    1.038102
1.other_tr~t |   .9837176   .0500735    -0.32   0.747     .8903121    1.086923
  1.asplenia |   .9857923    .051135    -0.28   0.783     .8904959    1.091287
1.ra_sle_p~s |   .9573696    .047149    -0.88   0.376     .8692791    1.054387
1.other_im~o |   .9932622   .0506235    -0.13   0.894     .8988366    1.097607
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .8196248   .2598224    -0.63   0.530     .4403346    1.525624
          1 #|
 only 12-18  |   .5876339   .2531858    -1.23   0.217     .2525581    1.367264
    1#mixed  |   .6852034   .1972751    -1.31   0.189     .3897197    1.204722
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    3.30
         Prob > chi2 =    0.3477

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.104682   .2179361     0.50   0.614     .7504279     1.62617
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9346467   .2633256    -0.24   0.810      .538061    1.623541
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9605685   .1726208    -0.22   0.823     .6754008     1.36614
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_tim
> eperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_timeperiod
> 0.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    21,574      3,842 |    25,416 
         1 |    20,589      3,685 |    24,274 
-----------+----------------------+----------
     Total |    42,163      7,527 |    49,690 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -11378.174
Iteration 1:   log pseudolikelihood = -11351.481
Iteration 2:   log pseudolikelihood = -11350.125
Iteration 3:   log pseudolikelihood = -11349.732
Iteration 4:   log pseudolikelihood = -11349.588
Iteration 5:   log pseudolikelihood = -11349.535
Iteration 6:   log pseudolikelihood = -11349.515
Iteration 7:   log pseudolikelihood = -11349.508
Iteration 8:   log pseudolikelihood = -11349.505
Iteration 9:   log pseudolikelihood = -11349.504
Iteration 10:  log pseudolikelihood = -11349.504
Iteration 11:  log pseudolikelihood = -11349.504
Iteration 12:  log pseudolikelihood = -11349.504
Iteration 13:  log pseudolikelihood = -11349.504
Iteration 14:  log pseudolikelihood = -11349.504
Iteration 15:  log pseudolikelihood = -11349.504
Iteration 16:  log pseudolikelihood = -11349.504
Iteration 17:  log pseudolikelihood = -11349.504
Iteration 18:  log pseudolikelihood = -11349.504
Iteration 19:  log pseudolikelihood = -11349.504
Iteration 20:  log pseudolikelihood = -11349.504
Iteration 21:  log pseudolikelihood = -11349.504
Iteration 22:  log pseudolikelihood = -11349.504
Iteration 23:  log pseudolikelihood = -11349.504
Iteration 24:  log pseudolikelihood = -11349.504
Iteration 25:  log pseudolikelihood = -11349.504
Iteration 26:  log pseudolikelihood = -11349.504
Iteration 27:  log pseudolikelihood = -11349.504
Iteration 28:  log pseudolikelihood = -11349.504
Refining estimates:
Iteration 0:   log pseudolikelihood = -11349.504
Iteration 1:   log pseudolikelihood = -11349.504

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,280             Number of obs    =      12,280
No. of failures      =        1,627
Time at risk         =       753835
                                                Wald chi2(45)    =    24133.90
Log pseudolikelihood =   -11349.504             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,084 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.209005   .2916191     0.79   0.431     .7535516    1.939737
 only 12-18  |   .7939261   .3525324    -0.52   0.603      .332518    1.895592
      mixed  |   1.300319   .2866048     1.19   0.233     .8441807    2.002923
             |
        age1 |    .991209   .0085157    -1.03   0.304     .9746583    1.008041
        age2 |   1.007705   .0275378     0.28   0.779     .9551516    1.063149
        age3 |   .9859565   .0775898    -0.18   0.857     .8450308    1.150384
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.101193   .3427213     0.31   0.757     .5983378    2.026659
             |
   ethnicity |
Asian or ..  |   1.137682   .0881016     1.67   0.096     .9774721    1.324152
      Other  |   1.057553   .0906669     0.65   0.514     .8939766    1.251059
             |
   obese4cat |
Obese I ..)  |   .9104714   .0715718    -1.19   0.233     .7804655    1.062133
Obese II..)  |   .9304251    .084166    -0.80   0.425     .7792592    1.110915
Obese II..)  |   .9912962   .1082409    -0.08   0.936     .8003126    1.227855
             |
smoke_nomiss |
     Former  |    1.01674   .1756773     0.10   0.923     .7246609    1.426542
    Current  |   .9934273   .0744963    -0.09   0.930     .8576404    1.150713
             |
         imd |
          4  |   1.009673   .0649317     0.15   0.881     .8901025    1.145305
5 most de..  |   1.072709   .0877522     0.86   0.391     .9137972    1.259255
             |
tot_adults~h |
          2  |   1.081658   .4605836     0.18   0.854     .4695023    2.491967
          3  |   .7320999   .2625736    -0.87   0.385     .3624766    1.478634
             |
1.htdiag_o~p |   .9147061   .0477401    -1.71   0.088      .825764    1.013228
1.~y_disease |    .958908   .0636031    -0.63   0.527     .8420113    1.092034
    1.asthma |   1.148684    .102295     1.56   0.120     .9647119     1.36774
1.~c_disease |   1.019285   .0659519     0.30   0.768     .8978821    1.157102
             |
     diabcat |
T1DM, con..  |    .796632   .1337477    -1.35   0.176     .5732556     1.10705
T1DM, unc..  |   1.365981   .4180765     1.02   0.308     .7497619    2.488663
T2DM, con..  |   .9701102   .0625076    -0.47   0.638     .8550178    1.100695
T2DM, unc..  |   .8774813   .1143751    -1.00   0.316     .6796545     1.13289
Diabetes,..  |   1.537265   .8769193     0.75   0.451     .5025604    4.702288
             |
cancer_exh~t |
  Last year  |   2.58e-13   4.98e-14  -149.98   0.000     1.77e-13    3.77e-13
2-5 years..  |   .8363234   .1762743    -0.85   0.396     .5533042    1.264109
   5+ years  |   1.028324   .0660083     0.44   0.663     .9067578    1.166189
             |
cancer_hae~t |
  Last year  |   1.160534   .4401513     0.39   0.695      .551856    2.440562
2-5 years..  |   .5612687   .1466929    -2.21   0.027     .3362802    .9367861
   5+ years  |   1.021363    .065186     0.33   0.740     .9012689     1.15746
             |
1.~r_disease |   1.047831   .0672691     0.73   0.467     .9239432     1.18833
1.stroke_d~a |   .9698899   .0604202    -0.49   0.624     .8584125    1.095844
1.other_ne~o |   .9031052   .0568532    -1.62   0.105     .7982753    1.021702
             |
reduced_ki~t |
Stage 3a/..  |   1.223525   .4862826     0.51   0.612     .5614461    2.666354
      1.esrd |   .8968758   .0457313    -2.13   0.033     .8115774    .9911393
1.other_tr~t |   .9791474   .0624062    -0.33   0.741     .8641646    1.109429
  1.asplenia |   1.007649   .0633873     0.12   0.904     .8907662     1.13987
1.ra_sle_p~s |   1.035757   .0629161     0.58   0.563     .9195017    1.166711
1.other_im~o |   1.026778   .0615321     0.44   0.659     .9129906    1.154747
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.143857   .3918141     0.39   0.695     .5845249    2.238414
          1 #|
 only 12-18  |   1.854599   1.072211     1.07   0.285     .5972272    5.759178
    1#mixed  |   .9242354   .2915037    -0.25   0.803     .4980968     1.71495
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    3.87
         Prob > chi2 =    0.2764

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.382928   .3742666     1.20   0.231     .8136469    2.350516
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.472414   .5022788     1.13   0.257     .7545068    2.873406
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.201801   .3021868     0.73   0.465     .7341791    1.967265
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_tim
> eperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_timeperiod
> 1.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    21,574      3,842 |    25,416 
         1 |    20,589      3,685 |    24,274 
-----------+----------------------+----------
     Total |    42,163      7,527 |    49,690 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -10562.599
Iteration 1:   log pseudolikelihood = -10536.522
Iteration 2:   log pseudolikelihood = -10535.792
Iteration 3:   log pseudolikelihood = -10535.631
Iteration 4:   log pseudolikelihood = -10535.573
Iteration 5:   log pseudolikelihood = -10535.551
Iteration 6:   log pseudolikelihood = -10535.543
Iteration 7:   log pseudolikelihood =  -10535.54
Iteration 8:   log pseudolikelihood = -10535.539
Iteration 9:   log pseudolikelihood = -10535.539
Iteration 10:  log pseudolikelihood = -10535.539
Iteration 11:  log pseudolikelihood = -10535.539
Iteration 12:  log pseudolikelihood = -10535.539
Iteration 13:  log pseudolikelihood = -10535.539
Iteration 14:  log pseudolikelihood = -10535.539
Iteration 15:  log pseudolikelihood = -10535.539
Iteration 16:  log pseudolikelihood = -10535.539
Iteration 17:  log pseudolikelihood = -10535.539
Iteration 18:  log pseudolikelihood = -10535.539
Iteration 19:  log pseudolikelihood = -10535.539
Iteration 20:  log pseudolikelihood = -10535.539
Iteration 21:  log pseudolikelihood = -10535.539
Iteration 22:  log pseudolikelihood = -10535.539
Iteration 23:  log pseudolikelihood = -10535.539
Iteration 24:  log pseudolikelihood = -10535.539
Iteration 25:  log pseudolikelihood = -10535.539
Iteration 26:  log pseudolikelihood = -10535.539
Iteration 27:  log pseudolikelihood = -10535.539
Iteration 28:  log pseudolikelihood = -10535.539
Iteration 29:  log pseudolikelihood = -10535.539
Iteration 30:  log pseudolikelihood = -10535.539
Refining estimates:
Iteration 0:   log pseudolikelihood = -10535.539
Iteration 1:   log pseudolikelihood = -10535.539

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,516             Number of obs    =       9,516
No. of failures      =        1,574
Time at risk         =       503315
                                                Wald chi2(45)    =     8389.30
Log pseudolikelihood =   -10535.539             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,045 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.389097   .3171579     1.44   0.150     .8879458    2.173093
 only 12-18  |    1.41768   .4792878     1.03   0.302     .7308106    2.750119
      mixed  |    1.18862   .2469535     0.83   0.406     .7910305    1.786047
             |
        age1 |   .9929073   .0092477    -0.76   0.445     .9749467    1.011199
        age2 |   .9931932    .029547    -0.23   0.818     .9369381    1.052826
        age3 |   1.045104   .0890946     0.52   0.605     .8842906    1.235162
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8499677   .2610017    -0.53   0.597     .4656095    1.551612
             |
   ethnicity |
Asian or ..  |   .9747711   .0871164    -0.29   0.775     .8181441    1.161383
      Other  |   1.019244   .0903456     0.22   0.830     .8566977     1.21263
             |
   obese4cat |
Obese I ..)  |   .9311373   .0721697    -0.92   0.357     .7999073    1.083896
Obese II..)  |   1.006703   .0907423     0.07   0.941     .8436761    1.201233
Obese II..)  |   .9150494   .1057022    -0.77   0.442     .7296553    1.147549
             |
smoke_nomiss |
     Former  |     1.0258   .1855707     0.14   0.888     .7195775    1.462339
    Current  |   1.024827   .0796832     0.32   0.752     .8799688    1.193532
             |
         imd |
          4  |    .959779   .0618935    -0.64   0.524     .8458232    1.089088
5 most de..  |    1.04868   .0911881     0.55   0.585     .8843553    1.243539
             |
tot_adults~h |
          2  |   .5991995   .2731757    -1.12   0.261     .2451928    1.464317
          3  |   .5974176   .1898657    -1.62   0.105     .3204476    1.113779
             |
1.htdiag_o~p |   1.077575   .0587178     1.37   0.170     .9684231    1.199031
1.~y_disease |   .9797329   .0633361    -0.32   0.751     .8631389    1.112077
    1.asthma |   1.077341   .0953296     0.84   0.400     .9058028    1.281364
1.~c_disease |   1.103605   .0673499     1.62   0.106     .9791909    1.243827
             |
     diabcat |
T1DM, con..  |   1.214213    .170912     1.38   0.168     .9214679    1.599962
T1DM, unc..  |   .5690211   .2875957    -1.12   0.265     .2113063    1.532302
T2DM, con..  |   1.087552   .0752392     1.21   0.225     .9496463    1.245483
T2DM, unc..  |   1.255493   .1472396     1.94   0.052     .9976737    1.579938
Diabetes,..  |   3.44e-14   1.21e-14   -88.24   0.000     1.73e-14    6.86e-14
             |
cancer_exh~t |
  Last year  |    1.49932   .5562749     1.09   0.275      .724575    3.102455
2-5 years..  |    .752183    .177699    -1.21   0.228      .473404     1.19513
   5+ years  |   .9544535   .0661189    -0.67   0.501     .8332754    1.093254
             |
cancer_hae~t |
  Last year  |    .516055   .3027119    -1.13   0.259     .1634522      1.6293
2-5 years..  |   1.317306   .2144337     1.69   0.090     .9574729    1.812371
   5+ years  |   1.008256   .0646999     0.13   0.898     .8890965    1.143385
             |
1.~r_disease |   .8676149   .0564945    -2.18   0.029     .7636621    .9857183
1.stroke_d~a |   .9275238   .0599277    -1.16   0.244     .8172004    1.052741
1.other_ne~o |   1.080097   .0677654     1.23   0.219     .9551212    1.221427
             |
reduced_ki~t |
Stage 3a/..  |   .5962685   .3518871    -0.88   0.381     .1875454    1.895734
      1.esrd |   .9869081    .053896    -0.24   0.809     .8867307    1.098403
1.other_tr~t |   1.096242   .0670293     1.50   0.133     .9724336    1.235813
  1.asplenia |   .9803814   .0611249    -0.32   0.751     .8676094    1.107812
1.ra_sle_p~s |   1.024881   .0637929     0.39   0.693     .9071746    1.157859
1.other_im~o |   1.072466   .0708516     1.06   0.290     .9422143    1.220724
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .9117607   .3151873    -0.27   0.789     .4630505    1.795285
          1 #|
 only 12-18  |   1.066126   .5297937     0.13   0.897     .4025486    2.823573
    1#mixed  |    1.17217    .365321     0.51   0.610     .6363608    2.159125
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    2.50
         Prob > chi2 =    0.4753

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.266524   .3744435     0.80   0.424     .7095098    2.260831
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.511426   .5705736     1.09   0.274     .7211945    3.167534
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.393265    .381697     1.21   0.226     .8144034    2.383569
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_tim
> eperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_timeperiod
> 2.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    21,574      3,842 |    25,416 
         1 |    20,589      3,685 |    24,274 
-----------+----------------------+----------
     Total |    42,163      7,527 |    49,690 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -7630.6889
Iteration 1:   log pseudolikelihood = -7607.9636
Iteration 2:   log pseudolikelihood =  -7601.419
Iteration 3:   log pseudolikelihood = -7601.2579
Iteration 4:   log pseudolikelihood = -7601.2524
Iteration 5:   log pseudolikelihood = -7601.2524
Refining estimates:
Iteration 0:   log pseudolikelihood = -7601.2524

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        6,896             Number of obs    =       6,896
No. of failures      =        1,196
Time at risk         =       284743
                                                Wald chi2(45)    =       69.81
Log pseudolikelihood =   -7601.2524             Prob > chi2      =      0.0103

                         (Std. Err. adjusted for 993 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8752887   .2486582    -0.47   0.639     .5015751    1.527449
 only 12-18  |   1.724821   .6573362     1.43   0.153     .8172365    3.640327
      mixed  |    .899412   .2315907    -0.41   0.681     .5429773    1.489826
             |
        age1 |   .9977407   .0105231    -0.21   0.830     .9773276     1.01858
        age2 |   .9810315   .0332744    -0.56   0.572     .9179354    1.048465
        age3 |   1.083591   .1056402     0.82   0.410     .8951196    1.311746
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |     .86488   .3294312    -0.38   0.703     .4099537    1.824639
             |
   ethnicity |
Asian or ..  |   1.050835    .104544     0.50   0.618     .8646724    1.277079
      Other  |   1.026723   .1022507     0.26   0.791     .8446611    1.248026
             |
   obese4cat |
Obese I ..)  |   1.156851   .0974702     1.73   0.084     .9807526    1.364568
Obese II..)  |   1.022253   .1115317     0.20   0.840     .8254472    1.265983
Obese II..)  |   1.274726   .1507209     2.05   0.040      1.01105    1.607168
             |
smoke_nomiss |
     Former  |   .8981065   .2027721    -0.48   0.634     .5769602    1.398009
    Current  |   1.053774   .0941192     0.59   0.558     .8845481    1.255376
             |
         imd |
          4  |   1.101498   .0756209     1.41   0.159     .9628233    1.260147
5 most de..  |   1.184444   .1076022     1.86   0.062     .9912564    1.415282
             |
tot_adults~h |
          2  |   .4512192   .2293653    -1.57   0.117     .1666103    1.222006
          3  |   .6179552   .2152643    -1.38   0.167     .3122061     1.22313
             |
1.htdiag_o~p |    1.09782   .0658099     1.56   0.120     .9761238    1.234688
1.~y_disease |   1.075122   .0765017     1.02   0.309      .935167    1.236021
    1.asthma |   .9864224   .1063034    -0.13   0.899     .7986045    1.218412
1.~c_disease |   .9802043   .0739293    -0.27   0.791     .8455065    1.136361
             |
     diabcat |
T1DM, con..  |   .8373332   .1597874    -0.93   0.352     .5760557    1.217116
T1DM, unc..  |   .5631953   .3133859    -1.03   0.302     .1892406    1.676115
T2DM, con..  |   1.049294   .0824068     0.61   0.540      .899596    1.223902
T2DM, unc..  |   1.317838   .1778348     2.05   0.041     1.011572    1.716828
Diabetes,..  |   4.955422   2.219753     3.57   0.000     2.059633    11.92262
             |
cancer_exh~t |
  Last year  |   1.320746   .6319981     0.58   0.561     .5170179    3.373905
2-5 years..  |   .7829312    .191258    -1.00   0.316     .4850519    1.263744
   5+ years  |   1.029686    .083245     0.36   0.717     .8787991    1.206481
             |
cancer_hae~t |
  Last year  |   .2014458   .2003395    -1.61   0.107     .0286835    1.414767
2-5 years..  |   1.019928   .2439323     0.08   0.934     .6382498    1.629852
   5+ years  |    1.06801   .0776825     0.90   0.366     .9261097    1.231652
             |
1.~r_disease |   1.084698   .0770179     1.15   0.252     .9437783    1.246658
1.stroke_d~a |   .9294491   .0717992    -0.95   0.344     .7988606    1.081385
1.other_ne~o |   1.074182   .0755637     1.02   0.309     .9358365     1.23298
             |
reduced_ki~t |
Stage 3a/..  |   1.503834   .7008581     0.88   0.381     .6032531    3.748869
      1.esrd |   .9899294    .062275    -0.16   0.872     .8750973     1.11983
1.other_tr~t |   1.025168   .0733387     0.35   0.728     .8910488    1.179474
  1.asplenia |   1.024108   .0755877     0.32   0.747     .8861758    1.183509
1.ra_sle_p~s |   .9839008    .068927    -0.23   0.817     .8576707    1.128709
1.other_im~o |    1.00389   .0729344     0.05   0.957      .870653    1.157518
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.422537   .5996815     0.84   0.403     .6226345    3.250081
          1 #|
 only 12-18  |   .7535041   .4272833    -0.50   0.618     .2479715    2.289652
    1#mixed  |   1.343473   .5186693     0.76   0.444     .6303897    2.863182
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    2.59
         Prob > chi2 =    0.4588

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.245131   .3952295     0.69   0.490     .6683848    2.319548
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.29966   .5114624     0.67   0.505     .6009684    2.810657
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.208336   .3544467     0.65   0.519     .6799875     2.14721
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_tim
> eperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_timeperiod
> 3.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    21,574      3,842 |    25,416 
         1 |    20,589      3,685 |    24,274 
-----------+----------------------+----------
     Total |    42,163      7,527 |    49,690 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -5236.2066
Iteration 1:   log pseudolikelihood = -5215.2055
Iteration 2:   log pseudolikelihood = -5214.3337
Iteration 3:   log pseudolikelihood = -5214.2669
Iteration 4:   log pseudolikelihood = -5214.2464
Iteration 5:   log pseudolikelihood = -5214.2388
Iteration 6:   log pseudolikelihood = -5214.2361
Iteration 7:   log pseudolikelihood = -5214.2351
Iteration 8:   log pseudolikelihood = -5214.2347
Iteration 9:   log pseudolikelihood = -5214.2345
Iteration 10:  log pseudolikelihood = -5214.2345
Iteration 11:  log pseudolikelihood = -5214.2345
Iteration 12:  log pseudolikelihood = -5214.2345
Iteration 13:  log pseudolikelihood = -5214.2345
Iteration 14:  log pseudolikelihood = -5214.2345
Iteration 15:  log pseudolikelihood = -5214.2345
Iteration 16:  log pseudolikelihood = -5214.2345
Iteration 17:  log pseudolikelihood = -5214.2345
Iteration 18:  log pseudolikelihood = -5214.2345
Iteration 19:  log pseudolikelihood = -5214.2345
Iteration 20:  log pseudolikelihood = -5214.2345
Iteration 21:  log pseudolikelihood = -5214.2345
Iteration 22:  log pseudolikelihood = -5214.2345
Iteration 23:  log pseudolikelihood = -5214.2345
Iteration 24:  log pseudolikelihood = -5214.2345
Iteration 25:  log pseudolikelihood = -5214.2345
Iteration 26:  log pseudolikelihood = -5214.2345
Iteration 27:  log pseudolikelihood = -5214.2345
Refining estimates:
Iteration 0:   log pseudolikelihood = -5214.2345
Iteration 1:   log pseudolikelihood = -5214.2345
Iteration 2:   log pseudolikelihood = -5214.2345

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,916             Number of obs    =       4,916
No. of failures      =          867
Time at risk         =       151399
                                                Wald chi2(45)    =     3272.58
Log pseudolikelihood =   -5214.2345             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 932 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.061205   .3702365     0.17   0.865     .5355859     2.10266
 only 12-18  |   .6342613   .4129399    -0.70   0.484     .1770468     2.27221
      mixed  |   1.003922   .3238187     0.01   0.990     .5335094    1.889114
             |
        age1 |   .9835709   .0129823    -1.26   0.209     .9584523    1.009348
        age2 |    1.04476    .042512     1.08   0.282     .9646737    1.131494
        age3 |   .9227664   .1056278    -0.70   0.483     .7373198    1.154856
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8918915   .3576136    -0.29   0.775      .406456    1.957089
             |
   ethnicity |
Asian or ..  |    .907461   .1072714    -0.82   0.411      .719792     1.14406
      Other  |   .9202263   .1075256    -0.71   0.477     .7318708    1.157057
             |
   obese4cat |
Obese I ..)  |   1.094514   .1044021     0.95   0.344     .9078788    1.319516
Obese II..)  |   .8726871   .1159943    -1.02   0.306     .6725429    1.132393
Obese II..)  |   .9776522   .1471723    -0.15   0.881     .7278595    1.313171
             |
smoke_nomiss |
     Former  |   .9951218   .2347781    -0.02   0.983     .6266905    1.580154
    Current  |   1.116245   .1118409     1.10   0.272     .9172215    1.358453
             |
         imd |
          4  |   .9780336   .0828293    -0.26   0.793     .8284491    1.154627
5 most de..  |   1.028511   .1184339     0.24   0.807      .820715    1.288919
             |
tot_adults~h |
          2  |   1.012942   .6097421     0.02   0.983     .3113168    3.295845
          3  |   .6951044    .346515    -0.73   0.466     .2616491    1.846634
             |
1.htdiag_o~p |   1.059608   .0770777     0.80   0.426     .9188131    1.221977
1.~y_disease |   1.018711   .0826589     0.23   0.819     .8689282    1.194313
    1.asthma |   .8934386   .1235949    -0.81   0.415     .6812598    1.171701
1.~c_disease |   .9696328   .0871678    -0.34   0.732     .8129918    1.156454
             |
     diabcat |
T1DM, con..  |   .9251594   .1928169    -0.37   0.709     .6149128    1.391937
T1DM, unc..  |   .8756983   .4917394    -0.24   0.813     .2913205    2.632316
T2DM, con..  |   1.018362   .0910488     0.20   0.839     .8546705    1.213404
T2DM, unc..  |   1.051229   .1933028     0.27   0.786     .7331217    1.507365
Diabetes,..  |   3.03e-13   1.60e-13   -54.39   0.000     1.07e-13    8.55e-13
             |
cancer_exh~t |
  Last year  |   .4952057   .4891755    -0.71   0.477     .0714413     3.43259
2-5 years..  |   1.010726    .257333     0.04   0.967     .6136433    1.664759
   5+ years  |   1.017816   .0899151     0.20   0.842     .8559991    1.210223
             |
cancer_hae~t |
  Last year  |   2.334544   .8393449     2.36   0.018     1.153898    4.723205
2-5 years..  |   1.386325   .3315297     1.37   0.172     .8675735    2.215255
   5+ years  |   1.156558   .1008749     1.67   0.095     .9748229    1.372174
             |
1.~r_disease |   .9932305    .086234    -0.08   0.938     .8378134    1.177478
1.stroke_d~a |   .8404402   .0751485    -1.94   0.052      .705336    1.001423
1.other_ne~o |   1.052761   .0863291     0.63   0.531      .896456    1.236319
             |
reduced_ki~t |
Stage 3a/..  |   .6478017   .4509065    -0.62   0.533     .1655609    2.534698
      1.esrd |   1.046894   .0715193     0.67   0.502     .9156982    1.196887
1.other_tr~t |   .9958106   .0885053    -0.05   0.962     .8366117    1.185303
  1.asplenia |   1.022216   .0902769     0.25   0.804     .8597438    1.215393
1.ra_sle_p~s |   1.025888   .0856142     0.31   0.759     .8710923    1.208192
1.other_im~o |    1.25625   .0995148     2.88   0.004     1.075591    1.467251
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .9131026   .4202474    -0.20   0.843     .3704773    2.250493
          1 #|
 only 12-18  |   2.726916   1.807835     1.51   0.130      .743634    9.999634
    1#mixed  |   1.101095   .4475729     0.24   0.813     .4963962    2.442424
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    3.65
         Prob > chi2 =    0.3021

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9689886   .3322285    -0.09   0.927     .4948514    1.897416
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.729577   .7711705     1.23   0.219     .7217931    4.144452
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.105414   .3373495     0.33   0.743      .607793    2.010454
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_tim
> eperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_0_timeperiod
> 4.ster saved
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,113      1,127 |     7,240 
         1 |     5,673      1,041 |     6,714 
-----------+----------------------+----------
     Total |    11,786      2,168 |    13,954 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood =  -4040.444
Iteration 1:   log pseudolikelihood =  -4015.833
Iteration 2:   log pseudolikelihood = -4015.1494
Iteration 3:   log pseudolikelihood =  -4015.078
Iteration 4:   log pseudolikelihood = -4015.0579
Iteration 5:   log pseudolikelihood = -4015.0505
Iteration 6:   log pseudolikelihood = -4015.0478
Iteration 7:   log pseudolikelihood = -4015.0468
Iteration 8:   log pseudolikelihood = -4015.0465
Iteration 9:   log pseudolikelihood = -4015.0463
Iteration 10:  log pseudolikelihood = -4015.0463
Iteration 11:  log pseudolikelihood = -4015.0463
Iteration 12:  log pseudolikelihood = -4015.0462
Iteration 13:  log pseudolikelihood = -4015.0462
Iteration 14:  log pseudolikelihood = -4015.0462
Iteration 15:  log pseudolikelihood = -4015.0462
Iteration 16:  log pseudolikelihood = -4015.0462
Iteration 17:  log pseudolikelihood = -4015.0462
Iteration 18:  log pseudolikelihood = -4015.0462
Iteration 19:  log pseudolikelihood = -4015.0462
Iteration 20:  log pseudolikelihood = -4015.0462
Iteration 21:  log pseudolikelihood = -4015.0462
Iteration 22:  log pseudolikelihood = -4015.0462
Iteration 23:  log pseudolikelihood = -4015.0462
Iteration 24:  log pseudolikelihood = -4015.0462
Iteration 25:  log pseudolikelihood = -4015.0462
Iteration 26:  log pseudolikelihood = -4015.0462
Iteration 27:  log pseudolikelihood = -4015.0462
Iteration 28:  log pseudolikelihood = -4015.0462
Iteration 29:  log pseudolikelihood = -4015.0462
Iteration 30:  log pseudolikelihood = -4015.0462
Refining estimates:
Iteration 0:   log pseudolikelihood = -4015.0462
Iteration 1:   log pseudolikelihood = -4015.0462
Iteration 2:   log pseudolikelihood = -4015.0462
Iteration 3:   log pseudolikelihood = -4015.0462
Iteration 4:   log pseudolikelihood = -4015.0462
Iteration 5:   log pseudolikelihood = -4015.0462
Iteration 6:   log pseudolikelihood = -4015.0462
Iteration 7:   log pseudolikelihood = -4015.0462

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,549             Number of obs    =       4,549
No. of failures      =          674
Time at risk         =       366077
                                                Wald chi2(45)    =     5625.38
Log pseudolikelihood =   -4015.0462             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.092958   .4669388     0.21   0.835     .4730955     2.52498
 only 12-18  |   .5843674   .3640907    -0.86   0.389     .1723233    1.981654
      mixed  |   1.060016   .4206879     0.15   0.883     .4869634    2.307428
             |
        age1 |   .9786902   .0344104    -0.61   0.540     .9135183    1.048512
        age2 |    1.07499   .2031316     0.38   0.702     .7422669    1.556857
        age3 |   .8870215   .3600561    -0.30   0.768     .4003298    1.965397
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.627852    .813904     0.97   0.330     .6109777    4.337147
             |
   ethnicity |
Asian or ..  |   .9849501   .1288394    -0.12   0.908     .7622022    1.272794
      Other  |   1.004067   .1299787     0.03   0.975      .779063    1.294054
             |
   obese4cat |
Obese I ..)  |   .8597426   .0983333    -1.32   0.186     .6870874    1.075783
Obese II..)  |   1.008909    .132566     0.07   0.946     .7798448    1.305257
Obese II..)  |   1.126077   .1876716     0.71   0.476      .812283    1.561094
             |
smoke_nomiss |
     Former  |   1.290071   .3254088     1.01   0.313     .7868753    2.115055
    Current  |   .9843047   .1171486    -0.13   0.894     .7795113    1.242901
             |
         imd |
          4  |   .8808791   .0914775    -1.22   0.222     .7186556    1.079722
5 most de..  |   .9904551   .1336988    -0.07   0.943     .7602098    1.290435
             |
tot_adults~h |
          2  |    .390709   .4304424    -0.85   0.394     .0450909    3.385466
          3  |    1.56869   .7971022     0.89   0.376     .5794477    4.246785
             |
1.htdiag_o~p |   1.046704   .0905453     0.53   0.598     .8834673    1.240101
1.~y_disease |   .9020237   .0878498    -1.06   0.290     .7452772    1.091737
    1.asthma |    .962318   .1378304    -0.27   0.789     .7267804     1.27419
1.~c_disease |   .8626195   .0875193    -1.46   0.145     .7070635    1.052398
             |
     diabcat |
T1DM, con..  |   1.507073   .2992434     2.07   0.039     1.021222    2.224069
T1DM, unc..  |    1.49476    .605018     0.99   0.321     .6761451    3.304481
T2DM, con..  |   .8801999   .0958531    -1.17   0.241      .711027    1.089624
T2DM, unc..  |   .8941935   .1852688    -0.54   0.589     .5957585    1.342124
Diabetes,..  |   8.15e-17   4.16e-17   -72.63   0.000     3.00e-17    2.22e-16
             |
cancer_exh~t |
  Last year  |   1.563123    .692432     1.01   0.313     .6560365    3.724417
2-5 years..  |   .8935442   .2949043    -0.34   0.733      .467936    1.706261
   5+ years  |   1.186875   .1122306     1.81   0.070     .9860876    1.428546
             |
cancer_hae~t |
  Last year  |   .9510857   .4617901    -0.10   0.918     .3672208     2.46327
2-5 years..  |   .5614829   .2322469    -1.40   0.163     .2496048    1.263049
   5+ years  |   .7556076     .08223    -2.58   0.010     .6104685    .9352537
             |
1.~r_disease |   1.265899   .1156092     2.58   0.010     1.058431    1.514035
1.stroke_d~a |   .9991289   .0950699    -0.01   0.993      .829139     1.20397
1.other_ne~o |   1.054374   .0960228     0.58   0.561      .882013    1.260417
             |
reduced_ki~t |
Stage 3a/..  |   1.161816   .2249964     0.77   0.439     .7948668    1.698167
      1.esrd |   1.097164   .0884968     1.15   0.250     .9367287    1.285077
1.other_tr~t |   1.090343   .1048701     0.90   0.369     .9030131    1.316536
  1.asplenia |   1.185604   .1135721     1.78   0.076     .9826549    1.430469
1.ra_sle_p~s |   1.090729   .1007196     0.94   0.347     .9101559    1.307128
1.other_im~o |    1.08965   .1026759     0.91   0.362      .905899    1.310673
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .6799347   .3812015    -0.69   0.491     .2265928    2.040274
          1 #|
 only 12-18  |   .9324369   .7723134    -0.08   0.933      .183904    4.727676
    1#mixed  |   .6388462   .3246067    -0.88   0.378     .2359874    1.729433
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    1.12
         Prob > chi2 =    0.7729

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7431399   .2768523    -0.80   0.426     .3580639    1.542342
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5448857   .2775468    -1.19   0.233     .2007851    1.478698
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .677187   .2362489    -1.12   0.264     .3417838    1.341732
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_tim
> eperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_timeperiod
> 0.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,113      1,127 |     7,240 
         1 |     5,673      1,041 |     6,714 
-----------+----------------------+----------
     Total |    11,786      2,168 |    13,954 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2637.5026
Iteration 1:   log pseudolikelihood = -2621.5419
Iteration 2:   log pseudolikelihood = -2617.5376
Iteration 3:   log pseudolikelihood = -2617.1627
Iteration 4:   log pseudolikelihood = -2617.1433
Iteration 5:   log pseudolikelihood = -2617.1384
Iteration 6:   log pseudolikelihood = -2617.1366
Iteration 7:   log pseudolikelihood = -2617.1359
Iteration 8:   log pseudolikelihood = -2617.1356
Iteration 9:   log pseudolikelihood = -2617.1355
Iteration 10:  log pseudolikelihood = -2617.1355
Iteration 11:  log pseudolikelihood = -2617.1355
Iteration 12:  log pseudolikelihood = -2617.1355
Iteration 13:  log pseudolikelihood = -2617.1355
Iteration 14:  log pseudolikelihood = -2617.1355
Iteration 15:  log pseudolikelihood = -2617.1355
Iteration 16:  log pseudolikelihood = -2617.1355
Iteration 17:  log pseudolikelihood = -2617.1355
Iteration 18:  log pseudolikelihood = -2617.1355
Iteration 19:  log pseudolikelihood = -2617.1355
Iteration 20:  log pseudolikelihood = -2617.1355
Iteration 21:  log pseudolikelihood = -2617.1355
Iteration 22:  log pseudolikelihood = -2617.1355
Iteration 23:  log pseudolikelihood = -2617.1355
Iteration 24:  log pseudolikelihood = -2617.1355
Iteration 25:  log pseudolikelihood = -2617.1355
Iteration 26:  log pseudolikelihood = -2617.1355
Iteration 27:  log pseudolikelihood = -2617.1355
Iteration 28:  log pseudolikelihood = -2617.1355
Iteration 29:  log pseudolikelihood = -2617.1355
Refining estimates:
Iteration 0:   log pseudolikelihood = -2617.1355
Iteration 1:   log pseudolikelihood = -2617.1355
Iteration 2:   log pseudolikelihood = -2617.1355

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,427             Number of obs    =       3,427
No. of failures      =          461
Time at risk         =       209290
                                                Wald chi2(45)    =     3105.35
Log pseudolikelihood =   -2617.1355             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 886 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.218809   .6663999     0.36   0.717     .4173787    3.559109
 only 12-18  |   1.690178   1.165625     0.76   0.447     .4374261    6.530709
      mixed  |   1.459932   .7411587     0.75   0.456     .5397663    3.948746
             |
        age1 |   .9206745   .0403111    -1.89   0.059     .8449613    1.003172
        age2 |   1.484626   .3410896     1.72   0.085      .946358     2.32905
        age3 |   .4649225   .2282247    -1.56   0.119     .1776381    1.216816
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.058518    .676008     0.09   0.929     .3027544    3.700892
             |
   ethnicity |
Asian or ..  |   1.124828     .17386     0.76   0.447     .8308437    1.522835
      Other  |   .9943001   .1485369    -0.04   0.969     .7419213     1.33253
             |
   obese4cat |
Obese I ..)  |   .7833024    .109253    -1.75   0.080     .5959448    1.029563
Obese II..)  |   .9408371   .1682443    -0.34   0.733     .6626728    1.335764
Obese II..)  |    .858488   .1877193    -0.70   0.485     .5592528    1.317833
             |
smoke_nomiss |
     Former  |   .8523061    .311346    -0.44   0.662     .4165366    1.743966
    Current  |   .9148906    .146336    -0.56   0.578     .6686828    1.251752
             |
         imd |
          4  |   .9552347   .1128015    -0.39   0.698     .7578681       1.204
5 most de..  |   1.027176   .1648412     0.17   0.867     .7499704    1.406843
             |
tot_adults~h |
          2  |   .3233664   .3726415    -0.98   0.327     .0337898    3.094596
          3  |   .8838329    .498196    -0.22   0.827     .2927978    2.667919
             |
1.htdiag_o~p |   1.033165   .1040882     0.32   0.746     .8480351     1.25871
1.~y_disease |   1.026997   .1215386     0.23   0.822     .8143942      1.2951
    1.asthma |   .9780327   .1722396    -0.13   0.900     .6925479    1.381201
1.~c_disease |   .9503689   .1143139    -0.42   0.672     .7507694    1.203034
             |
     diabcat |
T1DM, con..  |   1.216515    .347556     0.69   0.493     .6949137     2.12963
T1DM, unc..  |   .8169572    .575981    -0.29   0.774     .2051516    3.253297
T2DM, con..  |   .9815983   .1249255    -0.15   0.884     .7648981    1.259691
T2DM, unc..  |   .8274652   .2252766    -0.70   0.487     .4853007    1.410875
Diabetes,..  |   3.03e-14   1.80e-14   -52.35   0.000     9.44e-15    9.72e-14
             |
cancer_exh~t |
  Last year  |   3.432711   1.454864     2.91   0.004     1.495815    7.877647
2-5 years..  |   .7232182   .3327938    -0.70   0.481     .2934831    1.782197
   5+ years  |   1.151278   .1386866     1.17   0.242     .9091633     1.45787
             |
cancer_hae~t |
  Last year  |   1.386804   .8645797     0.52   0.600     .4086464     4.70633
2-5 years..  |   1.451902   .4814667     1.12   0.261     .7580005    2.781027
   5+ years  |   1.197239   .1337928     1.61   0.107     .9617411    1.490403
             |
1.~r_disease |   .9598256   .1133448    -0.35   0.728     .7615086     1.20979
1.stroke_d~a |   .8976076   .1097217    -0.88   0.377     .7063783    1.140606
1.other_ne~o |   1.283689   .1415369     2.27   0.024     1.034209    1.593351
             |
reduced_ki~t |
Stage 3a/..  |   .8797909   .2226682    -0.51   0.613     .5357313    1.444814
      1.esrd |   1.026996   .1030344     0.27   0.791     .8436675    1.250163
1.other_tr~t |    .943125   .1205588    -0.46   0.647     .7341098    1.211651
  1.asplenia |   .8626799   .1095582    -1.16   0.245     .6725882    1.106497
1.ra_sle_p~s |   .9786255   .1171765    -0.18   0.857     .7739221    1.237473
1.other_im~o |   1.084857   .1261979     0.70   0.484     .8636841    1.362668
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .9543573   .6858794    -0.07   0.948     .2333285      3.9035
          1 #|
 only 12-18  |     1.3811   1.192596     0.37   0.708     .2542158    7.503222
    1#mixed  |   .9259938   .5984526    -0.12   0.905     .2609109    3.286426
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.49
         Prob > chi2 =    0.9216

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.16318   .5119178     0.34   0.731     .4909431    2.755893
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.334305   1.210464     1.63   0.102     .8448189    6.449881
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.351887   .5362865     0.76   0.447     .6212601    2.941763
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_tim
> eperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_timeperiod
> 1.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,113      1,127 |     7,240 
         1 |     5,673      1,041 |     6,714 
-----------+----------------------+----------
     Total |    11,786      2,168 |    13,954 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2380.2034
Iteration 1:   log pseudolikelihood = -2362.5822
Iteration 2:   log pseudolikelihood = -2360.8514
Iteration 3:   log pseudolikelihood = -2360.7479
Iteration 4:   log pseudolikelihood = -2360.7319
Iteration 5:   log pseudolikelihood = -2360.7261
Iteration 6:   log pseudolikelihood = -2360.7239
Iteration 7:   log pseudolikelihood = -2360.7231
Iteration 8:   log pseudolikelihood = -2360.7228
Iteration 9:   log pseudolikelihood = -2360.7227
Iteration 10:  log pseudolikelihood = -2360.7227
Iteration 11:  log pseudolikelihood = -2360.7227
Iteration 12:  log pseudolikelihood = -2360.7227
Iteration 13:  log pseudolikelihood = -2360.7227
Iteration 14:  log pseudolikelihood = -2360.7227
Iteration 15:  log pseudolikelihood = -2360.7227
Iteration 16:  log pseudolikelihood = -2360.7227
Iteration 17:  log pseudolikelihood = -2360.7227
Iteration 18:  log pseudolikelihood = -2360.7227
Iteration 19:  log pseudolikelihood = -2360.7227
Iteration 20:  log pseudolikelihood = -2360.7227
Iteration 21:  log pseudolikelihood = -2360.7227
Iteration 22:  log pseudolikelihood = -2360.7227
Iteration 23:  log pseudolikelihood = -2360.7227
Iteration 24:  log pseudolikelihood = -2360.7227
Iteration 25:  log pseudolikelihood = -2360.7227
Iteration 26:  log pseudolikelihood = -2360.7227
Iteration 27:  log pseudolikelihood = -2360.7227
Iteration 28:  log pseudolikelihood = -2360.7227
Iteration 29:  log pseudolikelihood = -2360.7227
Iteration 30:  log pseudolikelihood = -2360.7227
Iteration 31:  log pseudolikelihood = -2360.7227
Refining estimates:
Iteration 0:   log pseudolikelihood = -2360.7227
Iteration 1:   log pseudolikelihood = -2360.7227

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,658             Number of obs    =       2,658
No. of failures      =          438
Time at risk         =       140582
                                                Wald chi2(45)    =     3203.95
Log pseudolikelihood =   -2360.7227             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 836 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.476769   .7066601     0.81   0.415     .5780926    3.772485
 only 12-18  |   1.249101   .8096135     0.34   0.731      .350659    4.449485
      mixed  |   1.471778   .6567962     0.87   0.386     .6137404    3.529391
             |
        age1 |   1.064102   .0545516     1.21   0.226     .9623789    1.176577
        age2 |    .750085   .1962371    -1.10   0.272     .4491788    1.252569
        age3 |   1.780751   .9886187     1.04   0.299     .5998491    5.286453
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   2.857835   1.534618     1.96   0.051     .9975936    8.186924
             |
   ethnicity |
Asian or ..  |   1.212809   .1907192     1.23   0.220     .8911228    1.650621
      Other  |   .8434451   .1423183    -1.01   0.313     .6059402    1.174043
             |
   obese4cat |
Obese I ..)  |   1.094243   .1525552     0.65   0.518     .8326118    1.438087
Obese II..)  |   1.080205   .1942878     0.43   0.668     .7592898    1.536756
Obese II..)  |   1.191564   .2560136     0.82   0.415     .7820458    1.815525
             |
smoke_nomiss |
     Former  |   .6215987   .2561753    -1.15   0.249      .277147    1.394152
    Current  |   1.270058    .177361     1.71   0.087     .9659506    1.669906
             |
         imd |
          4  |   1.016785   .1239998     0.14   0.891     .8006133    1.291325
5 most de..  |   1.024708   .1684108     0.15   0.882     .7425148    1.414149
             |
tot_adults~h |
          2  |   .6149914   .4421631    -0.68   0.499     .1502716    2.516873
          3  |    .518971   .2648518    -1.29   0.199     .1908713     1.41106
             |
1.htdiag_o~p |   1.263801   .1330257     2.22   0.026     1.028212     1.55337
1.~y_disease |   .9846363   .1156866    -0.13   0.895     .7821079     1.23961
    1.asthma |   1.013094   .1751531     0.08   0.940     .7219149    1.421717
1.~c_disease |   1.011727   .1157076     0.10   0.919     .8085645    1.265938
             |
     diabcat |
T1DM, con..  |   1.213133   .3420544     0.69   0.493     .6980782    2.108205
T1DM, unc..  |   1.084814    .618979     0.14   0.887     .3545457    3.319238
T2DM, con..  |   .9846842   .1327415    -0.11   0.909     .7560487    1.282461
T2DM, unc..  |   .8678364   .2288149    -0.54   0.591     .5176175    1.455013
Diabetes,..  |   1.18e-14   7.23e-15   -52.22   0.000     3.53e-15    3.92e-14
             |
cancer_exh~t |
  Last year  |   .7661759   .8208525    -0.25   0.804     .0938388    6.255677
2-5 years..  |   1.011102   .3853763     0.03   0.977     .4790313    2.134155
   5+ years  |   1.050494   .1346793     0.38   0.701     .8170803    1.350587
             |
cancer_hae~t |
  Last year  |   .8996854   .6349892    -0.15   0.881     .2255906    3.588066
2-5 years..  |   1.146798   .4473609     0.35   0.725     .5338714    2.463411
   5+ years  |   .9408887   .1172028    -0.49   0.625     .7370677    1.201072
             |
1.~r_disease |   .9727383    .121527    -0.22   0.825     .7614703    1.242622
1.stroke_d~a |   .8900687    .105171    -0.99   0.324     .7060657    1.122023
1.other_ne~o |   1.128818   .1360089     1.01   0.315     .8913836    1.429498
             |
reduced_ki~t |
Stage 3a/..  |   1.117985   .2461934     0.51   0.613      .726092    1.721396
      1.esrd |   .9673666   .1015876    -0.32   0.752     .7874129    1.188447
1.other_tr~t |   1.056689   .1207486     0.48   0.629     .8446556    1.321949
  1.asplenia |   1.010442   .1183142     0.09   0.929     .8032356    1.271101
1.ra_sle_p~s |   1.313474   .1530499     2.34   0.019      1.04529    1.650464
1.other_im~o |   .9418673   .1157988    -0.49   0.626      .740181     1.19851
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .2807095   .1742755    -2.05   0.041     .0831377    .9477993
          1 #|
 only 12-18  |   .0929325   .1197606    -1.84   0.065     .0074343    1.161708
    1#mixed  |   .3122056   .1713093    -2.12   0.034     .1065077    .9151675
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    5.82
         Prob > chi2 =    0.1207

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4145431   .1599595    -2.28   0.022     .1945884    .8831253
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .116082   .1238506    -2.02   0.044     .0143416    .9395752
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4594973   .1480502    -2.41   0.016     .2443574    .8640531
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_tim
> eperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_timeperiod
> 2.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,113      1,127 |     7,240 
         1 |     5,673      1,041 |     6,714 
-----------+----------------------+----------
     Total |    11,786      2,168 |    13,954 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1750.1713
Iteration 1:   log pseudolikelihood = -1734.6642
Iteration 2:   log pseudolikelihood = -1734.2658
Iteration 3:   log pseudolikelihood = -1734.2127
Iteration 4:   log pseudolikelihood = -1734.1932
Iteration 5:   log pseudolikelihood = -1734.1861
Iteration 6:   log pseudolikelihood = -1734.1835
Iteration 7:   log pseudolikelihood = -1734.1825
Iteration 8:   log pseudolikelihood = -1734.1821
Iteration 9:   log pseudolikelihood =  -1734.182
Iteration 10:  log pseudolikelihood =  -1734.182
Iteration 11:  log pseudolikelihood = -1734.1819
Iteration 12:  log pseudolikelihood = -1734.1819
Iteration 13:  log pseudolikelihood = -1734.1819
Iteration 14:  log pseudolikelihood = -1734.1819
Iteration 15:  log pseudolikelihood = -1734.1819
Iteration 16:  log pseudolikelihood = -1734.1819
Iteration 17:  log pseudolikelihood = -1734.1819
Iteration 18:  log pseudolikelihood = -1734.1819
Iteration 19:  log pseudolikelihood = -1734.1819
Iteration 20:  log pseudolikelihood = -1734.1819
Iteration 21:  log pseudolikelihood = -1734.1819
Iteration 22:  log pseudolikelihood = -1734.1819
Iteration 23:  log pseudolikelihood = -1734.1819
Iteration 24:  log pseudolikelihood = -1734.1819
Iteration 25:  log pseudolikelihood = -1734.1819
Iteration 26:  log pseudolikelihood = -1734.1819
Iteration 27:  log pseudolikelihood = -1734.1819
Iteration 28:  log pseudolikelihood = -1734.1819
Iteration 29:  log pseudolikelihood = -1734.1819
Refining estimates:
Iteration 0:   log pseudolikelihood = -1734.1819
Iteration 1:   log pseudolikelihood = -1734.1819
Iteration 2:   log pseudolikelihood = -1734.1819

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,946             Number of obs    =       1,946
No. of failures      =          342
Time at risk         =        79767
                                                Wald chi2(45)    =     2857.55
Log pseudolikelihood =   -1734.1819             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 758 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8098715   .3902688    -0.44   0.662     .3149421    2.082579
 only 12-18  |   .8392309   .5217757    -0.28   0.778     .2481208    2.838571
      mixed  |   .7169237   .3198614    -0.75   0.456     .2990215    1.718872
             |
        age1 |   1.052404   .0554397     0.97   0.332     .9491658    1.166872
        age2 |   .8623097   .2355155    -0.54   0.588     .5048724    1.472804
        age3 |   1.253669   .7317702     0.39   0.699     .3993317    3.935788
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .5788006    .383411    -0.83   0.409     .1580059    2.120238
             |
   ethnicity |
Asian or ..  |   1.029764   .2030975     0.15   0.882     .6996126    1.515716
      Other  |   .7337252   .1458132    -1.56   0.119     .4970203     1.08316
             |
   obese4cat |
Obese I ..)  |   .9715209   .1444365    -0.19   0.846     .7259448    1.300172
Obese II..)  |    .886713   .1869637    -0.57   0.569     .5865526    1.340476
Obese II..)  |   .6697139   .2070987    -1.30   0.195     .3653158    1.227751
             |
smoke_nomiss |
     Former  |   1.129993   .3749257     0.37   0.713      .589728     2.16521
    Current  |   .8672238   .1556811    -0.79   0.427      .609995    1.232923
             |
         imd |
          4  |   1.076815   .1387588     0.57   0.566     .8364783    1.386204
5 most de..  |   .6945013   .1545597    -1.64   0.101     .4489935    1.074252
             |
tot_adults~h |
          2  |   .8311523   1.003237    -0.15   0.878     .0780267    8.853564
          3  |   1.237183   .9987465     0.26   0.792     .2542612    6.019875
             |
1.htdiag_o~p |   .9646682   .1125647    -0.31   0.758     .7674558    1.212558
1.~y_disease |   .8802466   .1273589    -0.88   0.378     .6628998    1.168855
    1.asthma |    .961825   .2071592    -0.18   0.857     .6306132    1.466996
1.~c_disease |   1.119731   .1526733     0.83   0.407     .8571446    1.462762
             |
     diabcat |
T1DM, con..  |   1.033428   .3453107     0.10   0.922      .536857    1.989306
T1DM, unc..  |   .9511189   .7115955    -0.07   0.947     .2194796    4.121691
T2DM, con..  |   .7643755   .1247561    -1.65   0.100     .5551106    1.052529
T2DM, unc..  |   1.494507   .3560752     1.69   0.092     .9369017    2.383975
Diabetes,..  |   3.82e-14   2.39e-14   -49.43   0.000     1.12e-14    1.30e-13
             |
cancer_exh~t |
  Last year  |   1.395167   .8952549     0.52   0.604     .3966658    4.907132
2-5 years..  |   1.645543   .6375617     1.29   0.199     .7700398    3.516456
   5+ years  |   1.022377   .1528945     0.15   0.882     .7626328    1.370587
             |
cancer_hae~t |
  Last year  |   1.008608   .6594022     0.01   0.990     .2800457    3.632589
2-5 years..  |   1.151557   .5042909     0.32   0.747     .4881199    2.716717
   5+ years  |   1.035232   .1365834     0.26   0.793     .7993448    1.340729
             |
1.~r_disease |   .9876741   .1346229    -0.09   0.927     .7561229    1.290134
1.stroke_d~a |   1.031981   .1371853     0.24   0.813     .7952763    1.339138
1.other_ne~o |   1.086926    .154855     0.59   0.559     .8221078    1.437048
             |
reduced_ki~t |
Stage 3a/..  |   1.082728   .3040407     0.28   0.777      .624444    1.877349
      1.esrd |   1.059876   .1287659     0.48   0.632      .835298    1.344835
1.other_tr~t |   1.202844   .1552696     1.43   0.153     .9339667    1.549126
  1.asplenia |   .8260897    .116045    -1.36   0.174     .6272701    1.087927
1.ra_sle_p~s |   .9870852   .1431963    -0.09   0.929     .7427984    1.311711
1.other_im~o |   1.152184   .1593448     1.02   0.306     .8786223    1.510919
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.904132    1.41688     0.87   0.387     .4429058     8.18621
          1 #|
 only 12-18  |   .9664127   .8929578    -0.04   0.971     .1580007    5.911071
    1#mixed  |   1.818444   1.226581     0.89   0.375     .4847813    6.821097
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    1.55
         Prob > chi2 =    0.6697

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.542103   .9806768     0.68   0.496      .443409    5.363176
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8110435   .7007233    -0.24   0.808     .1491506    4.410249
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.303686   .7752502     0.45   0.656     .4064407     4.18166
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_tim
> eperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_timeperiod
> 3.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

           |   Failure/censoring
           |     indicator for
           | outcome: covid death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,113      1,127 |     7,240 
         1 |     5,673      1,041 |     6,714 
-----------+----------------------+----------
     Total |    11,786      2,168 |    13,954 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1205.0131
Iteration 1:   log pseudolikelihood = -1182.1993
Iteration 2:   log pseudolikelihood = -1178.8815
Iteration 3:   log pseudolikelihood = -1178.7468
Iteration 4:   log pseudolikelihood = -1178.7459
Iteration 5:   log pseudolikelihood = -1178.7459
Refining estimates:
Iteration 0:   log pseudolikelihood = -1178.7459

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,372             Number of obs    =       1,372
No. of failures      =          253
Time at risk         =        41696
                                                Wald chi2(45)    =       73.80
Log pseudolikelihood =   -1178.7459             Prob > chi2      =      0.0043

                         (Std. Err. adjusted for 669 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.566137   1.066951     0.66   0.510     .4120384    5.952808
 only 12-18  |   .4920754   .5979354    -0.58   0.560     .0454686    5.325395
      mixed  |   1.665516   1.080722     0.79   0.432      .466896    5.941246
             |
        age1 |   .8991598   .0558399    -1.71   0.087     .7961141    1.015543
        age2 |   1.690928   .5696523     1.56   0.119     .8737077    3.272534
        age3 |   .3341924   .2413476    -1.52   0.129     .0811474    1.376318
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   2.747835   1.962778     1.42   0.157     .6776067    11.14304
             |
   ethnicity |
Asian or ..  |   .8976972   .2004553    -0.48   0.629     .5795048    1.390602
      Other  |    .876536   .1930747    -0.60   0.550     .5692139    1.349783
             |
   obese4cat |
Obese I ..)  |   .8657133   .1630444    -0.77   0.444     .5984981    1.252234
Obese II..)  |   1.212318   .2584389     0.90   0.366     .7982881    1.841084
Obese II..)  |   .5181154   .1768872    -1.93   0.054     .2653518    1.011652
             |
smoke_nomiss |
     Former  |   1.484917   .5410497     1.09   0.278     .7270353    3.032837
    Current  |   1.367665   .2327048     1.84   0.066     .9798282    1.909016
             |
         imd |
          4  |   .9815062   .1568906    -0.12   0.907     .7175155    1.342625
5 most de..  |   1.129698   .2441477     0.56   0.573     .7396103    1.725528
             |
tot_adults~h |
          2  |   .9700524   .7521528    -0.04   0.969     .2122248    4.433985
          3  |   .4394953   .2663656    -1.36   0.175     .1339878    1.441595
             |
1.htdiag_o~p |   .9229839   .1383874    -0.53   0.593     .6879698     1.23828
1.~y_disease |   1.012801   .1574426     0.08   0.935     .7467972    1.373554
    1.asthma |   1.313435   .2610157     1.37   0.170      .889716    1.938946
1.~c_disease |   .8741032   .1420106    -0.83   0.408     .6357302    1.201856
             |
     diabcat |
T1DM, con..  |   .7234852   .3734641    -0.63   0.531     .2630499    1.989853
T1DM, unc..  |   1.566678   1.287878     0.55   0.585     .3127917    7.847015
T2DM, con..  |   .9007616   .1595685    -0.59   0.555      .636533    1.274673
T2DM, unc..  |   1.420109   .4089127     1.22   0.223     .8076493    2.497012
Diabetes,..  |    2.98312   3.551017     0.92   0.359     .2893515      30.755
             |
cancer_exh~t |
  Last year  |   1.093838    1.18871     0.08   0.934     .1299943    9.204107
2-5 years..  |   .2740667   .2886603    -1.23   0.219       .03478    2.159648
   5+ years  |   1.407246    .238527     2.02   0.044     1.009466    1.961769
             |
cancer_hae~t |
  Last year  |   .6874388    .638902    -0.40   0.687     .1112069    4.249485
2-5 years..  |   2.172719   1.004247     1.68   0.093     .8781559    5.375704
   5+ years  |   1.398219   .2067912     2.27   0.023     1.046371    1.868378
             |
1.~r_disease |   1.071084   .1678895     0.44   0.661     .7877709    1.456287
1.stroke_d~a |   .8473374   .1385253    -1.01   0.311     .6150342    1.167383
1.other_ne~o |   1.038321   .1680009     0.23   0.816     .7561481    1.425793
             |
reduced_ki~t |
Stage 3a/..  |   1.728314   .4478007     2.11   0.035      1.04011     2.87188
      1.esrd |   1.115651   .1558603     0.78   0.433     .8484232    1.467047
1.other_tr~t |   1.016393   .1739876     0.09   0.924     .7266946    1.421581
  1.asplenia |   1.184196   .1895985     1.06   0.291     .8652469    1.620717
1.ra_sle_p~s |   .8755993   .1605336    -0.72   0.469     .6112866    1.254197
1.other_im~o |   .9998824   .1677504    -0.00   0.999     .7196855    1.389169
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .3815903   .3064223    -1.20   0.230     .0790807    1.841298
          1 #|
 only 12-18  |   1.042032   1.410439     0.03   0.976     .0734074    14.79183
    1#mixed  |   .3166886   .2313632    -1.57   0.116     .0756432    1.325851
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    3.54
         Prob > chi2 =    0.3150

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5976227   .2881741    -1.07   0.286     .2322614    1.537719
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5127582    .338502    -1.01   0.312     .1405996    1.869998
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .52745   .2284617    -1.48   0.140     .2256777    1.232747
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_tim
> eperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_male_1_timeperiod
> 4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_sex_covid_death.log
  log type:  text
 closed on:  28 Oct 2021, 11:41:27
-------------------------------------------------------------------------------
