-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_death_s
> tratified.log
  log type:  text
 opened on:  17 Nov 2021, 20:54:56

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  4. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  5.         
.         
. gen first_vacc_plus_7d=covid_vacc_date+7
  6. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
  7. format first_vacc_plus_7d second_vacc_plus_7d %td
  8.  
. stsplit vaccine, after(first_vacc_plus_7d) at(0)
  9. replace vaccine = vaccine +1
 10. stsplit vaccine2, after(second_vacc_plus_7d) at(0)
 11. replace vaccine=2 if vaccine==1 &vaccine2==0 & second_vacc_plus_7d!=.
 12. recode `outcome' .=0 
 13. 
. tab vaccine
 14. tab vaccine `outcome' if kids_cat4==0
 15. 
. 
. foreach int_type in  vaccine  {
 16. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 17. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ///
> interaction(i.`int_type'##i.`exposure_type')
 18. if _rc==0{
 19. testparm 1.`int_type'#i.`exposure_type'
 20. di _n "`exposure_type' " _n "****************"
 21. lincom 0.`exposure_type' 
 22. lincom 1.`exposure_type' 
 23. lincom 2.`exposure_type' 
 24. lincom 3.`exposure_type' 
 25. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 26. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 27. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 28. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 29. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 30. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 31. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 32. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 33. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_stratified, replace
 34. }
 35. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 36. }
 37. }
 38. }
(13,755 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,123  total observations
      3,296  observations end on or before enter()
------------------------------------------------------------------------------
     12,827  observations remaining, representing
     12,827  subjects
      5,525  failures in single-failure-per-subject data
    721,398  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(8,054 missing values generated)
(12,914 missing values generated)
(1,513 observations (episodes) created)
(14,340 real changes made)
(1,106 observations (episodes) created)
(907 real changes made)
(covid_death: 2619 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,736       43.61       43.61
          1 |      7,803       50.52       94.13
          2 |        907        5.87      100.00
------------+-----------------------------------
      Total |     15,446      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |       226         42 |       268 
         1 |       273        145 |       418 
         2 |        41         25 |        66 
-----------+----------------------+----------
     Total |       540        212 |       752 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -34671.997
Iteration 1:   log pseudolikelihood = -34278.945
Iteration 2:   log pseudolikelihood = -34257.696
Iteration 3:   log pseudolikelihood = -34257.093
Iteration 4:   log pseudolikelihood = -34257.091
Iteration 5:   log pseudolikelihood = -34257.091
Refining estimates:
Iteration 0:   log pseudolikelihood = -34257.091

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,827             Number of obs    =      15,446
No. of failures      =        5,525
Time at risk         =       721398
                                                Wald chi2(50)    =      399.13
Log pseudolikelihood =   -34257.091             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 990 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.771811   .4949996     5.71   0.000     1.953228    3.933454
 only 12-18  |   2.147222   .5835852     2.81   0.005     1.260469    3.657815
      mixed  |   4.976652   .7776178    10.27   0.000     3.663822    6.759899
             |
        age1 |   .9986119   .0050259    -0.28   0.783     .9888098    1.008511
        age2 |   1.017164   .0162407     1.07   0.286     .9858259    1.049499
        age3 |   .9442706   .0415286    -1.30   0.192     .8662853    1.029276
      1.male |   1.011454    .025507     0.45   0.652     .9626761    1.062702
             |
   ethnicity |
Asian or ..  |   1.049925   .0447559     1.14   0.253     .9657693    1.141414
      Other  |   1.102515   .0501617     2.15   0.032     1.008456    1.205346
             |
   obese4cat |
Obese I ..)  |   .9865702   .0406102    -0.33   0.743     .9101019    1.069464
Obese II..)  |   1.057358   .0523996     1.13   0.260     .9594865    1.165212
Obese II..)  |   .9733317   .0574173    -0.46   0.647     .8670578    1.092631
             |
smoke_nomiss |
     Former  |    1.03116   .1029702     0.31   0.759     .8478641    1.254082
    Current  |   1.036761   .0434989     0.86   0.390     .9549161    1.125621
             |
         imd |
          4  |   1.024187   .0345255     0.71   0.478     .9587051    1.094141
5 most de..  |   1.096204   .0490467     2.05   0.040     1.004169    1.196675
             |
tot_adults~h |
          2  |   .9539868   .2053222    -0.22   0.827     .6256654    1.454597
          3  |   1.171926     .18741     0.99   0.321     .8566023    1.603323
             |
1.htdiag_o~p |   .9669194   .0275809    -1.18   0.238     .9143452    1.022517
1.~y_disease |   1.020841   .0328855     0.64   0.522      .958379    1.087374
    1.asthma |   .9446718   .0496917    -1.08   0.279     .8521303    1.047263
1.~c_disease |   1.065367   .0349623     1.93   0.054     .9989999    1.136144
             |
     diabcat |
T1DM, con..  |   1.162353   .0963771     1.81   0.070     .9880072    1.367464
T1DM, unc..  |   1.130112   .2107007     0.66   0.512     .7841903    1.628626
T2DM, con..  |   .9760229   .0377388    -0.63   0.530     .9047895    1.052865
T2DM, unc..  |   1.053606   .0690109     0.80   0.425     .9266697    1.197931
Diabetes,..  |   2.027738   .8880501     1.61   0.106      .859463    4.784059
             |
cancer_exh~t |
  Last year  |   .8476981   .2047918    -0.68   0.494     .5279624    1.361067
2-5 years..  |   .8533336   .0904046    -1.50   0.134     .6933303    1.050262
   5+ years  |   .9300224   .0346447    -1.95   0.051     .8645397    1.000465
             |
cancer_hae~t |
  Last year  |   .9556965   .2076106    -0.21   0.835      .624323    1.462954
2-5 years..  |   1.031085   .1021442     0.31   0.757      .849123    1.252041
   5+ years  |   .9810677   .0363818    -0.52   0.606     .9122904     1.05503
             |
1.~r_disease |   .9901221   .0345873    -0.28   0.776     .9246007    1.060287
1.stroke_d~a |   .9743393   .0323313    -0.78   0.433     .9129878    1.039814
1.other_ne~o |   .9675643   .0330928    -0.96   0.335     .9048298    1.034648
             |
reduced_ki~t |
Stage 3a/..  |   .8025389   .1655337    -1.07   0.286     .5356673    1.202367
      1.esrd |   .9936061   .0273684    -0.23   0.816     .9413873    1.048721
1.other_tr~t |   1.016634   .0336835     0.50   0.619     .9527139    1.084844
  1.asplenia |   1.022689   .0326301     0.70   0.482     .9606933    1.088684
1.ra_sle_p~s |   .9891928   .0318824    -0.34   0.736     .9286373    1.053697
1.other_im~o |   1.001112   .0330766     0.03   0.973     .9383376    1.068086
             |
     vaccine |
          1  |   1.238104   .2030551     1.30   0.193     .8977513    1.707491
          2  |   1.443455   .3530617     1.50   0.133     .8937247    2.331325
             |
     vaccine#|
   kids_cat4 |
          1 #|
only <12 ..  |   .7159938   .1305063    -1.83   0.067     .5009082    1.023435
          1 #|
 only 12-18  |   .6844899   .2196165    -1.18   0.237     .3649737    1.283726
    1#mixed  |   .8143461   .1356945    -1.23   0.218     .5874533    1.128872
          2 #|
only <12 ..  |   .6421038   .1790531    -1.59   0.112     .3717444    1.109088
          2 #|
 only 12-18  |   .6277015   .2791646    -1.05   0.295      .262536    1.500781
    2#mixed  |   .7055822   .1783325    -1.38   0.168     .4299427    1.157936
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      7.54 /        1 =       7.5370

 ( 1)  1.vaccine#1.kids_cat4 = 0
 ( 2)  1.vaccine#2.kids_cat4 = 0
 ( 3)  1.vaccine#3.kids_cat4 = 0

           chi2(  3) =    4.23
         Prob > chi2 =    0.2376

kids_cat4 
****************

 ( 1)  0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.019501   .1785835     5.71   0.000     .6694836    1.369518
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7641747   .2717862     2.81   0.005     .2314835    1.296866
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.604757   .1562532    10.27   0.000     1.298507    1.911008
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 1o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.984599   .2319646     5.86   0.000     1.578274    2.495533
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.469751   .3165524     1.79   0.074     .9636374    2.241683
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   4.052717   .4130482    13.73   0.000      3.31889    4.948798
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.77979   .4076012     2.52   0.012     1.136134    2.788098
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.347814   .5097653     0.79   0.430     .6422317    2.828579
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.511437   .7460922     5.91   0.000     2.315399    5.325297
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_0_
> stratified.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_0_stratif
> ied.ster saved
(3,812 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,508  total observations
        922  observations end on or before enter()
------------------------------------------------------------------------------
      3,586  observations remaining, representing
      3,586  subjects
      1,503  failures in single-failure-per-subject data
    196,220  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(2,281 missing values generated)
(3,598 missing values generated)
(438 observations (episodes) created)
(4,024 real changes made)
(328 observations (episodes) created)
(265 real changes made)
(covid_death: 766 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,891       43.45       43.45
          1 |      2,196       50.46       93.91
          2 |        265        6.09      100.00
------------+-----------------------------------
      Total |      4,352      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |        65         10 |        75 
         1 |        85         52 |       137 
         2 |        15         10 |        25 
-----------+----------------------+----------
     Total |       165         72 |       237 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood =   -7457.67
Iteration 1:   log pseudolikelihood = -7333.6524
Iteration 2:   log pseudolikelihood = -7327.1987
Iteration 3:   log pseudolikelihood = -7326.9227
Iteration 4:   log pseudolikelihood = -7326.9201
Iteration 5:   log pseudolikelihood = -7326.9201
Refining estimates:
Iteration 0:   log pseudolikelihood = -7326.9201

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,586             Number of obs    =       4,352
No. of failures      =        1,503
Time at risk         =       196220
                                                Wald chi2(50)    =      201.73
Log pseudolikelihood =   -7326.9201             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 782 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.914964   1.224167     2.55   0.011     1.279862     6.63901
 only 12-18  |   .7492541   .4634404    -0.47   0.641     .2229105    2.518417
      mixed  |   5.739826   2.302711     4.36   0.000     2.614644    12.60041
             |
        age1 |   1.010045   .0232929     0.43   0.665     .9654081    1.056746
        age2 |   .9436199   .0981978    -0.56   0.577     .7695145    1.157117
        age3 |    1.14666   .2875988     0.55   0.585     .7013606    1.874685
      1.male |   1.035108   .0543242     0.66   0.511     .9339278    1.147251
             |
   ethnicity |
Asian or ..  |   .8883362   .0730805    -1.44   0.150     .7560522    1.043765
      Other  |   .9091617   .0735702    -1.18   0.239     .7758203    1.065421
             |
   obese4cat |
Obese I ..)  |   1.018725   .0723374     0.26   0.794     .8863695    1.170843
Obese II..)  |   .9892125   .0956523    -0.11   0.911     .8184315     1.19563
Obese II..)  |   .9928945   .1103667    -0.06   0.949     .7985214    1.234581
             |
smoke_nomiss |
     Former  |   1.106762   .2378189     0.47   0.637     .7263562    1.686393
    Current  |    .955167   .0818104    -0.54   0.592     .8075577    1.129757
             |
         imd |
          4  |   .8978638   .0627485    -1.54   0.123     .7829302     1.02967
5 most de..  |   .8863808   .0766226    -1.40   0.163     .7482364     1.05003
             |
tot_adults~h |
          2  |   .9427905   .3625283    -0.15   0.878     .4437163    2.003203
          3  |   .8578018   .2076517    -0.63   0.526      .533744    1.378608
             |
1.htdiag_o~p |   .9907313   .0546598    -0.17   0.866      .889189    1.103869
1.~y_disease |   .9985131   .0639743    -0.02   0.981     .8806791    1.132113
    1.asthma |   .9502323   .0999199    -0.49   0.627     .7732559    1.167714
1.~c_disease |   1.053507   .0679121     0.81   0.419     .9284668    1.195386
             |
     diabcat |
T1DM, con..  |   .8922124   .1420081    -0.72   0.474      .653112    1.218846
T1DM, unc..  |   1.671404   .5571615     1.54   0.123     .8696288    3.212395
T2DM, con..  |   1.003675   .0730046     0.05   0.960     .8703205    1.157464
T2DM, unc..  |   1.014136   .1301711     0.11   0.913     .7885677    1.304228
Diabetes,..  |   4.153013   1.871792     3.16   0.002     1.716804    10.04629
             |
cancer_exh~t |
  Last year  |   .6713826   .3589548    -0.75   0.456     .2354372    1.914543
2-5 years..  |   1.075376   .1890475     0.41   0.679     .7619419    1.517744
   5+ years  |   1.125508    .071593     1.86   0.063     .9935832     1.27495
             |
cancer_hae~t |
  Last year  |   1.187075   .6489817     0.31   0.754     .4065564    3.466057
2-5 years..  |   1.050448   .1733986     0.30   0.766     .7600918    1.451722
   5+ years  |    1.13789   .0772061     1.90   0.057     .9961991    1.299734
             |
1.~r_disease |   1.173487   .0707242     2.65   0.008     1.042744    1.320623
1.stroke_d~a |   .9448413   .0626052    -0.86   0.392     .8297711    1.075869
1.other_ne~o |   1.129828    .071511     1.93   0.054     .9980144    1.279052
             |
reduced_ki~t |
Stage 3a/..  |   1.022649   .1376519     0.17   0.868     .7855104    1.331377
      1.esrd |   .9719387   .0538464    -0.51   0.607     .8719296    1.083419
1.other_tr~t |    .943209   .0607017    -0.91   0.364     .8314335    1.070011
  1.asplenia |   .9893819   .0657414    -0.16   0.872     .8685689    1.126999
1.ra_sle_p~s |   .8843052   .0624706    -1.74   0.082     .7699635    1.015627
1.other_im~o |   1.094229   .0672426     1.47   0.143     .9700633    1.234287
             |
     vaccine |
          1  |   1.631119   .6664587     1.20   0.231     .7323075    3.633105
          2  |   1.485491   .7427635     0.79   0.429     .5575181    3.958048
             |
     vaccine#|
   kids_cat4 |
          1 #|
only <12 ..  |   .6808317   .3011359    -0.87   0.385       .28612    1.620061
          1 #|
 only 12-18  |   1.674695   .9424557     0.92   0.360     .5557909    5.046149
    1#mixed  |   .6370877   .2642518    -1.09   0.277     .2825772    1.436354
          2 #|
only <12 ..  |   .5706325   .3236027    -0.99   0.323      .187778    1.734077
          2 #|
 only 12-18  |   1.593713   1.445807     0.51   0.607     .2692808    9.432245
    2#mixed  |   .7464828   .3820119    -0.57   0.568     .2737904    2.035267
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      2.33 /        1 =       2.3320

 ( 1)  1.vaccine#1.kids_cat4 = 0
 ( 2)  1.vaccine#2.kids_cat4 = 0
 ( 3)  1.vaccine#3.kids_cat4 = 0

           chi2(  3) =    7.36
         Prob > chi2 =    0.0613

kids_cat4 
****************

 ( 1)  0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.069857   .4199595     2.55   0.011     .2467521    1.892963
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.288677   .6185357    -0.47   0.641    -1.500985    .9236307
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.747429   .4011813     4.36   0.000     .9611281     2.53373
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 1o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     1.9846   .3176134     4.28   0.000     1.450266    2.715804
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.254772   .3856841     0.74   0.460     .6869544    2.291933
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.656773   .5436143     8.72   0.000     2.732491    4.893699
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.663373   .6947147     1.22   0.223      .733638    3.771356
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.194096   .7701668     0.28   0.783     .3373125    4.227137
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   4.284681   1.526097     4.09   0.000     2.131776     8.61183
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_1_
> stratified.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_1_stratif
> ied.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_death_s
> tratified.log
  log type:  text
 closed on:  17 Nov 2021, 20:55:08
-------------------------------------------------------------------------------
