-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b_stratified.log
  log type:  text
 opened on:  14 Sep 2021, 10:57:27

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  4. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  5.         
.         
. gen first_vacc_plus_7d=covid_vacc_date+7
  6. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
  7. format first_vacc_plus_7d second_vacc_plus_7d %td
  8.  
. stsplit vaccine, after(first_vacc_plus_7d) at(0)
  9. replace vaccine = vaccine +1
 10. stsplit vaccine2, after(second_vacc_plus_7d) at(0)
 11. replace vaccine=2 if vaccine==1 &vaccine2==0 & second_vacc_plus_7d!=.
 12. recode `outcome' .=0 
 13. 
. tab vaccine
 14. tab vaccine `outcome' if kids_cat4==0
 15. 
. 
. foreach int_type in  vaccine  {
 16. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 17. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ///
> interaction(i.`int_type'##i.`exposure_type')
 18. if _rc==0{
 19. testparm 1.`int_type'#i.`exposure_type'
 20. di _n "`exposure_type' " _n "****************"
 21. lincom 0.`exposure_type' 
 22. lincom 1.`exposure_type' 
 23. lincom 2.`exposure_type' 
 24. lincom 3.`exposure_type' 
 25. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 26. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 27. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 28. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 29. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 30. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 31. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 32. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 33. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_stratified, replace
 34. }
 35. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 36. }
 37. }
 38. }
(11,665 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,117  total observations
      3,500  observations end on or before enter()
------------------------------------------------------------------------------
     12,617  observations remaining, representing
     12,617  subjects
     10,412  failures in single-failure-per-subject data
    515,248  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(8,073 missing values generated)
(12,894 missing values generated)
(1,195 observations (episodes) created)
(13,812 real changes made)
(1,027 observations (episodes) created)
(815 real changes made)
(covid_tpp_prob: 2222 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,573       44.30       44.30
          1 |      7,451       50.21       94.51
          2 |        815        5.49      100.00
------------+-----------------------------------
      Total |     14,839      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |       116        122 |       238 
         1 |        85        202 |       287 
         2 |         9         46 |        55 
-----------+----------------------+----------
     Total |       210        370 |       580 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -64737.569
Iteration 1:   log pseudolikelihood = -64448.312
Iteration 2:   log pseudolikelihood = -64438.399
Iteration 3:   log pseudolikelihood = -64438.329
Iteration 4:   log pseudolikelihood = -64438.329
Refining estimates:
Iteration 0:   log pseudolikelihood = -64438.329

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,617             Number of obs    =      14,839
No. of failures      =       10,412
Time at risk         =       515248
                                                Wald chi2(50)    =      386.72
Log pseudolikelihood =   -64438.329             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 971 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.467252   .1793925     3.14   0.002     1.154604     1.86456
 only 12-18  |   1.330717   .2903445     1.31   0.190     .8676911    2.040828
      mixed  |   2.349607   .2225941     9.02   0.000      1.95144    2.829016
             |
        age1 |   1.000453   .0035483     0.13   0.898     .9935231    1.007432
        age2 |   1.000229   .0113475     0.02   0.984     .9782336    1.022719
        age3 |   .9964629    .032691    -0.11   0.914     .9344063    1.062641
      1.male |   .9841994   .0190454    -0.82   0.410     .9475701    1.022245
             |
   ethnicity |
Asian or ..  |   .9755416    .033971    -0.71   0.477     .9111809    1.044448
      Other  |   .9897274   .0311268    -0.33   0.743     .9305622    1.052654
             |
   obese4cat |
Obese I ..)  |   .9732545   .0272143    -0.97   0.332     .9213507    1.028082
Obese II..)  |   1.005582   .0354159     0.16   0.874     .9385095    1.077448
Obese II..)  |   1.086476   .0424113     2.12   0.034     1.006452    1.172864
             |
smoke_nomiss |
     Former  |   .9311049   .0701241    -0.95   0.343     .8033268    1.079208
    Current  |    .989359    .029883    -0.35   0.723     .9324893    1.049697
             |
         imd |
          4  |   .9549893   .0239917    -1.83   0.067     .9091053    1.003189
5 most de..  |   .9847597   .0340319    -0.44   0.657     .9202672    1.053772
             |
tot_adults~h |
          2  |   .7902951   .0926098    -2.01   0.045     .6281194    .9943434
          3  |   .9781557   .0924353    -0.23   0.815     .8127741    1.177189
             |
1.htdiag_o~p |   1.061882   .0228167     2.79   0.005      1.01809    1.107557
1.~y_disease |   .9907146   .0242857    -0.38   0.704     .9442408    1.039476
    1.asthma |   .9467241    .033157    -1.56   0.118     .8839178    1.013993
1.~c_disease |   1.032461   .0258888     1.27   0.203     .9829462    1.084469
             |
     diabcat |
T1DM, con..  |   .9675367   .0596763    -0.54   0.593     .8573665    1.091864
T1DM, unc..  |   .8851479   .1067191    -1.01   0.312      .698859    1.121094
T2DM, con..  |   1.047218   .0276081     1.75   0.080     .9944814    1.102751
T2DM, unc..  |   .9875492   .0495634    -0.25   0.803     .8950317     1.08963
Diabetes,..  |   .5455379   .2077563    -1.59   0.112     .2586207    1.150765
             |
cancer_exh~t |
  Last year  |   1.437531   .1930145     2.70   0.007     1.104913    1.870279
2-5 years..  |   1.082346   .0760002     1.13   0.260     .9431843    1.242041
   5+ years  |   1.022798   .0271072     0.85   0.395     .9710255    1.077332
             |
cancer_hae~t |
  Last year  |   .7007751   .0977495    -2.55   0.011     .5331464    .9211086
2-5 years..  |   1.140311    .091653     1.63   0.102      .974109     1.33487
   5+ years  |    1.03435   .0270217     1.29   0.196     .9827216    1.088691
             |
1.~r_disease |   1.010117   .0260656     0.39   0.696     .9602997    1.062519
1.stroke_d~a |    1.01504   .0248646     0.61   0.542     .9674582    1.064963
1.other_ne~o |   .9962582   .0226157    -0.17   0.869     .9529039    1.041585
             |
reduced_ki~t |
Stage 3a/..  |   1.332982   .2339479     1.64   0.101     .9450012    1.880253
      1.esrd |   1.021992   .0196211     1.13   0.257     .9842499    1.061181
1.other_tr~t |   1.003606   .0252219     0.14   0.886     .9553692    1.054277
  1.asplenia |   1.011611   .0242855     0.48   0.631     .9651143    1.060347
1.ra_sle_p~s |   1.019808   .0237299     0.84   0.399     .9743432    1.067395
1.other_im~o |   1.047444   .0264728     1.83   0.067     .9968228    1.100637
             |
     vaccine |
          1  |    .975709   .1047078    -0.23   0.819     .7906313    1.204111
          2  |   1.142465   .1807015     0.84   0.400     .8379346    1.557672
             |
     vaccine#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.072557   .1334302     0.56   0.573     .8404806    1.368715
          1 #|
 only 12-18  |   1.213619   .2003982     1.17   0.241     .8780678      1.6774
    1#mixed  |   1.037076   .1138416     0.33   0.740     .8363206    1.286022
          2 #|
only <12 ..  |    .860559   .1831581    -0.71   0.480     .5670406    1.306012
          2 #|
 only 12-18  |   .9210144   .2871045    -0.26   0.792     .4999475    1.696713
    2#mixed  |    .905159   .1515874    -0.59   0.552     .6518892    1.256828
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      5.52 /        1 =       5.5200

 ( 1)  1.vaccine#1.kids_cat4 = 0
 ( 2)  1.vaccine#2.kids_cat4 = 0
 ( 3)  1.vaccine#3.kids_cat4 = 0

           chi2(  3) =    1.83
         Prob > chi2 =    0.6081

kids_cat4 
****************

 ( 1)  0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3833914   .1222643     3.14   0.002     .1437578    .6230249
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2857181   .2181865     1.31   0.190    -.1419195    .7133557
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8542482   .0947367     9.02   0.000     .6685677    1.039929
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 1o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.573712   .1522255     4.69   0.000     1.301932    1.902226
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.614984   .2593924     2.98   0.003     1.178831    2.212508
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.436722   .1964799    11.05   0.000     2.080516    2.853913
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.262657   .2407355     1.22   0.221     .8689546    1.834737
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.22561   .3109762     0.80   0.423     .7453758    2.015251
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.126768   .3129193     5.13   0.000     1.593969    2.837662
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine
> _0_stratified.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine_0_stra
> tified.ster saved
(3,266 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,536  total observations
        975  observations end on or before enter()
------------------------------------------------------------------------------
      3,561  observations remaining, representing
      3,561  subjects
      2,911  failures in single-failure-per-subject data
    144,397  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(2,260 missing values generated)
(3,627 missing values generated)
(350 observations (episodes) created)
(3,911 real changes made)
(278 observations (episodes) created)
(221 real changes made)
(covid_tpp_prob: 628 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,874       44.74       44.74
          1 |      2,094       49.99       94.72
          2 |        221        5.28      100.00
------------+-----------------------------------
      Total |      4,189      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |        42         25 |        67 
         1 |        21         60 |        81 
         2 |         3         12 |        15 
-----------+----------------------+----------
     Total |        66         97 |       163 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -14417.754
Iteration 1:   log pseudolikelihood = -14347.508
Iteration 2:   log pseudolikelihood = -14344.509
Iteration 3:   log pseudolikelihood = -14344.456
Iteration 4:   log pseudolikelihood = -14344.456
Refining estimates:
Iteration 0:   log pseudolikelihood = -14344.456

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,561             Number of obs    =       4,189
No. of failures      =        2,911
Time at risk         =       144397
                                                Wald chi2(49)    =      119.17
Log pseudolikelihood =   -14344.456             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 773 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.334788   .5595405     3.54   0.000     1.459668    3.734574
 only 12-18  |   2.245346   .8694399     2.09   0.037     1.051192    4.796057
      mixed  |   3.251522   .6953872     5.51   0.000      2.13818    4.944576
             |
        age1 |   .9828813   .0175637    -0.97   0.334      .949053    1.017915
        age2 |   1.076019    .099483     0.79   0.428     .8976818    1.289786
        age3 |   .8763147   .1711105    -0.68   0.499     .5976587    1.284893
      1.male |   1.024249   .0390992     0.63   0.530     .9504129    1.103822
             |
   ethnicity |
Asian or ..  |   1.047943   .0611377     0.80   0.422      .934712     1.17489
      Other  |   .9626846   .0616103    -0.59   0.552     .8491971    1.091339
             |
   obese4cat |
Obese I ..)  |   1.013124   .0522319     0.25   0.800     .9157533    1.120847
Obese II..)  |   1.039861   .0699579     0.58   0.561      .911401    1.186426
Obese II..)  |   1.006212   .0841519     0.07   0.941      .854086    1.185434
             |
smoke_nomiss |
     Former  |   1.019069   .1426776     0.13   0.893      .774513    1.340845
    Current  |   1.041365   .0542421     0.78   0.436     .9402991    1.153294
             |
         imd |
          4  |   .9925325    .044953    -0.17   0.869     .9082237    1.084668
5 most de..  |   1.052686   .0699466     0.77   0.440     .9241453    1.199107
             |
tot_adults~h |
          2  |   .7760615   .1868271    -1.05   0.292     .4841501    1.243977
          3  |   .8505685   .1821003    -0.76   0.450     .5590793    1.294032
             |
1.htdiag_o~p |   .9508441   .0388463    -1.23   0.217     .8776752    1.030113
1.~y_disease |   .9757665   .0422559    -0.57   0.571     .8963638    1.062203
    1.asthma |   .9303114   .0624014    -1.08   0.282     .8157053     1.06102
1.~c_disease |   .9792629   .0432789    -0.47   0.635     .8980079     1.06787
             |
     diabcat |
T1DM, con..  |   1.127654   .1378741     0.98   0.326     .8873651    1.433009
T1DM, unc..  |    1.08595   .2590621     0.35   0.730     .6803758    1.733288
T2DM, con..  |   .9929646   .0486277    -0.14   0.885     .9020871    1.092997
T2DM, unc..  |   1.009721   .1099937     0.09   0.929     .8155976    1.250048
             |
cancer_exh~t |
  Last year  |   1.073946    .324702     0.24   0.813     .5937805    1.942401
2-5 years..  |   .8595972   .1246472    -1.04   0.297     .6469418    1.142154
   5+ years  |   .9702695   .0481653    -0.61   0.543     .8803143    1.069417
             |
cancer_hae~t |
  Last year  |   .4377546   .1982314    -1.82   0.068     .1802086    1.063374
2-5 years..  |   1.096262   .1427488     0.71   0.480     .8493292    1.414988
   5+ years  |   .9708695   .0450728    -0.64   0.524     .8864284    1.063354
             |
1.~r_disease |   1.073764   .0497681     1.54   0.125     .9805192    1.175875
1.stroke_d~a |   1.069868   .0509669     1.42   0.156     .9744963    1.174573
1.other_ne~o |   1.031319   .0483047     0.66   0.510     .9408589    1.130476
             |
reduced_ki~t |
Stage 3a/..  |   .9870984   .1023628    -0.13   0.900     .8055458    1.209569
      1.esrd |   .9775243   .0390605    -0.57   0.569     .9038882    1.057159
1.other_tr~t |   .9459692   .0452299    -1.16   0.245     .8613472    1.038905
  1.asplenia |    1.01524   .0480172     0.32   0.749     .9253583    1.113852
1.ra_sle_p~s |   1.095988   .0501268     2.00   0.045     1.002016    1.198772
1.other_im~o |   1.096798   .0502286     2.02   0.044      1.00264    1.199797
             |
     vaccine |
          1  |    1.55184   .3623692     1.88   0.060     .9819368    2.452509
          2  |   1.864285   .7033715     1.65   0.099     .8899475     3.90535
             |
     vaccine#|
   kids_cat4 |
          1 #|
only <12 ..  |   .5958085   .1560075    -1.98   0.048     .3566372    .9953751
          1 #|
 only 12-18  |   .6146243   .2389379    -1.25   0.211     .2868807    1.316795
    1#mixed  |    .629482   .1491257    -1.95   0.051     .3956687    1.001463
          2 #|
only <12 ..  |    .623913   .2803174    -1.05   0.294     .2586356     1.50508
          2 #|
 only 12-18  |   .5604946   .3115671    -1.04   0.298     .1885413    1.666236
    2#mixed  |   .5157016   .2002812    -1.71   0.088     .2408909    1.104019
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      1.35 /        1 =       1.3500

 ( 1)  1.vaccine#1.kids_cat4 = 0
 ( 2)  1.vaccine#2.kids_cat4 = 0
 ( 3)  1.vaccine#3.kids_cat4 = 0

           chi2(  3) =    4.13
         Prob > chi2 =    0.2476

kids_cat4 
****************

 ( 1)  0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8479213   .2396536     3.54   0.000     .3782088    1.317634
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8088594   .3872187     2.09   0.037     .0499247    1.567794
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.179123   .2138651     5.51   0.000     .7599552    1.598291
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 1o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.391087   .2606289     1.76   0.078     .9635545    2.008317
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.380044   .3820711     1.16   0.245     .8021104    2.374388
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.046774   .3485027     4.21   0.000     1.466009    2.857613
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.456705   .5872209     0.93   0.351     .6610566    3.209996
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.258504   .5267802     0.55   0.583     .5540662    2.858562
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.676815    .589831     1.47   0.142     .8415293    3.341189
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine
> _1_stratified.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine_1_stra
> tified.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b_stratified.log
  log type:  text
 closed on:  14 Sep 2021, 10:57:35
-------------------------------------------------------------------------------
