-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_shield_covid_tpp_prob
> .log
  log type:  text
 opened on:  28 Oct 2021, 11:44:17

. 
. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. foreach int_type in  shield  {
 19. 
. tab shield `outcome'
 20. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 21. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposu
> re_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id) 
 22. if _rc==0{
 23. *testparm 1.`int_type'#i.`exposure_type'
. di _n "`exposure_type' " _n "****************"
 24. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 25. di "`exposure_type'" _n "****************"
 26. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 27. di "`exposure_type'" _n "****************"
 28. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 29. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod`period', replace
 30. }
 31. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 32. }
 33. drop cat_time
 34. }
 35. }
 36. }
(18,078 observations (episodes) created)
(cat_time: 18078 changes made)
(covid_tpp_prob: 18078 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,905      2,326 |     5,231 
         1 |    16,079     12,850 |    28,929 
-----------+----------------------+----------
     Total |    18,984     15,176 |    34,160 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -46583.701
Iteration 1:   log pseudolikelihood = -46563.865
Iteration 2:   log pseudolikelihood = -46563.802
Iteration 3:   log pseudolikelihood = -46563.802
Refining estimates:
Iteration 0:   log pseudolikelihood = -46563.802

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,079             Number of obs    =      16,079
No. of failures      =        6,525
Time at risk         =      1069677
                                                Wald chi2(46)    =       43.68
Log pseudolikelihood =   -46563.802             Prob > chi2      =      0.5700

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.069718   .2393618     0.30   0.763     .6899272    1.658577
 only 12-18  |   1.245873   .3147255     0.87   0.384     .7593606    2.044088
      mixed  |    1.11524   .2262563     0.54   0.591     .7493407    1.659806
             |
        age1 |   1.002325   .0045312     0.51   0.608     .9934828    1.011245
        age2 |   .9904911   .0141597    -0.67   0.504     .9631237    1.018636
        age3 |   1.031378   .0424537     0.75   0.453     .9514385    1.118034
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9483339   .0238361    -2.11   0.035     .9027481    .9962217
             |
   ethnicity |
Asian or ..  |   .9706317   .0419054    -0.69   0.490     .8918777     1.05634
      Other  |   .9420435    .041317    -1.36   0.173     .8644467    1.026606
             |
   obese4cat |
Obese I ..)  |    .991463   .0345994    -0.25   0.806     .9259167     1.06165
Obese II..)  |   .9664137   .0442002    -0.75   0.455     .8835522    1.057046
Obese II..)  |   1.010262   .0560383     0.18   0.854     .9061889    1.126288
             |
smoke_nomiss |
     Former  |   1.209263   .1010537     2.27   0.023     1.026571    1.424467
    Current  |    1.04012   .0379999     1.08   0.282     .9682452    1.117329
             |
         imd |
          4  |     .97908   .0306324    -0.68   0.499     .9208455    1.040997
5 most de..  |   .9912456    .042538    -0.20   0.838     .9112826    1.078225
             |
tot_adults~h |
          2  |   .8121311   .1696107    -1.00   0.319     .5393315    1.222916
          3  |   .7933251   .1293621    -1.42   0.156     .5763039    1.092071
             |
    1.shield |   .9641538   .1953456    -0.18   0.857     .6481654     1.43419
1.htdiag_o~p |   .9963662   .0261226    -0.14   0.890     .9464601    1.048904
1.~y_disease |   1.013371   .0312864     0.43   0.667     .9538697    1.076585
    1.asthma |   .9826643   .0452742    -0.38   0.704      .897817     1.07553
1.~c_disease |   .9765233   .0306197    -0.76   0.449     .9183166    1.038419
             |
     diabcat |
T1DM, con..  |   .9263725    .076526    -0.93   0.355     .7878969    1.089186
T1DM, unc..  |    1.10532   .1833164     0.60   0.546     .7985777    1.529886
T2DM, con..  |   1.027338    .034844     0.80   0.426      .961266    1.097952
T2DM, unc..  |   1.055319   .0666294     0.85   0.394     .9324846    1.194334
Diabetes,..  |   .7345527   .3073646    -0.74   0.461     .3234805    1.668007
             |
cancer_exh~t |
  Last year  |   1.240403   .2854712     0.94   0.349     .7900672    1.947429
2-5 years..  |   1.000828   .0982728     0.01   0.993     .8256167    1.213221
   5+ years  |   .9516912   .0336519    -1.40   0.161     .8879682    1.019987
             |
cancer_hae~t |
  Last year  |   .9108271     .21219    -0.40   0.688     .5769479    1.437922
2-5 years..  |    .878153   .0947979    -1.20   0.229     .7106925    1.085072
   5+ years  |   .9741483   .0321893    -0.79   0.428     .9130581    1.039326
             |
1.~r_disease |   .9973169   .0307286    -0.09   0.931     .9388724      1.0594
1.stroke_d~a |   1.036226   .0305021     1.21   0.227     .9781351    1.097767
1.other_ne~o |   1.050128    .033242     1.55   0.122      .986955    1.117345
             |
reduced_ki~t |
Stage 3a/..  |   1.132609   .2263825     0.62   0.533     .7654982    1.675774
      1.esrd |   .9766424   .0269172    -0.86   0.391     .9252852     1.03085
1.other_tr~t |   .9922679   .0310881    -0.25   0.804     .9331694    1.055109
  1.asplenia |   .9750038   .0314671    -0.78   0.433     .9152396    1.038671
1.ra_sle_p~s |   .9454202   .0299719    -1.77   0.077     .8884642    1.006028
1.other_im~o |   1.010426   .0323429     0.32   0.746     .9489826    1.075847
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.125948   .2588253     0.52   0.606     .7175466    1.766798
          1 #|
 only 12-18  |   .9421199   .2513417    -0.22   0.823     .5584959    1.589251
    1#mixed  |    1.08786   .2221994     0.41   0.680     .7289739    1.623432
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.204448   .1186888     1.89   0.059     .9929074    1.461057
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.173762   .1463641     1.28   0.199     .9192594    1.498725
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.213225   .1111219     2.11   0.035      1.01386    1.451793
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 0_timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_0_timep
> eriod0.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,905      2,326 |     5,231 
         1 |    16,079     12,850 |    28,929 
-----------+----------------------+----------
     Total |    18,984     15,176 |    34,160 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -25845.535
Iteration 1:   log pseudolikelihood = -25823.743
Iteration 2:   log pseudolikelihood =  -25823.63
Iteration 3:   log pseudolikelihood =  -25823.63
Refining estimates:
Iteration 0:   log pseudolikelihood =  -25823.63

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,340             Number of obs    =       9,340
No. of failures      =        3,925
Time at risk         =       499720
                                                Wald chi2(46)    =       48.87
Log pseudolikelihood =    -25823.63             Prob > chi2      =      0.3585

                       (Std. Err. adjusted for 1,038 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9166809   .2469611    -0.32   0.747      .540627    1.554314
 only 12-18  |   .5664922   .2475369    -1.30   0.193     .2405743    1.333947
      mixed  |   .9449115   .2299815    -0.23   0.816      .586432    1.522525
             |
        age1 |   1.002108    .005914     0.36   0.721     .9905834    1.013766
        age2 |   .9908469     .01875    -0.49   0.627     .9547706    1.028286
        age3 |    1.02634   .0558391     0.48   0.633     .9225309    1.141831
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9918602   .0336814    -0.24   0.810     .9279948    1.060121
             |
   ethnicity |
Asian or ..  |   1.147648   .0589522     2.68   0.007      1.03773    1.269209
      Other  |   1.099775   .0552757     1.89   0.058     .9966017    1.213629
             |
   obese4cat |
Obese I ..)  |    .995557   .0471412    -0.09   0.925     .9073198    1.092375
Obese II..)  |    .971119   .0573366    -0.50   0.620     .8649998    1.090257
Obese II..)  |   1.048241   .0734143     0.67   0.501     .9137901    1.202473
             |
smoke_nomiss |
     Former  |   1.126767   .1292887     1.04   0.298     .8998389    1.410924
    Current  |   .9992331   .0501092    -0.02   0.988      .905693    1.102434
             |
         imd |
          4  |    1.01168   .0412872     0.28   0.776     .9339101    1.095926
5 most de..  |   .9353442   .0516801    -1.21   0.226     .8393449    1.042323
             |
tot_adults~h |
          2  |   1.421168   .3962203     1.26   0.207     .8228701    2.454481
          3  |   1.118557    .266555     0.47   0.638      .701156    1.784439
             |
    1.shield |   .8991656   .2489703    -0.38   0.701     .5225769    1.547139
1.htdiag_o~p |   1.037986   .0342325     1.13   0.258     .9730135    1.107296
1.~y_disease |   .9604673    .038592    -1.00   0.315     .8877302    1.039164
    1.asthma |   1.068549   .0636603     1.11   0.266     .9507863    1.200898
1.~c_disease |   .9907901   .0399933    -0.23   0.819     .9154252    1.072359
             |
     diabcat |
T1DM, con..  |    .979892   .0981586    -0.20   0.839     .8052132    1.192465
T1DM, unc..  |   1.154992   .2639781     0.63   0.528     .7379605    1.807692
T2DM, con..  |   .9507045   .0424857    -1.13   0.258     .8709767     1.03773
T2DM, unc..  |   .9065873   .0775639    -1.15   0.252     .7666273    1.072099
Diabetes,..  |   1.378384   .4661849     0.95   0.343     .7103696    2.674583
             |
cancer_exh~t |
  Last year  |   .8541387   .3061766    -0.44   0.660     .4230626    1.724456
2-5 years..  |   1.216766   .1344874     1.78   0.076     .9797718    1.511086
   5+ years  |    1.04026   .0434683     0.94   0.345     .9584594    1.129043
             |
cancer_hae~t |
  Last year  |    1.29317   .2894104     1.15   0.251     .8339835    2.005182
2-5 years..  |   .9837888   .1240356    -0.13   0.897      .768392    1.259566
   5+ years  |    1.06669   .0469312     1.47   0.142     .9785611    1.162756
             |
1.~r_disease |   1.001265   .0398383     0.03   0.975     .9261501    1.082472
1.stroke_d~a |   1.053003   .0421675     1.29   0.197     .9735167     1.13898
1.other_ne~o |   .9653007   .0389994    -0.87   0.382     .8918113    1.044846
             |
reduced_ki~t |
Stage 3a/..  |   1.099388   .2857924     0.36   0.715     .6605047    1.829893
      1.esrd |   .9942778   .0349214    -0.16   0.870     .9281358    1.065133
1.other_tr~t |   1.040913   .0423966     0.98   0.325     .9610478    1.127416
  1.asplenia |   1.029394   .0432083     0.69   0.490      .948097    1.117662
1.ra_sle_p~s |   1.078828   .0426242     1.92   0.055     .9984389     1.16569
1.other_im~o |   .9960376   .0413198    -0.10   0.924     .9182571    1.080406
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.163515   .3557286     0.50   0.620     .6390411    2.118434
          1 #|
 only 12-18  |   1.982269   .9212674     1.47   0.141     .7971927    4.929035
    1#mixed  |   1.028274    .285951     0.10   0.920     .5962107    1.773447
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.066572   .1275876     0.54   0.590     .8436571    1.348386
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.12294   .1862952     0.70   0.485     .8112274    1.554427
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9716281   .1070135    -0.26   0.794      .782979     1.20573
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 0_timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_0_timep
> eriod1.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,905      2,326 |     5,231 
         1 |    16,079     12,850 |    28,929 
-----------+----------------------+----------
     Total |    18,984     15,176 |    34,160 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -15755.722
Iteration 1:   log pseudolikelihood = -15736.041
Iteration 2:   log pseudolikelihood =  -15735.06
Iteration 3:   log pseudolikelihood = -15735.033
Iteration 4:   log pseudolikelihood = -15735.033
Refining estimates:
Iteration 0:   log pseudolikelihood = -15735.033

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,260             Number of obs    =       5,260
No. of failures      =        2,652
Time at risk         =       235184
                                                Wald chi2(46)    =       45.28
Log pseudolikelihood =   -15735.033             Prob > chi2      =      0.5024

                         (Std. Err. adjusted for 940 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.36829   .5207588     0.82   0.410     .6489606    2.884946
 only 12-18  |   1.043807   .5488368     0.08   0.935     .3724395    2.925395
      mixed  |   1.414212   .5005143     0.98   0.327     .7067398    2.829891
             |
        age1 |   1.004891   .0073179     0.67   0.503     .9906498    1.019337
        age2 |   .9970331   .0231935    -0.13   0.898     .9525954    1.043544
        age3 |   .9973313   .0665516    -0.04   0.968     .8750624    1.136684
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9511919   .0343152    -1.39   0.165     .8862581    1.020883
             |
   ethnicity |
Asian or ..  |   1.058523   .0705059     0.85   0.393     .9289744    1.206138
      Other  |   .8955855   .0604008    -1.64   0.102     .7846927     1.02215
             |
   obese4cat |
Obese I ..)  |   1.008729   .0593492     0.15   0.883     .8988635    1.132024
Obese II..)  |   .9582149   .0644314    -0.63   0.526     .8398993    1.093197
Obese II..)  |   .9333437   .0787045    -0.82   0.413     .7911591    1.101081
             |
smoke_nomiss |
     Former  |   .8920755   .1293302    -0.79   0.431     .6714245    1.185239
    Current  |    1.07016    .061996     1.17   0.242     .9552947    1.198837
             |
         imd |
          4  |   1.024278   .0507256     0.48   0.628     .9295306    1.128684
5 most de..  |   1.076567   .0691501     1.15   0.251     .9492192    1.220999
             |
tot_adults~h |
          2  |   .8467146   .3024644    -0.47   0.641     .4204068    1.705314
          3  |    .843088   .2308584    -0.62   0.533     .4929386    1.441959
             |
    1.shield |   1.273801   .4657227     0.66   0.508     .6221402    2.608044
1.htdiag_o~p |   .9875786   .0400391    -0.31   0.758     .9121404    1.069256
1.~y_disease |   1.015098   .0504006     0.30   0.763     .9209692    1.118848
    1.asthma |   1.032597   .0767927     0.43   0.666     .8925415     1.19463
1.~c_disease |   .9606781   .0470379    -0.82   0.413     .8727709    1.057439
             |
     diabcat |
T1DM, con..  |   1.101728   .1188142     0.90   0.369     .8918217    1.361041
T1DM, unc..  |   1.192173   .3716559     0.56   0.573     .6471126    2.196334
T2DM, con..  |   .9911304   .0509202    -0.17   0.862      .896189     1.09613
T2DM, unc..  |   .8810183   .0895712    -1.25   0.213     .7218469    1.075288
Diabetes,..  |   .9334969   .5150551    -0.12   0.901     .3165658    2.752718
             |
cancer_exh~t |
  Last year  |   2.392013   .7900568     2.64   0.008     1.252047    4.569898
2-5 years..  |   .9570049   .1564494    -0.27   0.788     .6946425     1.31846
   5+ years  |   1.081628   .0578005     1.47   0.142      .974072     1.20106
             |
cancer_hae~t |
  Last year  |   .8551633   .3255491    -0.41   0.681     .4055161    1.803391
2-5 years..  |   1.293845   .1661599     2.01   0.045     1.005931    1.664165
   5+ years  |    .971512   .0543096    -0.52   0.605     .8706912    1.084007
             |
1.~r_disease |    .930528   .0480347    -1.39   0.163     .8409877    1.029602
1.stroke_d~a |   .9342426   .0476166    -1.33   0.182     .8454258     1.03239
1.other_ne~o |   1.040856   .0530729     0.79   0.432     .9418644    1.150253
             |
reduced_ki~t |
Stage 3a/..  |   .8841875   .3055131    -0.36   0.722     .4491888    1.740443
      1.esrd |   1.023642   .0453636     0.53   0.598     .9384826    1.116528
1.other_tr~t |   1.055409    .053458     1.06   0.287     .9556658    1.165562
  1.asplenia |   .9993025   .0504641    -0.01   0.989     .9051318    1.103271
1.ra_sle_p~s |   1.095668   .0514639     1.95   0.052      .999304    1.201324
1.other_im~o |   1.041735   .0546523     0.78   0.436     .9399413    1.154552
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |    .781015   .3098143    -0.62   0.533     .3589247    1.699477
          1 #|
 only 12-18  |   .9055033   .5116851    -0.18   0.861     .2991507     2.74088
    1#mixed  |   .6990757   .2559339    -0.98   0.328     .3411116    1.432689
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.068655   .1567675     0.45   0.651     .8016217    1.424641
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9451705   .1900034    -0.28   0.779     .6373778    1.401598
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9886413    .131837    -0.09   0.932     .7612541    1.283949
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 0_timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_0_timep
> eriod2.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,905      2,326 |     5,231 
         1 |    16,079     12,850 |    28,929 
-----------+----------------------+----------
     Total |    18,984     15,176 |    34,160 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood =  -6948.872
Iteration 1:   log pseudolikelihood =  -6931.525
Iteration 2:   log pseudolikelihood = -6926.2029
Iteration 3:   log pseudolikelihood =  -6926.153
Iteration 4:   log pseudolikelihood = -6926.1528
Refining estimates:
Iteration 0:   log pseudolikelihood = -6926.1528

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,462             Number of obs    =       2,462
No. of failures      =        1,352
Time at risk         =        80292
                                                Wald chi2(46)    =      124.20
Log pseudolikelihood =   -6926.1528             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 796 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.472772    .665151     0.86   0.391     .6077228    3.569155
 only 12-18  |   .9457677   .5411766    -0.10   0.922     .3081197    2.903017
      mixed  |    1.18369   .4489233     0.44   0.657     .5628772    2.489216
             |
        age1 |   1.016562   .0108129     1.54   0.123      .995588    1.037977
        age2 |   .9444533   .0313973    -1.72   0.086     .8848777     1.00804
        age3 |   1.175624   .1113418     1.71   0.088     .9764545    1.415417
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.025702    .054183     0.48   0.631     .9248179    1.137591
             |
   ethnicity |
Asian or ..  |   1.041913   .1008239     0.42   0.671     .8619103    1.259507
      Other  |   .9408407   .0850541    -0.67   0.500     .7880715    1.123225
             |
   obese4cat |
Obese I ..)  |   1.071209   .0865674     0.85   0.395     .9142947    1.255053
Obese II..)  |   .9179798   .0881658    -0.89   0.373     .7604679    1.108116
Obese II..)  |    1.03358   .1220407     0.28   0.780     .8200449    1.302717
             |
smoke_nomiss |
     Former  |   .8870258    .202924    -0.52   0.600     .5665101     1.38888
    Current  |   1.147803   .0969559     1.63   0.103     .9726707    1.354469
             |
         imd |
          4  |    .956274   .0641544    -0.67   0.505     .8384498    1.090656
5 most de..  |   1.032902   .0959752     0.35   0.728     .8609291    1.239228
             |
tot_adults~h |
          2  |   1.308331   .7164223     0.49   0.624     .4473143    3.826685
          3  |   1.613646   .6881068     1.12   0.262     .6995686    3.722082
             |
    1.shield |   1.569573   .7065284     1.00   0.317     .6495632    3.792642
1.htdiag_o~p |   .9992754   .0573777    -0.01   0.990     .8929143    1.118306
1.~y_disease |   1.066113   .0712331     0.96   0.338     .9352541    1.215282
    1.asthma |   1.063576   .1116668     0.59   0.557     .8657637    1.306585
1.~c_disease |   1.055591    .071063     0.80   0.422     .9251072    1.204478
             |
     diabcat |
T1DM, con..  |   1.179328   .1939049     1.00   0.316     .8544375    1.627755
T1DM, unc..  |   1.073391   .5563737     0.14   0.891     .3886443    2.964583
T2DM, con..  |   .9535176   .0739657    -0.61   0.539     .8190301    1.110088
T2DM, unc..  |   1.127598   .1346489     1.01   0.315     .8922989    1.424945
Diabetes,..  |    6.09225   1.379241     7.98   0.000     3.909056     9.49475
             |
cancer_exh~t |
  Last year  |   1.537987    1.08591     0.61   0.542     .3854376    6.136935
2-5 years..  |    1.48842    .309424     1.91   0.056     .9903104    2.237071
   5+ years  |   1.136444     .08342     1.74   0.081     .9841609    1.312291
             |
cancer_hae~t |
  Last year  |   1.209858   .6148187     0.37   0.708     .4468646    3.275617
2-5 years..  |   1.077395   .2471494     0.32   0.745     .6872477    1.689027
   5+ years  |    1.08957   .0800327     1.17   0.243     .9434773    1.258285
             |
1.~r_disease |   1.079562   .0724737     1.14   0.254     .9464639    1.231376
1.stroke_d~a |   1.010427   .0688971     0.15   0.879     .8840252    1.154901
1.other_ne~o |   1.148217   .0781514     2.03   0.042      1.00482    1.312077
             |
reduced_ki~t |
Stage 3a/..  |   1.514769   .6770531     0.93   0.353     .6307924    3.637526
      1.esrd |   1.041265   .0616238     0.68   0.494     .9272263    1.169329
1.other_tr~t |   1.073153   .0714745     1.06   0.289     .9418238    1.222795
  1.asplenia |   .9580313   .0695701    -0.59   0.555     .8309355    1.104567
1.ra_sle_p~s |   .9384878   .0674338    -0.88   0.377     .8152046    1.080415
1.other_im~o |   1.143113   .0804701     1.90   0.057      .995791     1.31223
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .5002959   .2608866    -1.33   0.184     .1800344    1.390267
          1 #|
 only 12-18  |   .6504997   .4412078    -0.63   0.526     .1721517    2.458005
    1#mixed  |   .5403655   .2441909    -1.36   0.173      .222859    1.310223
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7368217   .1645427    -1.37   0.171     .4756386    1.141426
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6152216    .200758    -1.49   0.137     .3245406    1.166257
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6396255   .1328675    -2.15   0.031     .4257045     .961044
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 0_timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_0_timep
> eriod3.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,905      2,326 |     5,231 
         1 |    16,079     12,850 |    28,929 
-----------+----------------------+----------
     Total |    18,984     15,176 |    34,160 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2938.8804
Iteration 1:   log pseudolikelihood = -2912.1315
Iteration 2:   log pseudolikelihood = -2911.6908
Iteration 3:   log pseudolikelihood = -2911.6791
Iteration 4:   log pseudolikelihood =  -2911.679
Refining estimates:
Iteration 0:   log pseudolikelihood =  -2911.679

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,016             Number of obs    =       1,016
No. of failures      =          719
Time at risk         =        24973
                                                Wald chi2(45)    =       74.40
Log pseudolikelihood =    -2911.679             Prob > chi2      =      0.0038

                         (Std. Err. adjusted for 569 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    .744222   .3557783    -0.62   0.537     .2915965    1.899428
 only 12-18  |   .5049688    .319777    -1.08   0.281     .1459593    1.747017
      mixed  |   .7791269   .2593653    -0.75   0.453     .4057419     1.49612
             |
        age1 |   .9911061   .0140825    -0.63   0.530     .9638856    1.019095
        age2 |   1.030562   .0467242     0.66   0.507      .942935    1.126332
        age3 |   .9308912   .1213764    -0.55   0.583      .720963    1.201946
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8600254   .0640073    -2.03   0.043     .7432942    .9950887
             |
   ethnicity |
Asian or ..  |   1.008945   .1427733     0.06   0.950     .7645681    1.331432
      Other  |   1.057655   .1304202     0.45   0.649     .8305806     1.34681
             |
   obese4cat |
Obese I ..)  |   .8963693   .1041495    -0.94   0.346     .7138148    1.125611
Obese II..)  |   1.389323   .1755861     2.60   0.009     1.084492    1.779837
Obese II..)  |   .8857685   .1450099    -0.74   0.459     .6426423    1.220875
             |
smoke_nomiss |
     Former  |   1.077975   .3039474     0.27   0.790     .6203012    1.873332
    Current  |   .9775416   .1219598    -0.18   0.856      .765487    1.248339
             |
         imd |
          4  |   .8353711   .0871495    -1.72   0.085     .6808922    1.024898
5 most de..  |   .8985385   .1159742    -0.83   0.407     .6977058     1.15718
             |
tot_adults~h |
          2  |   1.203343   .7843052     0.28   0.776     .3354287    4.316967
          3  |   .4992631   .2858066    -1.21   0.225     .1625748    1.533224
             |
    1.shield |   .5425096   .3032915    -1.09   0.274     .1813597    1.622834
1.htdiag_o~p |   1.215547   .0946239     2.51   0.012     1.043542    1.415902
1.~y_disease |   1.062167   .1083494     0.59   0.554     .8696884    1.297245
    1.asthma |    1.05845   .1747531     0.34   0.731     .7658342    1.462872
1.~c_disease |   1.085649   .0963879     0.93   0.355     .9122558    1.291999
             |
     diabcat |
T1DM, con..  |   .7461508   .2042201    -1.07   0.285     .4363694    1.275848
T1DM, unc..  |   .3438738    .350649    -1.05   0.295     .0466044    2.537299
T2DM, con..  |   1.176248   .1093273     1.75   0.081      .980355    1.411284
T2DM, unc..  |   1.351111   .2835895     1.43   0.152     .8954256    2.038698
             |
cancer_exh~t |
  Last year  |   1.448928   .4332253     1.24   0.215     .8063809    2.603476
2-5 years..  |   .8005677   .2171219    -0.82   0.412     .4704828    1.362236
   5+ years  |    .879306   .0904363    -1.25   0.211     .7187772    1.075687
             |
cancer_hae~t |
  Last year  |   .4046151   .2886817    -1.27   0.205     .0999386     1.63814
2-5 years..  |   1.018523   .3870907     0.05   0.961     .4835824    2.145215
   5+ years  |   1.045972   .1061205     0.44   0.658     .8573545    1.276086
             |
1.~r_disease |   1.112419   .1103548     1.07   0.283     .9158556    1.351169
1.stroke_d~a |   1.136787   .0963704     1.51   0.130     .9627624    1.342268
1.other_ne~o |   1.047467    .110319     0.44   0.660     .8521027    1.287623
             |
reduced_ki~t |
Stage 3a/..  |   .6113323   .4003119    -0.75   0.452     .1693926    2.206278
      1.esrd |   1.131225   .1004111     1.39   0.165     .9505905    1.346184
1.other_tr~t |    .993847   .0977451    -0.06   0.950     .8196032    1.205134
  1.asplenia |   1.074732   .1089781     0.71   0.477     .8810244    1.311028
1.ra_sle_p~s |   .7410467   .0723647    -3.07   0.002     .6119614    .8973608
1.other_im~o |   1.012307   .1044465     0.12   0.906     .8269667    1.239186
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   2.466916    1.68072     1.33   0.185     .6489734    9.377382
          1 #|
 only 12-18  |   3.166417   2.756689     1.32   0.186     .5747914    17.44319
    1#mixed  |   1.692051   .9670678     0.92   0.357     .5519776    5.186873
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.835933   .8891325     1.25   0.210     .7105987    4.743394
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.598942   .8885146     0.84   0.398     .5380579    4.751559
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.318323   .6209416     0.59   0.557      .523719    3.318525
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 0_timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_0_timep
> eriod4.ster saved
(4,975 observations (episodes) created)
(cat_time: 4975 changes made)
(covid_tpp_prob: 4975 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       792        690 |     1,482 
         1 |     4,442      3,602 |     8,044 
-----------+----------------------+----------
     Total |     5,234      4,292 |     9,526 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -11203.854
Iteration 1:   log pseudolikelihood = -11174.841
Iteration 2:   log pseudolikelihood = -11173.884
Iteration 3:   log pseudolikelihood = -11173.695
Iteration 4:   log pseudolikelihood = -11173.628
Iteration 5:   log pseudolikelihood = -11173.603
Iteration 6:   log pseudolikelihood = -11173.594
Iteration 7:   log pseudolikelihood =  -11173.59
Iteration 8:   log pseudolikelihood = -11173.589
Iteration 9:   log pseudolikelihood = -11173.589
Iteration 10:  log pseudolikelihood = -11173.589
Iteration 11:  log pseudolikelihood = -11173.588
Iteration 12:  log pseudolikelihood = -11173.588
Iteration 13:  log pseudolikelihood = -11173.588
Iteration 14:  log pseudolikelihood = -11173.588
Iteration 15:  log pseudolikelihood = -11173.588
Iteration 16:  log pseudolikelihood = -11173.588
Iteration 17:  log pseudolikelihood = -11173.588
Iteration 18:  log pseudolikelihood = -11173.588
Iteration 19:  log pseudolikelihood = -11173.588
Iteration 20:  log pseudolikelihood = -11173.588
Iteration 21:  log pseudolikelihood = -11173.588
Iteration 22:  log pseudolikelihood = -11173.588
Iteration 23:  log pseudolikelihood = -11173.588
Iteration 24:  log pseudolikelihood = -11173.588
Iteration 25:  log pseudolikelihood = -11173.588
Iteration 26:  log pseudolikelihood = -11173.588
Iteration 27:  log pseudolikelihood = -11173.588
Iteration 28:  log pseudolikelihood = -11173.588
Iteration 29:  log pseudolikelihood = -11173.588
Iteration 30:  log pseudolikelihood = -11173.588
Iteration 31:  log pseudolikelihood = -11173.588
Iteration 32:  log pseudolikelihood = -11173.588
Iteration 33:  log pseudolikelihood = -11173.588
Iteration 34:  log pseudolikelihood = -11173.588
Iteration 35:  log pseudolikelihood = -11173.588
Iteration 36:  log pseudolikelihood = -11173.588
Iteration 37:  log pseudolikelihood = -11173.588
Iteration 38:  log pseudolikelihood = -11173.588
Refining estimates:
Iteration 0:   log pseudolikelihood = -11173.588
Iteration 1:   log pseudolikelihood = -11173.588

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,549             Number of obs    =       4,549
No. of failures      =        1,908
Time at risk         =       298676
                                                Wald chi2(46)    =     6351.09
Log pseudolikelihood =   -11173.588             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.461738   .5906215     0.94   0.347     .6621214    3.227016
 only 12-18  |   .6516391   .4301206    -0.65   0.516      .178716    2.376024
      mixed  |   1.693392   .6231277     1.43   0.152     .8232574    3.483207
             |
        age1 |   1.002776    .023263     0.12   0.905      .958202    1.049423
        age2 |   1.007614   .1219253     0.06   0.950     .7948684      1.2773
        age3 |   .9795058   .2516813    -0.08   0.936      .591961    1.620768
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9747485   .0472483    -0.53   0.598     .8864065    1.071895
             |
   ethnicity |
Asian or ..  |   1.125359   .0856419     1.55   0.121     .9694225    1.306379
      Other  |     .89088    .070281    -1.46   0.143     .7632527    1.039848
             |
   obese4cat |
Obese I ..)  |   .9200637    .062998    -1.22   0.224     .8045165    1.052206
Obese II..)  |   1.034754    .083535     0.42   0.672     .8833241    1.212143
Obese II..)  |   1.131279   .1127535     1.24   0.216     .9305322    1.375334
             |
smoke_nomiss |
     Former  |   .9233238   .1673519    -0.44   0.660     .6472532    1.317146
    Current  |   1.044147   .0681109     0.66   0.508     .9188339    1.186552
             |
         imd |
          4  |   1.049415   .0601762     0.84   0.400     .9378577    1.174241
5 most de..  |   .9561049   .0752185    -0.57   0.568      .819483    1.115504
             |
tot_adults~h |
          2  |    .813055   .4280448    -0.39   0.694     .2897292    2.281642
          3  |   1.596437   .5039739     1.48   0.138     .8598815    2.963908
             |
    1.shield |    1.61986   .6634209     1.18   0.239     .7258788    3.614855
1.htdiag_o~p |    1.00777   .0496767     0.16   0.875     .9149609    1.109993
1.~y_disease |   .9764378   .0576523    -0.40   0.686     .8697344    1.096232
    1.asthma |   1.073495    .088294     0.86   0.389     .9136706    1.261278
1.~c_disease |   .9372959   .0547587    -1.11   0.268     .8358874    1.051007
             |
     diabcat |
T1DM, con..  |   1.224939   .1595075     1.56   0.119     .9490167    1.581085
T1DM, unc..  |   .9388468   .2742106    -0.22   0.829     .5296425    1.664204
T2DM, con..  |   1.034477   .0638572     0.55   0.583      .916594    1.167521
T2DM, unc..  |   1.091143   .1365692     0.70   0.486     .8537761    1.394503
Diabetes,..  |   1.28e-17   6.54e-18   -76.23   0.000     4.72e-18    3.49e-17
             |
cancer_exh~t |
  Last year  |   1.182349    .365166     0.54   0.588     .6454372    2.165896
2-5 years..  |   .9133491   .1762558    -0.47   0.639     .6257114    1.333213
   5+ years  |   1.031756   .0634868     0.51   0.611     .9145347    1.164002
             |
cancer_hae~t |
  Last year  |   .9786711   .2806086    -0.08   0.940     .5579262    1.716709
2-5 years..  |    .774654   .1633073    -1.21   0.226     .5124639    1.170988
   5+ years  |   .9515722   .0614446    -0.77   0.442     .8384521    1.079954
             |
1.~r_disease |   1.082443   .0596307     1.44   0.150     .9716579     1.20586
1.stroke_d~a |   1.123724   .0619578     2.12   0.034      1.00862    1.251963
1.other_ne~o |   .9227621   .0524776    -1.41   0.158      .825433    1.031568
             |
reduced_ki~t |
Stage 3a/..  |   1.091141    .132091     0.72   0.471       .86067    1.383329
      1.esrd |   .9844617   .0527084    -0.29   0.770     .8863907    1.093383
1.other_tr~t |   1.020868   .0618563     0.34   0.733     .9065541    1.149597
  1.asplenia |   1.092127   .0667505     1.44   0.149     .9688309    1.231114
1.ra_sle_p~s |   1.048321   .0595128     0.83   0.406     .9379328      1.1717
1.other_im~o |   1.161185    .064073     2.71   0.007     1.042157    1.293808
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .6438178   .2884042    -0.98   0.326     .2675835    1.549054
          1 #|
 only 12-18  |   1.163183   .8270066     0.21   0.832     .2887062    4.686409
    1#mixed  |   .5039126   .2076674    -1.66   0.096     .2246811     1.13017
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9410927   .1681474    -0.34   0.734     .6630496     1.33573
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7579757   .1836999    -1.14   0.253     .4713696    1.218847
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8533215   .1443998    -0.94   0.349     .6124514    1.188923
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 1_timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_1_timep
> eriod0.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       792        690 |     1,482 
         1 |     4,442      3,602 |     8,044 
-----------+----------------------+----------
     Total |     5,234      4,292 |     9,526 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -5884.5283
Iteration 1:   log pseudolikelihood = -5856.6639
Iteration 2:   log pseudolikelihood = -5854.4228
Iteration 3:   log pseudolikelihood =  -5854.388
Iteration 4:   log pseudolikelihood = -5854.3879
Refining estimates:
Iteration 0:   log pseudolikelihood = -5854.3879

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,591             Number of obs    =       2,591
No. of failures      =        1,111
Time at risk         =       137162
                                                Wald chi2(46)    =       76.69
Log pseudolikelihood =   -5854.3879             Prob > chi2      =      0.0030

                         (Std. Err. adjusted for 827 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.361716   .6066293     0.69   0.488     .5687035    3.260524
 only 12-18  |   1.102035   .6571683     0.16   0.871     .3424559    3.546386
      mixed  |    1.09598   .4257493     0.24   0.813     .5118483    2.346736
             |
        age1 |   .9729788   .0279492    -0.95   0.340      .919713     1.02933
        age2 |   1.185512   .1778147     1.13   0.257     .8835564     1.59066
        age3 |   .6917846   .2218883    -1.15   0.251     .3689351    1.297155
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.036859   .0607013     0.62   0.536     .9244581    1.162925
             |
   ethnicity |
Asian or ..  |   1.213089   .1248248     1.88   0.060     .9915294    1.484157
      Other  |   .8999317   .0893875    -1.06   0.288     .7407339    1.093344
             |
   obese4cat |
Obese I ..)  |   1.082493    .084742     1.01   0.311     .9285163    1.262004
Obese II..)  |   .8693827   .1055487    -1.15   0.249     .6852824    1.102941
Obese II..)  |   1.028624   .1546313     0.19   0.851     .7661206    1.381072
             |
smoke_nomiss |
     Former  |   1.052128   .2495354     0.21   0.830     .6609783    1.674749
    Current  |   .9701967   .0864086    -0.34   0.734     .8147967    1.155235
             |
         imd |
          4  |   .9175898   .0722409    -1.09   0.275     .7863835    1.070688
5 most de..  |   1.126139   .1077074     1.24   0.214     .9336422    1.358325
             |
tot_adults~h |
          2  |   1.980423   .7307901     1.85   0.064     .9608563    4.081853
          3  |    1.47006   .4491342     1.26   0.207     .8077462    2.675438
             |
    1.shield |    2.06022   .8016695     1.86   0.063     .9609382    4.417045
1.htdiag_o~p |   .9626303   .0647368    -0.57   0.571     .8437549    1.098254
1.~y_disease |   .8356097   .0685971    -2.19   0.029     .7114205    .9814779
    1.asthma |   .9167247   .1055866    -0.75   0.450     .7314744    1.148891
1.~c_disease |   1.028368   .0749892     0.38   0.701     .8914122    1.186366
             |
     diabcat |
T1DM, con..  |   .9813361   .1986004    -0.09   0.926     .6600149    1.459089
T1DM, unc..  |   .5938521   .3039312    -1.02   0.309     .2177893    1.619273
T2DM, con..  |   1.073233    .087813     0.86   0.388     .9142138    1.259912
T2DM, unc..  |   .9572807   .1561248    -0.27   0.789     .6953687    1.317842
Diabetes,..  |   1.234335   .8993052     0.29   0.773     .2959847    5.147506
             |
cancer_exh~t |
  Last year  |   1.356973   .4678349     0.89   0.376     .6904113     2.66707
2-5 years..  |   1.243688   .2693643     1.01   0.314     .8134929     1.90138
   5+ years  |   .9860627   .0803892    -0.17   0.863     .8404463    1.156909
             |
cancer_hae~t |
  Last year  |   .6306329   .3177099    -0.92   0.360     .2349336    1.692809
2-5 years..  |   1.035911   .2207623     0.17   0.869     .6822185    1.572974
   5+ years  |   .9262575   .0788093    -0.90   0.368     .7839862    1.094347
             |
1.~r_disease |   1.052636   .0799752     0.68   0.500     .9069997    1.221657
1.stroke_d~a |   .9940197   .0746094    -0.08   0.936     .8580356    1.151555
1.other_ne~o |   1.026583   .0778488     0.35   0.729     .8847992    1.191086
             |
reduced_ki~t |
Stage 3a/..  |   .8630354    .145558    -0.87   0.382     .6201067    1.201132
      1.esrd |   1.061601   .0753956     0.84   0.400     .9236525    1.220153
1.other_tr~t |   .9618319   .0782124    -0.48   0.632     .8201302    1.128017
  1.asplenia |   .9627909   .0750856    -0.49   0.627     .8263214    1.121799
1.ra_sle_p~s |   1.103702   .0880795     1.24   0.216     .9438926    1.290567
1.other_im~o |   1.133078   .0866907     1.63   0.102     .9752928    1.316389
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |    .314699   .1448078    -2.51   0.012     .1277078    .7754848
          1 #|
 only 12-18  |   .8170044    .543119    -0.30   0.761     .2220098    3.006606
    1#mixed  |   .4698753    .186335    -1.90   0.057     .2159871    1.022204
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4285307    .089114    -4.07   0.000     .2850837    .6441566
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9003674   .2435395    -0.39   0.698     .5298819    1.529891
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .514974    .097535    -3.50   0.000     .3552791    .7464506
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 1_timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_1_timep
> eriod1.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       792        690 |     1,482 
         1 |     4,442      3,602 |     8,044 
-----------+----------------------+----------
     Total |     5,234      4,292 |     9,526 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -3317.7293
Iteration 1:   log pseudolikelihood = -3295.1547
Iteration 2:   log pseudolikelihood = -3293.1668
Iteration 3:   log pseudolikelihood = -3293.1123
Iteration 4:   log pseudolikelihood = -3293.1121
Refining estimates:
Iteration 0:   log pseudolikelihood = -3293.1121

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,433             Number of obs    =       1,433
No. of failures      =          713
Time at risk         =        64384
                                                Wald chi2(46)    =       74.13
Log pseudolikelihood =   -3293.1121             Prob > chi2      =      0.0054

                         (Std. Err. adjusted for 663 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.12144   .5388006     0.24   0.811     .4373333    2.875673
 only 12-18  |   2.795074   1.505387     1.91   0.056     .9726317     8.03227
      mixed  |   .9252298   .3837972    -0.19   0.851     .4103555    2.086118
             |
        age1 |   .9794387   .0353073    -0.58   0.564     .9126257    1.051143
        age2 |   1.118859   .2103456     0.60   0.550     .7740147     1.61734
        age3 |   .7720925   .3096735    -0.64   0.519     .3517762    1.694619
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    1.02615   .0795495     0.33   0.739     .8815027    1.194532
             |
   ethnicity |
Asian or ..  |   1.087769   .1456589     0.63   0.530     .8366724    1.414222
      Other  |   .8623876   .1065231    -1.20   0.231      .676957    1.098611
             |
   obese4cat |
Obese I ..)  |    1.16075   .1232361     1.40   0.160     .9426861    1.429257
Obese II..)  |     1.0898   .1516502     0.62   0.537     .8296568    1.431512
Obese II..)  |   1.112671   .2054693     0.58   0.563     .7747851     1.59791
             |
smoke_nomiss |
     Former  |   .4080565   .1551048    -2.36   0.018     .1937195    .8595424
    Current  |   1.154726   .1309258     1.27   0.205      .924629    1.442084
             |
         imd |
          4  |   .8965734   .0885562    -1.11   0.269     .7387733    1.088079
5 most de..  |   .8303145   .1255386    -1.23   0.219     .6173707    1.116707
             |
tot_adults~h |
          2  |   1.130624   .7850114     0.18   0.860     .2899444    4.408815
          3  |   1.414271   .7361093     0.67   0.505     .5099098    3.922579
             |
    1.shield |   1.337821   .7731216     0.50   0.615     .4310142    4.152447
1.htdiag_o~p |   1.032566   .0841667     0.39   0.694     .8801047    1.211437
1.~y_disease |    .921553   .0877311    -0.86   0.391     .7646922    1.110591
    1.asthma |   1.086124   .1463297     0.61   0.540     .8340649    1.414356
1.~c_disease |   .9270465   .0839365    -0.84   0.403     .7763046    1.107059
             |
     diabcat |
T1DM, con..  |     1.5999   .3335437     2.25   0.024     1.063252    2.407407
T1DM, unc..  |   1.495969   .8113078     0.74   0.458     .5167628     4.33066
T2DM, con..  |   1.028513    .113981     0.25   0.800     .8277112     1.27803
T2DM, unc..  |   .9300738   .1876846    -0.36   0.719     .6262516    1.381293
Diabetes,..  |    2.37923    .678839     3.04   0.002     1.360105    4.161982
             |
cancer_exh~t |
  Last year  |   2.191405    .877491     1.96   0.050     .9997264     4.80357
2-5 years..  |   .7302004   .3162959    -0.73   0.468     .3124157    1.706677
   5+ years  |   .9254683   .0966681    -0.74   0.458     .7541381    1.135722
             |
cancer_hae~t |
  Last year  |   1.836377   .7460145     1.50   0.135     .8282617    4.071516
2-5 years..  |   .8717153   .2817888    -0.42   0.671     .4626122    1.642602
   5+ years  |   .9725281   .0980582    -0.28   0.782     .7981363    1.185024
             |
1.~r_disease |    1.08259   .1013893     0.85   0.397     .9010428    1.300717
1.stroke_d~a |   1.043882   .0995123     0.45   0.652     .8659784    1.258333
1.other_ne~o |   1.093358   .1055802     0.92   0.355     .9048282     1.32117
             |
reduced_ki~t |
Stage 3a/..  |   1.451578   .2625386     2.06   0.039     1.018329    2.069151
      1.esrd |    .909633   .0809197    -1.06   0.287     .7640899    1.082899
1.other_tr~t |   .8798317   .0937343    -1.20   0.229     .7140284    1.084136
  1.asplenia |    .805117   .0807866    -2.16   0.031     .6613757    .9800985
1.ra_sle_p~s |   1.049948   .1039944     0.49   0.623     .8646864    1.274902
1.other_im~o |   .8312413   .0862572    -1.78   0.075     .6782638    1.018722
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .6673037   .4284483    -0.63   0.529     .1895842    2.348795
          1 #|
 only 12-18  |    .230986   .1732961    -1.95   0.051     .0530855    1.005068
    1#mixed  |   .9274727   .5408868    -0.13   0.897     .2957293     2.90876
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .748341   .2809546    -0.77   0.440     .3585315    1.561966
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6456232   .2910254    -0.97   0.332     .2668614    1.561969
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8581253    .300896    -0.44   0.663     .4316011    1.706157
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 1_timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_1_timep
> eriod2.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       792        690 |     1,482 
         1 |     4,442      3,602 |     8,044 
-----------+----------------------+----------
     Total |     5,234      4,292 |     9,526 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1411.2689
Iteration 1:   log pseudolikelihood = -1398.8484
Iteration 2:   log pseudolikelihood = -1393.6844
Iteration 3:   log pseudolikelihood = -1393.3268
Iteration 4:   log pseudolikelihood = -1393.2733
Iteration 5:   log pseudolikelihood = -1393.2568
Iteration 6:   log pseudolikelihood = -1393.2508
Iteration 7:   log pseudolikelihood = -1393.2486
Iteration 8:   log pseudolikelihood = -1393.2478
Iteration 9:   log pseudolikelihood = -1393.2475
Iteration 10:  log pseudolikelihood = -1393.2474
Iteration 11:  log pseudolikelihood = -1393.2473
Iteration 12:  log pseudolikelihood = -1393.2473
Iteration 13:  log pseudolikelihood = -1393.2473
Iteration 14:  log pseudolikelihood = -1393.2473
Iteration 15:  log pseudolikelihood = -1393.2473
Iteration 16:  log pseudolikelihood = -1393.2473
Iteration 17:  log pseudolikelihood = -1393.2473
Iteration 18:  log pseudolikelihood = -1393.2473
Iteration 19:  log pseudolikelihood = -1393.2473
Iteration 20:  log pseudolikelihood = -1393.2473
Iteration 21:  log pseudolikelihood = -1393.2473
Iteration 22:  log pseudolikelihood = -1393.2473
Iteration 23:  log pseudolikelihood = -1393.2473
Iteration 24:  log pseudolikelihood = -1393.2473
Iteration 25:  log pseudolikelihood = -1393.2473
Iteration 26:  log pseudolikelihood = -1393.2473
Iteration 27:  log pseudolikelihood = -1393.2473
Iteration 28:  log pseudolikelihood = -1393.2473
Iteration 29:  log pseudolikelihood = -1393.2473
Iteration 30:  log pseudolikelihood = -1393.2473
Iteration 31:  log pseudolikelihood = -1393.2473
Iteration 32:  log pseudolikelihood = -1393.2473
Iteration 33:  log pseudolikelihood = -1393.2473
Iteration 34:  log pseudolikelihood = -1393.2473
Iteration 35:  log pseudolikelihood = -1393.2473
Refining estimates:
Iteration 0:   log pseudolikelihood = -1393.2473
Iteration 1:   log pseudolikelihood = -1393.2473
Iteration 2:   log pseudolikelihood = -1393.2473

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          679             Number of obs    =         679
No. of failures      =          367
Time at risk         =        22324
                                                Wald chi2(45)    =     2722.33
Log pseudolikelihood =   -1393.2473             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 446 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5332603   .3132292    -1.07   0.284     .1686383    1.686252
 only 12-18  |   2.676003   1.477527     1.78   0.075     .9067854    7.897118
      mixed  |   .3818494   .1825042    -2.01   0.044     .1496449    .9743664
             |
        age1 |   1.018323   .0527041     0.35   0.726     .9200912    1.127042
        age2 |   .9530731   .2552216    -0.18   0.858     .5638773    1.610897
        age3 |   1.078899   .6137846     0.13   0.894     .3537795    3.290247
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.089692   .1154326     0.81   0.417     .8853902    1.341136
             |
   ethnicity |
Asian or ..  |   1.079855   .2136958     0.39   0.698     .7326873    1.591521
      Other  |    1.07892   .1856468     0.44   0.659     .7700616    1.511657
             |
   obese4cat |
Obese I ..)  |   .8896709   .1443694    -0.72   0.471     .6472953    1.222802
Obese II..)  |   1.031399   .2005179     0.16   0.874     .7045984    1.509773
Obese II..)  |   1.099225   .2457399     0.42   0.672     .7092414    1.703645
             |
smoke_nomiss |
     Former  |   .8095428   .2613869    -0.65   0.513     .4299343    1.524325
    Current  |   .8093382   .1559362    -1.10   0.272     .5547891     1.18068
             |
         imd |
          4  |   1.094978   .1498759     0.66   0.507     .8373296    1.431905
5 most de..  |   1.167374   .2081625     0.87   0.385     .8230501    1.655745
             |
tot_adults~h |
          2  |   1.04e-16   1.07e-16   -35.71   0.000     1.38e-17    7.83e-16
          3  |   1.789356    1.30746     0.80   0.426     .4273017    7.493054
             |
    1.shield |   .6696244   .4189112    -0.64   0.521     .1964839    2.282105
1.htdiag_o~p |   .8275592   .0979036    -1.60   0.110      .656294    1.043517
1.~y_disease |   .9089826   .1141244    -0.76   0.447     .7106989    1.162587
    1.asthma |   .9293326   .1943544    -0.35   0.726     .6168173    1.400186
1.~c_disease |   .8908878   .1118151    -0.92   0.357     .6966087     1.13935
             |
     diabcat |
T1DM, con..  |   .9605881   .3651546    -0.11   0.916     .4559995    2.023532
T1DM, unc..  |   1.544454   1.143297     0.59   0.557     .3619634    6.589998
T2DM, con..  |   1.113036   .1683239     0.71   0.479     .8275274    1.497049
T2DM, unc..  |    1.47228   .3896945     1.46   0.144     .8763702    2.473392
             |
cancer_exh~t |
  Last year  |   2.412768   .8789085     2.42   0.016     1.181531     4.92704
2-5 years..  |   1.156849   .3256834     0.52   0.605     .6662556    2.008687
   5+ years  |   .8675176   .1323849    -0.93   0.352     .6432551    1.169966
             |
cancer_hae~t |
  Last year  |    .363944   .3111866    -1.18   0.237      .068112     1.94467
2-5 years..  |   .5747469   .2416772    -1.32   0.188      .252088    1.310392
   5+ years  |    1.10911   .1451145     0.79   0.429     .8582319    1.433325
             |
1.~r_disease |   .9806615   .1333511    -0.14   0.886     .7512286    1.280166
1.stroke_d~a |   1.040836   .1449354     0.29   0.774     .7922336    1.367449
1.other_ne~o |   .7831721   .1077826    -1.78   0.076     .5980153    1.025657
             |
reduced_ki~t |
Stage 3a/..  |    1.03651   .4343573     0.09   0.932     .4559017    2.356546
      1.esrd |   .9701713   .1194455    -0.25   0.806     .7621672    1.234942
1.other_tr~t |   .9819819    .137433    -0.13   0.897     .7464037    1.291913
  1.asplenia |   1.047987   .1386261     0.35   0.723     .8086499    1.358162
1.ra_sle_p~s |   .9956087   .1622674    -0.03   0.978     .7233645    1.370314
1.other_im~o |   1.072442    .136494     0.55   0.583     .8356765    1.376289
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |    2.05336   1.512052     0.98   0.329     .4849062    8.695057
          1 #|
 only 12-18  |   .4522971   .3809479    -0.94   0.346     .0867957    2.356945
    1#mixed  |   1.917246   1.236936     1.01   0.313     .5413953    6.789556
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.094975   .5275719     0.19   0.851     .4258783     2.81529
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.210348   .7834569     0.29   0.768     .3403524    4.304196
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7320994   .3422961    -0.67   0.505     .2928109    1.830429
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 1_timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_1_timep
> eriod3.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
  Probable |         case
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |       792        690 |     1,482 
         1 |     4,442      3,602 |     8,044 
-----------+----------------------+----------
     Total |     5,234      4,292 |     9,526 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
note: 1.shield#2.kids_cat4 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -531.74712
Iteration 1:   log pseudolikelihood = -513.90026
Iteration 2:   log pseudolikelihood = -512.93467
Iteration 3:   log pseudolikelihood = -512.85654
Iteration 4:   log pseudolikelihood = -512.82892
Iteration 5:   log pseudolikelihood = -512.81878
Iteration 6:   log pseudolikelihood = -512.81505
Iteration 7:   log pseudolikelihood = -512.81368
Iteration 8:   log pseudolikelihood = -512.81317
Iteration 9:   log pseudolikelihood = -512.81298
Iteration 10:  log pseudolikelihood = -512.81292
Iteration 11:  log pseudolikelihood = -512.81289
Iteration 12:  log pseudolikelihood = -512.81288
Iteration 13:  log pseudolikelihood = -512.81288
Iteration 14:  log pseudolikelihood = -512.81288
Iteration 15:  log pseudolikelihood = -512.81288
Iteration 16:  log pseudolikelihood = -512.81288
Iteration 17:  log pseudolikelihood = -512.81288
Iteration 18:  log pseudolikelihood = -512.81288
Iteration 19:  log pseudolikelihood = -512.81288
Iteration 20:  log pseudolikelihood = -512.81288
Iteration 21:  log pseudolikelihood = -512.81288
Iteration 22:  log pseudolikelihood = -512.81288
Iteration 23:  log pseudolikelihood = -512.81288
Iteration 24:  log pseudolikelihood = -512.81288
Iteration 25:  log pseudolikelihood = -512.81288
Iteration 26:  log pseudolikelihood = -512.81288
Iteration 27:  log pseudolikelihood = -512.81288
Iteration 28:  log pseudolikelihood = -512.81288
Iteration 29:  log pseudolikelihood = -512.81288
Iteration 30:  log pseudolikelihood = -512.81288
Iteration 31:  log pseudolikelihood = -512.81288
Iteration 32:  log pseudolikelihood = -512.81288
Iteration 33:  log pseudolikelihood = -512.81288
Iteration 34:  log pseudolikelihood = -512.81288
Iteration 35:  log pseudolikelihood = -512.81288
Refining estimates:
Iteration 0:   log pseudolikelihood = -512.81288
Iteration 1:   log pseudolikelihood = -512.81288
Iteration 2:   log pseudolikelihood = -512.81288
Iteration 3:   log pseudolikelihood = -512.81288
Iteration 4:   log pseudolikelihood = -512.81288

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          272             Number of obs    =         272
No. of failures      =          191
Time at risk         =         6473
                                                Wald chi2(42)    =     8065.90
Log pseudolikelihood =   -512.81288             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 236 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    3385771    2464913    20.65   0.000     812764.9    1.41e+07
 only 12-18  |   .7074502   .6067176    -0.40   0.687     .1317332    3.799237
      mixed  |    7159977    8094023    13.96   0.000     781029.8    6.56e+07
             |
        age1 |   1.066701   .0879888     0.78   0.434     .9074648    1.253879
        age2 |   .7117506   .3120661    -0.78   0.438     .3013836    1.680878
        age3 |   1.939213   1.796264     0.71   0.475     .3156242    11.91464
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.252118   .2152706     1.31   0.191     .8939278    1.753833
             |
   ethnicity |
Asian or ..  |    1.37772   .3274794     1.35   0.178     .8646357    2.195274
      Other  |   1.118143   .2854239     0.44   0.662     .6779764    1.844082
             |
   obese4cat |
Obese I ..)  |   1.182555   .2868953     0.69   0.489     .7350461    1.902516
Obese II..)  |   1.291352   .3510356     0.94   0.347     .7579802    2.200045
Obese II..)  |   1.547301   .5035853     1.34   0.180     .8176026    2.928244
             |
smoke_nomiss |
     Former  |   1.247403   .5820731     0.47   0.636     .4998183    3.113159
    Current  |   .8905201   .2459623    -0.42   0.675     .5182524    1.530193
             |
         imd |
          4  |   .8991916   .1591086    -0.60   0.548     .6356752    1.271948
5 most de..  |   2.134268   .5203646     3.11   0.002      1.32347    3.441786
             |
tot_adults~h |
          2  |   18.36342   25.04248     2.13   0.033      1.26811    265.9195
          3  |   7.505793   10.00413     1.51   0.130      .550642    102.3114
             |
    1.shield |   2.54e+07   2.04e+07    21.17   0.000      5236211    1.23e+08
1.htdiag_o~p |   1.094533   .1938646     0.51   0.610     .7735056    1.548797
1.~y_disease |   .6951614   .1465228    -1.73   0.085     .4599107    1.050746
    1.asthma |   1.185929   .3738459     0.54   0.589      .639338    2.199819
1.~c_disease |   1.169404   .2264741     0.81   0.419     .8000474    1.709282
             |
     diabcat |
T1DM, con..  |     .74269   .4119192    -0.54   0.592     .2504404    2.202473
T1DM, unc..  |   8.18e-18   9.55e-18   -33.70   0.000     8.30e-19    8.06e-17
T2DM, con..  |   1.331785   .3075486     1.24   0.215     .8469674    2.094121
T2DM, unc..  |   1.274443   .4485432     0.69   0.491     .6393489    2.540404
             |
cancer_exh~t |
2-5 years..  |   2.560741    1.00568     2.39   0.017     1.185969    5.529145
   5+ years  |   1.072209   .2352647     0.32   0.751     .6974427    1.648354
             |
cancer_hae~t |
  Last year  |   2.253817   1.275681     1.44   0.151     .7432428    6.834497
2-5 years..  |   .7724537   .5837387    -0.34   0.733     .1756404    3.397195
   5+ years  |   .8573804   .1912029    -0.69   0.490     .5537945     1.32739
             |
1.~r_disease |   .8708931   .1972171    -0.61   0.542     .5587364    1.357447
1.stroke_d~a |   1.223329     .24403     1.01   0.312     .8274572    1.808595
1.other_ne~o |   1.054937   .2162434     0.26   0.794     .7059034     1.57655
             |
reduced_ki~t |
Stage 3a/..  |   2.893161   1.112772     2.76   0.006     1.361389    6.148415
      1.esrd |    .646239   .1398725    -2.02   0.044     .4228229    .9877065
1.other_tr~t |   1.020104   .2611884     0.08   0.938     .6175927     1.68495
  1.asplenia |    .807943   .1800146    -0.96   0.338      .522069    1.250356
1.ra_sle_p~s |   1.347079   .3306316     1.21   0.225     .8326666    2.179289
1.other_im~o |   .7068185   .1699093    -1.44   0.149     .4412564    1.132204
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.40e-07          .        .       .            .           .
          1 #|
 only 12-18  |          1  (omitted)
    1#mixed  |   4.58e-08   3.90e-08   -19.84   0.000     8.63e-09    2.43e-07
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4728804   .3442669    -1.03   0.304     .1135164    1.969899
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1o.shield#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7074502   .6067176    -0.40   0.687     .1317332    3.799237
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3279523   .2440591    -1.50   0.134     .0762701    1.410156
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_
> 1_timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_shield_1_timep
> eriod4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_shield_covid_tpp_prob
> .log
  log type:  text
 closed on:  28 Oct 2021, 11:45:07
-------------------------------------------------------------------------------
