-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_shield_covidadmission
> .log
  log type:  text
 opened on:  28 Oct 2021, 11:45:30

. 
. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. foreach int_type in  shield  {
 19. 
. tab shield `outcome'
 20. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 21. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposu
> re_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id) 
 22. if _rc==0{
 23. *testparm 1.`int_type'#i.`exposure_type'
. di _n "`exposure_type' " _n "****************"
 24. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 25. di "`exposure_type'" _n "****************"
 26. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 27. di "`exposure_type'" _n "****************"
 28. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 29. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod`period', replace
 30. }
 31. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 32. }
 33. drop cat_time
 34. }
 35. }
 36. }
(29,573 observations (episodes) created)
(cat_time: 29573 changes made)
(covidadmission: 29573 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
  Probable |       admission
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,610        351 |     6,961 
         1 |    36,865      1,829 |    38,694 
-----------+----------------------+----------
     Total |    43,475      2,180 |    45,655 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -6966.0636
Iteration 1:   log pseudolikelihood =   -6950.28
Iteration 2:   log pseudolikelihood = -6949.8545
Iteration 3:   log pseudolikelihood =  -6949.853
Iteration 4:   log pseudolikelihood =  -6949.853
Refining estimates:
Iteration 0:   log pseudolikelihood =  -6949.853

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,065             Number of obs    =      16,065
No. of failures      =          964
Time at risk         =      1263881
                                                Wald chi2(46)    =       37.84
Log pseudolikelihood =    -6949.853             Prob > chi2      =      0.7985

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8764388   .5030102    -0.23   0.818     .2845743    2.699277
 only 12-18  |   .5752121   .5058138    -0.63   0.529     .1026414    3.223544
      mixed  |    .985118   .4862791    -0.03   0.976     .3743809    2.592166
             |
        age1 |   1.012929   .0123918     1.05   0.294     .9889304     1.03751
        age2 |   .9711197   .0376398    -0.76   0.450     .9000795    1.047767
        age3 |   1.066766   .1165586     0.59   0.554     .8611203    1.321522
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.052019   .0703137     0.76   0.448     .9228521    1.199266
             |
   ethnicity |
Asian or ..  |   1.020818    .116122     0.18   0.856     .8168097     1.27578
      Other  |   1.024564   .1125865     0.22   0.825     .8260438    1.270794
             |
   obese4cat |
Obese I ..)  |   1.029072   .0973149     0.30   0.762     .8549712    1.238627
Obese II..)  |   1.030346   .1157687     0.27   0.790     .8266901    1.284172
Obese II..)  |   .9419083    .137854    -0.41   0.683     .7070175    1.254836
             |
smoke_nomiss |
     Former  |   1.495214   .2914037     2.06   0.039     1.020497     2.19076
    Current  |   .9315402   .0952863    -0.69   0.488     .7623126    1.138335
             |
         imd |
          4  |   .9680828    .080176    -0.39   0.695     .8230317    1.138698
5 most de..  |   .9357053   .1062241    -0.59   0.558     .7490454     1.16888
             |
tot_adults~h |
          2  |   .8425177   .4261543    -0.34   0.735     .3126312    2.270522
          3  |   .5856719   .2313028    -1.35   0.176      .270075     1.27006
             |
    1.shield |   .8128188   .4805472    -0.35   0.726     .2551258    2.589603
1.htdiag_o~p |   1.069137   .0753124     0.95   0.343     .9312643    1.227422
1.~y_disease |   .9672029   .0839651    -0.38   0.701     .8158735    1.146601
    1.asthma |   .9390657    .122773    -0.48   0.631     .7267923    1.213338
1.~c_disease |   .9516639   .0803902    -0.59   0.558     .8064542     1.12302
             |
     diabcat |
T1DM, con..  |   .9983972   .1953457    -0.01   0.993     .6803899    1.465038
T1DM, unc..  |   1.699399   .6013277     1.50   0.134     .8493758    3.400092
T2DM, con..  |   .9006225   .0805781    -1.17   0.242     .7557643    1.073246
T2DM, unc..  |   1.070423   .1737473     0.42   0.675     .7787378    1.471361
Diabetes,..  |     1.8191    1.30106     0.84   0.403     .4477737    7.390171
             |
cancer_exh~t |
  Last year  |   1.263099   .7478493     0.39   0.693     .3957874    4.030998
2-5 years..  |   .5403089    .183262    -1.82   0.070     .2779276    1.050395
   5+ years  |   .9178138   .0821732    -0.96   0.338     .7700968    1.093865
             |
cancer_hae~t |
  Last year  |   .5435622   .3864773    -0.86   0.391      .134908    2.190084
2-5 years..  |    .957353   .2510793    -0.17   0.868     .5725752    1.600706
   5+ years  |   .8415736    .075633    -1.92   0.055     .7056573    1.003669
             |
1.~r_disease |   .9876094   .0795882    -0.15   0.877     .8433148    1.156593
1.stroke_d~a |   .8720621   .0729731    -1.64   0.102     .7401503    1.027484
1.other_ne~o |   1.049612    .079588     0.64   0.523     .9046604    1.217789
             |
reduced_ki~t |
Stage 3a/..  |   .9232723   .5494419    -0.13   0.893     .2875924    2.964027
      1.esrd |   .9963508   .0739387    -0.05   0.961     .8614796    1.152337
1.other_tr~t |   .9361724   .0776063    -0.80   0.426     .7957806    1.101332
  1.asplenia |    .975081   .0826212    -0.30   0.766     .8258784    1.151238
1.ra_sle_p~s |   1.133823   .0835933     1.70   0.088     .9812704    1.310092
1.other_im~o |   .9774619     .08218    -0.27   0.786     .8289631    1.152562
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.368785   .9224428     0.47   0.641     .3653417    5.128277
          1 #|
 only 12-18  |   2.553018   2.342701     1.02   0.307     .4226436    15.42174
    1#mixed  |   1.316278   .7780375     0.46   0.642     .4132492      4.1926
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.199657   .3431882     0.64   0.525     .6847815    2.101657
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.468527    .515896     1.09   0.274     .7376551    2.923549
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.29669   .3512846     0.96   0.338     .7624969    2.205129
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_
> 0_timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_0_timep
> eriod0.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
  Probable |       admission
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,610        351 |     6,961 
         1 |    36,865      1,829 |    38,694 
-----------+----------------------+----------
     Total |    43,475      2,180 |    45,655 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -3652.3094
Iteration 1:   log pseudolikelihood = -3629.1456
Iteration 2:   log pseudolikelihood =  -3624.667
Iteration 3:   log pseudolikelihood =  -3624.041
Iteration 4:   log pseudolikelihood = -3623.8845
Iteration 5:   log pseudolikelihood = -3623.8275
Iteration 6:   log pseudolikelihood = -3623.8066
Iteration 7:   log pseudolikelihood = -3623.7989
Iteration 8:   log pseudolikelihood =  -3623.796
Iteration 9:   log pseudolikelihood =  -3623.795
Iteration 10:  log pseudolikelihood = -3623.7946
Iteration 11:  log pseudolikelihood = -3623.7945
Iteration 12:  log pseudolikelihood = -3623.7944
Iteration 13:  log pseudolikelihood = -3623.7944
Iteration 14:  log pseudolikelihood = -3623.7944
Iteration 15:  log pseudolikelihood = -3623.7944
Iteration 16:  log pseudolikelihood = -3623.7944
Iteration 17:  log pseudolikelihood = -3623.7944
Iteration 18:  log pseudolikelihood = -3623.7944
Iteration 19:  log pseudolikelihood = -3623.7944
Iteration 20:  log pseudolikelihood = -3623.7944
Iteration 21:  log pseudolikelihood = -3623.7944
Iteration 22:  log pseudolikelihood = -3623.7944
Iteration 23:  log pseudolikelihood = -3623.7944
Iteration 24:  log pseudolikelihood = -3623.7944
Iteration 25:  log pseudolikelihood = -3623.7944
Iteration 26:  log pseudolikelihood = -3623.7944
Iteration 27:  log pseudolikelihood = -3623.7944
Iteration 28:  log pseudolikelihood = -3623.7944
Iteration 29:  log pseudolikelihood = -3623.7944
Iteration 30:  log pseudolikelihood = -3623.7944
Iteration 31:  log pseudolikelihood = -3623.7944
Iteration 32:  log pseudolikelihood = -3623.7944
Iteration 33:  log pseudolikelihood = -3623.7944
Iteration 34:  log pseudolikelihood = -3623.7944
Iteration 35:  log pseudolikelihood = -3623.7944
Refining estimates:
Iteration 0:   log pseudolikelihood = -3623.7944
Iteration 1:   log pseudolikelihood = -3623.7944
Iteration 2:   log pseudolikelihood = -3623.7944

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       11,439             Number of obs    =      11,439
No. of failures      =          529
Time at risk         =       684674
                                                Wald chi2(46)    =    93314.76
Log pseudolikelihood =   -3623.7944             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,069 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.059052   2.273734     0.65   0.513     .2364382    17.93152
 only 12-18  |   4.104125   4.501888     1.29   0.198     .4781039     35.2305
      mixed  |   2.475867   2.506235     0.90   0.370     .3404751    18.00401
             |
        age1 |   .9981115   .0155481    -0.12   0.903     .9680983    1.029055
        age2 |   .9839187   .0499558    -0.32   0.749     .8907212    1.086868
        age3 |   1.083641   .1575636     0.55   0.581     .8149272     1.44096
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.111747   .0951959     1.24   0.216     .9399828    1.314898
             |
   ethnicity |
Asian or ..  |    .782675   .1250798    -1.53   0.125     .5722033    1.070564
      Other  |   .8904413    .144644    -0.71   0.475     .6476426    1.224264
             |
   obese4cat |
Obese I ..)  |   1.212955   .1437325     1.63   0.103     .9615657    1.530066
Obese II..)  |   .7497422   .1286897    -1.68   0.093     .5355589    1.049583
Obese II..)  |   .9362086   .1924152    -0.32   0.748     .6257899    1.400608
             |
smoke_nomiss |
     Former  |   .7083897   .2510113    -0.97   0.331     .3537178     1.41869
    Current  |   .8041538   .1187924    -1.48   0.140     .6020003    1.074191
             |
         imd |
          4  |   .9428532   .1058768    -0.52   0.600     .7565876    1.174976
5 most de..  |   1.034981   .1462162     0.24   0.808     .7846559    1.365165
             |
tot_adults~h |
          2  |   2.259001   1.466384     1.26   0.209     .6329605    8.062249
          3  |   .7623535    .462006    -0.45   0.654     .2324375    2.500383
             |
    1.shield |   2.052543   2.141549     0.69   0.491     .2655704    15.86372
1.htdiag_o~p |   .8371468   .0792877    -1.88   0.061      .695317    1.007907
1.~y_disease |   .9196027   .1070232    -0.72   0.471     .7320446    1.155215
    1.asthma |   .6545079   .1286646    -2.16   0.031     .4452294     .962157
1.~c_disease |   .9464023   .1051147    -0.50   0.620     .7612631    1.176567
             |
     diabcat |
T1DM, con..  |   1.281508   .2985926     1.06   0.287     .8116911    2.023262
T1DM, unc..  |   8.07e-17   1.45e-17  -205.86   0.000     5.67e-17    1.15e-16
T2DM, con..  |   .9258448   .1125672    -0.63   0.526     .7295354    1.174979
T2DM, unc..  |   1.037727   .2465071     0.16   0.876     .6514544    1.653034
Diabetes,..  |   8.14e-17   2.73e-17  -110.40   0.000     4.22e-17    1.57e-16
             |
cancer_exh~t |
  Last year  |   2.292597   1.302129     1.46   0.144     .7531297    6.978879
2-5 years..  |   1.088253   .3510842     0.26   0.793     .5782577    2.048039
   5+ years  |   .9297731   .1140638    -0.59   0.553     .7310587    1.182501
             |
cancer_hae~t |
  Last year  |   .4969604   .4987333    -0.70   0.486     .0695158    3.552712
2-5 years..  |   1.093976   .3516018     0.28   0.780     .5826842    2.053914
   5+ years  |   .9245964     .11667    -0.62   0.534     .7220105    1.184025
             |
1.~r_disease |   1.072698   .1162301     0.65   0.517      .867455    1.326501
1.stroke_d~a |   1.071852   .1120086     0.66   0.507     .8733415    1.315483
1.other_ne~o |   1.009883   .1105248     0.09   0.928     .8149161    1.251495
             |
reduced_ki~t |
Stage 3a/..  |   9.35e-17   1.86e-17  -185.15   0.000     6.33e-17    1.38e-16
      1.esrd |   .9297691   .0910936    -0.74   0.457     .7673246    1.126604
1.other_tr~t |   .9074664   .1008313    -0.87   0.382     .7298793    1.128262
  1.asplenia |   1.001167   .1111678     0.01   0.992      .805361    1.244579
1.ra_sle_p~s |    .806834   .0892327    -1.94   0.052     .6495978    1.002129
1.other_im~o |   .8084798   .0987543    -1.74   0.082     .6363506    1.027169
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .6282854   .7233406    -0.40   0.686     .0657922    5.999836
          1 #|
 only 12-18  |   .2557961   .3064913    -1.14   0.255     .0244341    2.677884
    1#mixed  |   .5231925   .5459861    -0.62   0.535     .0676669    4.045264
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.293673   .4269369     0.78   0.435     .6775034    2.470229
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.049819   .4996169     0.10   0.919     .4130677    2.668135
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.295355   .3981042     0.84   0.400     .7092302    2.365867
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_
> 0_timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_0_timep
> eriod1.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
  Probable |       admission
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,610        351 |     6,961 
         1 |    36,865      1,829 |    38,694 
-----------+----------------------+----------
     Total |    43,475      2,180 |    45,655 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2386.9024
Iteration 1:   log pseudolikelihood = -2362.4299
Iteration 2:   log pseudolikelihood = -2356.1811
Iteration 3:   log pseudolikelihood = -2356.1149
Iteration 4:   log pseudolikelihood = -2356.1145
Refining estimates:
Iteration 0:   log pseudolikelihood = -2356.1145

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        8,402             Number of obs    =       8,402
No. of failures      =          363
Time at risk         =       434977
                                                Wald chi2(46)    =       83.94
Log pseudolikelihood =   -2356.1145             Prob > chi2      =      0.0005

                       (Std. Err. adjusted for 1,019 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.475731   1.646068     0.35   0.727     .1657888    13.13588
 only 12-18  |   3.359622   3.805654     1.07   0.285     .3648219    30.93854
      mixed  |   1.533795   1.511111     0.43   0.664       .22241    10.57743
             |
        age1 |   .9822399   .0196137    -0.90   0.370     .9445403    1.021444
        age2 |   1.071583   .0687072     1.08   0.281     .9450373    1.215074
        age3 |   .8124822   .1497823    -1.13   0.260     .5661005    1.166096
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.167685   .1216972     1.49   0.137     .9519466    1.432315
             |
   ethnicity |
Asian or ..  |   .8516705   .1645113    -0.83   0.406     .5832449    1.243633
      Other  |   1.080417   .1884668     0.44   0.657     .7675534    1.520807
             |
   obese4cat |
Obese I ..)  |   .9597415   .1489058    -0.26   0.791     .7080904    1.300828
Obese II..)  |   1.043976   .1950682     0.23   0.818     .7238397      1.5057
Obese II..)  |   1.014301   .2298102     0.06   0.950      .650594    1.581334
             |
smoke_nomiss |
     Former  |   .8380394   .3408457    -0.43   0.664     .3776291    1.859788
    Current  |   .6359243   .1140158    -2.52   0.012     .4474992     .903688
             |
         imd |
          4  |   1.049669   .1361945     0.37   0.709      .813971    1.353617
5 most de..  |   .8806412   .1597225    -0.70   0.483     .6171859    1.256557
             |
tot_adults~h |
          2  |   4.423244   4.844258     1.36   0.175     .5170351    37.84092
          3  |   1.247754   1.358832     0.20   0.839     .1476221    10.54646
             |
    1.shield |   .5482787   .6328713    -0.52   0.603     .0570782    5.266629
1.htdiag_o~p |   .9654153   .1095309    -0.31   0.756     .7729321    1.205832
1.~y_disease |    1.06052   .1488197     0.42   0.675     .8055125    1.396258
    1.asthma |   1.090802   .2153388     0.44   0.660     .7408111    1.606144
1.~c_disease |   .9786827   .1325432    -0.16   0.874     .7505221    1.276205
             |
     diabcat |
T1DM, con..  |   .9770334   .3190747    -0.07   0.943     .5151435    1.853065
T1DM, unc..  |   .6294073   .6163266    -0.47   0.636     .0923465     4.28986
T2DM, con..  |   .9337909   .1378567    -0.46   0.643     .6991748    1.247135
T2DM, unc..  |   1.274147   .3040878     1.02   0.310     .7981267    2.034076
Diabetes,..  |   7.191194   5.246706     2.70   0.007     1.720929    30.04962
             |
cancer_exh~t |
  Last year  |   1.083672   .9933509     0.09   0.930     .1797388    6.533622
2-5 years..  |   2.391383   .6924574     3.01   0.003     1.355727     4.21819
   5+ years  |   1.255444   .1764528     1.62   0.106     .9531496    1.653613
             |
cancer_hae~t |
  Last year  |   .8188864   .8016425    -0.20   0.838     .1202116    5.578287
2-5 years..  |   1.267118   .5335265     0.56   0.574     .5551548    2.892143
   5+ years  |   1.378208   .1857872     2.38   0.017     1.058205     1.79498
             |
1.~r_disease |   1.025792   .1356867     0.19   0.847     .7915289    1.329389
1.stroke_d~a |   .8498505   .1151746    -1.20   0.230     .6516057    1.108409
1.other_ne~o |    .898739   .1200516    -0.80   0.424     .6917226    1.167711
             |
reduced_ki~t |
Stage 3a/..  |   .7663197   .7539903    -0.27   0.787     .1114047    5.271285
      1.esrd |   .9451209   .1142327    -0.47   0.641     .7457724    1.197756
1.other_tr~t |   .9913674   .1361496    -0.06   0.950     .7574165    1.297581
  1.asplenia |   1.534882    .192991     3.41   0.001     1.199631    1.963823
1.ra_sle_p~s |   .9057242   .1146622    -0.78   0.434     .7067019    1.160796
1.other_im~o |   1.236046   .1701074     1.54   0.124     .9438229    1.618747
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.229199   1.585962     0.16   0.873      .098032    15.41263
          1 #|
 only 12-18  |   1.097943   1.460613     0.07   0.944     .0809492    14.89181
    1#mixed  |   1.124315    1.30147     0.10   0.919     .1162961    10.86953
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.813967   .8816392     1.23   0.220     .6997152    4.702593
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.688675   1.907989     2.52   0.012     1.338386    10.16622
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.724468   .7990333     1.18   0.240     .6954255    4.276219
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_
> 0_timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_0_timep
> eriod2.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
  Probable |       admission
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,610        351 |     6,961 
         1 |    36,865      1,829 |    38,694 
-----------+----------------------+----------
     Total |    43,475      2,180 |    45,655 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1264.5024
Iteration 1:   log pseudolikelihood =  -1233.033
Iteration 2:   log pseudolikelihood =  -1230.132
Iteration 3:   log pseudolikelihood = -1229.9165
Iteration 4:   log pseudolikelihood = -1229.8544
Iteration 5:   log pseudolikelihood = -1229.8316
Iteration 6:   log pseudolikelihood = -1229.8232
Iteration 7:   log pseudolikelihood = -1229.8201
Iteration 8:   log pseudolikelihood =  -1229.819
Iteration 9:   log pseudolikelihood = -1229.8185
Iteration 10:  log pseudolikelihood = -1229.8184
Iteration 11:  log pseudolikelihood = -1229.8183
Iteration 12:  log pseudolikelihood = -1229.8183
Iteration 13:  log pseudolikelihood = -1229.8183
Iteration 14:  log pseudolikelihood = -1229.8183
Iteration 15:  log pseudolikelihood = -1229.8183
Iteration 16:  log pseudolikelihood = -1229.8183
Iteration 17:  log pseudolikelihood = -1229.8183
Iteration 18:  log pseudolikelihood = -1229.8183
Iteration 19:  log pseudolikelihood = -1229.8183
Iteration 20:  log pseudolikelihood = -1229.8183
Iteration 21:  log pseudolikelihood = -1229.8183
Iteration 22:  log pseudolikelihood = -1229.8183
Iteration 23:  log pseudolikelihood = -1229.8183
Iteration 24:  log pseudolikelihood = -1229.8183
Iteration 25:  log pseudolikelihood = -1229.8183
Iteration 26:  log pseudolikelihood = -1229.8183
Iteration 27:  log pseudolikelihood = -1229.8183
Iteration 28:  log pseudolikelihood = -1229.8183
Iteration 29:  log pseudolikelihood = -1229.8183
Iteration 30:  log pseudolikelihood = -1229.8183
Refining estimates:
Iteration 0:   log pseudolikelihood = -1229.8183
Iteration 1:   log pseudolikelihood = -1229.8183

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,790             Number of obs    =       5,790
No. of failures      =          204
Time at risk         =       233836
                                                Wald chi2(45)    =    27279.72
Log pseudolikelihood =   -1229.8183             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 960 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .6693351    .770047    -0.35   0.727     .0702046    6.381485
 only 12-18  |   2.99e-09   2.02e-09   -29.17   0.000     8.01e-10    1.12e-08
      mixed  |   .5806727   .5885638    -0.54   0.592     .0796457    4.233509
             |
        age1 |   1.002775   .0278176     0.10   0.920     .9497096    1.058806
        age2 |   .9679222   .0870187    -0.36   0.717     .8115499    1.154425
        age3 |   1.156898   .2960799     0.57   0.569     .7005684    1.910466
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8875886   .1372391    -0.77   0.441     .6555393    1.201779
             |
   ethnicity |
Asian or ..  |   .6146255   .1701235    -1.76   0.079     .3572767    1.057344
      Other  |   .6199701   .1741871    -1.70   0.089     .3574511    1.075288
             |
   obese4cat |
Obese I ..)  |   1.086273   .2227936     0.40   0.687     .7267048    1.623751
Obese II..)  |    .971274   .2698807    -0.10   0.916     .5634102    1.674399
Obese II..)  |    .554769   .2112464    -1.55   0.122     .2630204    1.170132
             |
smoke_nomiss |
     Former  |   1.783847   .6686641     1.54   0.123     .8556374    3.718992
    Current  |   1.139592   .2431229     0.61   0.540     .7501575    1.731197
             |
         imd |
          4  |   .9322019   .1815585    -0.36   0.718     .6363959    1.365503
5 most de..  |   1.034978    .242238     0.15   0.883     .6541939    1.637405
             |
tot_adults~h |
          2  |   .9112079   .9000396    -0.09   0.925     .1314767    6.315187
          3  |   .6092839   .5083442    -0.59   0.553     .1187507    3.126102
             |
    1.shield |    1.05527   1.168216     0.05   0.961     .1205194     9.23996
1.htdiag_o~p |   .6470123   .1082002    -2.60   0.009     .4661929     .897965
1.~y_disease |   .9590186   .1797238    -0.22   0.823     .6642148    1.384667
    1.asthma |   .7187555   .2132005    -1.11   0.266     .4018777    1.285489
1.~c_disease |   1.009634   .1837472     0.05   0.958     .7067253    1.442373
             |
     diabcat |
T1DM, con..  |    1.34032   .4983982     0.79   0.431     .6466792    2.777972
T1DM, unc..  |   1.392929   1.354853     0.34   0.733     .2070118    9.372662
T2DM, con..  |   1.107345   .2184394     0.52   0.605     .7522665    1.630026
T2DM, unc..  |   .4309402   .2527447    -1.44   0.151     .1365182    1.360327
Diabetes,..  |   2.82e-14   2.09e-14   -42.12   0.000     6.61e-15    1.21e-13
             |
cancer_exh~t |
  Last year  |   2.94e-14   9.92e-15   -92.41   0.000     1.52e-14    5.69e-14
2-5 years..  |   1.952579   .7445702     1.75   0.079     .9247469     4.12282
   5+ years  |   .5165764   .1158713    -2.94   0.003     .3328165    .8017967
             |
cancer_hae~t |
  Last year  |   3.15e-14   8.82e-15  -110.90   0.000     1.82e-14    5.45e-14
2-5 years..  |   1.793028   .7588599     1.38   0.168       .78223    4.109978
   5+ years  |   .8968976    .180969    -0.54   0.590     .6039403    1.331962
             |
1.~r_disease |   1.145889   .1850375     0.84   0.399     .8350083    1.572512
1.stroke_d~a |   .7527767   .1465154    -1.46   0.145     .5140366    1.102398
1.other_ne~o |   .7177287    .131531    -1.81   0.070     .5011516    1.027901
             |
reduced_ki~t |
Stage 3a/..  |   1.119684   1.225792     0.10   0.918     .1309872    9.571107
      1.esrd |   .7720275   .1227757    -1.63   0.104     .5652832    1.054386
1.other_tr~t |   1.312863   .2150915     1.66   0.097     .9522779    1.809985
  1.asplenia |   .6724378    .137921    -1.93   0.053     .4498477    1.005168
1.ra_sle_p~s |   1.197197   .2067533     1.04   0.297     .8534241    1.679447
1.other_im~o |     .77216   .1437236    -1.39   0.165     .5361317    1.112098
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.811896   2.310714     0.47   0.641     .1487972    22.06338
          1 #|
 only 12-18  |   4.19e+08          .        .       .            .           .
    1#mixed  |   1.474312   1.660047     0.34   0.730     .1622382    13.39756
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.212766   .6293254     0.37   0.710      .438605    3.353361
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.255898   .8450416     0.34   0.735     .3359046    4.695616
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8560927   .4176708    -0.32   0.750     .3290306    2.227436
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_
> 0_timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_0_timep
> eriod3.ster saved
(no new episodes generated)
(cat_time: 29573 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,065       35.20       35.20
          1 |     11,439       25.06       60.27
          2 |      8,402       18.41       78.68
          3 |      5,790       12.69       91.36
          4 |      3,942        8.64      100.00
------------+-----------------------------------
      Total |     45,638      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    15,101        964 |    16,065 
         1 |    10,910        529 |    11,439 
         2 |     8,039        363 |     8,402 
         3 |     5,586        204 |     5,790 
         4 |     3,836        106 |     3,942 
-----------+----------------------+----------
     Total |    43,472      2,166 |    45,638 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
  Probable |       admission
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,610        351 |     6,961 
         1 |    36,865      1,829 |    38,694 
-----------+----------------------+----------
     Total |    43,475      2,180 |    45,655 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -618.16006
Iteration 1:   log pseudolikelihood = -610.69199
Iteration 2:   log pseudolikelihood = -603.16169
Iteration 3:   log pseudolikelihood = -602.09661
Iteration 4:   log pseudolikelihood =  -601.9686
Iteration 5:   log pseudolikelihood = -601.93394
Iteration 6:   log pseudolikelihood = -601.92122
Iteration 7:   log pseudolikelihood = -601.91654
Iteration 8:   log pseudolikelihood = -601.91482
Iteration 9:   log pseudolikelihood = -601.91419
Iteration 10:  log pseudolikelihood = -601.91396
Iteration 11:  log pseudolikelihood = -601.91387
Iteration 12:  log pseudolikelihood = -601.91384
Iteration 13:  log pseudolikelihood = -601.91383
Iteration 14:  log pseudolikelihood = -601.91382
Iteration 15:  log pseudolikelihood = -601.91382
Iteration 16:  log pseudolikelihood = -601.91382
Iteration 17:  log pseudolikelihood = -601.91382
Iteration 18:  log pseudolikelihood = -601.91382
Iteration 19:  log pseudolikelihood = -601.91382
Iteration 20:  log pseudolikelihood = -601.91382
Iteration 21:  log pseudolikelihood = -601.91382
Iteration 22:  log pseudolikelihood = -601.91382
Iteration 23:  log pseudolikelihood = -601.91382
Iteration 24:  log pseudolikelihood = -601.91382
Iteration 25:  log pseudolikelihood = -601.91382
Iteration 26:  log pseudolikelihood = -601.91382
Iteration 27:  log pseudolikelihood = -601.91382
Iteration 28:  log pseudolikelihood = -601.91382
Iteration 29:  log pseudolikelihood = -601.91382
Iteration 30:  log pseudolikelihood = -601.91382
Iteration 31:  log pseudolikelihood = -601.91382
Iteration 32:  log pseudolikelihood = -601.91382
Refining estimates:
Iteration 0:   log pseudolikelihood = -601.91382
Iteration 1:   log pseudolikelihood = -601.91382

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,942             Number of obs    =       3,942
No. of failures      =          106
Time at risk         =       119706
                                                Wald chi2(45)    =    52292.07
Log pseudolikelihood =   -601.91382             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 882 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5091354   .6390446    -0.54   0.591     .0434953      5.9597
 only 12-18  |   7.24e-10   7.81e-10   -19.51   0.000     8.75e-11    6.00e-09
      mixed  |   .3951315   .4153293    -0.88   0.377     .0503535    3.100658
             |
        age1 |   .9981431   .0370601    -0.05   0.960     .9280866    1.073488
        age2 |   .9785735   .1143383    -0.19   0.853      .778283    1.230409
        age3 |   1.070505   .3561155     0.20   0.838     .5577336    2.054709
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.372181   .2860117     1.52   0.129     .9119906    2.064583
             |
   ethnicity |
Asian or ..  |   .6938271   .2523777    -1.00   0.315     .3401175    1.415382
      Other  |   .6653979   .2714524    -1.00   0.318      .299109    1.480244
             |
   obese4cat |
Obese I ..)  |   1.112688   .3010271     0.39   0.693     .6547703    1.890853
Obese II..)  |   1.011847   .3548978     0.03   0.973     .5088177    2.012183
Obese II..)  |   1.285687   .4646273     0.70   0.487      .633176    2.610636
             |
smoke_nomiss |
     Former  |   .5036428   .5272962    -0.66   0.512      .064706     3.92013
    Current  |   1.246039   .3472383     0.79   0.430     .7216457    2.151489
             |
         imd |
          4  |   .7603937   .2026628    -1.03   0.304     .4509967    1.282046
5 most de..  |    1.23909   .3694862     0.72   0.472     .6906881    2.222921
             |
tot_adults~h |
          2  |   9.54e-16   7.16e-16   -46.09   0.000     2.19e-16    4.15e-15
          3  |   .1965024   .1513434    -2.11   0.035     .0434295    .8891014
             |
    1.shield |   .3059672   .3713567    -0.98   0.329     .0283504      3.3021
1.htdiag_o~p |   1.020328    .222091     0.09   0.926     .6659808    1.563211
1.~y_disease |   .9342732   .2615141    -0.24   0.808     .5397747    1.617094
    1.asthma |   1.008518   .3806856     0.02   0.982     .4812603    2.113425
1.~c_disease |   .8368877   .2160894    -0.69   0.490      .504524    1.388202
             |
     diabcat |
T1DM, con..  |   .7731645   .5620657    -0.35   0.723     .1859841    3.214164
T1DM, unc..  |   2.347989   2.161838     0.93   0.354      .386348    14.26965
T2DM, con..  |   .9460101   .2667276    -0.20   0.844     .5443766    1.643963
T2DM, unc..  |   .7461621    .434843    -0.50   0.615     .2381091    2.338247
Diabetes,..  |   3.60e-15   3.32e-15   -35.97   0.000     5.87e-16    2.20e-14
             |
cancer_exh~t |
  Last year  |   3.68e-15   1.76e-15   -69.37   0.000     1.44e-15    9.41e-15
2-5 years..  |   3.25e-15   6.84e-16  -158.68   0.000     2.15e-15    4.91e-15
   5+ years  |   .6273966   .1938018    -1.51   0.131     .3424581    1.149415
             |
cancer_hae~t |
  Last year  |   3.505197   2.606609     1.69   0.092     .8160631     15.0557
2-5 years..  |   .7417227   .7465795    -0.30   0.767     .1031493    5.333554
   5+ years  |   .7003606    .199967    -1.25   0.212     .4002088    1.225623
             |
1.~r_disease |   1.011607   .2590957     0.05   0.964     .6123498    1.671183
1.stroke_d~a |   .6236539   .1706955    -1.73   0.085     .3647269    1.066398
1.other_ne~o |   1.001599   .2445493     0.01   0.995     .6206764    1.616301
             |
reduced_ki~t |
Stage 3a/..  |   7.56e-15   3.40e-15   -72.30   0.000     3.13e-15    1.83e-14
      1.esrd |    1.01804    .224607     0.08   0.935     .6606433    1.568783
1.other_tr~t |   1.303688   .3372562     1.03   0.305      .785187    2.164584
  1.asplenia |   1.019968   .2492821     0.08   0.936     .6317584    1.646728
1.ra_sle_p~s |   1.057823    .266362     0.22   0.823     .6457714    1.732796
1.other_im~o |   .9591977   .2625852    -0.15   0.879     .5609026    1.640321
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |     2.0647   2.941018     0.51   0.611     .1265846    33.67698
          1 #|
 only 12-18  |   1.32e+09          .        .       .            .           .
    1#mixed  |   3.213112   3.961861     0.95   0.344     .2866615    36.01491
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.051212   .7357953     0.07   0.943     .2666195    4.144655
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9559586   1.030992    -0.04   0.967     .1154587    7.915013
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.269602   .8020405     0.38   0.706     .3680791    4.379189
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_
> 0_timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_0_timep
> eriod4.ster saved
(8,317 observations (episodes) created)
(cat_time: 8317 changes made)
(covidadmission: 8317 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
  Probable |       admission
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,976         97 |     2,073 
         1 |    10,271        524 |    10,795 
-----------+----------------------+----------
     Total |    12,247        621 |    12,868 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1557.2082
Iteration 1:   log pseudolikelihood = -1533.4624
Iteration 2:   log pseudolikelihood = -1531.4242
Iteration 3:   log pseudolikelihood = -1531.0207
Iteration 4:   log pseudolikelihood = -1530.8765
Iteration 5:   log pseudolikelihood = -1530.8236
Iteration 6:   log pseudolikelihood = -1530.8041
Iteration 7:   log pseudolikelihood = -1530.7969
Iteration 8:   log pseudolikelihood = -1530.7943
Iteration 9:   log pseudolikelihood = -1530.7933
Iteration 10:  log pseudolikelihood = -1530.7929
Iteration 11:  log pseudolikelihood = -1530.7928
Iteration 12:  log pseudolikelihood = -1530.7928
Iteration 13:  log pseudolikelihood = -1530.7928
Iteration 14:  log pseudolikelihood = -1530.7927
Iteration 15:  log pseudolikelihood = -1530.7927
Iteration 16:  log pseudolikelihood = -1530.7927
Iteration 17:  log pseudolikelihood = -1530.7927
Iteration 18:  log pseudolikelihood = -1530.7927
Iteration 19:  log pseudolikelihood = -1530.7927
Iteration 20:  log pseudolikelihood = -1530.7927
Iteration 21:  log pseudolikelihood = -1530.7927
Iteration 22:  log pseudolikelihood = -1530.7927
Iteration 23:  log pseudolikelihood = -1530.7927
Iteration 24:  log pseudolikelihood = -1530.7927
Iteration 25:  log pseudolikelihood = -1530.7927
Iteration 26:  log pseudolikelihood = -1530.7927
Iteration 27:  log pseudolikelihood = -1530.7927
Iteration 28:  log pseudolikelihood = -1530.7927
Iteration 29:  log pseudolikelihood = -1530.7927
Iteration 30:  log pseudolikelihood = -1530.7927
Iteration 31:  log pseudolikelihood = -1530.7927
Iteration 32:  log pseudolikelihood = -1530.7927
Iteration 33:  log pseudolikelihood = -1530.7927
Iteration 34:  log pseudolikelihood = -1530.7927
Iteration 35:  log pseudolikelihood = -1530.7927
Iteration 36:  log pseudolikelihood = -1530.7927
Refining estimates:
Iteration 0:   log pseudolikelihood = -1530.7927
Iteration 1:   log pseudolikelihood = -1530.7927

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,546             Number of obs    =       4,546
No. of failures      =          261
Time at risk         =       353856
                                                Wald chi2(44)    =    37052.50
Log pseudolikelihood =   -1530.7927             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   4.06e+08   2.36e+08    34.05   0.000     1.30e+08    1.27e+09
 only 12-18  |   .3547306   .2360024    -1.56   0.119     .0962928    1.306783
      mixed  |   1.62e+08   1.07e+08    28.60   0.000     4.45e+07    5.93e+08
             |
        age1 |   .9252015   .0533363    -1.35   0.177     .8263538    1.035873
        age2 |   1.508915   .4704397     1.32   0.187     .8189976    2.780013
        age3 |   .4050888    .272609    -1.34   0.179      .108324    1.514871
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    .840296   .1075044    -1.36   0.174     .6539321    1.079772
             |
   ethnicity |
Asian or ..  |   .9223021   .1985602    -0.38   0.707     .6048115    1.406457
      Other  |   .9961053   .2029728    -0.02   0.985     .6681268    1.485086
             |
   obese4cat |
Obese I ..)  |   .8306248   .1590674    -0.97   0.333     .5706857    1.208962
Obese II..)  |   .6944484   .1809162    -1.40   0.162     .4167607    1.157159
Obese II..)  |   1.162239   .3052339     0.57   0.567     .6946208    1.944656
             |
smoke_nomiss |
     Former  |   1.928573   .6432088     1.97   0.049     1.003107    3.707873
    Current  |   1.012386   .1892863     0.07   0.948     .7017727     1.46048
             |
         imd |
          4  |   .7471413   .1315891    -1.66   0.098     .5290372    1.055162
5 most de..  |   1.114059   .2356106     0.51   0.610     .7360187    1.686271
             |
tot_adults~h |
          2  |   2.056051   1.900673     0.78   0.436     .3358604    12.58662
          3  |   .8082355   .6273206    -0.27   0.784     .1765504    3.700046
             |
    1.shield |   2.11e+08   8.80e+07    46.01   0.000     9.33e+07    4.78e+08
1.htdiag_o~p |   .7426982   .1092882    -2.02   0.043     .5566188    .9909845
1.~y_disease |   .8741252   .1457268    -0.81   0.420     .6304759    1.211933
    1.asthma |   1.067608   .2319975     0.30   0.763     .6973337    1.634492
1.~c_disease |   1.074412   .1580035     0.49   0.626     .8053654    1.433339
             |
     diabcat |
T1DM, con..  |   .9668302   .3595925    -0.09   0.928     .4664052    2.004181
T1DM, unc..  |   8.08e-17   2.09e-17  -143.05   0.000     4.86e-17    1.34e-16
T2DM, con..  |   1.054626   .1742612     0.32   0.748     .7628688    1.457964
T2DM, unc..  |   .9091532   .3130359    -0.28   0.782     .4629721    1.785333
Diabetes,..  |   6.46e-17   3.57e-17   -67.49   0.000     2.19e-17    1.91e-16
             |
cancer_exh~t |
  Last year  |   .8095343   .7961641    -0.21   0.830     .1177856    5.563889
2-5 years..  |   .6921851   .4047078    -0.63   0.529     .2200597    2.177229
   5+ years  |   .8762312   .1593128    -0.73   0.467     .6135596    1.251356
             |
cancer_hae~t |
  Last year  |    1.18378   .8773947     0.23   0.820     .2769343     5.06017
2-5 years..  |   1.115682   .4851504     0.25   0.801     .4757717    2.616269
   5+ years  |   1.125712   .1869139     0.71   0.476     .8130052    1.558696
             |
1.~r_disease |   .7638864   .1334574    -1.54   0.123     .5423963    1.075823
1.stroke_d~a |   .9807579   .1614514    -0.12   0.906     .7102936    1.354209
1.other_ne~o |   1.053668   .1700759     0.32   0.746     .7679067    1.445769
             |
reduced_ki~t |
Stage 3a/..  |   .4452768   .2047002    -1.76   0.078     .1808507    1.096326
      1.esrd |   1.085098   .1514834     0.59   0.559     .8253507    1.426592
1.other_tr~t |   .7867654   .1319734    -1.43   0.153     .5663217    1.093018
  1.asplenia |   1.075912   .1723785     0.46   0.648     .7859598    1.472831
1.ra_sle_p~s |   .7986115   .1382521    -1.30   0.194     .5688258    1.121222
1.other_im~o |    1.16567   .1783074     1.00   0.316      .863716    1.573186
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   2.22e-09          .        .       .            .           .
          1 #|
 only 12-18  |    2.82872          .        .       .            .           .
    1#mixed  |   6.24e-09   2.68e-09   -43.89   0.000     2.68e-09    1.45e-08
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9016811   .5248551    -0.18   0.859     .2881252     2.82179
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.003434   .6675847     0.01   0.996     .2723854    3.696522
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.012766   .5711298     0.02   0.982     .3353441    3.058636
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_
> 1_timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_1_timep
> eriod0.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
  Probable |       admission
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,976         97 |     2,073 
         1 |    10,271        524 |    10,795 
-----------+----------------------+----------
     Total |    12,247        621 |    12,868 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -797.54704
Iteration 1:   log pseudolikelihood = -777.99108
Iteration 2:   log pseudolikelihood = -765.82388
Iteration 3:   log pseudolikelihood = -764.45248
Iteration 4:   log pseudolikelihood = -764.27544
Iteration 5:   log pseudolikelihood = -764.21909
Iteration 6:   log pseudolikelihood = -764.19839
Iteration 7:   log pseudolikelihood = -764.19078
Iteration 8:   log pseudolikelihood = -764.18798
Iteration 9:   log pseudolikelihood = -764.18695
Iteration 10:  log pseudolikelihood = -764.18657
Iteration 11:  log pseudolikelihood = -764.18643
Iteration 12:  log pseudolikelihood = -764.18638
Iteration 13:  log pseudolikelihood = -764.18636
Iteration 14:  log pseudolikelihood = -764.18636
Iteration 15:  log pseudolikelihood = -764.18635
Iteration 16:  log pseudolikelihood = -764.18635
Iteration 17:  log pseudolikelihood = -764.18635
Iteration 18:  log pseudolikelihood = -764.18635
Iteration 19:  log pseudolikelihood = -764.18635
Iteration 20:  log pseudolikelihood = -764.18635
Iteration 21:  log pseudolikelihood = -764.18635
Iteration 22:  log pseudolikelihood = -764.18635
Iteration 23:  log pseudolikelihood = -764.18635
Iteration 24:  log pseudolikelihood = -764.18635
Iteration 25:  log pseudolikelihood = -764.18635
Iteration 26:  log pseudolikelihood = -764.18635
Iteration 27:  log pseudolikelihood = -764.18635
Iteration 28:  log pseudolikelihood = -764.18635
Iteration 29:  log pseudolikelihood = -764.18635
Iteration 30:  log pseudolikelihood = -764.18635
Refining estimates:
Iteration 0:   log pseudolikelihood = -764.18635
Iteration 1:   log pseudolikelihood = -764.18635
Iteration 2:   log pseudolikelihood = -764.18635

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,195             Number of obs    =       3,195
No. of failures      =          142
Time at risk         =       190938
                                                Wald chi2(44)    =    26138.70
Log pseudolikelihood =   -764.18635             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 865 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.36e+08   1.96e+08    23.24   0.000     4.65e+07    1.20e+09
 only 12-18  |   .3795259     .38922    -0.94   0.345     .0508508    2.832597
      mixed  |   2.98e+08   3.42e+08    17.01   0.000     3.15e+07    2.83e+09
             |
        age1 |   1.020722    .077491     0.27   0.787     .8796016    1.184483
        age2 |    1.00546   .3895287     0.01   0.989     .4705412    2.148482
        age3 |   .9136851   .7524005    -0.11   0.913     .1819072    4.589265
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .8950381   .1554959    -0.64   0.523     .6367389    1.258119
             |
   ethnicity |
Asian or ..  |   1.126116   .2978618     0.45   0.653     .6705592    1.891163
      Other  |   1.140418   .3325988     0.45   0.652      .643894    2.019826
             |
   obese4cat |
Obese I ..)  |   1.166886   .2485222     0.72   0.469     .7686707    1.771399
Obese II..)  |   .4614078   .1836178    -1.94   0.052     .2115185    1.006518
Obese II..)  |   1.529418   .5229654     1.24   0.214     .7824717      2.9894
             |
smoke_nomiss |
     Former  |   4.570199    1.56214     4.45   0.000     2.338762    8.930676
    Current  |   .7295013   .2177931    -1.06   0.291     .4063491    1.309643
             |
         imd |
          4  |   1.391794   .3009802     1.53   0.126     .9109609    2.126426
5 most de..  |   .9545336   .2862755    -0.16   0.877     .5302811     1.71821
             |
tot_adults~h |
          2  |   2.174224    2.16775     0.78   0.436     .3080617    15.34515
          3  |   .5701941   .5071169    -0.63   0.528     .0997665    3.258824
             |
    1.shield |   2.06e+08   1.69e+08    23.30   0.000     4.11e+07    1.03e+09
1.htdiag_o~p |   1.375045   .2471826     1.77   0.076     .9667227    1.955832
1.~y_disease |   .9375599   .2086211    -0.29   0.772     .6061694     1.45012
    1.asthma |   1.548323   .3921684     1.73   0.084     .9424627    2.543659
1.~c_disease |   2.044491   .3787527     3.86   0.000     1.421987    2.939508
             |
     diabcat |
T1DM, con..  |   1.190166   .6474941     0.32   0.749     .4097535    3.456945
T1DM, unc..  |   1.55e-14   6.96e-15   -70.73   0.000     6.41e-15    3.73e-14
T2DM, con..  |   1.303927   .2892768     1.20   0.232     .8441385    2.014154
T2DM, unc..  |   .9399705   .4140977    -0.14   0.888     .3963904    2.228976
Diabetes,..  |   9.74e-15   6.74e-15   -46.64   0.000     2.51e-15    3.78e-14
             |
cancer_exh~t |
  Last year  |   1.63e-14   8.85e-15   -58.36   0.000     5.60e-15    4.73e-14
2-5 years..  |   .8441307   .6337309    -0.23   0.821     .1938074    3.676623
   5+ years  |   1.259834   .2562676     1.14   0.256     .8456044    1.876979
             |
cancer_hae~t |
  Last year  |   1.28e-14   4.30e-15   -95.15   0.000     6.62e-15    2.47e-14
2-5 years..  |   .8278419   .6005186    -0.26   0.795     .1997486    3.430924
   5+ years  |   .6636178   .1683394    -1.62   0.106     .4036402    1.091043
             |
1.~r_disease |   .9492114   .2184011    -0.23   0.821     .6046619    1.490093
1.stroke_d~a |   .6734222   .1659315    -1.60   0.109     .4154808      1.0915
1.other_ne~o |   .9806355    .214831    -0.09   0.929     .6383107    1.506548
             |
reduced_ki~t |
Stage 3a/..  |   1.242866   .4376308     0.62   0.537     .6233101    2.478246
      1.esrd |   1.062076   .1986463     0.32   0.747     .7361231     1.53236
1.other_tr~t |   1.207095   .2415707     0.94   0.347     .8154439    1.786852
  1.asplenia |   .9502793   .2133708    -0.23   0.820     .6119653    1.475624
1.ra_sle_p~s |   .9874246    .213636    -0.06   0.953     .6461609    1.508923
1.other_im~o |   .9660507   .2080338    -0.16   0.873     .6334294    1.473335
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   4.50e-09          .        .       .            .           .
          1 #|
 only 12-18  |   3.270288          .        .       .            .           .
    1#mixed  |   5.31e-09   4.51e-09   -22.42   0.000     1.00e-09    2.81e-08
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.062744    .881813     0.07   0.942     .2089983    5.403986
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.241159   1.272861     0.21   0.833     .1662969    9.263409
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.583584   1.315318     0.55   0.580     .3109112    8.065766
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_
> 1_timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_1_timep
> eriod1.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
  Probable |       admission
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,976         97 |     2,073 
         1 |    10,271        524 |    10,795 
-----------+----------------------+----------
     Total |    12,247        621 |    12,868 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood =  -612.4298
Iteration 1:   log pseudolikelihood = -589.81069
Iteration 2:   log pseudolikelihood = -587.39993
Iteration 3:   log pseudolikelihood = -586.71932
Iteration 4:   log pseudolikelihood =  -586.4685
Iteration 5:   log pseudolikelihood =  -586.3756
Iteration 6:   log pseudolikelihood = -586.34132
Iteration 7:   log pseudolikelihood =  -586.3287
Iteration 8:   log pseudolikelihood = -586.32405
Iteration 9:   log pseudolikelihood = -586.32234
Iteration 10:  log pseudolikelihood = -586.32171
Iteration 11:  log pseudolikelihood = -586.32148
Iteration 12:  log pseudolikelihood =  -586.3214
Iteration 13:  log pseudolikelihood = -586.32137
Iteration 14:  log pseudolikelihood = -586.32136
Iteration 15:  log pseudolikelihood = -586.32135
Iteration 16:  log pseudolikelihood = -586.32135
Iteration 17:  log pseudolikelihood = -586.32135
Iteration 18:  log pseudolikelihood = -586.32135
Iteration 19:  log pseudolikelihood = -586.32135
Iteration 20:  log pseudolikelihood = -586.32135
Iteration 21:  log pseudolikelihood = -586.32135
Iteration 22:  log pseudolikelihood = -586.32135
Iteration 23:  log pseudolikelihood = -586.32135
Iteration 24:  log pseudolikelihood = -586.32135
Iteration 25:  log pseudolikelihood = -586.32135
Iteration 26:  log pseudolikelihood = -586.32135
Iteration 27:  log pseudolikelihood = -586.32135
Iteration 28:  log pseudolikelihood = -586.32135
Iteration 29:  log pseudolikelihood = -586.32135
Iteration 30:  log pseudolikelihood = -586.32135
Iteration 31:  log pseudolikelihood = -586.32135
Iteration 32:  log pseudolikelihood = -586.32135
Iteration 33:  log pseudolikelihood = -586.32135
Iteration 34:  log pseudolikelihood = -586.32135
Iteration 35:  log pseudolikelihood = -586.32135
Iteration 36:  log pseudolikelihood = -586.32135
Iteration 37:  log pseudolikelihood = -586.32135
Iteration 38:  log pseudolikelihood = -586.32135
Iteration 39:  log pseudolikelihood = -586.32135
Iteration 40:  log pseudolikelihood = -586.32135
Refining estimates:
Iteration 0:   log pseudolikelihood = -586.32135
Iteration 1:   log pseudolikelihood = -586.32135
Iteration 2:   log pseudolikelihood = -586.32135
Iteration 3:   log pseudolikelihood = -586.32135
Iteration 4:   log pseudolikelihood = -586.32135
Iteration 5:   log pseudolikelihood = -586.32135

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,366             Number of obs    =       2,366
No. of failures      =          115
Time at risk         =       122287
                                                Wald chi2(38)    =     1545.94
Log pseudolikelihood =   -586.32135             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 804 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   3.76e+08   6.14e+08    12.09   0.000     1.53e+07    9.24e+09
 only 12-18  |   9.83e+08   1.14e+09    17.89   0.000     1.02e+08    9.50e+09
      mixed  |   3.52e+08   5.38e+08    12.88   0.000     1.76e+07    7.03e+09
             |
        age1 |   .9483267   .0751097    -0.67   0.503     .8119715     1.10758
        age2 |   1.254626   .5450571     0.52   0.602     .5354517    2.939737
        age3 |    .581631   .5487471    -0.57   0.566     .0915315    3.695936
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9416197   .1694315    -0.33   0.738     .6617799    1.339792
             |
   ethnicity |
Asian or ..  |   .7307997   .2610551    -0.88   0.380     .3628553    1.471849
      Other  |   .9452978   .2838727    -0.19   0.851     .5247508    1.702881
             |
   obese4cat |
Obese I ..)  |   .6660448   .2064006    -1.31   0.190     .3628479    1.222594
Obese II..)  |   1.299968    .383919     0.89   0.374     .7286978     2.31909
Obese II..)  |   1.049426   .4404781     0.11   0.908     .4609721    2.389069
             |
smoke_nomiss |
     Former  |   2.64e-20          .        .       .            .           .
    Current  |   .7046587   .2293574    -1.08   0.282     .3723262    1.333626
             |
         imd |
          4  |   .6367699   .1724991    -1.67   0.096     .3744506    1.082856
5 most de..  |   .6409577   .2285408    -1.25   0.212     .3186571    1.289244
             |
tot_adults~h |
          2  |   .0029947          .        .       .            .           .
          3  |   9.67e+16          .        .       .            .           .
             |
    1.shield |   3.23e+08   3.74e+08    16.90   0.000     3.32e+07    3.13e+09
1.htdiag_o~p |   .7639928   .1703343    -1.21   0.227     .4935277    1.182679
1.~y_disease |   .5809005   .1549066    -2.04   0.042     .3444411    .9796896
    1.asthma |   .9120593    .345476    -0.24   0.808     .4341095    1.916227
1.~c_disease |   1.356223   .2855557     1.45   0.148     .8976538    2.049054
             |
     diabcat |
T1DM, con..  |   1.352589   .6968501     0.59   0.558     .4927531    3.712808
T1DM, unc..  |   1.14e-19          .        .       .            .           .
T2DM, con..  |   .9321994   .2383464    -0.27   0.784     .5647705     1.53867
T2DM, unc..  |   .9148931   .4731734    -0.17   0.863     .3319996    2.521176
Diabetes,..  |   4.02e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   2.322196   2.363441     0.83   0.408     .3159212    17.06942
2-5 years..  |   .4294457   .4394096    -0.83   0.409     .0578039    3.190503
   5+ years  |   .6696134   .1931024    -1.39   0.164     .3805008      1.1784
             |
cancer_hae~t |
  Last year  |   7.05e-20          .        .       .            .           .
2-5 years..  |   2.26e-20          .        .       .            .           .
   5+ years  |   .9649532   .2548106    -0.14   0.893     .5750869     1.61912
             |
1.~r_disease |   1.217015    .287215     0.83   0.405     .7663241    1.932765
1.stroke_d~a |   .8082633   .1923809    -0.89   0.371     .5069345    1.288706
1.other_ne~o |   1.066039   .2472405     0.28   0.783     .6766412    1.679529
             |
reduced_ki~t |
Stage 3a/..  |   1.596317    .743011     1.00   0.315     .6410986    3.974786
      1.esrd |   .6395419   .1521878    -1.88   0.060     .4011566    1.019587
1.other_tr~t |   .8553138   .2115554    -0.63   0.527     .5267291    1.388877
  1.asplenia |   .7366755   .1850937    -1.22   0.224     .4502018    1.205439
1.ra_sle_p~s |    1.39604   .3167749     1.47   0.141     .8948533    2.177928
1.other_im~o |   .8483778   .2258388    -0.62   0.537     .5034992    1.429485
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   4.63e-09   6.16e-09   -14.43   0.000     3.42e-10    6.28e-08
          1 #|
 only 12-18  |   2.38e-09          .        .       .            .           .
    1#mixed  |   3.92e-09   4.60e-09   -16.50   0.000     3.93e-10    3.91e-08
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     1.7411   1.793538     0.54   0.590     .2311991    13.11177
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.342672   2.711065     0.74   0.462     .2424687    22.63431
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.379844   1.375052     0.32   0.747     .1956972    9.729163
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_
> 1_timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_1_timep
> eriod2.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
  Probable |       admission
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,976         97 |     2,073 
         1 |    10,271        524 |    10,795 
-----------+----------------------+----------
     Total |    12,247        621 |    12,868 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -352.69518
Iteration 1:   log pseudolikelihood = -350.56231
Iteration 2:   log pseudolikelihood = -326.36712
Iteration 3:   log pseudolikelihood = -325.40523
Iteration 4:   log pseudolikelihood = -325.12192
Iteration 5:   log pseudolikelihood = -325.01778
Iteration 6:   log pseudolikelihood = -324.97947
Iteration 7:   log pseudolikelihood = -324.96537
Iteration 8:   log pseudolikelihood = -324.96019
Iteration 9:   log pseudolikelihood = -324.95828
Iteration 10:  log pseudolikelihood = -324.95758
Iteration 11:  log pseudolikelihood = -324.95732
Iteration 12:  log pseudolikelihood = -324.95722
Iteration 13:  log pseudolikelihood = -324.95719
Iteration 14:  log pseudolikelihood = -324.95718
Iteration 15:  log pseudolikelihood = -324.95717
Iteration 16:  log pseudolikelihood = -324.95717
Iteration 17:  log pseudolikelihood = -324.95717
Iteration 18:  log pseudolikelihood = -324.95717
Iteration 19:  log pseudolikelihood = -324.95717
Iteration 20:  log pseudolikelihood = -324.95717
Iteration 21:  log pseudolikelihood = -324.95717
Iteration 22:  log pseudolikelihood = -324.95717
Iteration 23:  log pseudolikelihood = -324.95717
Iteration 24:  log pseudolikelihood = -324.95717
Iteration 25:  log pseudolikelihood = -324.95717
Iteration 26:  log pseudolikelihood = -324.95717
Iteration 27:  log pseudolikelihood = -324.95717
Iteration 28:  log pseudolikelihood = -324.95717
Iteration 29:  log pseudolikelihood = -324.95717
Iteration 30:  log pseudolikelihood = -324.95717
Iteration 31:  log pseudolikelihood = -324.95717
Iteration 32:  log pseudolikelihood = -324.95717
Iteration 33:  log pseudolikelihood = -324.95717
Iteration 34:  log pseudolikelihood = -324.95717
Iteration 35:  log pseudolikelihood = -324.95717
Iteration 36:  log pseudolikelihood = -324.95717
Iteration 37:  log pseudolikelihood = -324.95717
Iteration 38:  log pseudolikelihood = -324.95717
Iteration 39:  log pseudolikelihood = -324.95717
Iteration 40:  log pseudolikelihood = -324.95717
Iteration 41:  log pseudolikelihood = -324.95717
Iteration 42:  log pseudolikelihood = -324.95717
Iteration 43:  log pseudolikelihood = -324.95717
Iteration 44:  log pseudolikelihood = -324.95717
Iteration 45:  log pseudolikelihood = -324.95717
Refining estimates:
Iteration 0:   log pseudolikelihood = -324.95717

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,648             Number of obs    =       1,648
No. of failures      =           71
Time at risk         =        66414
                                                Wald chi2(38)    =     2271.36
Log pseudolikelihood =   -324.95717             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 706 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   6.96e+08   1.10e+09    12.91   0.000     3.16e+07    1.53e+10
 only 12-18  |   8.11e+09          .        .       .            .           .
      mixed  |   9.13e+08   1.12e+09    16.85   0.000     8.29e+07    1.01e+10
             |
        age1 |   1.239988    .139194     1.92   0.055     .9950992    1.545142
        age2 |   .4110906   .2326833    -1.57   0.116     .1355642    1.246609
        age3 |   5.379334   6.420904     1.41   0.159     .5184579    55.81404
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.116244   .2826138     0.43   0.664     .6795938    1.833448
             |
   ethnicity |
Asian or ..  |   1.324119   .5244148     0.71   0.478     .6092706    2.877688
      Other  |   .9538859   .3921452    -0.11   0.909     .4261525    2.135147
             |
   obese4cat |
Obese I ..)  |   1.088355   .3989257     0.23   0.817     .5306048     2.23239
Obese II..)  |    1.05757   .5044792     0.12   0.907     .4152132    2.693686
Obese II..)  |    3.23234   1.390692     2.73   0.006     1.390892    7.511743
             |
smoke_nomiss |
     Former  |   2.10e-20          .        .       .            .           .
    Current  |   .9371944   .3471127    -0.18   0.861     .4534888    1.936836
             |
         imd |
          4  |   .4452262   .1550591    -2.32   0.020      .224974    .8811078
5 most de..  |   .2902207    .183852    -1.95   0.051     .0838495    1.004515
             |
tot_adults~h |
          2  |   1.27e-20          .        .       .            .           .
          3  |   .1708555   .1940295    -1.56   0.120     .0184491     1.58228
             |
    1.shield |   .2791928   .3196529    -1.11   0.265     .0296039    2.633057
1.htdiag_o~p |   1.007043   .2549896     0.03   0.978     .6130817     1.65416
1.~y_disease |   .9416671   .2880925    -0.20   0.844     .5169897    1.715193
    1.asthma |   1.446779   .6036224     0.89   0.376     .6386534    3.277471
1.~c_disease |   1.220941   .3634705     0.67   0.503     .6812312    2.188239
             |
     diabcat |
T1DM, con..  |   .3656078   .4015156    -0.92   0.360     .0424829    3.146421
T1DM, unc..  |   5.11e-20          .        .       .            .           .
T2DM, con..  |   .6326955   .2400607    -1.21   0.228      .300765    1.330951
T2DM, unc..  |   .6895924   .4588473    -0.56   0.576     .1871596    2.540814
Diabetes,..  |   3.69e-19          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   32.25082   23.64532     4.74   0.000     7.664179    135.7113
2-5 years..  |   1.526972   1.087287     0.59   0.552     .3782065       6.165
   5+ years  |    .960913   .3387034    -0.11   0.910     .4815617    1.917416
             |
cancer_hae~t |
  Last year  |   1.08e-19          .        .       .            .           .
2-5 years..  |   8.29e-20          .        .       .            .           .
   5+ years  |   1.161524   .3850004     0.45   0.651     .6065793    2.224173
             |
1.~r_disease |   .5863146   .1980357    -1.58   0.114     .3024307    1.136673
1.stroke_d~a |   1.137072   .3267307     0.45   0.655     .6474409    1.996988
1.other_ne~o |   .6150277   .2096532    -1.43   0.154      .315307    1.199653
             |
reduced_ki~t |
Stage 3a/..  |   .8089747   .6095211    -0.28   0.778     .1847558    3.542189
      1.esrd |   .9180153   .2559284    -0.31   0.759     .5315549    1.585447
1.other_tr~t |   1.088762   .3651525     0.25   0.800     .5642274     2.10093
  1.asplenia |   .6163664      .2207    -1.35   0.177      .305529    1.243442
1.ra_sle_p~s |   .9157269   .2944904    -0.27   0.784     .4875581    1.719909
1.other_im~o |   .9474921   .3082873    -0.17   0.868     .5007472    1.792803
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   6.101367          .        .       .            .           .
          1 #|
 only 12-18  |   .7583213   1.466199    -0.14   0.886     .0171424    33.54549
    1#mixed  |   3.636728   4.283994     1.10   0.273     .3614201    36.59396
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   4.25e+09   6.70e+09    14.05   0.000     1.93e+08    9.35e+10
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   6.15e+09   1.19e+10    11.66   0.000     1.39e+08    2.72e+11
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.32e+09   5.36e+09    13.58   0.000     1.40e+08    7.86e+10
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_
> 1_timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_1_timep
> eriod3.ster saved
(no new episodes generated)
(cat_time: 8317 changes made)
(covidadmission: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,546       35.34       35.34
          1 |      3,195       24.84       60.18
          2 |      2,366       18.39       78.57
          3 |      1,648       12.81       91.39
          4 |      1,108        8.61      100.00
------------+-----------------------------------
      Total |     12,863      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,285        261 |     4,546 
         1 |     3,053        142 |     3,195 
         2 |     2,251        115 |     2,366 
         3 |     1,577         71 |     1,648 
         4 |     1,079         29 |     1,108 
-----------+----------------------+----------
     Total |    12,245        618 |    12,863 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
  Probable |       admission
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,976         97 |     2,073 
         1 |    10,271        524 |    10,795 
-----------+----------------------+----------
     Total |    12,247        621 |    12,868 

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -130.67699
Iteration 1:   log pseudolikelihood =  -119.8038
Iteration 2:   log pseudolikelihood = -109.35065
Iteration 3:   log pseudolikelihood = -107.74188
Iteration 4:   log pseudolikelihood = -107.07573
Iteration 5:   log pseudolikelihood = -106.93667
Iteration 6:   log pseudolikelihood = -106.88855
Iteration 7:   log pseudolikelihood = -106.87089
Iteration 8:   log pseudolikelihood =  -106.8644
Iteration 9:   log pseudolikelihood = -106.86201
Iteration 10:  log pseudolikelihood = -106.86113
Iteration 11:  log pseudolikelihood = -106.86081
Iteration 12:  log pseudolikelihood = -106.86069
Iteration 13:  log pseudolikelihood = -106.86065
Iteration 14:  log pseudolikelihood = -106.86063
Iteration 15:  log pseudolikelihood = -106.86062
Iteration 16:  log pseudolikelihood = -106.86062
Iteration 17:  log pseudolikelihood = -106.86062
Iteration 18:  log pseudolikelihood = -106.86062
Iteration 19:  log pseudolikelihood = -106.86062
Iteration 20:  log pseudolikelihood = -106.86062
Iteration 21:  log pseudolikelihood = -106.86062
Iteration 22:  log pseudolikelihood = -106.86062
Iteration 23:  log pseudolikelihood = -106.86062
Iteration 24:  log pseudolikelihood = -106.86062
Iteration 25:  log pseudolikelihood = -106.86062
Iteration 26:  log pseudolikelihood = -106.86062
Iteration 27:  log pseudolikelihood = -106.86062
Iteration 28:  log pseudolikelihood = -106.86062
Iteration 29:  log pseudolikelihood = -106.86062
Iteration 30:  log pseudolikelihood = -106.86062
Iteration 31:  log pseudolikelihood = -106.86062
Iteration 32:  log pseudolikelihood = -106.86062
Iteration 33:  log pseudolikelihood = -106.86062
Iteration 34:  log pseudolikelihood = -106.86062
Iteration 35:  log pseudolikelihood = -106.86062
Iteration 36:  log pseudolikelihood = -106.86062
Iteration 37:  log pseudolikelihood = -106.86062
Iteration 38:  log pseudolikelihood = -106.86062
Iteration 39:  log pseudolikelihood = -106.86062
Iteration 40:  log pseudolikelihood = -106.86062
Iteration 41:  log pseudolikelihood = -106.86062
Iteration 42:  log pseudolikelihood = -106.86062
Iteration 43:  log pseudolikelihood = -106.86062
Iteration 44:  log pseudolikelihood = -106.86062
Iteration 45:  log pseudolikelihood = -106.86062
Refining estimates:
Iteration 0:   log pseudolikelihood = -106.86062
Iteration 1:   log pseudolikelihood = -106.86062

Stratified Cox regr. -- no ties

No. of subjects      =        1,108             Number of obs    =       1,108
No. of failures      =           29
Time at risk         =        33205
                                                Wald chi2(33)    =    20961.66
Log pseudolikelihood =   -106.86062             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 593 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   5.30e-11          .        .       .            .           .
 only 12-18  |   7.44e-22          .        .       .            .           .
      mixed  |   .0139848   .0131377    -4.55   0.000     .0022183    .0881646
             |
        age1 |   .8149153   .1702675    -0.98   0.327     .5410823    1.227331
        age2 |   2.939616   3.087545     1.03   0.305     .3751927    23.03174
        age3 |   .1104522     .24087    -1.01   0.312     .0015378    7.933099
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.162886   .4279558     0.41   0.682     .5653077    2.392155
             |
   ethnicity |
Asian or ..  |   .3399532   .3010369    -1.22   0.223     .0599321    1.928319
      Other  |   1.137667    .650603     0.23   0.822     .3708807    3.489762
             |
   obese4cat |
Obese I ..)  |   .7137808   .4770603    -0.50   0.614      .192601    2.645278
Obese II..)  |   1.182535   .7516047     0.26   0.792     .3402519    4.109862
Obese II..)  |   1.401229   1.248313     0.38   0.705     .2444549    8.031918
             |
smoke_nomiss |
     Former  |   5.12e-20          .        .       .            .           .
    Current  |   .5893834    .408807    -0.76   0.446     .1513523    2.295127
             |
         imd |
          4  |   1.408537   .6236536     0.77   0.439     .5914038    3.354688
5 most de..  |   .7671284   .5608735    -0.36   0.717     .1830315    3.215217
             |
tot_adults~h |
          2  |    .005984          .        .       .            .           .
          3  |   2.05e+17          .        .       .            .           .
             |
    1.shield |   3.16e-11          .        .       .            .           .
1.htdiag_o~p |   1.550888   .6037233     1.13   0.260     .7231499     3.32608
1.~y_disease |   .8978845   .4237987    -0.23   0.819     .3560049    2.264566
    1.asthma |   4.119047   2.735426     2.13   0.033     1.120781    15.13815
1.~c_disease |    .951445   .4911296    -0.10   0.923     .3459387    2.616786
             |
     diabcat |
T1DM, con..  |   .7664095   .5290557    -0.39   0.700     .1980947    2.965165
T1DM, unc..  |   1.84e-19          .        .       .            .           .
T2DM, con..  |   .3601363   .2914285    -1.26   0.207     .0737326    1.759033
T2DM, unc..  |   4.049032   2.469941     2.29   0.022     1.224931    13.38415
Diabetes,..  |   1.32e-18          .        .       .            .           .
             |
cancer_exh~t |
  Last year  |   1.14e-18          .        .       .            .           .
2-5 years..  |   1.05e-19          .        .       .            .           .
   5+ years  |   1.232002   .7345598     0.35   0.726     .3829107    3.963926
             |
cancer_hae~t |
  Last year  |   5.226871   5.399267     1.60   0.109     .6901846    39.58387
2-5 years..  |   2.93e-19          .        .       .            .           .
   5+ years  |   .9999732    .592363    -0.00   1.000     .3131515    3.193171
             |
1.~r_disease |   1.267906   .7204632     0.42   0.676     .4163014    3.861588
1.stroke_d~a |   1.592564   .6795662     1.09   0.275     .6900474    3.675487
1.other_ne~o |   1.963429   .8569437     1.55   0.122      .834653    4.618749
             |
reduced_ki~t |
Stage 3a/..  |   5.15e-20          .        .       .            .           .
      1.esrd |   1.579282   .8203856     0.88   0.379     .5705428    4.371507
1.other_tr~t |   .5426962   .4091492    -0.81   0.418     .1238282     2.37845
  1.asplenia |   .3304026   .2504249    -1.46   0.144     .0747971    1.459493
1.ra_sle_p~s |    2.23702    1.06591     1.69   0.091     .8791923    5.691884
1.other_im~o |   .4181235   .3165946    -1.15   0.249     .0947965    1.844238
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   7.65e+18   7.92e+18    41.98   0.000     1.00e+18    5.82e+19
          1 #|
 only 12-18  |   3.33e+10          .        .       .            .           .
    1#mixed  |   1.97e+10   1.32e+10    35.47   0.000     5.31e+09    7.30e+10
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   4.05e+08   4.20e+08    19.13   0.000     5.32e+07    3.09e+09
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.47e-11          .        .       .            .           .
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.75e+08   2.77e+08    19.33   0.000     3.84e+07    1.98e+09
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_
> 1_timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_shield_1_timep
> eriod4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_shield_covidadmission
> .log
  log type:  text
 closed on:  28 Oct 2021, 11:46:38
-------------------------------------------------------------------------------
