-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b.log
  log type:  text
 opened on:  24 Nov 2021, 09:03:36

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  4. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  5.         
.         
. gen first_vacc_plus_7d=covid_vacc_date+7
  6. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
  7. format first_vacc_plus_7d second_vacc_plus_7d %td
  8.  
. stsplit vaccine, after(first_vacc_plus_7d) at(0)
  9. replace vaccine = vaccine +1
 10. stsplit vaccine2, after(second_vacc_plus_7d) at(0)
 11. replace vaccine=2 if vaccine==1 &vaccine2==0 & second_vacc_plus_7d!=.
 12. recode `outcome' .=0 
 13. 
. tab vaccine
 14. tab vaccine `outcome' if kids_cat4==0
 15. 
. foreach int_type in  vaccine  {
 16. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 17. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposu
> re_type' ///
>                         1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposu
> re_type' ///
>                         2.`int_type'#0.`exposure_type' 2.`int_type'#1.`exposu
> re_type' ///
>                         2.`int_type'#2.`exposure_type' 2.`int_type'#3.`exposu
> re_type'   ///
>                         , strata(stp) vce(cluster household_id) 
 18. if _rc==0 {
 19. *testparm 1.`int_type'#i.`exposure_type'
. di _n "`exposure_type' " _n "****************"
 20. lincom 0.`exposure_type' 
 21. lincom 1.`exposure_type' 
 22. lincom 2.`exposure_type' 
 23. lincom 3.`exposure_type' 
 24. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 25. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 26. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 27. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 28. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 29. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 30. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 31. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 32. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x', replace
 33. }
 34. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 35. }
 36. }
 37. }
(12,448 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,123  total observations
      3,296  observations end on or before enter()
------------------------------------------------------------------------------
     12,827  observations remaining, representing
     12,827  subjects
     11,047  failures in single-failure-per-subject data
    586,709  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(8,054 missing values generated)
(12,914 missing values generated)
(1,267 observations (episodes) created)
(14,094 real changes made)
(1,000 observations (episodes) created)
(792 real changes made)
(covid_tpp_prob: 2267 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,699       44.38       44.38
          1 |      7,603       50.37       94.75
          2 |        792        5.25      100.00
------------+-----------------------------------
      Total |     15,094      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |       154        111 |       265 
         1 |        88        295 |       383 
         2 |        10         40 |        50 
-----------+----------------------+----------
     Total |       252        446 |       698 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -68527.857
Iteration 1:   log pseudolikelihood = -67952.036
Iteration 2:   log pseudolikelihood = -67926.039
Iteration 3:   log pseudolikelihood = -67925.613
Iteration 4:   log pseudolikelihood = -67925.613
Refining estimates:
Iteration 0:   log pseudolikelihood = -67925.613

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,827             Number of obs    =      15,094
No. of failures      =       11,047
Time at risk         =       586709
                                                Wald chi2(50)    =      566.29
Log pseudolikelihood =   -67925.613             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 990 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.143378   .2734045     5.98   0.000      1.66925    2.752175
 only 12-18  |   1.320661   .2297706     1.60   0.110     .9390702    1.857311
      mixed  |   3.562319   .3859428    11.73   0.000     2.880802    4.405065
             |
        age1 |    .993663   .0033898    -1.86   0.062     .9870414    1.000329
        age2 |    1.02311   .0108325     2.16   0.031     1.002098    1.044563
        age3 |   .9356269   .0275292    -2.26   0.024      .883197    .9911692
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.000745   .0198442     0.04   0.970      .962597    1.040405
             |
   ethnicity |
Asian or ..  |   1.000886    .032202     0.03   0.978     .9397198    1.066033
      Other  |   1.036802   .0347699     1.08   0.281     .9708459     1.10724
             |
   obese4cat |
Obese I ..)  |   .9937111   .0286761    -0.22   0.827     .9390668    1.051535
Obese II..)  |   .9986895      .0354    -0.04   0.970      .931662    1.070539
Obese II..)  |   .9457489   .0392447    -1.34   0.179     .8718756    1.025882
             |
smoke_nomiss |
     Former  |   1.046177   .0697669     0.68   0.498     .9179955    1.192256
    Current  |    1.01171   .0288278     0.41   0.683     .9567575    1.069819
             |
         imd |
          4  |   1.028094    .022384     1.27   0.203     .9851447    1.072915
5 most de..  |   1.063045   .0321817     2.02   0.043     1.001805    1.128029
             |
tot_adults~h |
          2  |   .9272031   .1259123    -0.56   0.578     .7105317    1.209947
          3  |   1.238626   .1185884     2.24   0.025     1.026703    1.494293
             |
1.htdiag_o~p |    .983607    .019979    -0.81   0.416     .9452182    1.023555
1.~y_disease |   .9664495   .0228342    -1.44   0.149     .9227158    1.012256
    1.asthma |   1.009171   .0343105     0.27   0.788     .9441154    1.078709
1.~c_disease |   1.020438   .0255018     0.81   0.418     .9716598    1.071665
             |
     diabcat |
T1DM, con..  |   1.010265   .0620129     0.17   0.868     .8957484    1.139422
T1DM, unc..  |   1.024546   .1530084     0.16   0.871     .7645584    1.372942
T2DM, con..  |   .9973625   .0268735    -0.10   0.922     .9460579    1.051449
T2DM, unc..  |   1.005014   .0476969     0.11   0.916     .9157457    1.102984
Diabetes,..  |   .8384559   .4108779    -0.36   0.719     .3208902    2.190807
             |
cancer_exh~t |
  Last year  |   .7178967   .1248514    -1.91   0.057     .5105369    1.009478
2-5 years..  |   .9907448   .0828776    -0.11   0.911     .8409249    1.167257
   5+ years  |   .9647655   .0249902    -1.38   0.166     .9170083     1.01501
             |
cancer_hae~t |
  Last year  |   .9851444   .1647387    -0.09   0.929     .7098384    1.367226
2-5 years..  |    .993494   .0669695    -0.10   0.923     .8705373    1.133817
   5+ years  |   1.023963    .025753     0.94   0.346     .9747116    1.075702
             |
1.~r_disease |   .9947014   .0231384    -0.23   0.819     .9503693    1.041101
1.stroke_d~a |   .9618877   .0226685    -1.65   0.099     .9184688    1.007359
1.other_ne~o |   .9649106   .0221284    -1.56   0.119     .9225001    1.009271
             |
reduced_ki~t |
Stage 3a/..  |   .9634576   .1315076    -0.27   0.785     .7373054    1.258977
      1.esrd |   1.003837   .0217242     0.18   0.860      .962149    1.047332
1.other_tr~t |   1.042699   .0243556     1.79   0.073     .9960391    1.091544
  1.asplenia |   .9882465   .0208869    -0.56   0.576     .9481453    1.030044
1.ra_sle_p~s |    .984545   .0228688    -0.67   0.502      .940728    1.030403
1.other_im~o |   .9941397   .0233617    -0.25   0.802       .94939    1.040999
             |
     vaccine#|
   kids_cat4 |
     1#none  |   1.167872   .1310573     1.38   0.167     .9372903    1.455178
          1 #|
only <12 ..  |   .8985767   .0526726    -1.82   0.068     .8010499    1.007977
          1 #|
 only 12-18  |   1.144431   .1773144     0.87   0.384     .8447088    1.550501
    1#mixed  |   1.005467   .0212992     0.26   0.797     .9645764    1.048092
     2#none  |   1.247615   .2502884     1.10   0.270     .8420113      1.8486
          2 #|
only <12 ..  |   .9577326   .1000839    -0.41   0.679     .7803564    1.175427
          2 #|
 only 12-18  |   1.222296   .2807831     0.87   0.382     .7791843    1.917399
    2#mixed  |    1.00986   .0520362     0.19   0.849     .9128516    1.117177
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7623829   .1275578     5.98   0.000     .5123743    1.012392
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2781325   .1739815     1.60   0.110    -.0628651      .61913
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.270412   .1083403    11.73   0.000     1.058069    1.482755
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 1bn.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.167872   .1310573     1.38   0.167     .9372903    1.455178
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1bn.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.925989   .2279214     5.54   0.000     1.527294    2.428762
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1bn.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.511405   .2256347     2.77   0.006     1.127994     2.02514
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1bn.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.581796   .3873016    11.80   0.000     2.897743    4.427328
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.247615   .2502884     1.10   0.270     .8420113      1.8486
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.052783   .2761058     5.35   0.000      1.57708    2.671974
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.614239   .3521263     2.20   0.028     1.052661    2.475409
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.597442   .4166379    11.05   0.000     2.866896    4.514148
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine
> _0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine_0.ster
>  saved
(3,477 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,508  total observations
        922  observations end on or before enter()
------------------------------------------------------------------------------
      3,586  observations remaining, representing
      3,586  subjects
      3,066  failures in single-failure-per-subject data
    159,773  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(2,281 missing values generated)
(3,598 missing values generated)
(363 observations (episodes) created)
(3,949 real changes made)
(310 observations (episodes) created)
(238 real changes made)
(covid_tpp_prob: 673 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,883       44.21       44.21
          1 |      2,138       50.20       94.41
          2 |        238        5.59      100.00
------------+-----------------------------------
      Total |      4,259      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |        44         30 |        74 
         1 |        37         85 |       122 
         2 |         4         19 |        23 
-----------+----------------------+----------
     Total |        85        134 |       219 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -15136.478
Iteration 1:   log pseudolikelihood = -14964.267
Iteration 2:   log pseudolikelihood = -14956.233
Iteration 3:   log pseudolikelihood = -14956.134
Iteration 4:   log pseudolikelihood = -14956.134
Refining estimates:
Iteration 0:   log pseudolikelihood = -14956.134

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,586             Number of obs    =       4,259
No. of failures      =        3,066
Time at risk         =       159773
                                                Wald chi2(50)    =      305.38
Log pseudolikelihood =   -14956.134             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 782 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.829432   .3954775     2.79   0.005     1.197589    2.794633
 only 12-18  |    .967025   .2776656    -0.12   0.907     .5508444    1.697643
      mixed  |   3.190012   .6168586     6.00   0.000     2.183705    4.660052
             |
        age1 |   1.005702   .0157588     0.36   0.717      .975285    1.037068
        age2 |   .9689877   .0704382    -0.43   0.665     .8403152    1.117363
        age3 |   1.089822   .1914882     0.49   0.624     .7723152     1.53786
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.031007   .0352337     0.89   0.372     .9642123    1.102429
             |
   ethnicity |
Asian or ..  |   .9826534    .056928    -0.30   0.763      .877178    1.100812
      Other  |   .9391126   .0560096    -1.05   0.292     .8355091    1.055563
             |
   obese4cat |
Obese I ..)  |   .9551278   .0485221    -0.90   0.366     .8646075    1.055125
Obese II..)  |   1.032537   .0619001     0.53   0.593     .9180711    1.161274
Obese II..)  |    .993399   .0843859    -0.08   0.938     .8410407    1.173358
             |
smoke_nomiss |
     Former  |   1.128134   .1284308     1.06   0.290     .9025196    1.410147
    Current  |   1.039849   .0580719     0.70   0.484     .9320384    1.160131
             |
         imd |
          4  |   .9663206   .0426011    -0.78   0.437     .8863296    1.053531
5 most de..  |    .908206    .055457    -1.58   0.115     .8057645    1.023671
             |
tot_adults~h |
          2  |   1.572542   .4882752     1.46   0.145     .8556649     2.89002
          3  |    1.06083   .2138361     0.29   0.770     .7146043    1.574803
             |
1.htdiag_o~p |   .9927498   .0385201    -0.19   0.851     .9200512    1.071193
1.~y_disease |   .9544618   .0422248    -1.05   0.292     .8751891    1.040915
    1.asthma |   .9870107   .0706654    -0.18   0.855     .8577876    1.135701
1.~c_disease |   .9419314   .0435937    -1.29   0.196       .86025    1.031368
             |
     diabcat |
T1DM, con..  |   .9540869   .0991109    -0.45   0.651     .7783318    1.169529
T1DM, unc..  |   1.499243   .2628858     2.31   0.021     1.063207    2.114105
T2DM, con..  |   1.009862   .0503401     0.20   0.844     .9158641    1.113508
T2DM, unc..  |   1.159049   .0976106     1.75   0.080     .9826908    1.367057
Diabetes,..  |   1.314831   .6499481     0.55   0.580     .4990034    3.464467
             |
cancer_exh~t |
  Last year  |   .4750687   .2526156    -1.40   0.162     .1675459    1.347035
2-5 years..  |   1.166062   .1316722     1.36   0.174     .9345524    1.454922
   5+ years  |   .9960057   .0449977    -0.09   0.929     .9116038    1.088222
             |
cancer_hae~t |
  Last year  |   .6325896    .334512    -0.87   0.386     .2243926    1.783346
2-5 years..  |   1.133759   .1189495     1.20   0.231       .92303    1.392597
   5+ years  |   1.093131   .0516305     1.89   0.059     .9964802    1.199157
             |
1.~r_disease |    1.09431   .0478088     2.06   0.039     1.004506    1.192142
1.stroke_d~a |   1.044126   .0493395     0.91   0.361     .9517655    1.145449
1.other_ne~o |   1.030606   .0494693     0.63   0.530     .9380688    1.132271
             |
reduced_ki~t |
Stage 3a/..  |   1.023707   .0934149     0.26   0.797     .8560555    1.224191
      1.esrd |   .9318753     .03618    -1.82   0.069     .8635947    1.005555
1.other_tr~t |   .9647326   .0465423    -0.74   0.457     .8776913    1.060406
  1.asplenia |   1.005159    .040985     0.13   0.900     .9279564    1.088786
1.ra_sle_p~s |   .9783618   .0434756    -0.49   0.623     .8967565    1.067393
1.other_im~o |   1.058191   .0445309     1.34   0.179     .9744143     1.14917
             |
     vaccine#|
   kids_cat4 |
     1#none  |   .8670361   .1857839    -0.67   0.506     .5697001    1.319557
          1 #|
only <12 ..  |   1.030517   .1168019     0.27   0.791     .8252345    1.286865
          1 #|
 only 12-18  |   1.327017   .3165213     1.19   0.236     .8314709    2.117902
    1#mixed  |   1.012882   .0425329     0.30   0.761     .9328569    1.099771
     2#none  |   .9652209   .2704466    -0.13   0.899     .5573492    1.671576
          2 #|
only <12 ..  |   1.301485   .2310706     1.48   0.138     .9189964    1.843168
          2 #|
 only 12-18  |   .8684384   .3985307    -0.31   0.759     .3532795    2.134812
    2#mixed  |   .9098522   .0758726    -1.13   0.257     .7726612    1.071402
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6040054   .2161751     2.79   0.005       .18031    1.027701
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.033531   .2871338    -0.12   0.907    -.5963029     .529241
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.160025   .1933719     6.00   0.000     .7810228    1.539027
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 1bn.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8670361   .1857839    -0.67   0.506     .5697001    1.319557
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1bn.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.88526   .3913647     3.05   0.002     1.255072    2.831874
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1bn.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.283258   .3293922     0.97   0.331     .7759327    2.122287
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1bn.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.231105   .6198524     6.11   0.000     2.218489    4.705923
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9652209   .2704466    -0.13   0.899     .5573492    1.671576
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.380979   .5787659     3.57   0.000     1.478585    3.834111
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8398016   .3501992    -0.42   0.675     .3708717    1.901646
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.902439   .5900056     5.24   0.000      1.94864    4.323095
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine
> _1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine_1.ster
>  saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b.log
  log type:  text
 closed on:  24 Nov 2021, 09:03:42
-------------------------------------------------------------------------------
