-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covidadmissio
> n.log
  log type:  text
 opened on:  17 Aug 2021, 07:53:47

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  4. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  5.         
.         
. gen first_vacc_plus_14d=covid_vacc_date+14
  6. gen second_vacc_plus_14d=covid_vacc_second_dose_date+14
  7. format first_vacc_plus_14d second_vacc_plus_14d %td
  8. 
. stsplit vaccine, after(first_vacc_plus_14d) at(0)
  9. replace vaccine = vaccine +1
 10. stsplit vaccine2, after(second_vacc_plus_14d) at(2)
 11. replace vaccine2 = vaccine2 +1
 12. replace vaccine=2 if vaccine2==2
 13. 
. bysort patient: replace vaccine=0 if _N==1
 14. sort patient vaccine
 15. bysort patient: replace vaccine=2 if _N==3 & vaccine2==3
 16. 
. recode `outcome' .=0 
 17. tab vaccine
 18. tab vaccine `outcome'
 19. recode vaccine 1=0 2=1
 20. 
. foreach int_type in  vaccine  {
 21. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 22. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 23. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ///
> interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type' 1.`
> int_type'#3.`exposure_type')
 24. if _rc==0{
 25. testparm 1.`int_type'#i.`exposure_type'
 26. di _n "`exposure_type' " _n "****************"
 27. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 28. di "`exposure_type'" _n "****************"
 29. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 30. di "`exposure_type'" _n "****************"
 31. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 32. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod1, replace
 33. }
 34. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 35. }
 36. }
 37. }
(12,669 real changes made)

                id:  patient_id
     failure event:  covidadmission != 0 & covidadmission < .
obs. time interval:  (stime_covidadmission[_n-1], stime_covidadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,149  total observations
      3,450  observations end on or before enter()
------------------------------------------------------------------------------
     12,699  observations remaining, representing
     12,699  subjects
      1,470  failures in single-failure-per-subject data
    600,160  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       178
(8,075 missing values generated)
(12,912 missing values generated)
(1,316 observations (episodes) created)
(14,015 real changes made)
(1,058 observations (episodes) created)
(15,073 real changes made)
(0 real changes made)
(9,238 real changes made)
(312 real changes made)
(covidadmission: 2374 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,898       85.83       85.83
          1 |      2,313       12.49       98.32
          2 |        312        1.68      100.00
------------+-----------------------------------
      Total |     18,523      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid SUS
observatio |       admission
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    14,170      1,728 |    15,898 
         1 |     2,158        155 |     2,313 
         2 |       295         17 |       312 
-----------+----------------------+----------
     Total |    16,623      1,900 |    18,523 
(vaccine: 2625 changes made)

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -9346.7898
Iteration 1:   log pseudolikelihood = -9283.6387
Iteration 2:   log pseudolikelihood = -9281.5307
Iteration 3:   log pseudolikelihood = -9281.4761
Iteration 4:   log pseudolikelihood =  -9281.476
Refining estimates:
Iteration 0:   log pseudolikelihood =  -9281.476

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,699             Number of obs    =      15,073
No. of failures      =        1,470
Time at risk         =       600160
                                                Wald chi2(42)    =      111.01
Log pseudolikelihood =    -9281.476             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 975 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.369745     .21201     2.03   0.042     1.011323    1.855193
 only 12-18  |   1.176823   .2556234     0.75   0.454     .7688075    1.801378
      mixed  |   2.077688   .2685968     5.66   0.000     1.612649    2.676831
             |
        age1 |   1.003951   .0100428     0.39   0.693     .9844589    1.023829
        age2 |   .9643051    .030764    -1.14   0.255     .9058552    1.026526
        age3 |   1.123554   .1014133     1.29   0.197     .9413765    1.340986
      1.male |   1.105046   .0608592     1.81   0.070     .9919766    1.231004
             |
   ethnicity |
Asian or ..  |   .9677107   .0829374    -0.38   0.702     .8180758    1.144715
      Other  |   .9245995   .0876096    -0.83   0.408     .7678897     1.11329
             |
   obese4cat |
Obese I ..)  |   .9777697   .0767879    -0.29   0.775     .8382789    1.140472
Obese II..)  |   .9323978   .0910067    -0.72   0.473     .7700514    1.128971
Obese II..)  |    .789915    .095551    -1.95   0.051     .6231834    1.001255
             |
smoke_nomiss |
     Former  |    1.03744   .1881147     0.20   0.839     .7271403    1.480157
    Current  |   .9913372   .0815959    -0.11   0.916     .8436453    1.164885
             |
         imd |
          4  |   .9807856   .0638404    -0.30   0.766     .8633133    1.114243
5 most de..  |   .9892108     .08587    -0.12   0.901     .8344474    1.172678
             |
tot_adults~h |
          2  |   .6174408   .3158852    -0.94   0.346     .2265256    1.682958
          3  |   1.486011   .4758102     1.24   0.216     .7933659    2.783369
             |
1.htdiag_o~p |    .925633   .0525923    -1.36   0.174     .8280862    1.034671
1.~y_disease |   .9737397   .0666917    -0.39   0.698       .85142    1.113632
    1.asthma |    1.18014   .1045742     1.87   0.062     .9919892    1.403976
1.~c_disease |   1.122371   .0719543     1.80   0.072     .9898439    1.272643
             |
     diabcat |
T1DM, con..  |   1.042505   .1829768     0.24   0.813     .7390573    1.470544
T1DM, unc..  |    .643667   .3155862    -0.90   0.369     .2462193    1.682676
T2DM, con..  |   1.125248    .077791     1.71   0.088     .9826584    1.288527
T2DM, unc..  |   1.117444   .1487631     0.83   0.404     .8608097     1.45059
Diabetes,..  |   1.091526   1.123627     0.09   0.932     .1451439    8.208603
             |
cancer_exh~t |
  Last year  |   .7686567   .4023156    -0.50   0.615     .2755578    2.144135
2-5 years..  |   1.011234   .2266103     0.05   0.960     .6517841    1.568917
   5+ years  |   1.009296   .0721411     0.13   0.897     .8773599    1.161074
             |
cancer_hae~t |
  Last year  |   1.341784   .5084065     0.78   0.438     .6384977    2.819719
2-5 years..  |   .9133602   .2197754    -0.38   0.706     .5699326    1.463729
   5+ years  |   1.004723   .0717901     0.07   0.947     .8734254    1.155758
             |
1.~r_disease |   .8812986    .058235    -1.91   0.056     .7742422    1.003158
1.stroke_d~a |   1.103878   .0707246     1.54   0.123     .9736107    1.251575
1.other_ne~o |   1.179937   .0755954     2.58   0.010     1.040697    1.337805
             |
reduced_ki~t |
Stage 3a/..  |   .7037659   .3703676    -0.67   0.504     .2508825    1.974177
      1.esrd |   1.029429   .0543699     0.55   0.583     .9281961    1.141703
1.other_tr~t |   1.049894   .0653897     0.78   0.434     .9292466    1.186206
  1.asplenia |   1.076792   .0694488     1.15   0.251     .9489263    1.221886
1.ra_sle_p~s |   .9490912   .0639476    -0.78   0.438     .8316794    1.083079
1.other_im~o |   1.037381   .0683323     0.56   0.577     .9117374     1.18034
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      5.34 /        1 =       5.3420

         failure _d:  covidadmission
   analysis time _t:  (stime_covidadmission-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -9346.7898
Iteration 1:   log pseudolikelihood = -9280.8862
Iteration 2:   log pseudolikelihood = -9278.6603
Iteration 3:   log pseudolikelihood =  -9278.605
Iteration 4:   log pseudolikelihood = -9278.6049
Refining estimates:
Iteration 0:   log pseudolikelihood = -9278.6049

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,699             Number of obs    =      15,073
No. of failures      =        1,470
Time at risk         =       600160
                                                Wald chi2(45)    =      116.21
Log pseudolikelihood =   -9278.6049             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 975 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.395291   .2166808     2.14   0.032     1.029148    1.891697
 only 12-18  |   1.158987   .2562173     0.67   0.505     .7514558    1.787532
      mixed  |   2.105529   .2721458     5.76   0.000     1.634335    2.712574
             |
        age1 |   1.003574   .0100544     0.36   0.722     .9840596    1.023475
        age2 |    .965408   .0308778    -1.10   0.271     .9067466    1.027865
        age3 |   1.120339   .1014146     1.26   0.209      .938205    1.337832
      1.male |   1.106637   .0610235     1.84   0.066       .99327    1.232944
             |
   ethnicity |
Asian or ..  |   .9654991    .083058    -0.41   0.683     .8156924    1.142819
      Other  |    .922441   .0874169    -0.85   0.394     .7660777    1.110719
             |
   obese4cat |
Obese I ..)  |   .9774345   .0767516    -0.29   0.771     .8380083    1.140058
Obese II..)  |   .9318606   .0911558    -0.72   0.471     .7692816    1.128799
Obese II..)  |   .7883418   .0953838    -1.97   0.049     .6219065    .9993186
             |
smoke_nomiss |
     Former  |   1.036218   .1874748     0.20   0.844     .7268585    1.477244
    Current  |   .9918514   .0816886    -0.10   0.921      .843999    1.165605
             |
         imd |
          4  |   .9805787   .0637787    -0.30   0.763     .8632144      1.1139
5 most de..  |   .9897619   .0858003    -0.12   0.906     .8351066    1.173058
             |
tot_adults~h |
          2  |   .6206268   .3174872    -0.93   0.351     .2277145    1.691494
          3  |    1.48577    .475976     1.24   0.216     .7929829    2.783809
             |
1.htdiag_o~p |   .9270569   .0526629    -1.33   0.182     .8293781     1.03624
1.~y_disease |   .9727921    .066682    -0.40   0.687     .8504968    1.112673
    1.asthma |   1.173617    .104286     1.80   0.072     .9860291    1.396892
1.~c_disease |   1.123177    .072029     1.81   0.070     .9905146    1.273607
             |
     diabcat |
T1DM, con..  |   1.039675   .1823606     0.22   0.824     .7372173    1.466222
T1DM, unc..  |   .6382658   .3131164    -0.92   0.360     .2440194     1.66947
T2DM, con..  |   1.126583   .0779702     1.72   0.085     .9836757    1.290251
T2DM, unc..  |   1.116883   .1486719     0.83   0.406     .8604019    1.449819
Diabetes,..  |   1.083505   1.118232     0.08   0.938     .1433337    8.190567
             |
cancer_exh~t |
  Last year  |   .7807297   .4088708    -0.47   0.636       .27972    2.179104
2-5 years..  |   1.011885   .2264741     0.05   0.958     .6525598    1.569069
   5+ years  |   1.009783   .0721914     0.14   0.892     .8777568    1.161669
             |
cancer_hae~t |
  Last year  |   1.378034   .5199153     0.85   0.395     .6578278    2.886741
2-5 years..  |   .9192723   .2212147    -0.35   0.726     .5736012    1.473256
   5+ years  |   1.004594    .071749     0.06   0.949     .8733676    1.155538
             |
1.~r_disease |   .8798418   .0581399    -1.94   0.053     .7729603    1.001502
1.stroke_d~a |   1.103557   .0705944     1.54   0.123     .9735171    1.250968
1.other_ne~o |   1.177415   .0753793     2.55   0.011     1.038568    1.334825
             |
reduced_ki~t |
Stage 3a/..  |   .6993813   .3682535    -0.68   0.497     .2491844    1.962941
      1.esrd |   1.031106   .0544335     0.58   0.562     .9297527    1.143509
1.other_tr~t |   1.047892   .0652956     0.75   0.453     .9274214    1.184012
  1.asplenia |   1.075495   .0694603     1.13   0.260     .9476199    1.220627
1.ra_sle_p~s |    .947395   .0638185    -0.80   0.422     .8302186     1.08111
1.other_im~o |   1.038111   .0684047     0.57   0.570     .9123372    1.181225
             |
     vaccine#|
   kids_cat4 |
          1 #|
only <12 ..  |   .5188429    .275873    -1.23   0.217     .1829975    1.471047
          1 #|
 only 12-18  |   2.029267   2.647069     0.54   0.587     .1573958    26.16288
    1#mixed  |   .5796872   .1802757    -1.75   0.080     .3151231    1.066368
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      5.54 /        1 =       5.5360

 ( 1)  1.vaccine#1.kids_cat4 = 0
 ( 2)  1.vaccine#2.kids_cat4 = 0
 ( 3)  1.vaccine#3.kids_cat4 = 0

           chi2(  3) =    4.92
         Prob > chi2 =    0.1774

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7239367   .3900479    -0.60   0.549     .2518164    2.081216
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.351895   3.028498     0.66   0.507     .1885121    29.34247
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.220548   .4108374     0.59   0.554     .6310154    2.360859
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covidadmission_kids_cat4_vaccine
> _0_timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covidadmission_kids_cat4_vaccine_0_time
> period1.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covidadmissio
> n.log
  log type:  text
 closed on:  17 Aug 2021, 07:53:59
-------------------------------------------------------------------------------
