-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_sex_covid_tpp_prob.lo
> g
  log type:  text
 opened on:  28 Oct 2021, 11:41:00

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. foreach int_type in  male  {
 19. 
. tab male `outcome'
 20. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 21. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposu
> re_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id) 
 22.         if _rc==0{
 23. testparm 1.`int_type'#i.`exposure_type'
 24. di _n "`exposure_type' " _n "****************"
 25. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 26. di "`exposure_type'" _n "****************"
 27. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 28. di "`exposure_type'" _n "****************"
 29. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 30. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod`period', replace
 31. }
 32. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 33. }
 34. drop cat_time
 35. }
 36. }
 37. }
(18,078 observations (episodes) created)
(cat_time: 18078 changes made)
(covid_tpp_prob: 18078 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,500      7,790 |    17,290 
         1 |     9,484      7,386 |    16,870 
-----------+----------------------+----------
     Total |    18,984     15,176 |    34,160 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -46583.701
Iteration 1:   log pseudolikelihood = -46563.027
Iteration 2:   log pseudolikelihood = -46562.966
Iteration 3:   log pseudolikelihood = -46562.966
Refining estimates:
Iteration 0:   log pseudolikelihood = -46562.966

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,079             Number of obs    =      16,079
No. of failures      =        6,525
Time at risk         =      1069677
                                                Wald chi2(45)    =       46.49
Log pseudolikelihood =   -46562.966             Prob > chi2      =      0.4106

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.163648   .1410836     1.25   0.211     .9175294    1.475787
 only 12-18  |   1.313836   .2043866     1.75   0.079     .9685547    1.782207
      mixed  |   1.255137   .1363957     2.09   0.037     1.014358     1.55307
             |
        age1 |   1.002395   .0045344     0.53   0.597     .9935473    1.011322
        age2 |   .9902855   .0141654    -0.68   0.495     .9629074    1.018442
        age3 |   1.031974   .0425024     0.76   0.445     .9519439    1.118731
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.029126   .1588688     0.19   0.852     .7604426    1.392742
             |
   ethnicity |
Asian or ..  |    .969163   .0418382    -0.73   0.468     .8905349    1.054733
      Other  |   .9418505    .041288    -1.37   0.172     .8643065    1.026352
             |
   obese4cat |
Obese I ..)  |   .9920705   .0346133    -0.23   0.820     .9264973    1.062285
Obese II..)  |   .9672905    .044176    -0.73   0.466     .8844691    1.057867
Obese II..)  |   1.010084   .0560637     0.18   0.857      .905967    1.126167
             |
smoke_nomiss |
     Former  |   1.213243   .1012063     2.32   0.020      1.03025    1.428741
    Current  |   1.040585   .0380181     1.09   0.276     .9686764    1.117832
             |
         imd |
          4  |   .9789705    .030603    -0.68   0.497     .9207904    1.040827
5 most de..  |   .9913803   .0425276    -0.20   0.840     .9114355    1.078337
             |
tot_adults~h |
          2  |   .8102921   .1694808    -1.01   0.315     .5377794    1.220897
          3  |   .7901769   .1292525    -1.44   0.150     .5734423    1.088827
             |
1.htdiag_o~p |   .9964835   .0261433    -0.13   0.893     .9465387    1.049064
1.~y_disease |   1.023001   .0304554     0.76   0.445     .9650173    1.084468
    1.asthma |   .9911929   .0453582    -0.19   0.847     .9061626    1.084202
1.~c_disease |   .9762145   .0306318    -0.77   0.443     .9179861    1.038136
             |
     diabcat |
T1DM, con..  |   .9236029   .0763302    -0.96   0.336     .7854863    1.086005
T1DM, unc..  |   1.105702   .1834706     0.61   0.545     .7987243    1.530661
T2DM, con..  |   1.027852   .0348353     0.81   0.418     .9617948    1.098447
T2DM, unc..  |   1.055683   .0666634     0.86   0.391     .9327873    1.194771
Diabetes,..  |   .7382081   .3087126    -0.73   0.468      .325247      1.6755
             |
cancer_exh~t |
  Last year  |   1.252477    .286966     0.98   0.326     .7993624    1.962439
2-5 years..  |   1.012166   .0989719     0.12   0.902     .8356398    1.225982
   5+ years  |   .9588994   .0331534    -1.21   0.225     .8960726    1.026131
             |
cancer_hae~t |
  Last year  |   .9243211   .2153125    -0.34   0.735     .5855216     1.45916
2-5 years..  |   .8866207   .0952132    -1.12   0.262     .7183372    1.094328
   5+ years  |    .983399    .031266    -0.53   0.599      .923989    1.046629
             |
1.~r_disease |    .996887   .0307357    -0.10   0.919     .9384302    1.058985
1.stroke_d~a |   1.035815   .0304838     1.20   0.232     .9777583    1.097319
1.other_ne~o |   1.049382   .0332509     1.52   0.128     .9861936    1.116618
             |
reduced_ki~t |
Stage 3a/..  |   1.142435   .2271638     0.67   0.503     .7737077    1.686886
      1.esrd |   .9878798   .0251658    -0.48   0.632     .9397668    1.038456
1.other_tr~t |   1.001133   .0300182     0.04   0.970     .9439941    1.061731
  1.asplenia |   .9835181   .0303435    -0.54   0.590     .9258084    1.044825
1.ra_sle_p~s |   .9453182   .0299606    -1.77   0.076     .8883832    1.005902
1.other_im~o |   1.019256   .0317132     0.61   0.540     .9589568    1.083347
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |    1.04084    .181286     0.23   0.818     .7398227    1.464333
          1 #|
 only 12-18  |   .8208303   .2124677    -0.76   0.446     .4942245    1.363272
    1#mixed  |   .9082712   .1424657    -0.61   0.540     .6678846    1.235178
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    3.18
         Prob > chi2 =    0.3653

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.211171   .1657939     1.40   0.162     .9261622    1.583887
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.078436   .2086299     0.39   0.696     .7381159    1.575667
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.140005   .1474087     1.01   0.311     .8847932     1.46883
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_
> timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_timeper
> iod0.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,500      7,790 |    17,290 
         1 |     9,484      7,386 |    16,870 
-----------+----------------------+----------
     Total |    18,984     15,176 |    34,160 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -25845.535
Iteration 1:   log pseudolikelihood = -25825.781
Iteration 2:   log pseudolikelihood = -25825.706
Iteration 3:   log pseudolikelihood = -25825.706
Refining estimates:
Iteration 0:   log pseudolikelihood = -25825.706

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,340             Number of obs    =       9,340
No. of failures      =        3,925
Time at risk         =       499720
                                                Wald chi2(45)    =       44.93
Log pseudolikelihood =   -25825.706             Prob > chi2      =      0.4748

                       (Std. Err. adjusted for 1,038 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.006341   .1326116     0.05   0.962     .7772797    1.302906
 only 12-18  |   .8956172   .2091577    -0.47   0.637     .5666792    1.415492
      mixed  |   .9571034   .1149048    -0.37   0.715     .7564289    1.211015
             |
        age1 |   1.001995    .005904     0.34   0.735     .9904897    1.013634
        age2 |   .9910194   .0187241    -0.48   0.633     .9549921    1.028406
        age3 |   1.026104   .0557483     0.47   0.635     .9224555    1.141398
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9642278   .1861685    -0.19   0.850     .6604405     1.40775
             |
   ethnicity |
Asian or ..  |   1.150435   .0591818     2.72   0.006     1.040097    1.272478
      Other  |   1.099614   .0553311     1.89   0.059     .9963426    1.213589
             |
   obese4cat |
Obese I ..)  |   .9950753   .0471063    -0.10   0.917     .9069024    1.091821
Obese II..)  |    .970488   .0572555    -0.51   0.612     .8645143    1.089452
Obese II..)  |   1.047504   .0731868     0.66   0.507     .9134486    1.201233
             |
smoke_nomiss |
     Former  |   1.125986    .129209     1.03   0.301     .8991992     1.40997
    Current  |    .998567   .0500405    -0.03   0.977     .9051521    1.101623
             |
         imd |
          4  |   1.011094   .0412831     0.27   0.787     .9333337    1.095333
5 most de..  |   .9357885   .0517315    -1.20   0.230     .8396965    1.042877
             |
tot_adults~h |
          2  |   1.396237   .3890265     1.20   0.231     .8087108      2.4106
          3  |    1.11778    .266642     0.47   0.641     .7003342     1.78405
             |
1.htdiag_o~p |   1.037199   .0342342     1.11   0.268     .9722256    1.106515
1.~y_disease |   .9504604    .037206    -1.30   0.194     .8802652    1.026253
    1.asthma |   1.058344    .061998     0.97   0.333     .9435468    1.187109
1.~c_disease |   .9894679   .0399266    -0.26   0.793     .9142277      1.0709
             |
     diabcat |
T1DM, con..  |   .9857474   .0987397    -0.14   0.886     .8100335    1.199577
T1DM, unc..  |    1.15815   .2649269     0.64   0.521     .7396949    1.813332
T2DM, con..  |    .950599   .0424575    -1.13   0.257     .8709221    1.037565
T2DM, unc..  |   .9076288   .0774459    -1.14   0.256     .7678514    1.072851
Diabetes,..  |   1.379862   .4682836     0.95   0.343     .7095178    2.683538
             |
cancer_exh~t |
  Last year  |    .841803   .3018711    -0.48   0.631     .4168397    1.700011
2-5 years..  |   1.203721   .1317041     1.69   0.090     .9713868    1.491624
   5+ years  |   1.030014   .0421165     0.72   0.470     .9506877    1.115958
             |
cancer_hae~t |
  Last year  |   1.280162   .2856354     1.11   0.268     .8266872    1.982389
2-5 years..  |   .9729887   .1228822    -0.22   0.828     .7596377    1.246261
   5+ years  |   1.055471   .0442377     1.29   0.198     .9722325    1.145836
             |
1.~r_disease |   1.000674     .03976     0.02   0.986     .9257024    1.081717
1.stroke_d~a |   1.052095    .042116     1.27   0.205     .9727042    1.137965
1.other_ne~o |   .9663755   .0390009    -0.85   0.397     .8928801     1.04592
             |
reduced_ki~t |
Stage 3a/..  |   1.091873   .2842524     0.34   0.736      .655503    1.818735
      1.esrd |   .9823077   .0317028    -0.55   0.580     .9220958    1.046451
1.other_tr~t |   1.030759   .0410371     0.76   0.447     .9533856    1.114411
  1.asplenia |   1.016958   .0406833     0.42   0.674     .9402666    1.099906
1.ra_sle_p~s |   1.078869   .0425655     1.92   0.054     .9985857    1.165606
1.other_im~o |   .9849174   .0395375    -0.38   0.705     .9103955    1.065539
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.075936   .2343077     0.34   0.737     .7021332    1.648745
          1 #|
 only 12-18  |   1.238933   .4077564     0.65   0.515     .6499814    2.361535
    1#mixed  |   1.019964   .2003171     0.10   0.920     .6940837    1.498848
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.75
         Prob > chi2 =    0.8604

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.082759   .1852418     0.46   0.642     .7742933    1.514112
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.109609   .2454019     0.47   0.638     .7193128    1.711679
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9762106    .151165    -0.16   0.876     .7206694    1.322364
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_
> timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_timeper
> iod1.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,500      7,790 |    17,290 
         1 |     9,484      7,386 |    16,870 
-----------+----------------------+----------
     Total |    18,984     15,176 |    34,160 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -15755.722
Iteration 1:   log pseudolikelihood = -15736.444
Iteration 2:   log pseudolikelihood = -15735.458
Iteration 3:   log pseudolikelihood = -15735.431
Iteration 4:   log pseudolikelihood =  -15735.43
Refining estimates:
Iteration 0:   log pseudolikelihood =  -15735.43

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        5,260             Number of obs    =       5,260
No. of failures      =        2,652
Time at risk         =       235184
                                                Wald chi2(45)    =       43.27
Log pseudolikelihood =    -15735.43             Prob > chi2      =      0.5454

                         (Std. Err. adjusted for 940 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.074361   .1764439     0.44   0.662     .7786748    1.482328
 only 12-18  |   .7408679   .1790902    -1.24   0.215     .4612959    1.189877
      mixed  |   .9607575   .1398343    -0.28   0.783     .7223122    1.277917
             |
        age1 |   1.004506   .0073151     0.62   0.537     .9902703    1.018946
        age2 |   .9982276   .0231955    -0.08   0.939      .953785    1.044741
        age3 |   .9938981   .0662048    -0.09   0.927     .8722527    1.132508
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .7955026   .2062554    -0.88   0.378     .4785693    1.322326
             |
   ethnicity |
Asian or ..  |   1.063191   .0707687     0.92   0.357     .9331538     1.21135
      Other  |   .8975702   .0604614    -1.60   0.109     .7865576    1.024251
             |
   obese4cat |
Obese I ..)  |   1.008543   .0592544     0.14   0.885     .8988436     1.13163
Obese II..)  |   .9576727   .0643352    -0.64   0.520     .8395267    1.092445
Obese II..)  |   .9336838   .0784993    -0.82   0.414     .7918359    1.100942
             |
smoke_nomiss |
     Former  |   .8902642   .1287086    -0.80   0.421      .670591    1.181898
    Current  |   1.071133   .0620579     1.19   0.236     .9561531    1.199939
             |
         imd |
          4  |    1.02461   .0507511     0.49   0.624     .9298152    1.129069
5 most de..  |    1.07568    .069193     1.13   0.257     .9482651    1.220216
             |
tot_adults~h |
          2  |   .8412632   .3018735    -0.48   0.630     .4163822    1.699697
          3  |   .8229432   .2253485    -0.71   0.477     .4811531    1.407526
             |
1.htdiag_o~p |   .9871124   .0399668    -0.32   0.749     .9118063    1.068638
1.~y_disease |   .9958718   .0483523    -0.09   0.932     .9054725    1.095296
    1.asthma |   1.013023   .0750423     0.17   0.861     .8761215    1.171317
1.~c_disease |   .9593641   .0469239    -0.85   0.396     .8716656    1.055886
             |
     diabcat |
T1DM, con..  |   1.108358   .1193298     0.96   0.339     .8975042    1.368748
T1DM, unc..  |   1.209119   .3758001     0.61   0.541     .6575239    2.223447
T2DM, con..  |   .9897012   .0508372    -0.20   0.840     .8949136    1.094529
T2DM, unc..  |   .8833805   .0897404    -1.22   0.222     .7238964    1.078001
Diabetes,..  |   .9217691   .5066007    -0.15   0.882     .3139099    2.706694
             |
cancer_exh~t |
  Last year  |   2.312856   .7708268     2.52   0.012     1.203541    4.444638
2-5 years..  |   .9375999   .1532575    -0.39   0.693     .6805852    1.291673
   5+ years  |   1.063981   .0559574     1.18   0.238     .9597703    1.179508
             |
cancer_hae~t |
  Last year  |   .8380089   .3167747    -0.47   0.640     .3994726    1.757965
2-5 years..  |   1.267867   .1621149     1.86   0.063     .9868139    1.628965
   5+ years  |   .9567913   .0507459    -0.83   0.405      .862326    1.061605
             |
1.~r_disease |   .9308769   .0478409    -1.39   0.163     .8416783    1.029529
1.stroke_d~a |   .9344793   .0474835    -1.33   0.182     .8458976    1.032337
1.other_ne~o |   1.041742   .0531972     0.80   0.423     .9425253    1.151403
             |
reduced_ki~t |
Stage 3a/..  |   .8734673   .3029249    -0.39   0.696     .4426329    1.723652
      1.esrd |   1.001914   .0401858     0.05   0.962      .926168    1.083856
1.other_tr~t |   1.039979   .0509471     0.80   0.424     .9447687    1.144785
  1.asplenia |   .9812241   .0473172    -0.39   0.694     .8927319    1.078488
1.ra_sle_p~s |   1.095863   .0516237     1.94   0.052     .9992131    1.201862
1.other_im~o |    1.02118   .0521629     0.41   0.682     .9238935     1.12871
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.078964   .3056693     0.27   0.788     .6192452    1.879972
          1 #|
 only 12-18  |   1.692133   .6162731     1.44   0.149     .8287584    3.454946
    1#mixed  |   1.208629   .3171484     0.72   0.470     .7226617    2.021395
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    3.21
         Prob > chi2 =    0.3597

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.159197   .2749255     0.62   0.533      .728247    1.845168
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.253647   .3574724     0.79   0.428     .7169003     2.19226
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     1.1612   .2598361     0.67   0.504     .7489238     1.80043
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_
> timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_timeper
> iod2.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,500      7,790 |    17,290 
         1 |     9,484      7,386 |    16,870 
-----------+----------------------+----------
     Total |    18,984     15,176 |    34,160 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood =  -6948.872
Iteration 1:   log pseudolikelihood = -6933.2672
Iteration 2:   log pseudolikelihood = -6928.4084
Iteration 3:   log pseudolikelihood = -6928.3594
Iteration 4:   log pseudolikelihood = -6928.3592
Refining estimates:
Iteration 0:   log pseudolikelihood = -6928.3592

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,462             Number of obs    =       2,462
No. of failures      =        1,352
Time at risk         =        80292
                                                Wald chi2(45)    =      126.05
Log pseudolikelihood =   -6928.3592             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 796 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .8440067   .2270844    -0.63   0.528     .4981105    1.430099
 only 12-18  |   .6814961   .2670111    -0.98   0.328     .3161997    1.468809
      mixed  |   .7395497   .1809315    -1.23   0.217     .4578468    1.194578
             |
        age1 |   1.015938   .0107864     1.49   0.136      .995015      1.0373
        age2 |   .9462796   .0314318    -1.66   0.096     .8866369    1.009934
        age3 |    1.16916   .1106796     1.65   0.099     .9711676    1.407517
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.049024   .3419432     0.15   0.883     .5537644    1.987219
             |
   ethnicity |
Asian or ..  |   1.049529   .1019412     0.50   0.619     .8675946    1.269615
      Other  |   .9491615   .0857047    -0.58   0.563     .7952079    1.132921
             |
   obese4cat |
Obese I ..)  |   1.080748   .0870897     0.96   0.335     .9228529    1.265659
Obese II..)  |   .9135647   .0879956    -0.94   0.348     .7563983    1.103387
Obese II..)  |   1.035084   .1218384     0.29   0.770     .8218297    1.303675
             |
smoke_nomiss |
     Former  |   .8846814    .201743    -0.54   0.591     .5658205    1.383232
    Current  |   1.148367   .0969084     1.64   0.101      .973306    1.354914
             |
         imd |
          4  |   .9535179   .0641036    -0.71   0.479     .8358029    1.087812
5 most de..  |    1.02697   .0951682     0.29   0.774     .8564018    1.231509
             |
tot_adults~h |
          2  |   1.301075   .7085851     0.48   0.629       .44743    3.783377
          3  |   1.505969   .6092465     1.01   0.312     .6814885    3.327924
             |
1.htdiag_o~p |    .998758   .0573915    -0.02   0.983     .8923758    1.117822
1.~y_disease |   1.038529   .0665354     0.59   0.555     .9159772    1.177477
    1.asthma |   1.032383   .1070919     0.31   0.759     .8424486    1.265139
1.~c_disease |   1.058415   .0713314     0.84   0.400     .9274486    1.207876
             |
     diabcat |
T1DM, con..  |   1.183885   .1947964     1.03   0.305     .8575371     1.63443
T1DM, unc..  |   1.088615   .5590872     0.17   0.869     .3978477    2.978733
T2DM, con..  |   .9456737   .0730636    -0.72   0.470      .812787    1.100287
T2DM, unc..  |   1.127439   .1348244     1.00   0.316     .8918718    1.425226
Diabetes,..  |   6.060008   1.332065     8.20   0.000     3.938842    9.323475
             |
cancer_exh~t |
  Last year  |   1.425317   1.018439     0.50   0.620     .3513159    5.782623
2-5 years..  |    1.47672    .304769     1.89   0.059     .9854287    2.212948
   5+ years  |   1.107003   .0807449     1.39   0.163     .9595379    1.277131
             |
cancer_hae~t |
  Last year  |   1.186783   .6039304     0.34   0.736     .4377358    3.217592
2-5 years..  |    1.04037   .2351721     0.18   0.861     .6679999    1.620313
   5+ years  |   1.054174   .0733766     0.76   0.448     .9197377    1.208262
             |
1.~r_disease |    1.07943   .0721582     1.14   0.253     .9468756     1.23054
1.stroke_d~a |   1.007853   .0689701     0.11   0.909     .8813472    1.152516
1.other_ne~o |   1.144036   .0775817     1.98   0.047      1.00165    1.306661
             |
reduced_ki~t |
Stage 3a/..  |   1.524299   .6770536     0.95   0.343     .6382469    3.640421
      1.esrd |   1.005997   .0561226     0.11   0.915     .9017994    1.122235
1.other_tr~t |    1.04907   .0690831     0.73   0.467     .9220429    1.193596
  1.asplenia |   .9301385   .0657289    -1.02   0.305     .8098356    1.068313
1.ra_sle_p~s |   .9455798   .0679519    -0.78   0.436     .8213505    1.088599
1.other_im~o |   1.108951   .0756437     1.52   0.129     .9701758    1.267578
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.011165   .3729873     0.03   0.976     .4907277     2.08355
          1 #|
 only 12-18  |    .965194   .4873008    -0.07   0.944     .3588108    2.596353
    1#mixed  |   .9683141   .3194385    -0.10   0.922     .5072385    1.848504
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.07
         Prob > chi2 =    0.9956

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8534304    .226363    -0.60   0.550     .5074535    1.435291
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .657776   .2338393    -1.18   0.239     .3276996    1.320323
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7161163   .1712874    -1.40   0.163     .4481106    1.144411
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_
> timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_timeper
> iod3.ster saved
(no new episodes generated)
(cat_time: 18078 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       47.07       47.07
          1 |      9,340       27.34       74.42
          2 |      5,260       15.40       89.82
          3 |      2,462        7.21       97.03
          4 |      1,016        2.97      100.00
------------+-----------------------------------
      Total |     34,157      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,554      6,525 |    16,079 
         1 |     5,415      3,925 |     9,340 
         2 |     2,608      2,652 |     5,260 
         3 |     1,110      1,352 |     2,462 
         4 |       297        719 |     1,016 
-----------+----------------------+----------
     Total |    18,984     15,173 |    34,157 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,500      7,790 |    17,290 
         1 |     9,484      7,386 |    16,870 
-----------+----------------------+----------
     Total |    18,984     15,176 |    34,160 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2938.8804
Iteration 1:   log pseudolikelihood = -2912.5571
Iteration 2:   log pseudolikelihood = -2912.1487
Iteration 3:   log pseudolikelihood = -2912.1379
Iteration 4:   log pseudolikelihood = -2912.1378
Refining estimates:
Iteration 0:   log pseudolikelihood = -2912.1378

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,016             Number of obs    =       1,016
No. of failures      =          719
Time at risk         =        24973
                                                Wald chi2(44)    =       70.77
Log pseudolikelihood =   -2912.1378             Prob > chi2      =      0.0064

                         (Std. Err. adjusted for 569 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.491511   .7367136     0.81   0.418     .5664813    3.927056
 only 12-18  |    1.15863   .6611318     0.26   0.796     .3786483    3.545302
      mixed  |   1.249139   .5754681     0.48   0.629     .5063713     3.08143
             |
        age1 |   .9911187   .0142647    -0.62   0.535     .9635511    1.019475
        age2 |   1.030332   .0471762     0.65   0.514     .9418954    1.127071
        age3 |   .9307592   .1225208    -0.55   0.586     .7190997    1.204718
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.373308    .805111     0.54   0.588     .4352564    4.333018
             |
   ethnicity |
Asian or ..  |   1.029435   .1467512     0.20   0.839     .7784946    1.361263
      Other  |   1.066179   .1331562     0.51   0.608     .8346849    1.361876
             |
   obese4cat |
Obese I ..)  |   .9134406   .1058883    -0.78   0.435     .7277915    1.146446
Obese II..)  |   1.401269    .177926     2.66   0.008     1.092547    1.797226
Obese II..)  |   .8804892   .1456097    -0.77   0.442     .6367335     1.21756
             |
smoke_nomiss |
     Former  |   1.082098   .3057271     0.28   0.780     .6219777      1.8826
    Current  |     .98604   .1235162    -0.11   0.911     .7713809    1.260434
             |
         imd |
          4  |   .8420945   .0878617    -1.65   0.100     .6863551    1.033172
5 most de..  |   .9263193   .1197733    -0.59   0.554     .7189524    1.193497
             |
tot_adults~h |
          2  |   1.278076   .8586297     0.37   0.715     .3425371    4.768766
          3  |   .8269786   .4477765    -0.35   0.726     .2861554    2.389938
             |
1.htdiag_o~p |   1.214215   .0956822     2.46   0.014     1.040446    1.417006
1.~y_disease |   1.055949    .105077     0.55   0.584     .8688408    1.283351
    1.asthma |   1.053541   .1734409     0.32   0.751     .7629938    1.454728
1.~c_disease |   1.085383   .0957992     0.93   0.353     .9129638    1.290365
             |
     diabcat |
T1DM, con..  |   .7375372    .203809    -1.10   0.271     .4291066     1.26766
T1DM, unc..  |   .3555128   .3575311    -1.03   0.304     .0495247    2.552049
T2DM, con..  |   1.175568   .1087008     1.75   0.080      .980709    1.409145
T2DM, unc..  |   1.354652   .2833942     1.45   0.147     .8989915    2.041266
             |
cancer_exh~t |
  Last year  |   1.384289   .3992588     1.13   0.260     .7865421    2.436305
2-5 years..  |   .8064306   .2153045    -0.81   0.420     .4778695    1.360895
   5+ years  |   .8758509   .0892002    -1.30   0.193     .7173652     1.06935
             |
cancer_hae~t |
  Last year  |   .3991714   .2834266    -1.29   0.196     .0992601    1.605256
2-5 years..  |   1.024041   .3849975     0.06   0.950     .4901178    2.139608
   5+ years  |   1.035915   .1012595     0.36   0.718     .8553035    1.254666
             |
1.~r_disease |   1.106939   .1098113     1.02   0.306      .911344    1.344514
1.stroke_d~a |   1.127623   .0954223     1.42   0.156     .9552857    1.331051
1.other_ne~o |   1.055811   .1115994     0.51   0.607     .8582502    1.298848
             |
reduced_ki~t |
Stage 3a/..  |   .7246547   .3986144    -0.59   0.558     .2465508    2.129883
      1.esrd |   1.125339   .0898939     1.48   0.139     .9622498    1.316069
1.other_tr~t |   .9876393   .0952475    -0.13   0.897     .8175397     1.19313
  1.asplenia |   1.062567   .1042914     0.62   0.536     .8766182    1.287959
1.ra_sle_p~s |    .745409   .0730887    -3.00   0.003     .6150816    .9033508
1.other_im~o |   .9977971   .1006532    -0.02   0.983     .8187983    1.215927
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .7551131   .4785421    -0.44   0.658     .2180596    2.614862
          1 #|
 only 12-18  |   .8849035   .6364271    -0.17   0.865     .2161262    3.623134
    1#mixed  |   .6085472   .3603335    -0.84   0.402      .190669    1.942265
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    2.26
         Prob > chi2 =    0.5201

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.126259   .4993928     0.27   0.789     .4722896    2.685767
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.025276   .5285857     0.05   0.961     .3732498    2.816317
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7601599   .3218717    -0.65   0.517     .3315002    1.743115
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_
> timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_0_timeper
> iod4.ster saved
(4,975 observations (episodes) created)
(cat_time: 4975 changes made)
(covid_tpp_prob: 4975 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,699      2,202 |     4,901 
         1 |     2,535      2,090 |     4,625 
-----------+----------------------+----------
     Total |     5,234      4,292 |     9,526 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -11203.854
Iteration 1:   log pseudolikelihood = -11179.414
Iteration 2:   log pseudolikelihood = -11178.691
Iteration 3:   log pseudolikelihood = -11178.508
Iteration 4:   log pseudolikelihood = -11178.441
Iteration 5:   log pseudolikelihood = -11178.416
Iteration 6:   log pseudolikelihood = -11178.407
Iteration 7:   log pseudolikelihood = -11178.404
Iteration 8:   log pseudolikelihood = -11178.402
Iteration 9:   log pseudolikelihood = -11178.402
Iteration 10:  log pseudolikelihood = -11178.402
Iteration 11:  log pseudolikelihood = -11178.402
Iteration 12:  log pseudolikelihood = -11178.402
Iteration 13:  log pseudolikelihood = -11178.402
Iteration 14:  log pseudolikelihood = -11178.402
Iteration 15:  log pseudolikelihood = -11178.402
Iteration 16:  log pseudolikelihood = -11178.402
Iteration 17:  log pseudolikelihood = -11178.402
Iteration 18:  log pseudolikelihood = -11178.402
Iteration 19:  log pseudolikelihood = -11178.402
Iteration 20:  log pseudolikelihood = -11178.402
Iteration 21:  log pseudolikelihood = -11178.402
Iteration 22:  log pseudolikelihood = -11178.402
Iteration 23:  log pseudolikelihood = -11178.402
Iteration 24:  log pseudolikelihood = -11178.402
Iteration 25:  log pseudolikelihood = -11178.402
Iteration 26:  log pseudolikelihood = -11178.402
Iteration 27:  log pseudolikelihood = -11178.402
Iteration 28:  log pseudolikelihood = -11178.402
Iteration 29:  log pseudolikelihood = -11178.402
Refining estimates:
Iteration 0:   log pseudolikelihood = -11178.402
Iteration 1:   log pseudolikelihood = -11178.402
Iteration 2:   log pseudolikelihood = -11178.402

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,549             Number of obs    =       4,549
No. of failures      =        1,908
Time at risk         =       298676
                                                Wald chi2(45)    =     4058.63
Log pseudolikelihood =   -11178.402             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.105386   .2448287     0.45   0.651     .7161169    1.706256
 only 12-18  |   .8652362   .2498501    -0.50   0.616     .4912892    1.523814
      mixed  |   1.035546   .2083428     0.17   0.862     .6980958    1.536115
             |
        age1 |   1.002526   .0231986     0.11   0.913     .9580732    1.049041
        age2 |   1.005567   .1214425     0.05   0.963     .7936174    1.274121
        age3 |   .9847405   .2526059    -0.06   0.952     .5956229    1.628067
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.092889   .3065419     0.32   0.751     .6307021    1.893771
             |
   ethnicity |
Asian or ..  |   1.128212   .0856019     1.59   0.112     .9723139    1.309105
      Other  |   .8910501   .0701862    -1.46   0.143     .7635803    1.039799
             |
   obese4cat |
Obese I ..)  |   .9238467   .0632048    -1.16   0.247      .807914    1.056415
Obese II..)  |   1.037616   .0836687     0.46   0.647     .8859305    1.215273
Obese II..)  |    1.13036   .1122528     1.23   0.217     .9304359    1.373242
             |
smoke_nomiss |
     Former  |   .9354343   .1699398    -0.37   0.713     .6552033     1.33552
    Current  |   1.044561   .0680542     0.67   0.503     .9193418    1.186835
             |
         imd |
          4  |   1.045343   .0598748     0.77   0.439     .9343379    1.169536
5 most de..  |   .9565895   .0750953    -0.57   0.572     .8201695      1.1157
             |
tot_adults~h |
          2  |   .8469754   .4429338    -0.32   0.751     .3038974    2.360558
          3  |   1.609885   .5184136     1.48   0.139       .85643    3.026202
             |
1.htdiag_o~p |    1.00928   .0497716     0.19   0.851     .9162956    1.111701
1.~y_disease |   .9482864   .0540831    -0.93   0.352     .8479953    1.060439
    1.asthma |   1.048592   .0842474     0.59   0.555      .895815    1.227425
1.~c_disease |   .9347175   .0545913    -1.16   0.248     .8336174    1.048079
             |
     diabcat |
T1DM, con..  |   1.226317   .1596807     1.57   0.117     .9500936    1.582847
T1DM, unc..  |   .9659514    .280833    -0.12   0.905      .546366     1.70776
T2DM, con..  |   1.028289   .0635489     0.45   0.652     .9109835      1.1607
T2DM, unc..  |   1.090411    .136239     0.69   0.488     .8535692     1.39297
Diabetes,..  |   3.79e-14   1.93e-14   -60.88   0.000     1.40e-14    1.03e-13
             |
cancer_exh~t |
  Last year  |   1.152489    .356394     0.46   0.646     .6286551    2.112813
2-5 years..  |   .8886225   .1727907    -0.61   0.544     .6070201    1.300863
   5+ years  |   1.002806   .0596147     0.05   0.962     .8925131    1.126728
             |
cancer_hae~t |
  Last year  |   .9562985   .2742398    -0.16   0.876     .5451206    1.677623
2-5 years..  |   .7584932   .1601028    -1.31   0.190     .5015104    1.147158
   5+ years  |    .925511   .0577518    -1.24   0.215     .8189675    1.045915
             |
1.~r_disease |   1.084578   .0596583     1.48   0.140     .9737321    1.208042
1.stroke_d~a |   1.129156   .0618669     2.22   0.027     1.014183    1.257163
1.other_ne~o |   .9274343   .0526866    -1.33   0.185     .8297117    1.036667
             |
reduced_ki~t |
Stage 3a/..  |   1.079947   .1303216     0.64   0.524     .8524803    1.368108
      1.esrd |   .9533005    .046599    -0.98   0.328     .8662068    1.049151
1.other_tr~t |   .9923149   .0585856    -0.13   0.896     .8838837    1.114048
  1.asplenia |   1.061062   .0637122     0.99   0.324     .9432564     1.19358
1.ra_sle_p~s |   1.047702   .0595896     0.82   0.413     .9371827    1.171254
1.other_im~o |    1.12788   .0602557     2.25   0.024     1.015754    1.252384
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .8739183   .2809148    -0.42   0.675     .4654341    1.640905
          1 #|
 only 12-18  |   .8035388    .339909    -0.52   0.605        .3507    1.841102
    1#mixed  |   .8908765   .2538251    -0.41   0.685     .5096787    1.557179
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    0.29
         Prob > chi2 =    0.9617

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9660173   .2206239    -0.15   0.880     .6174235    1.511425
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6952508   .2250897    -1.12   0.262     .3686058    1.311357
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9225435   .1916389    -0.39   0.698     .6139992    1.386136
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_
> timeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_timeper
> iod0.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,699      2,202 |     4,901 
         1 |     2,535      2,090 |     4,625 
-----------+----------------------+----------
     Total |     5,234      4,292 |     9,526 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -5884.5283
Iteration 1:   log pseudolikelihood = -5859.2675
Iteration 2:   log pseudolikelihood = -5857.4818
Iteration 3:   log pseudolikelihood = -5857.4557
Iteration 4:   log pseudolikelihood = -5857.4557
Refining estimates:
Iteration 0:   log pseudolikelihood = -5857.4557

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,591             Number of obs    =       2,591
No. of failures      =        1,111
Time at risk         =       137162
                                                Wald chi2(45)    =       63.77
Log pseudolikelihood =   -5857.4557             Prob > chi2      =      0.0341

                         (Std. Err. adjusted for 827 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5840399     .16612    -1.89   0.059     .3344514    1.019887
 only 12-18  |   1.257165   .4575838     0.63   0.530     .6159865    2.565743
      mixed  |   .6178116   .1615997    -1.84   0.066     .3700062     1.03158
             |
        age1 |   .9715433   .0277195    -1.01   0.312     .9187053     1.02742
        age2 |    1.18888   .1775224     1.16   0.247     .8872327    1.593084
        age3 |   .6883592   .2199095    -1.17   0.242     .3680294    1.287502
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.118128   .3445302     0.36   0.717     .6112374    2.045377
             |
   ethnicity |
Asian or ..  |   1.230119   .1266391     2.01   0.044     1.005349    1.505141
      Other  |   .9022795   .0890947    -1.04   0.298     .7435155    1.094945
             |
   obese4cat |
Obese I ..)  |   1.077977   .0851464     0.95   0.342     .9233692    1.258472
Obese II..)  |   .8907217   .1067667    -0.97   0.334     .7042266    1.126605
Obese II..)  |   1.034701    .156285     0.23   0.821     .7695668     1.39118
             |
smoke_nomiss |
     Former  |   1.060075   .2521173     0.25   0.806     .6651133    1.689575
    Current  |   .9666043   .0860263    -0.38   0.703     .8118824    1.150812
             |
         imd |
          4  |    .903881   .0708079    -1.29   0.197     .7752293    1.053883
5 most de..  |   1.121785   .1074752     1.20   0.230     .9297327    1.353508
             |
tot_adults~h |
          2  |   2.073766    .831673     1.82   0.069     .9449086    4.551239
          3  |   1.514248   .4714722     1.33   0.183     .8225633    2.787564
             |
1.htdiag_o~p |   .9601837   .0645605    -0.60   0.546     .8416306    1.095436
1.~y_disease |   .8297666   .0657651    -2.35   0.019     .7103819    .9692146
    1.asthma |   .9077494   .1020132    -0.86   0.389     .7282956    1.131421
1.~c_disease |   1.025536   .0745818     0.35   0.729     .8892981    1.182644
             |
     diabcat |
T1DM, con..  |   .9955703    .201152    -0.02   0.982     .6700222    1.479295
T1DM, unc..  |   .6033644   .3035687    -1.00   0.315     .2250699    1.617491
T2DM, con..  |   1.068803   .0872841     0.81   0.415     .9107181    1.254328
T2DM, unc..  |   .9529542   .1556228    -0.30   0.768     .6919362    1.312436
Diabetes,..  |   1.249437   .9033459     0.31   0.758     .3028958     5.15389
             |
cancer_exh~t |
  Last year  |   1.334765   .4627732     0.83   0.405     .6765297    2.633437
2-5 years..  |   1.228604   .2658705     0.95   0.341     .8039174     1.87764
   5+ years  |    .986455   .0773434    -0.17   0.862      .845938    1.150313
             |
cancer_hae~t |
  Last year  |   .6129006   .3083867    -0.97   0.331     .2286125    1.643161
2-5 years..  |   1.045417   .2225832     0.21   0.835     .6887435    1.586798
   5+ years  |   .9197856   .0759898    -1.01   0.312     .7822814    1.081459
             |
1.~r_disease |   1.051857   .0800716     0.66   0.507     .9060659    1.221107
1.stroke_d~a |   .9937772   .0743953    -0.08   0.934     .8581577    1.150829
1.other_ne~o |   1.032107    .078269     0.42   0.677     .8895583    1.197498
             |
reduced_ki~t |
Stage 3a/..  |   .8790016   .1473453    -0.77   0.442     .6328554    1.220885
      1.esrd |   1.059835   .0700188     0.88   0.379     .9311144    1.206351
1.other_tr~t |    .964334   .0738187    -0.47   0.635     .8299826    1.120433
  1.asplenia |   .9657151   .0725787    -0.46   0.643     .8334445    1.118978
1.ra_sle_p~s |   1.106076   .0886976     1.26   0.209     .9452056    1.294327
1.other_im~o |   1.127239   .0862798     1.56   0.118     .9702069    1.309688
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   .8663589   .3055545    -0.41   0.684     .4339995    1.729444
          1 #|
 only 12-18  |   .5552776   .2779315    -1.18   0.240     .2081904    1.481016
    1#mixed  |    .953742   .3003093    -0.15   0.880      .514528     1.76788
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    2.07
         Prob > chi2 =    0.5576

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5059882    .126973    -2.71   0.007     .3094136    .8274492
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6980754   .2291457    -1.09   0.274     .3668534    1.328349
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5892328   .1292932    -2.41   0.016     .3832754     .905864
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_
> timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_timeper
> iod1.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,699      2,202 |     4,901 
         1 |     2,535      2,090 |     4,625 
-----------+----------------------+----------
     Total |     5,234      4,292 |     9,526 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -3317.7293
Iteration 1:   log pseudolikelihood = -3293.8465
Iteration 2:   log pseudolikelihood = -3292.7805
Iteration 3:   log pseudolikelihood = -3292.7717
Iteration 4:   log pseudolikelihood = -3292.7717
Refining estimates:
Iteration 0:   log pseudolikelihood = -3292.7717

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,433             Number of obs    =       1,433
No. of failures      =          713
Time at risk         =        64384
                                                Wald chi2(45)    =       74.15
Log pseudolikelihood =   -3292.7717             Prob > chi2      =      0.0040

                         (Std. Err. adjusted for 663 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.760264   .6866022     1.45   0.147     .8195229    3.780893
 only 12-18  |   2.353382   1.155851     1.74   0.081     .8987302     6.16248
      mixed  |   1.726558   .6202093     1.52   0.128     .8539157     3.49098
             |
        age1 |   .9811284   .0356129    -0.52   0.600     .9137534    1.053471
        age2 |   1.128949   .2133581     0.64   0.521     .7794841    1.635089
        age3 |    .751019   .3028262    -0.71   0.478     .3407447    1.655285
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   3.656511   1.980237     2.39   0.017     1.264987    10.56933
             |
   ethnicity |
Asian or ..  |    1.09532   .1466521     0.68   0.496     .8425078    1.423994
      Other  |   .8752719   .1084963    -1.07   0.282     .6864839    1.115978
             |
   obese4cat |
Obese I ..)  |   1.166797   .1225127     1.47   0.142     .9497726    1.433411
Obese II..)  |   1.097887   .1519893     0.67   0.500     .8369871    1.440112
Obese II..)  |   1.130821   .2062471     0.67   0.500      .790944    1.616747
             |
smoke_nomiss |
     Former  |   .3960265   .1524273    -2.41   0.016     .1862532    .8420631
    Current  |   1.158883   .1315927     1.30   0.194      .927651    1.447754
             |
         imd |
          4  |   .8979829   .0887522    -1.09   0.276     .7398429    1.089925
5 most de..  |   .8521519   .1266477    -1.08   0.282      .636811    1.140311
             |
tot_adults~h |
          2  |   2.369826   1.526912     1.34   0.181     .6703094    8.378332
          3  |   1.613302   .7881802     0.98   0.328      .619242    4.203112
             |
1.htdiag_o~p |   1.040924   .0842382     0.50   0.620      .888248    1.219842
1.~y_disease |   .9447508   .0879974    -0.61   0.542     .7871062    1.133969
    1.asthma |   1.112438   .1487884     0.80   0.426     .8559095    1.445852
1.~c_disease |    .926396   .0838474    -0.84   0.398     .7758094    1.106212
             |
     diabcat |
T1DM, con..  |   1.564032   .3290071     2.13   0.033     1.035591    2.362125
T1DM, unc..  |   1.390012   .7489223     0.61   0.541      .483505    3.996097
T2DM, con..  |   1.027505   .1135886     0.25   0.806     .8273422    1.276093
T2DM, unc..  |   .9361665   .1902416    -0.32   0.745     .6286045    1.394212
Diabetes,..  |     2.3284   .5375796     3.66   0.000     1.480924    3.660855
             |
cancer_exh~t |
  Last year  |   2.366732   .9587032     2.13   0.033     1.069914    5.235393
2-5 years..  |   .7388383   .3200568    -0.70   0.485     .3160953    1.726954
   5+ years  |   .9530791   .0971662    -0.47   0.637     .7804573    1.163881
             |
cancer_hae~t |
  Last year  |   1.908155    .758211     1.63   0.104     .8757625    4.157585
2-5 years..  |   .9744296   .3038449    -0.08   0.934     .5288473    1.795439
   5+ years  |   1.012194    .099201     0.12   0.902     .8352967    1.226553
             |
1.~r_disease |   1.084913   .1020304     0.87   0.386     .9022857    1.304506
1.stroke_d~a |    1.02963   .0979298     0.31   0.759     .8545193    1.240624
1.other_ne~o |   1.078933   .1039953     0.79   0.431     .8932017    1.303285
             |
reduced_ki~t |
Stage 3a/..  |   1.481066    .266023     2.19   0.029     1.041562    2.106026
      1.esrd |   .9456188   .0766116    -0.69   0.490     .8067777    1.108353
1.other_tr~t |   .8986374   .0907139    -1.06   0.290     .7373252    1.095242
  1.asplenia |   .8246815    .079125    -2.01   0.045     .6833083    .9953041
1.ra_sle_p~s |   1.056667   .1049025     0.56   0.579     .8698286    1.283639
1.other_im~o |   .8506999   .0858995    -1.60   0.109     .6979531    1.036875
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |    .227182   .1334096    -2.52   0.012      .071865    .7181754
          1 #|
 only 12-18  |   .1796484   .1278266    -2.41   0.016     .0445412    .7245782
    1#mixed  |   .2840209   .1550119    -2.31   0.021     .0974506    .8277818
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    7.53
         Prob > chi2 =    0.0568

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3999003   .1784459    -2.05   0.040     .1667721    .9589148
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4227813   .2112196    -1.72   0.085     .1588033    1.125569
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4903785   .2038042    -1.71   0.086     .2171536    1.107378
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_
> timeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_timeper
> iod2.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,699      2,202 |     4,901 
         1 |     2,535      2,090 |     4,625 
-----------+----------------------+----------
     Total |     5,234      4,292 |     9,526 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1411.2689
Iteration 1:   log pseudolikelihood =  -1394.937
Iteration 2:   log pseudolikelihood = -1392.8579
Iteration 3:   log pseudolikelihood = -1392.6985
Iteration 4:   log pseudolikelihood = -1392.6527
Iteration 5:   log pseudolikelihood = -1392.6359
Iteration 6:   log pseudolikelihood = -1392.6297
Iteration 7:   log pseudolikelihood = -1392.6274
Iteration 8:   log pseudolikelihood = -1392.6266
Iteration 9:   log pseudolikelihood = -1392.6263
Iteration 10:  log pseudolikelihood = -1392.6262
Iteration 11:  log pseudolikelihood = -1392.6261
Iteration 12:  log pseudolikelihood = -1392.6261
Iteration 13:  log pseudolikelihood = -1392.6261
Iteration 14:  log pseudolikelihood = -1392.6261
Iteration 15:  log pseudolikelihood = -1392.6261
Iteration 16:  log pseudolikelihood = -1392.6261
Iteration 17:  log pseudolikelihood = -1392.6261
Iteration 18:  log pseudolikelihood = -1392.6261
Iteration 19:  log pseudolikelihood = -1392.6261
Iteration 20:  log pseudolikelihood = -1392.6261
Iteration 21:  log pseudolikelihood = -1392.6261
Iteration 22:  log pseudolikelihood = -1392.6261
Iteration 23:  log pseudolikelihood = -1392.6261
Iteration 24:  log pseudolikelihood = -1392.6261
Iteration 25:  log pseudolikelihood = -1392.6261
Iteration 26:  log pseudolikelihood = -1392.6261
Iteration 27:  log pseudolikelihood = -1392.6261
Iteration 28:  log pseudolikelihood = -1392.6261
Iteration 29:  log pseudolikelihood = -1392.6261
Iteration 30:  log pseudolikelihood = -1392.6261
Iteration 31:  log pseudolikelihood = -1392.6261
Refining estimates:
Iteration 0:   log pseudolikelihood = -1392.6261
Iteration 1:   log pseudolikelihood = -1392.6261
Iteration 2:   log pseudolikelihood = -1392.6261

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          679             Number of obs    =         679
No. of failures      =          367
Time at risk         =        22324
                                                Wald chi2(44)    =     2051.21
Log pseudolikelihood =   -1392.6261             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 446 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.046123   .4756442     0.10   0.921     .4291052    2.550359
 only 12-18  |   .8021923   .7220776    -0.24   0.807     .1374315    4.682424
      mixed  |   .8344684   .3508993    -0.43   0.667     .3659943    1.902592
             |
        age1 |   1.018253   .0517296     0.36   0.722     .9217493    1.124861
        age2 |   .9654477   .2544364    -0.13   0.894     .5759715    1.618291
        age3 |   1.044586   .5855926     0.08   0.938     .3481472    3.134194
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |    3.02652   1.825547     1.84   0.066     .9279248    9.871299
             |
   ethnicity |
Asian or ..  |   1.040123    .208282     0.20   0.844     .7024793    1.540053
      Other  |   1.101415   .1888958     0.56   0.573     .7869868    1.541468
             |
   obese4cat |
Obese I ..)  |   .8695622    .140506    -0.86   0.387     .6335216    1.193548
Obese II..)  |   1.002586    .190266     0.01   0.989     .6911692    1.454315
Obese II..)  |    1.12786    .258361     0.53   0.599     .7198946     1.76702
             |
smoke_nomiss |
     Former  |   .8243105   .2616165    -0.61   0.543     .4425269    1.535472
    Current  |   .8029237   .1535127    -1.15   0.251     .5519901    1.167931
             |
         imd |
          4  |   1.121589   .1525889     0.84   0.399     .8590737    1.464324
5 most de..  |   1.200778   .2115258     1.04   0.299     .8501923     1.69593
             |
tot_adults~h |
          2  |   5.14e-15   5.18e-15   -32.62   0.000     7.12e-16    3.71e-14
          3  |   1.638245   1.132599     0.71   0.475     .4225731    6.351204
             |
1.htdiag_o~p |   .8287671   .0970415    -1.60   0.109      .658816     1.04256
1.~y_disease |   .9440243   .1179249    -0.46   0.645     .7390153    1.205905
    1.asthma |    .961892    .199578    -0.19   0.851     .6404938    1.444567
1.~c_disease |   .9044674   .1145111    -0.79   0.428     .7057088    1.159205
             |
     diabcat |
T1DM, con..  |   .9425073   .3812195    -0.15   0.884     .4265756    2.082444
T1DM, unc..  |   1.292358   .9584014     0.35   0.729     .3020922    5.528743
T2DM, con..  |   1.111186   .1679224     0.70   0.485     .8263289    1.494239
T2DM, unc..  |   1.527864   .4049173     1.60   0.110     .9088615    2.568453
             |
cancer_exh~t |
  Last year  |   2.286312   .7639801     2.47   0.013     1.187691    4.401167
2-5 years..  |   1.178286    .349863     0.55   0.581     .6584263    2.108599
   5+ years  |   .9211506   .1381739    -0.55   0.584     .6865137    1.235982
             |
cancer_hae~t |
  Last year  |   .3730647   .3228525    -1.14   0.255     .0684146    2.034319
2-5 years..  |   .6302506   .2674937    -1.09   0.277     .2743106    1.448051
   5+ years  |   1.182325   .1527202     1.30   0.195     .9178836    1.522951
             |
1.~r_disease |   .9804481   .1326968    -0.15   0.884     .7520045    1.278288
1.stroke_d~a |   1.064134   .1472137     0.45   0.653     .8114094    1.395573
1.other_ne~o |    .778563   .1072213    -1.82   0.069     .5943865    1.019808
             |
reduced_ki~t |
Stage 3a/..  |   .9787964   .4148234    -0.05   0.960     .4265254    2.246155
      1.esrd |   1.005694    .113617     0.05   0.960     .8059398    1.254959
1.other_tr~t |    1.03785   .1390925     0.28   0.782     .7980991    1.349623
  1.asplenia |   1.088304   .1400849     0.66   0.511     .8456384    1.400605
1.ra_sle_p~s |   1.029221   .1673492     0.18   0.859     .7483506    1.415508
1.other_im~o |   1.119679   .1364997     0.93   0.354      .881706    1.421881
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |    .468066   .3056759    -1.16   0.245     .1301428    1.683426
          1 #|
 only 12-18  |   .9101897   .9971934    -0.09   0.932     .1063078    7.792891
    1#mixed  |   .3340545    .203823    -1.80   0.072     .1010317    1.104529
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0

           chi2(  3) =    5.06
         Prob > chi2 =    0.1678

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4896544   .2431231    -1.44   0.150     .1850339     1.29577
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7301472   .4901516    -0.47   0.639     .1958819    2.721614
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2787579   .1367757    -2.60   0.009     .1065554    .7292541
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_
> timeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_timeper
> iod3.ster saved
(no new episodes generated)
(cat_time: 4975 changes made)
(covid_tpp_prob: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       47.76       47.76
          1 |      2,591       27.20       74.97
          2 |      1,433       15.05       90.01
          3 |        679        7.13       97.14
          4 |        272        2.86      100.00
------------+-----------------------------------
      Total |      9,524      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,641      1,908 |     4,549 
         1 |     1,480      1,111 |     2,591 
         2 |       720        713 |     1,433 
         3 |       312        367 |       679 
         4 |        81        191 |       272 
-----------+----------------------+----------
     Total |     5,234      4,290 |     9,524 

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,699      2,202 |     4,901 
         1 |     2,535      2,090 |     4,625 
-----------+----------------------+----------
     Total |     5,234      4,292 |     9,526 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -531.74712
Iteration 1:   log pseudolikelihood = -514.64108
Iteration 2:   log pseudolikelihood = -513.72251
Iteration 3:   log pseudolikelihood = -513.64376
Iteration 4:   log pseudolikelihood = -513.61615
Iteration 5:   log pseudolikelihood = -513.60601
Iteration 6:   log pseudolikelihood = -513.60228
Iteration 7:   log pseudolikelihood = -513.60091
Iteration 8:   log pseudolikelihood =  -513.6004
Iteration 9:   log pseudolikelihood = -513.60022
Iteration 10:  log pseudolikelihood = -513.60015
Iteration 11:  log pseudolikelihood = -513.60013
Iteration 12:  log pseudolikelihood = -513.60012
Iteration 13:  log pseudolikelihood = -513.60011
Iteration 14:  log pseudolikelihood = -513.60011
Iteration 15:  log pseudolikelihood = -513.60011
Iteration 16:  log pseudolikelihood = -513.60011
Iteration 17:  log pseudolikelihood = -513.60011
Iteration 18:  log pseudolikelihood = -513.60011
Iteration 19:  log pseudolikelihood = -513.60011
Iteration 20:  log pseudolikelihood = -513.60011
Iteration 21:  log pseudolikelihood = -513.60011
Iteration 22:  log pseudolikelihood = -513.60011
Iteration 23:  log pseudolikelihood = -513.60011
Iteration 24:  log pseudolikelihood = -513.60011
Iteration 25:  log pseudolikelihood = -513.60011
Iteration 26:  log pseudolikelihood = -513.60011
Iteration 27:  log pseudolikelihood = -513.60011
Iteration 28:  log pseudolikelihood = -513.60011
Iteration 29:  log pseudolikelihood = -513.60011
Iteration 30:  log pseudolikelihood = -513.60011
Refining estimates:
Iteration 0:   log pseudolikelihood = -513.60011
Iteration 1:   log pseudolikelihood = -513.60011
Iteration 2:   log pseudolikelihood = -513.60011
Iteration 3:   log pseudolikelihood = -513.60011
Iteration 4:   log pseudolikelihood = -513.60011
Iteration 5:   log pseudolikelihood = -513.60011

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =          272             Number of obs    =         272
No. of failures      =          191
Time at risk         =         6473
                                                Wald chi2(42)    =     2090.51
Log pseudolikelihood =   -513.60011             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 236 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .5153564   .4016328    -0.85   0.395     .1118769    2.373967
 only 12-18  |   .8539492   .8869784    -0.15   0.879     .1115084    6.539679
      mixed  |   .3685924   .2743916    -1.34   0.180     .0856812    1.585649
             |
        age1 |   1.060486   .0886856     0.70   0.483     .9001635    1.249363
        age2 |   .7422032   .3233909    -0.68   0.494     .3159654    1.743437
        age3 |   1.768942   1.622932     0.62   0.534     .2929348    10.68209
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   6.93e-09   7.33e-09   -17.76   0.000     8.72e-10    5.51e-08
             |
   ethnicity |
Asian or ..  |   1.304686   .3002632     1.16   0.248     .8310151    2.048346
      Other  |   1.123646   .2992702     0.44   0.662     .6666863    1.893813
             |
   obese4cat |
Obese I ..)  |   1.198899   .2887933     0.75   0.451     .7477273    1.922303
Obese II..)  |   1.330561   .3649763     1.04   0.298     .7772271    2.277831
Obese II..)  |   1.552381   .5018251     1.36   0.174     .8238302    2.925224
             |
smoke_nomiss |
     Former  |   1.300203   .5880908     0.58   0.562      .535805    3.155117
    Current  |   .9035456   .2509884    -0.37   0.715     .5242058    1.557393
             |
         imd |
          4  |   .9027198   .1651796    -0.56   0.576     .6306671    1.292128
5 most de..  |    2.14671   .5161492     3.18   0.001     1.340025    3.439015
             |
tot_adults~h |
          2  |   19.12101   26.30334     2.15   0.032     1.289962    283.4295
          3  |   6.341184   8.229589     1.42   0.155     .4982887    80.69743
             |
1.htdiag_o~p |   1.117129   .1885854     0.66   0.512     .8024346    1.555237
1.~y_disease |    .716749   .1523351    -1.57   0.117     .4725589    1.087122
    1.asthma |   1.228175   .3848995     0.66   0.512     .6645091    2.269967
1.~c_disease |   1.193724    .232002     0.91   0.362     .8155899    1.747174
             |
     diabcat |
T1DM, con..  |   .6336831   .3874317    -0.75   0.456     .1911835    2.100361
T1DM, unc..  |   4.24e-16   4.95e-16   -30.35   0.000     4.31e-17    4.17e-15
T2DM, con..  |   1.348866    .314801     1.28   0.200     .8537168    2.131199
T2DM, unc..  |    1.31041   .4495968     0.79   0.431      .668903     2.56715
             |
cancer_exh~t |
2-5 years..  |   2.492205   .9990457     2.28   0.023     1.135963    5.467684
   5+ years  |   1.128676   .2339385     0.58   0.559     .7518696    1.694323
             |
cancer_hae~t |
  Last year  |   2.762134   1.611074     1.74   0.082     .8805684     8.66416
2-5 years..  |   .7860143   .5917559    -0.32   0.749     .1797206    3.437661
   5+ years  |   .8692775   .1917153    -0.64   0.525     .5641956    1.339329
             |
1.~r_disease |   .8768795   .1971508    -0.58   0.559     .5643679     1.36244
1.stroke_d~a |   1.227465   .2436895     1.03   0.302     .8318011    1.811335
1.other_ne~o |   1.056827   .2142374     0.27   0.785     .7103137    1.572379
             |
reduced_ki~t |
Stage 3a/..  |   2.891299   1.168252     2.63   0.009     1.309659    6.383042
      1.esrd |   .6826486   .1357419    -1.92   0.055     .4623163    1.007988
1.other_tr~t |   1.062672   .2677107     0.24   0.809      .648579    1.741149
  1.asplenia |    .831523   .1734861    -0.88   0.377     .5524367    1.251601
1.ra_sle_p~s |   1.352192   .3304763     1.23   0.217     .8375373    2.183093
1.other_im~o |    .732875   .1746802    -1.30   0.192     .4593531    1.169266
             |
        male#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.45e+08   1.74e+08    15.64   0.000     1.37e+07    1.53e+09
          1 #|
 only 12-18  |   1.56e+08          .        .       .            .           .
    1#mixed  |   1.81e+08   1.90e+08    18.03   0.000     2.29e+07    1.43e+09
------------------------------------------------------------------------------
                                                             Stratified by stp

 ( 1)  1.male#1.kids_cat4 = 0
 ( 2)  1.male#2.kids_cat4 = 0
 ( 3)  1.male#3.kids_cat4 = 0
       Constraint 2 dropped

           chi2(  2) =  325.17
         Prob > chi2 =    0.0000

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.male#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   7.46e+07   9.84e+07    13.76   0.000      5641609    9.88e+08
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.male#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.34e+08   1.39e+08    18.01   0.000     1.74e+07    1.02e+09
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.male#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   6.66e+07   8.66e+07    13.85   0.000      5202483    8.52e+08
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_
> timeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_male_1_timeper
> iod4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_sex_covid_tpp_prob.lo
> g
  log type:  text
 closed on:  28 Oct 2021, 11:41:50
-------------------------------------------------------------------------------
