-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b.log
  log type:  text
 opened on:  30 Nov 2021, 13:56:29

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
  4. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
  5. drop if covid_vacc_date<d(20dec2020)
  6. drop if covid_vacc_second_dose_date<d(20dec2020)
  7. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  8. replace `outcome'=0 if stime_`outcome'<date_`outcome'
  9. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 10. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 11. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 12. format first_vacc_plus_7d second_vacc_plus_7d %td
 13. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 14. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 15. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 16. 
. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 17. recode `outcome' .=0 
 18. stsplit split2, after(second_vacc_plus_7d) at(0)
 19. recode `outcome' .=0 
 20. 
. stset
 21. bysort patient_id (_t): gen vaccine=_n
 22. strate vaccine if kids_cat4==0, per(100000)
 23. strate vaccine if kids_cat4==1, per(100000)
 24. 
. 
. foreach int_type in  vaccine  {
 25. 
. foreach exposure_type in kids_cat4  {
 26. 
. 
. *Unadjusted  model (interaction)
. stcox   i.`exposure_type'       ///
>                         i.`int_type'#i.`exposure_type' ///
>                         , strata(stp) vce(cluster household_id) 
 27. 
. if _rc==0 {
 28. *testparm 1.`int_type'#i.`exposure_type'
. di _n "kids_cat4=0 " _n "****************"
 29. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 30. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 31. lincom 0.`exposure_type' + 3.`int_type'#0.`exposure_type', eform
 32. 
. di _n "kids_cat4=1 " _n "****************"
 33. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 34. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 35. lincom 1.`exposure_type' + 3.`int_type'#1.`exposure_type', eform
 36. 
. di _n "kids_cat4=2 " _n "****************"
 37. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 38. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 39. lincom 2.`exposure_type' + 3.`int_type'#2.`exposure_type', eform
 40. 
. di _n "kids_cat4=3 " _n "****************"
 41. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 42. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 43. lincom 3.`exposure_type' + 3.`int_type'#3.`exposure_type', eform
 44. }
 45. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"             
>       
 46. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         i.`int_type'#i.`exposure_type' ///
>                         , strata(stp) vce(cluster household_id) 
 47. if _rc==0 {
 48. *testparm 1.`int_type'#i.`exposure_type'
. di _n "kids_cat4=0 " _n "****************"
 49. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 50. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 51. lincom 0.`exposure_type' + 3.`int_type'#0.`exposure_type', eform
 52. 
. di _n "kids_cat4=1 " _n "****************"
 53. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 54. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 55. lincom 1.`exposure_type' + 3.`int_type'#1.`exposure_type', eform
 56. 
. di _n "kids_cat4=2 " _n "****************"
 57. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 58. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 59. lincom 2.`exposure_type' + 3.`int_type'#2.`exposure_type', eform
 60. 
. di _n "kids_cat4=3 " _n "****************"
 61. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 62. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 63. lincom 3.`exposure_type' + 3.`int_type'#3.`exposure_type', eform
 64. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x', replace
 65. }
 66. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 67. }
 68. }
 69. }
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(626 records included in the analysis)

  +------------------------------------------------------+
  | vaccine     D        Y      Rate    Lower      Upper |
  |------------------------------------------------------|
  |       1   206   0.5074    405.99   354.17     465.40 |
  |       2    68   0.1086    626.15   493.69     794.15 |
  |       3     2   0.0005   3846.15   961.91   15378.61 |
  +------------------------------------------------------+


         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(1987 records included in the analysis)

  +----------------------------------------------------+
  | vaccine     D        Y     Rate    Lower     Upper |
  |----------------------------------------------------|
  |       1   368   1.0151   362.52   327.31    401.52 |
  |       2    58   0.1416   409.69   316.73    529.94 |
  |       3     4   0.0087   457.14   171.57   1218.02 |
  +----------------------------------------------------+


         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -11758.128
Iteration 1:   log pseudolikelihood = -11754.443
Iteration 2:   log pseudolikelihood = -11752.917
Iteration 3:   log pseudolikelihood = -11752.742
Iteration 4:   log pseudolikelihood =  -11752.68
Iteration 5:   log pseudolikelihood = -11752.657
Iteration 6:   log pseudolikelihood = -11752.649
Iteration 7:   log pseudolikelihood = -11752.646
Iteration 8:   log pseudolikelihood = -11752.645
Iteration 9:   log pseudolikelihood = -11752.644
Iteration 10:  log pseudolikelihood = -11752.644
Iteration 11:  log pseudolikelihood = -11752.644
Iteration 12:  log pseudolikelihood = -11752.644
Iteration 13:  log pseudolikelihood = -11752.644
Iteration 14:  log pseudolikelihood = -11752.644
Iteration 15:  log pseudolikelihood = -11752.644
Iteration 16:  log pseudolikelihood = -11752.644
Iteration 17:  log pseudolikelihood = -11752.644
Iteration 18:  log pseudolikelihood = -11752.644
Iteration 19:  log pseudolikelihood = -11752.644
Iteration 20:  log pseudolikelihood = -11752.644
Iteration 21:  log pseudolikelihood = -11752.644
Iteration 22:  log pseudolikelihood = -11752.644
Iteration 23:  log pseudolikelihood = -11752.644
Iteration 24:  log pseudolikelihood = -11752.644
Iteration 25:  log pseudolikelihood = -11752.644
Iteration 26:  log pseudolikelihood = -11752.644
Iteration 27:  log pseudolikelihood = -11752.644
Iteration 28:  log pseudolikelihood = -11752.644
Iteration 29:  log pseudolikelihood = -11752.644
Iteration 30:  log pseudolikelihood = -11752.644
Iteration 31:  log pseudolikelihood = -11752.644
Iteration 32:  log pseudolikelihood = -11752.644
Iteration 33:  log pseudolikelihood = -11752.644
Iteration 34:  log pseudolikelihood = -11752.644
Iteration 35:  log pseudolikelihood = -11752.644
Iteration 36:  log pseudolikelihood = -11752.644
Iteration 37:  log pseudolikelihood = -11752.644
Iteration 38:  log pseudolikelihood = -11752.644
Iteration 39:  log pseudolikelihood = -11752.644
Iteration 40:  log pseudolikelihood = -11752.644
Iteration 41:  log pseudolikelihood = -11752.644
Iteration 42:  log pseudolikelihood = -11752.644
Iteration 43:  log pseudolikelihood = -11752.644
Iteration 44:  log pseudolikelihood = -11752.644
Iteration 45:  log pseudolikelihood = -11752.644
Refining estimates:
Iteration 0:   log pseudolikelihood = -11752.644

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,528             Number of obs    =      13,724
No. of failures      =        2,022
Time at risk         =       572927
                                                Wald chi2(10)    =       21.02
Log pseudolikelihood =   -11752.644             Prob > chi2      =      0.0210

                         (Std. Err. adjusted for 988 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.001039   .0828293     0.01   0.990     .8511768    1.177287
 only 12-18  |   .8660785   .1375901    -0.91   0.365     .6343524    1.182453
      mixed  |   .9853513   .0746202    -0.19   0.845     .8494347    1.143016
             |
     vaccine#|
   kids_cat4 |
     2#none  |   1.052091   .1610624     0.33   0.740     .7793719    1.420241
          2 #|
only <12 ..  |   .8675792   .1225247    -1.01   0.315     .6578053     1.14425
          2 #|
 only 12-18  |   1.455011   .4126644     1.32   0.186     .8345491    2.536767
    2#mixed  |   1.022368   .1045938     0.22   0.829     .8366133    1.249366
     3#none  |   9.510793    5.23454     4.09   0.000      3.23395    27.97049
          3 #|
only <12 ..  |   1.042885   .5009379     0.09   0.930     .4067915     2.67363
          3 #|
 only 12-18  |   6.82e-20          .        .       .            .           .
    3#mixed  |   1.436847   .4642384     1.12   0.262     .7627658    2.706635
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.052091   .1610624     0.33   0.740     .7793719    1.420241
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   9.510793    5.23454     4.09   0.000      3.23395    27.97049
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.001039   .0828293     0.01   0.990     .8511768    1.177287
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8684806   .1204716    -1.02   0.309      .661737    1.139816
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.043969   .4934167     0.09   0.927     .4134087    2.636305
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8660785   .1375901    -0.91   0.365     .6343524    1.182453
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.260154   .3425671     0.85   0.395     .7396533    2.146935
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   5.91e-20   9.38e-21  -278.70   0.000     4.33e-20    8.06e-20
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9853513   .0746202    -0.19   0.845     .8494347    1.143016
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.007392   .1109604     0.07   0.947     .8117864     1.25013
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.415799   .4622001     1.07   0.287     .7466538    2.684626
------------------------------------------------------------------------------

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -11758.128
Iteration 1:   log pseudolikelihood = -11743.624
Iteration 2:   log pseudolikelihood = -11732.924
Iteration 3:   log pseudolikelihood = -11732.065
Iteration 4:   log pseudolikelihood = -11731.932
Iteration 5:   log pseudolikelihood = -11731.893
Iteration 6:   log pseudolikelihood = -11731.879
Iteration 7:   log pseudolikelihood = -11731.874
Iteration 8:   log pseudolikelihood = -11731.872
Iteration 9:   log pseudolikelihood = -11731.871
Iteration 10:  log pseudolikelihood = -11731.871
Iteration 11:  log pseudolikelihood = -11731.871
Iteration 12:  log pseudolikelihood = -11731.871
Iteration 13:  log pseudolikelihood = -11731.871
Iteration 14:  log pseudolikelihood = -11731.871
Iteration 15:  log pseudolikelihood = -11731.871
Iteration 16:  log pseudolikelihood = -11731.871
Iteration 17:  log pseudolikelihood = -11731.871
Iteration 18:  log pseudolikelihood = -11731.871
Iteration 19:  log pseudolikelihood = -11731.871
Iteration 20:  log pseudolikelihood = -11731.871
Iteration 21:  log pseudolikelihood = -11731.871
Iteration 22:  log pseudolikelihood = -11731.871
Iteration 23:  log pseudolikelihood = -11731.871
Iteration 24:  log pseudolikelihood = -11731.871
Iteration 25:  log pseudolikelihood = -11731.871
Iteration 26:  log pseudolikelihood = -11731.871
Iteration 27:  log pseudolikelihood = -11731.871
Iteration 28:  log pseudolikelihood = -11731.871
Iteration 29:  log pseudolikelihood = -11731.871
Iteration 30:  log pseudolikelihood = -11731.871
Iteration 31:  log pseudolikelihood = -11731.871
Iteration 32:  log pseudolikelihood = -11731.871
Iteration 33:  log pseudolikelihood = -11731.871
Iteration 34:  log pseudolikelihood = -11731.871
Iteration 35:  log pseudolikelihood = -11731.871
Iteration 36:  log pseudolikelihood = -11731.871
Iteration 37:  log pseudolikelihood = -11731.871
Iteration 38:  log pseudolikelihood = -11731.871
Refining estimates:
Iteration 0:   log pseudolikelihood = -11731.871
Iteration 1:   log pseudolikelihood = -11731.871
Iteration 2:   log pseudolikelihood = -11731.871

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,528             Number of obs    =      13,724
No. of failures      =        2,022
Time at risk         =       572927
                                                Wald chi2(50)    =     7277.11
Log pseudolikelihood =   -11731.871             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 988 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9903584   .0877356    -0.11   0.913     .8325008    1.178149
 only 12-18  |   .8694798    .143923    -0.84   0.398     .6285822    1.202699
      mixed  |   .9723164   .0802968    -0.34   0.734     .8270139    1.143148
             |
        age1 |   .9965437   .0081272    -0.42   0.671     .9807414    1.012601
        age2 |   1.028582   .0254734     1.14   0.255      .979847     1.07974
        age3 |   .9103812    .062676    -1.36   0.173     .7954659    1.041897
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9850773   .0437178    -0.34   0.735     .9030128      1.0746
             |
   ethnicity |
Asian or ..  |   .9959934     .07345    -0.05   0.957     .8619541    1.150877
      Other  |   1.051101   .0775521     0.68   0.499     .9095804     1.21464
             |
   obese4cat |
Obese I ..)  |   .9173861   .0630029    -1.26   0.209     .8018527    1.049566
Obese II..)  |   .9622099   .0796027    -0.47   0.641     .8181835    1.131589
Obese II..)  |   .9187584   .0941993    -0.83   0.409     .7514993    1.123244
             |
smoke_nomiss |
     Former  |   1.091797   .1767689     0.54   0.588     .7949267    1.499536
    Current  |   .9875736   .0676446    -0.18   0.855     .8635068    1.129466
             |
         imd |
          4  |    1.04025   .0588866     0.70   0.486     .9310068    1.162312
5 most de..  |   1.028719   .0804869     0.36   0.717     .8824676    1.199208
             |
tot_adults~h |
          2  |   1.097313   .2287196     0.45   0.656     .7293051    1.651017
          3  |   1.134688   .1803315     0.80   0.427     .8309952    1.549368
             |
1.htdiag_o~p |   1.013363   .0483963     0.28   0.781     .9228117    1.112799
1.~y_disease |   .8969205   .0499246    -1.95   0.051     .8042187    1.000308
    1.asthma |    1.05714   .0846414     0.69   0.488     .9036074    1.236759
1.~c_disease |   1.021405   .0567777     0.38   0.703      .915971    1.138976
             |
     diabcat |
T1DM, con..  |   .9701725   .1444625    -0.20   0.839     .7246057    1.298961
T1DM, unc..  |   .6577323   .2764406    -1.00   0.319     .2885989    1.499007
T2DM, con..  |   1.047189   .0607427     0.79   0.427     .9346541    1.173274
T2DM, unc..  |   .9118942   .1037105    -0.81   0.417      .729687      1.1396
Diabetes,..  |   7.16e-18   4.64e-18   -60.88   0.000     2.01e-18    2.55e-17
             |
cancer_exh~t |
  Last year  |   .7114106   .2747963    -0.88   0.378     .3336776    1.516749
2-5 years..  |   .8290438    .156562    -0.99   0.321     .5725732    1.200394
   5+ years  |   .9549554   .0544121    -0.81   0.419      .854049    1.067784
             |
cancer_hae~t |
  Last year  |   1.549747   .5779947     1.17   0.240     .7460985    3.219034
2-5 years..  |   .8502737    .138287    -1.00   0.319     .6181884     1.16949
   5+ years  |   1.115567   .0651532     1.87   0.061     .9949072    1.250861
             |
1.~r_disease |   1.008921   .0529582     0.17   0.866     .9102852    1.118244
1.stroke_d~a |   .9257596   .0501815    -1.42   0.155     .8324501    1.029528
1.other_ne~o |   .9772273   .0542551    -0.41   0.678     .8764706    1.089567
             |
reduced_ki~t |
Stage 3a/..  |   1.480439   .4192387     1.39   0.166     .8498508    2.578923
      1.esrd |   1.051139   .0501925     1.04   0.296     .9572263    1.154264
1.other_tr~t |   1.169497    .065423     2.80   0.005      1.04805    1.305018
  1.asplenia |   .9169139   .0523228    -1.52   0.128     .8198899    1.025419
1.ra_sle_p~s |   1.002948   .0530451     0.06   0.956     .9041884    1.112494
1.other_im~o |   1.002933   .0566647     0.05   0.959     .8978003    1.120376
             |
     vaccine#|
   kids_cat4 |
     2#none  |   1.001094   .1579362     0.01   0.994     .7348288     1.36384
          2 #|
only <12 ..  |   .8568311    .121402    -1.09   0.275      .649069    1.131096
          2 #|
 only 12-18  |   1.536925   .4271084     1.55   0.122     .8914671    2.649719
    2#mixed  |    1.01038   .1044486     0.10   0.920     .8250711    1.237309
     3#none  |   8.749309   4.910327     3.86   0.000     2.912451    26.28385
          3 #|
only <12 ..  |   1.020331   .4606881     0.04   0.964     .4211301    2.472099
          3 #|
 only 12-18  |   7.16e-18   5.36e-18   -52.74   0.000     1.65e-18    3.10e-17
    3#mixed  |   1.427959   .4608494     1.10   0.270     .7585858    2.687983
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.001094   .1579362     0.01   0.994     .7348288     1.36384
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   8.749309   4.910327     3.86   0.000     2.912451    26.28385
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9903584   .0877356    -0.11   0.913     .8325008    1.178149
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8485699   .1221323    -1.14   0.254     .6399949     1.12512
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.010493   .4472076     0.02   0.981     .4244461    2.405716
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8694798    .143923    -0.84   0.398     .6285822    1.202699
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.336325   .3521905     1.10   0.271     .7972171    2.239998
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   6.23e-18   4.55e-18   -54.27   0.000     1.49e-18    2.60e-17
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9723164   .0802968    -0.34   0.734     .8270139    1.143148
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9824092    .114069    -0.15   0.879     .7824528    1.233465
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.388428   .4547053     1.00   0.316     .7307312    2.638085
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine
> _0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine_0.ster
>  saved
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(191 records included in the analysis)

  +------------------------------------------------------+
  | vaccine    D        Y      Rate     Lower      Upper |
  |------------------------------------------------------|
  |       1   61   0.1506   405.154   315.235    520.721 |
  |       2   19   0.0322   590.062   376.373    925.075 |
  |       3    1   0.0014   689.655    97.147   4895.911 |
  +------------------------------------------------------+


         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(536 records included in the analysis)

  +--------------------------------------------------+
  | vaccine    D        Y     Rate    Lower    Upper |
  |--------------------------------------------------|
  |       1   98   0.2565   382.05   313.43   465.70 |
  |       2   17   0.0322   528.11   328.31   849.52 |
  |       3    0   0.0026     0.00        .        . |
  +--------------------------------------------------+


         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 3.vaccine#2.kids_cat4 identifies no observations in the sample
Iteration 0:   log pseudolikelihood = -2378.6887
Iteration 1:   log pseudolikelihood = -2375.7667
Iteration 2:   log pseudolikelihood = -2375.2645
Iteration 3:   log pseudolikelihood = -2375.1109
Iteration 4:   log pseudolikelihood = -2375.0549
Iteration 5:   log pseudolikelihood = -2375.0344
Iteration 6:   log pseudolikelihood = -2375.0268
Iteration 7:   log pseudolikelihood =  -2375.024
Iteration 8:   log pseudolikelihood =  -2375.023
Iteration 9:   log pseudolikelihood = -2375.0226
Iteration 10:  log pseudolikelihood = -2375.0225
Iteration 11:  log pseudolikelihood = -2375.0224
Iteration 12:  log pseudolikelihood = -2375.0224
Iteration 13:  log pseudolikelihood = -2375.0224
Iteration 14:  log pseudolikelihood = -2375.0224
Iteration 15:  log pseudolikelihood = -2375.0224
Iteration 16:  log pseudolikelihood = -2375.0224
Iteration 17:  log pseudolikelihood = -2375.0224
Iteration 18:  log pseudolikelihood = -2375.0224
Iteration 19:  log pseudolikelihood = -2375.0224
Iteration 20:  log pseudolikelihood = -2375.0224
Iteration 21:  log pseudolikelihood = -2375.0224
Iteration 22:  log pseudolikelihood = -2375.0224
Iteration 23:  log pseudolikelihood = -2375.0224
Iteration 24:  log pseudolikelihood = -2375.0224
Iteration 25:  log pseudolikelihood = -2375.0224
Iteration 26:  log pseudolikelihood = -2375.0224
Iteration 27:  log pseudolikelihood = -2375.0224
Iteration 28:  log pseudolikelihood = -2375.0224
Iteration 29:  log pseudolikelihood = -2375.0224
Iteration 30:  log pseudolikelihood = -2375.0224
Iteration 31:  log pseudolikelihood = -2375.0224
Iteration 32:  log pseudolikelihood = -2375.0224
Iteration 33:  log pseudolikelihood = -2375.0224
Iteration 34:  log pseudolikelihood = -2375.0224
Iteration 35:  log pseudolikelihood = -2375.0224
Iteration 36:  log pseudolikelihood = -2375.0224
Iteration 37:  log pseudolikelihood = -2375.0224
Iteration 38:  log pseudolikelihood = -2375.0224
Iteration 39:  log pseudolikelihood = -2375.0224
Iteration 40:  log pseudolikelihood = -2375.0224
Iteration 41:  log pseudolikelihood = -2375.0224
Iteration 42:  log pseudolikelihood = -2375.0224
Iteration 43:  log pseudolikelihood = -2375.0224
Iteration 44:  log pseudolikelihood = -2375.0224
Refining estimates:
Iteration 0:   log pseudolikelihood = -2375.0224

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,489             Number of obs    =       3,814
No. of failures      =          532
Time at risk         =       155076
                                                Wald chi2(8)     =        7.47
Log pseudolikelihood =   -2375.0224             Prob > chi2      =      0.4874

                         (Std. Err. adjusted for 777 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.082073   .1789444     0.48   0.633     .7825134    1.496309
 only 12-18  |   .9137526   .2740626    -0.30   0.764     .5076063    1.644865
      mixed  |   .9985447   .1501435    -0.01   0.992     .7436676    1.340776
             |
     vaccine#|
   kids_cat4 |
     2#none  |   1.196067   .2644154     0.81   0.418     .7754968    1.844724
          2 #|
only <12 ..  |    1.08597   .2683649     0.33   0.739     .6690656    1.762652
          2 #|
 only 12-18  |   .4257435   .2536472    -1.43   0.152     .1324414    1.368587
    2#mixed  |    1.01665   .1930497     0.09   0.931     .7007103    1.475042
     3#none  |   1.084074    .289751     0.30   0.763     .6420223    1.830492
          3 #|
only <12 ..  |   6.88e-20          .        .       .            .           .
          3 #|
 only 12-18  |          1  (empty)
    3#mixed  |   7.56e-20          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.196067   .2644154     0.81   0.418     .7754968    1.844724
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.084074    .289751     0.30   0.763     .6420223    1.830492
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.082073   .1789444     0.48   0.633     .7825134    1.496309
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.175098   .3156604     0.60   0.548     .6940976    1.989427
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   7.45e-20   1.23e-20  -266.33   0.000     5.38e-20    1.03e-19
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9137526   .2740626    -0.30   0.764     .5076063    1.644865
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3890242   .1859979    -1.97   0.048     .1524071    .9929972
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3o.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9137526   .2740626    -0.30   0.764     .5076063    1.644865
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9985447   .1501435    -0.01   0.992     .7436676    1.340776
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.01517    .213769     0.07   0.943     .6718892    1.533841
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   7.55e-20   1.14e-20  -292.83   0.000     5.62e-20    1.01e-19
------------------------------------------------------------------------------

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
note: 3.vaccine#2.kids_cat4 identifies no observations in the sample
Iteration 0:   log pseudolikelihood = -2378.6887
Iteration 1:   log pseudolikelihood = -2355.0395
Iteration 2:   log pseudolikelihood = -2353.1472
Iteration 3:   log pseudolikelihood =  -2352.719
Iteration 4:   log pseudolikelihood = -2352.5653
Iteration 5:   log pseudolikelihood =  -2352.509
Iteration 6:   log pseudolikelihood = -2352.4884
Iteration 7:   log pseudolikelihood = -2352.4808
Iteration 8:   log pseudolikelihood =  -2352.478
Iteration 9:   log pseudolikelihood = -2352.4769
Iteration 10:  log pseudolikelihood = -2352.4766
Iteration 11:  log pseudolikelihood = -2352.4764
Iteration 12:  log pseudolikelihood = -2352.4764
Iteration 13:  log pseudolikelihood = -2352.4764
Iteration 14:  log pseudolikelihood = -2352.4763
Iteration 15:  log pseudolikelihood = -2352.4763
Iteration 16:  log pseudolikelihood = -2352.4763
Iteration 17:  log pseudolikelihood = -2352.4763
Iteration 18:  log pseudolikelihood = -2352.4763
Iteration 19:  log pseudolikelihood = -2352.4763
Iteration 20:  log pseudolikelihood = -2352.4763
Iteration 21:  log pseudolikelihood = -2352.4763
Iteration 22:  log pseudolikelihood = -2352.4763
Iteration 23:  log pseudolikelihood = -2352.4763
Iteration 24:  log pseudolikelihood = -2352.4763
Iteration 25:  log pseudolikelihood = -2352.4763
Iteration 26:  log pseudolikelihood = -2352.4763
Iteration 27:  log pseudolikelihood = -2352.4763
Iteration 28:  log pseudolikelihood = -2352.4763
Iteration 29:  log pseudolikelihood = -2352.4763
Iteration 30:  log pseudolikelihood = -2352.4763
Iteration 31:  log pseudolikelihood = -2352.4763
Iteration 32:  log pseudolikelihood = -2352.4763
Iteration 33:  log pseudolikelihood = -2352.4763
Refining estimates:
Iteration 0:   log pseudolikelihood = -2352.4763
Iteration 1:   log pseudolikelihood = -2352.4763
Iteration 2:   log pseudolikelihood = -2352.4763

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,489             Number of obs    =       3,814
No. of failures      =          532
Time at risk         =       155076
                                                Wald chi2(49)    =    21865.91
Log pseudolikelihood =   -2352.4763             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 777 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.150592   .2092969     0.77   0.441     .8055355    1.643456
 only 12-18  |   .9365714   .2772504    -0.22   0.825     .5242788    1.673091
      mixed  |   1.083659   .1902181     0.46   0.647     .7682079    1.528646
             |
        age1 |   .9806692   .0375562    -0.51   0.610     .9097551    1.057111
        age2 |   1.103025   .1909302     0.57   0.571      .785679    1.548552
        age3 |   .7908351   .3331293    -0.56   0.577     .3463602    1.805693
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9108008   .0782101    -1.09   0.277      .769717    1.077744
             |
   ethnicity |
Asian or ..  |   1.087201   .1681088     0.54   0.589     .8029573    1.472065
      Other  |   1.087639   .1658393     0.55   0.582     .8066714    1.466469
             |
   obese4cat |
Obese I ..)  |    .922429   .1251228    -0.60   0.552     .7070853    1.203356
Obese II..)  |   1.102142   .1631885     0.66   0.511     .8245263     1.47323
Obese II..)  |   1.231732    .225727     1.14   0.255     .8600526    1.764035
             |
smoke_nomiss |
     Former  |    .743521   .2794918    -0.79   0.430     .3558967    1.553326
    Current  |   1.238538   .1536535     1.72   0.085     .9712002    1.579464
             |
         imd |
          4  |   .9645442   .1031374    -0.34   0.736     .7821757    1.189433
5 most de..  |    .907632   .1348364    -0.65   0.514     .6783544    1.214403
             |
tot_adults~h |
          2  |   2.341275   1.015379     1.96   0.050     1.000686    5.477811
          3  |   1.119025    .364339     0.35   0.730     .5911536     2.11826
             |
1.htdiag_o~p |   .9529737   .0917661    -0.50   0.617     .7890689    1.150925
1.~y_disease |   1.005938   .1110927     0.05   0.957     .8101532    1.249037
    1.asthma |   1.048241   .1704813     0.29   0.772      .762124    1.441773
1.~c_disease |   .7452677   .0853794    -2.57   0.010     .5953836    .9328841
             |
     diabcat |
T1DM, con..  |   .8949058   .2349775    -0.42   0.672     .5349033    1.497198
T1DM, unc..  |   .4967536   .4739588    -0.73   0.463     .0765595    3.223169
T2DM, con..  |   .9725665    .119914    -0.23   0.822     .7637816    1.238424
T2DM, unc..  |   .9622851   .2226298    -0.17   0.868      .611468    1.514376
Diabetes,..  |   6.89e-16   5.75e-16   -41.86   0.000     1.34e-16    3.53e-15
             |
cancer_exh~t |
  Last year  |   .3258839   .3868161    -0.94   0.345     .0318206    3.337475
2-5 years..  |   1.805091   .5450402     1.96   0.050     .9988085    3.262242
   5+ years  |   1.097071   .1256361     0.81   0.419     .8765075    1.373137
             |
cancer_hae~t |
  Last year  |   4.29e-16   3.74e-16   -40.53   0.000     7.75e-17    2.37e-15
2-5 years..  |   1.020708   .3580602     0.06   0.953     .5132195    2.030016
   5+ years  |   1.299503   .1526801     2.23   0.026     1.032211     1.63601
             |
1.~r_disease |   1.156685    .128335     1.31   0.190     .9306228    1.437661
1.stroke_d~a |   1.053913   .1227315     0.45   0.652     .8388414    1.324128
1.other_ne~o |   .9761733   .1219112    -0.19   0.847     .7642281    1.246898
             |
reduced_ki~t |
Stage 3a/..  |   .7726972   .2138841    -0.93   0.352     .4491538    1.329302
      1.esrd |   .8756713   .0844587    -1.38   0.169     .7248407    1.057888
1.other_tr~t |   1.038649    .122527     0.32   0.748     .8242418     1.30883
  1.asplenia |   1.098711   .1141095     0.91   0.365     .8963541     1.34675
1.ra_sle_p~s |   1.202587   .1251332     1.77   0.076     .9807222    1.474642
1.other_im~o |   1.168038   .1268987     1.43   0.153     .9440182     1.44522
             |
     vaccine#|
   kids_cat4 |
     2#none  |   1.368133   .3334559     1.29   0.198     .8485246    2.205932
          2 #|
only <12 ..  |   1.154706   .2938532     0.57   0.572      .701221    1.901463
          2 #|
 only 12-18  |   .4129119   .2540226    -1.44   0.150     .1236516    1.378844
    2#mixed  |   1.003505   .1981885     0.02   0.986     .6814134    1.477845
     3#none  |   .7117476   .2596978    -0.93   0.351      .348133    1.455147
          3 #|
only <12 ..  |   3.96e-16   2.71e-16   -51.81   0.000     1.04e-16    1.52e-15
          3 #|
 only 12-18  |          1  (empty)
    3#mixed  |   5.34e-16   3.05e-16   -61.65   0.000     1.75e-16    1.63e-15
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.368133   .3334559     1.29   0.198     .8485246    2.205932
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7117476   .2596978    -0.93   0.351      .348133    1.455147
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.150592   .2092969     0.77   0.441     .8055355    1.643456
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.328595    .379278     1.00   0.320     .7592727    2.324811
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   4.56e-16   3.17e-16   -50.77   0.000     1.17e-16    1.78e-15
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9365714   .2772504    -0.22   0.825     .5242788    1.673091
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3867215   .2055475    -1.79   0.074       .13645    1.096031
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3o.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9365714   .2772504    -0.22   0.825     .5242788    1.673091
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.083659   .1902181     0.46   0.647     .7682079    1.528646
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.087458   .2552365     0.36   0.721     .6864798    1.722652
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   5.79e-16   3.38e-16   -60.19   0.000     1.85e-16    1.81e-15
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine
> _1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine_1.ster
>  saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b.log
  log type:  text
 closed on:  30 Nov 2021, 13:56:44
-------------------------------------------------------------------------------
