-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_shield_covid_death.lo
> g
  log type:  text
 opened on:  28 Oct 2021, 11:43:13

. 
. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. forvalues x=0/1 {
  2. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta",
>  clear
  3. forvalues period=0/4 {
  4. 
. 
. *Split data by time of study period: 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *-School opening +7 days (alpha variant): 15th March 2021 
. *-Schools open delta variant (+7 days): 24th May 2021 
. *Summer holidays +7 days: 24th July 2021
. *Winter term +7 days: 9th September 2021
. 
. if "`outcome'"=="covid_tpp_prob" {
  5. stsplit cat_time, at(0,85,154, 216, 263, 400)
  6. recode cat_time 85=1 154=2 216=3 263=4 
  7. recode `outcome' .=0 
  8. tab cat_time
  9. tab cat_time `outcome'
 10. }
 11. 
. *-School closure: 20th December 2020 (previous analysis up to 19th December 2
> 020) 
. *School opening +14 days (alpha variant): 22nd March 2021 
. *Schools open delta variant (+14 days): 31st May 2021 
. *Summer holidays +14 days: 30th July 2021
. *Winter term +14 days: 16th September 2021
. 
. if "`outcome'"=="covidadmission" | "`outcome'"=="covid_death" {
 12. stsplit cat_time, at(0,92,161,222,270, 400)
 13. recode cat_time 92=1 161=2 222=3 270=4
 14. recode `outcome' .=0 
 15. tab cat_time
 16. tab cat_time `outcome'
 17. }
 18.  
. foreach int_type in  shield  {
 19. 
. tab shield `outcome'
 20. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 21. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposu
> re_type' 1.`int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' ///
>                         if cat_time==`period'                                
>                    ///
>                         , strata(stp) vce(cluster household_id) 
 22. if _rc==0{
 23. *testparm 1.`int_type'#i.`exposure_type'
. di _n "`exposure_type' " _n "****************"
 24. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 25. di "`exposure_type'" _n "****************"
 26. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 27. di "`exposure_type'" _n "****************"
 28. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 29. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod`period', replace
 30. }
 31. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 32. }
 33. drop cat_time
 34. }
 35. }
 36. }
(33,608 observations (episodes) created)
(cat_time: 33608 changes made)
(covid_death: 33608 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,427      1,171 |     7,598 
         1 |    35,736      6,356 |    42,092 
-----------+----------------------+----------
     Total |    42,163      7,527 |    49,690 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -16404.954
Iteration 1:   log pseudolikelihood = -16382.985
Iteration 2:   log pseudolikelihood =  -16382.53
Iteration 3:   log pseudolikelihood = -16382.528
Iteration 4:   log pseudolikelihood = -16382.528
Refining estimates:
Iteration 0:   log pseudolikelihood = -16382.528

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       16,079             Number of obs    =      16,079
No. of failures      =        2,261
Time at risk         =      1306467
                                                Wald chi2(46)    =       47.52
Log pseudolikelihood =   -16382.528             Prob > chi2      =      0.4104

                       (Std. Err. adjusted for 1,117 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .6071883   .1879019    -1.61   0.107     .3310614    1.113623
 only 12-18  |   .7957258   .3334619    -0.55   0.586     .3499882    1.809145
      mixed  |   .6117745   .1630777    -1.84   0.065     .3628196    1.031554
             |
        age1 |   1.026301   .0083932     3.17   0.002     1.009982    1.042884
        age2 |    .935606   .0239082    -2.60   0.009     .8899009    .9836585
        age3 |   1.181322   .0856219     2.30   0.022     1.024881    1.361643
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9614227   .0424078    -0.89   0.372     .8817966    1.048239
             |
   ethnicity |
Asian or ..  |   1.027274   .0715534     0.39   0.699     .8961836     1.17754
      Other  |   .9549193    .065481    -0.67   0.501     .8348297    1.092284
             |
   obese4cat |
Obese I ..)  |   .8889565   .0593135    -1.76   0.078     .7799848    1.013153
Obese II..)  |   .9497856   .0722997    -0.68   0.499     .8181451    1.102607
Obese II..)  |   1.153562   .0963225     1.71   0.087     .9794128    1.358678
             |
smoke_nomiss |
     Former  |    .982852   .1433072    -0.12   0.906     .7385443    1.307976
    Current  |   1.018989   .0620102     0.31   0.757     .9044192    1.148072
             |
         imd |
          4  |   1.028066   .0543056     0.52   0.600     .9269532    1.140208
5 most de..  |   1.011997   .0713694     0.17   0.866     .8813524    1.162007
             |
tot_adults~h |
          2  |   .8549289     .31371    -0.43   0.669     .4164738     1.75498
          3  |   .8242486   .2280835    -0.70   0.485     .4791995    1.417751
             |
    1.shield |   .5009615   .1582558    -2.19   0.029     .2697157      .93047
1.htdiag_o~p |   1.054343   .0483047     1.16   0.248     .9637934    1.153399
1.~y_disease |   .9786404   .0537096    -0.39   0.694     .8788356     1.08978
    1.asthma |   .9522997   .0785995    -0.59   0.554     .8100624    1.119512
1.~c_disease |   1.024674   .0527361     0.47   0.636     .9263552    1.133428
             |
     diabcat |
T1DM, con..  |   .8044204    .112624    -1.55   0.120     .6113775    1.058417
T1DM, unc..  |   1.414191   .3530191     1.39   0.165     .8670139    2.306696
T2DM, con..  |     1.0694   .0574573     1.25   0.212     .9625121    1.188157
T2DM, unc..  |    .940646   .1081282    -0.53   0.595     .7508959    1.178346
Diabetes,..  |    1.07596   .6420247     0.12   0.902      .334106    3.465035
             |
cancer_exh~t |
  Last year  |   1.249856   .4852608     0.57   0.566      .583953    2.675111
2-5 years..  |   .9644169   .1641741    -0.21   0.831     .6908178    1.346375
   5+ years  |    .948386   .0570972    -0.88   0.379     .8428278    1.067165
             |
cancer_hae~t |
  Last year  |   .9910164   .3862925    -0.02   0.982      .461623    2.127523
2-5 years..  |   1.019692   .1669992     0.12   0.905     .7397147    1.405639
   5+ years  |   1.013512   .0540215     0.25   0.801     .9129751    1.125121
             |
1.~r_disease |    .990673   .0520807    -0.18   0.859     .8936796    1.098193
1.stroke_d~a |    .998119   .0526715    -0.04   0.972     .9000441    1.106881
1.other_ne~o |   .9883715   .0524526    -0.22   0.826     .8907323    1.096714
             |
reduced_ki~t |
Stage 3a/..  |   1.637331   .4649312     1.74   0.082     .9384952    2.856544
      1.esrd |    .933581   .0453286    -1.42   0.157     .8488348    1.026788
1.other_tr~t |   .9702653   .0510179    -0.57   0.566     .8752519    1.075593
  1.asplenia |   .9715709   .0530322    -0.53   0.597     .8729966    1.081276
1.ra_sle_p~s |   .9578004   .0471672    -0.88   0.381     .8696757    1.054855
1.other_im~o |   .9793392   .0507869    -0.40   0.687     .8846902    1.084114
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   2.341415   .8450025     2.36   0.018      1.15421    4.749762
          1 #|
 only 12-18  |   1.682504   .8198392     1.07   0.286     .6474232     4.37244
    1#mixed  |    2.20401   .7036259     2.48   0.013     1.178879    4.120577
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.42168   .2665042     1.88   0.061     .9845501     2.05289
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.338812   .3297567     1.18   0.236     .8261594    2.169577
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.348357   .2420102     1.67   0.096     .9484771    1.916828
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_t
> imeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_timeperi
> od0.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,427      1,171 |     7,598 
         1 |    35,736      6,356 |    42,092 
-----------+----------------------+----------
     Total |    42,163      7,527 |    49,690 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -11378.174
Iteration 1:   log pseudolikelihood = -11352.369
Iteration 2:   log pseudolikelihood = -11351.023
Iteration 3:   log pseudolikelihood =  -11350.63
Iteration 4:   log pseudolikelihood = -11350.485
Iteration 5:   log pseudolikelihood = -11350.432
Iteration 6:   log pseudolikelihood = -11350.413
Iteration 7:   log pseudolikelihood = -11350.406
Iteration 8:   log pseudolikelihood = -11350.403
Iteration 9:   log pseudolikelihood = -11350.402
Iteration 10:  log pseudolikelihood = -11350.402
Iteration 11:  log pseudolikelihood = -11350.402
Iteration 12:  log pseudolikelihood = -11350.401
Iteration 13:  log pseudolikelihood = -11350.401
Iteration 14:  log pseudolikelihood = -11350.401
Iteration 15:  log pseudolikelihood = -11350.401
Iteration 16:  log pseudolikelihood = -11350.401
Iteration 17:  log pseudolikelihood = -11350.401
Iteration 18:  log pseudolikelihood = -11350.401
Iteration 19:  log pseudolikelihood = -11350.401
Iteration 20:  log pseudolikelihood = -11350.401
Iteration 21:  log pseudolikelihood = -11350.401
Iteration 22:  log pseudolikelihood = -11350.401
Iteration 23:  log pseudolikelihood = -11350.401
Iteration 24:  log pseudolikelihood = -11350.401
Iteration 25:  log pseudolikelihood = -11350.401
Iteration 26:  log pseudolikelihood = -11350.401
Iteration 27:  log pseudolikelihood = -11350.401
Iteration 28:  log pseudolikelihood = -11350.401
Iteration 29:  log pseudolikelihood = -11350.401
Iteration 30:  log pseudolikelihood = -11350.401
Iteration 31:  log pseudolikelihood = -11350.401
Iteration 32:  log pseudolikelihood = -11350.401
Iteration 33:  log pseudolikelihood = -11350.401
Iteration 34:  log pseudolikelihood = -11350.401
Refining estimates:
Iteration 0:   log pseudolikelihood = -11350.401
Iteration 1:   log pseudolikelihood = -11350.401
Iteration 2:   log pseudolikelihood = -11350.401

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,280             Number of obs    =      12,280
No. of failures      =        1,627
Time at risk         =       753835
                                                Wald chi2(46)    =    37127.08
Log pseudolikelihood =   -11350.401             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,084 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.032919   .4749747     0.07   0.944     .4194226    2.543786
 only 12-18  |   .5548309   .3851784    -0.85   0.396     .1423095    2.163154
      mixed  |   1.148873   .4817853     0.33   0.741      .505029    2.613529
             |
        age1 |   .9914324   .0085278    -1.00   0.317     .9748584    1.008288
        age2 |    1.00732   .0275631     0.27   0.790     .9547207    1.062818
        age3 |   .9864516   .0777183    -0.17   0.863     .8453046    1.151167
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.053799   .0517638     1.07   0.286     .9570745    1.160298
             |
   ethnicity |
Asian or ..  |   1.133574    .087784     1.62   0.105     .9739414    1.319371
      Other  |   1.056751   .0905251     0.64   0.519     .8934195    1.249941
             |
   obese4cat |
Obese I ..)  |   .9100564   .0715384    -1.20   0.231     .7801111    1.061647
Obese II..)  |   .9303316   .0841993    -0.80   0.425     .7791125    1.110901
Obese II..)  |   .9936477   .1084782    -0.06   0.953     .8022419    1.230721
             |
smoke_nomiss |
     Former  |   1.016468   .1755779     0.09   0.925     .7245413    1.426017
    Current  |   .9936896   .0746182    -0.08   0.933     .8576938    1.151249
             |
         imd |
          4  |   1.010138   .0649822     0.16   0.875      .890477    1.145878
5 most de..  |   1.071929   .0876278     0.85   0.396     .9132339      1.2582
             |
tot_adults~h |
          2  |   1.082999   .4613193     0.19   0.852      .469944      2.4958
          3  |   .7329062   .2635322    -0.86   0.387     .3622268    1.482915
             |
    1.shield |   .8592479   .3964787    -0.33   0.742     .3478184    2.122679
1.htdiag_o~p |   .9152786   .0478494    -1.69   0.090     .8261401    1.014035
1.~y_disease |   .9651537   .0656166    -0.52   0.602     .8447476    1.102722
    1.asthma |   1.154341   .1045724     1.58   0.113     .9665476    1.378621
1.~c_disease |   1.019842   .0658688     0.30   0.761     .8985786     1.15747
             |
     diabcat |
T1DM, con..  |   .7916496   .1331744    -1.39   0.165     .5692991    1.100843
T1DM, unc..  |    1.35833   .4150458     1.00   0.316     .7463034    2.472264
T2DM, con..  |   .9693298   .0624216    -0.48   0.629     .8543917     1.09973
T2DM, unc..  |   .8781671   .1145822    -1.00   0.319      .680007    1.134073
Diabetes,..  |   1.517954   .8629353     0.73   0.463     .4981526    4.625457
             |
cancer_exh~t |
  Last year  |   2.37e-16   4.59e-17  -185.30   0.000     1.62e-16    3.46e-16
2-5 years..  |   .8367844   .1776699    -0.84   0.401     .5519282    1.268658
   5+ years  |   1.032866   .0676862     0.49   0.622     .9083695    1.174425
             |
cancer_hae~t |
  Last year  |    1.16208   .4414234     0.40   0.693     .5519522    2.446641
2-5 years..  |   .5661369   .1482721    -2.17   0.030     .3388367    .9459157
   5+ years  |   1.027561   .0682024     0.41   0.682     .9022168     1.17032
             |
1.~r_disease |    1.04843   .0673591     0.74   0.462      .924383    1.189124
1.stroke_d~a |   .9727506   .0605475    -0.44   0.657     .8610327    1.098964
1.other_ne~o |   .9045514   .0568597    -1.60   0.111     .7997001     1.02315
             |
reduced_ki~t |
Stage 3a/..  |   1.224973   .4831986     0.51   0.607      .565411    2.653924
      1.esrd |   .9014798   .0504889    -1.85   0.064     .8077612    1.006072
1.other_tr~t |   .9847395   .0656116    -0.23   0.817     .8641858     1.12211
  1.asplenia |   1.016625   .0667131     0.25   0.802     .8939292    1.156161
1.ra_sle_p~s |   1.035523   .0628828     0.57   0.565     .9193268    1.166405
1.other_im~o |   1.034525   .0644089     0.55   0.586      .915684    1.168789
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |    1.30028    .657994     0.52   0.604     .4822745    3.505735
          1 #|
 only 12-18  |   2.412803   1.779009     1.19   0.232     .5687395      10.236
    1#mixed  |      1.103    .510221     0.21   0.832     .4454825    2.730994
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.343083   .2808059     1.41   0.158      .891533    2.023338
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.338698    .361854     1.08   0.281     .7881341    2.273866
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.267207   .2455043     1.22   0.222     .8668395    1.852492
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_t
> imeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_timeperi
> od1.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,427      1,171 |     7,598 
         1 |    35,736      6,356 |    42,092 
-----------+----------------------+----------
     Total |    42,163      7,527 |    49,690 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -10562.599
Iteration 1:   log pseudolikelihood = -10536.034
Iteration 2:   log pseudolikelihood =  -10535.31
Iteration 3:   log pseudolikelihood =  -10535.15
Iteration 4:   log pseudolikelihood = -10535.091
Iteration 5:   log pseudolikelihood =  -10535.07
Iteration 6:   log pseudolikelihood = -10535.062
Iteration 7:   log pseudolikelihood = -10535.059
Iteration 8:   log pseudolikelihood = -10535.058
Iteration 9:   log pseudolikelihood = -10535.058
Iteration 10:  log pseudolikelihood = -10535.057
Iteration 11:  log pseudolikelihood = -10535.057
Iteration 12:  log pseudolikelihood = -10535.057
Iteration 13:  log pseudolikelihood = -10535.057
Iteration 14:  log pseudolikelihood = -10535.057
Iteration 15:  log pseudolikelihood = -10535.057
Iteration 16:  log pseudolikelihood = -10535.057
Iteration 17:  log pseudolikelihood = -10535.057
Iteration 18:  log pseudolikelihood = -10535.057
Iteration 19:  log pseudolikelihood = -10535.057
Iteration 20:  log pseudolikelihood = -10535.057
Iteration 21:  log pseudolikelihood = -10535.057
Iteration 22:  log pseudolikelihood = -10535.057
Iteration 23:  log pseudolikelihood = -10535.057
Iteration 24:  log pseudolikelihood = -10535.057
Iteration 25:  log pseudolikelihood = -10535.057
Iteration 26:  log pseudolikelihood = -10535.057
Iteration 27:  log pseudolikelihood = -10535.057
Iteration 28:  log pseudolikelihood = -10535.057
Iteration 29:  log pseudolikelihood = -10535.057
Refining estimates:
Iteration 0:   log pseudolikelihood = -10535.057
Iteration 1:   log pseudolikelihood = -10535.057

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        9,516             Number of obs    =       9,516
No. of failures      =        1,574
Time at risk         =       503315
                                                Wald chi2(46)    =     7858.51
Log pseudolikelihood =   -10535.057             Prob > chi2      =      0.0000

                       (Std. Err. adjusted for 1,045 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.135994    .542736     0.27   0.790     .4453518    2.897669
 only 12-18  |   1.412106   .8966809     0.54   0.587     .4067787    4.902035
      mixed  |   1.185388    .515169     0.39   0.696     .5057416    2.778384
             |
        age1 |   .9930707   .0092655    -0.75   0.456     .9750757    1.011398
        age2 |   .9928016   .0295531    -0.24   0.808     .9365359    1.052448
        age3 |   1.046087   .0892021     0.53   0.597     .8850828    1.236379
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9648931   .0480739    -0.72   0.473     .8751242     1.06387
             |
   ethnicity |
Asian or ..  |   .9734768   .0871697    -0.30   0.764     .8167798    1.160236
      Other  |   1.021997   .0906766     0.25   0.806     .8588685    1.216108
             |
   obese4cat |
Obese I ..)  |   .9301572   .0720037    -0.94   0.350     .7992168     1.08255
Obese II..)  |   1.005333    .090737     0.06   0.953     .8423336    1.199874
Obese II..)  |   .9162784   .1056202    -0.76   0.448     .7309854     1.14854
             |
smoke_nomiss |
     Former  |   1.032553   .1870906     0.18   0.860     .7239042    1.472799
    Current  |   1.026984   .0798766     0.34   0.732     .8817775    1.196102
             |
         imd |
          4  |   .9592854   .0618783    -0.64   0.519     .8453595    1.088565
5 most de..  |   1.050127   .0912468     0.56   0.574     .8856864    1.245099
             |
tot_adults~h |
          2  |   .5916677   .2700865    -1.15   0.250     .2418346    1.447562
          3  |    .586656   .1876182    -1.67   0.095     .3134449    1.098009
             |
    1.shield |   .7767779   .3493899    -0.56   0.574     .3216857    1.875694
1.htdiag_o~p |   1.076743   .0585613     1.36   0.174      .967871    1.197862
1.~y_disease |    1.00907   .0669738     0.14   0.892     .8859831    1.149257
    1.asthma |   1.106556    .099606     1.12   0.261     .9275835     1.32006
1.~c_disease |   1.102335   .0672974     1.60   0.111     .9780207    1.242451
             |
     diabcat |
T1DM, con..  |   1.217314   .1711335     1.40   0.162      .924141    1.603493
T1DM, unc..  |   .5644488    .284835    -1.13   0.257      .209936    1.517617
T2DM, con..  |   1.088363   .0753088     1.22   0.221     .9503321    1.246443
T2DM, unc..  |   1.251744   .1467932     1.91   0.056     .9947052    1.575204
Diabetes,..  |   9.49e-14   3.34e-14   -85.29   0.000     4.76e-14    1.89e-13
             |
cancer_exh~t |
  Last year  |   1.537492     .57057     1.16   0.246     .7428961     3.18198
2-5 years..  |   .7781605   .1851693    -1.05   0.292     .4881117    1.240564
   5+ years  |   .9813093    .069166    -0.27   0.789     .8546933    1.126682
             |
cancer_hae~t |
  Last year  |   .5311784   .3121012    -1.08   0.282     .1679211    1.680256
2-5 years..  |   1.350751   .2218042     1.83   0.067     .9790418    1.863586
   5+ years  |   1.040913   .0696828     0.60   0.549     .9129173    1.186853
             |
1.~r_disease |   .8641529   .0563934    -2.24   0.025     .7604005    .9820617
1.stroke_d~a |   .9259639   .0600787    -1.19   0.236     .8153913    1.051531
1.other_ne~o |   1.076448   .0676283     1.17   0.241     .9517352    1.217503
             |
reduced_ki~t |
Stage 3a/..  |      .6053   .3575889    -0.85   0.395     .1901569    1.926767
      1.esrd |   1.025872   .0603137     0.43   0.664     .9142161    1.151165
1.other_tr~t |   1.128928   .0698568     1.96   0.050      .999988    1.274494
  1.asplenia |   1.007988    .066343     0.12   0.904     .8859961    1.146778
1.ra_sle_p~s |   1.022989   .0636982     0.37   0.715     .9054606    1.155773
1.other_im~o |   1.105461   .0762499     1.45   0.146     .9656758    1.265481
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.210475   .6039436     0.38   0.702     .4552654     3.21845
          1 #|
 only 12-18  |   1.024002   .6838813     0.04   0.972     .2765825    3.791203
    1#mixed  |   1.090098   .4930335     0.19   0.849     .4492427    2.645149
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.375092   .2792826     1.57   0.117     .9235315    2.047442
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |      1.446   .3779173     1.41   0.158     .8663703    2.413419
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.292189   .2439569     1.36   0.175     .8925339      1.8708
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_t
> imeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_timeperi
> od2.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,427      1,171 |     7,598 
         1 |    35,736      6,356 |    42,092 
-----------+----------------------+----------
     Total |    42,163      7,527 |    49,690 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -7630.6889
Iteration 1:   log pseudolikelihood = -7607.3016
Iteration 2:   log pseudolikelihood =  -7600.352
Iteration 3:   log pseudolikelihood = -7600.1915
Iteration 4:   log pseudolikelihood = -7600.1859
Iteration 5:   log pseudolikelihood = -7600.1859
Refining estimates:
Iteration 0:   log pseudolikelihood = -7600.1859

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        6,896             Number of obs    =       6,896
No. of failures      =        1,196
Time at risk         =       284743
                                                Wald chi2(46)    =       71.80
Log pseudolikelihood =   -7600.1859             Prob > chi2      =      0.0088

                         (Std. Err. adjusted for 993 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.045526   .5022787     0.09   0.926     .4077658    2.680764
 only 12-18  |   .9536505    .574647    -0.08   0.937     .2927356    3.106726
      mixed  |   .9011698   .3910551    -0.24   0.810      .384977    2.109495
             |
        age1 |    .998123   .0105331    -0.18   0.859     .9776905    1.018983
        age2 |   .9804488   .0333055    -0.58   0.561     .9172968    1.047949
        age3 |    1.08432   .1058747     0.83   0.407      .895457    1.313016
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.143381   .0660964     2.32   0.020     1.020904    1.280552
             |
   ethnicity |
Asian or ..  |   1.052474   .1048563     0.51   0.608     .8657797    1.279426
      Other  |   1.024981   .1022735     0.25   0.805     .8429116    1.246377
             |
   obese4cat |
Obese I ..)  |   1.156513   .0971737     1.73   0.084     .9809122     1.36355
Obese II..)  |   1.020765   .1112813     0.19   0.850     .8243842    1.263926
Obese II..)  |   1.265856   .1503333     1.99   0.047     1.002987    1.597619
             |
smoke_nomiss |
     Former  |   .9053062    .204431    -0.44   0.660     .5815433    1.409318
    Current  |   1.053282    .093814     0.58   0.560     .8845644    1.254179
             |
         imd |
          4  |   1.105407   .0758952     1.46   0.144     .9662292    1.264632
5 most de..  |   1.186952   .1079079     1.89   0.059     .9932277    1.418461
             |
tot_adults~h |
          2  |    .456085   .2315435    -1.55   0.122     .1686208    1.233617
          3  |   .5992423   .2104978    -1.46   0.145     .3010219    1.192908
             |
    1.shield |   .6945836   .3442353    -0.74   0.462     .2629477    1.834762
1.htdiag_o~p |   1.098455   .0658821     1.57   0.117     .9766296    1.235478
1.~y_disease |   1.116048   .0815654     1.50   0.133     .9671044    1.287929
    1.asthma |    1.01566   .1113575     0.14   0.887     .8192605    1.259141
1.~c_disease |    .980224   .0739973    -0.26   0.791      .845411    1.136535
             |
     diabcat |
T1DM, con..  |   .8413865   .1604633    -0.91   0.365     .5789758     1.22273
T1DM, unc..  |   .5640707   .3106783    -1.04   0.299     .1916504    1.660189
T2DM, con..  |    1.04997   .0823108     0.62   0.534     .9004269     1.22435
T2DM, unc..  |   1.318976   .1783253     2.05   0.041      1.01194    1.719171
Diabetes,..  |   4.896807   2.205387     3.53   0.000     2.025608    11.83779
             |
cancer_exh~t |
  Last year  |    1.35819   .6517609     0.64   0.523     .5302617    3.478809
2-5 years..  |   .8059489   .1994118    -0.87   0.383     .4962483    1.308928
   5+ years  |   1.069285   .0882348     0.81   0.417     .9096083    1.256992
             |
cancer_hae~t |
  Last year  |    .207959   .2079535    -1.57   0.116     .0292954    1.476239
2-5 years..  |   1.055913   .2528391     0.23   0.820     .6604002    1.688297
   5+ years  |   1.112189   .0836785     1.41   0.158     .9597015    1.288905
             |
1.~r_disease |   1.080178    .077066     1.08   0.280     .9392165    1.242295
1.stroke_d~a |   .9289488   .0717366    -0.95   0.340     .7984709    1.080748
1.other_ne~o |   1.074723   .0756093     1.02   0.306     .9362946    1.233618
             |
reduced_ki~t |
Stage 3a/..  |   1.557395   .7292024     0.95   0.344     .6220848    3.898951
      1.esrd |   1.041613   .0684214     0.62   0.535     .9157836    1.184732
1.other_tr~t |   1.064621    .078259     0.85   0.394     .9217738    1.229606
  1.asplenia |   1.065775   .0802515     0.85   0.398     .9195413    1.235265
1.ra_sle_p~s |   .9830174   .0688634    -0.24   0.807     .8569034    1.127692
1.other_im~o |   1.040809   .0776731     0.54   0.592     .8991826    1.204742
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .9961565   .5421377    -0.01   0.994     .3428298     2.89452
          1 #|
 only 12-18  |   1.758465   1.174271     0.85   0.398     .4750253    6.509544
    1#mixed  |   1.184779   .5904588     0.34   0.734     .4460909    3.146669
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.041507   .2479014     0.17   0.864     .6532173    1.660607
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.676961   .4932644     1.76   0.079     .9422125    2.984674
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.067687   .2348948     0.30   0.766     .6937077    1.643278
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_t
> imeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_timeperi
> od3.ster saved
(no new episodes generated)
(cat_time: 33608 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,079       32.36       32.36
          1 |     12,280       24.71       57.08
          2 |      9,516       19.15       76.23
          3 |      6,896       13.88       90.11
          4 |      4,916        9.89      100.00
------------+-----------------------------------
      Total |     49,687      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,818      2,261 |    16,079 
         1 |    10,653      1,627 |    12,280 
         2 |     7,942      1,574 |     9,516 
         3 |     5,700      1,196 |     6,896 
         4 |     4,049        867 |     4,916 
-----------+----------------------+----------
     Total |    42,162      7,525 |    49,687 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,427      1,171 |     7,598 
         1 |    35,736      6,356 |    42,092 
-----------+----------------------+----------
     Total |    42,163      7,527 |    49,690 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -5236.2066
Iteration 1:   log pseudolikelihood = -5215.1642
Iteration 2:   log pseudolikelihood = -5214.2863
Iteration 3:   log pseudolikelihood = -5214.2191
Iteration 4:   log pseudolikelihood = -5214.1985
Iteration 5:   log pseudolikelihood =  -5214.191
Iteration 6:   log pseudolikelihood = -5214.1882
Iteration 7:   log pseudolikelihood = -5214.1872
Iteration 8:   log pseudolikelihood = -5214.1868
Iteration 9:   log pseudolikelihood = -5214.1867
Iteration 10:  log pseudolikelihood = -5214.1866
Iteration 11:  log pseudolikelihood = -5214.1866
Iteration 12:  log pseudolikelihood = -5214.1866
Iteration 13:  log pseudolikelihood = -5214.1866
Iteration 14:  log pseudolikelihood = -5214.1866
Iteration 15:  log pseudolikelihood = -5214.1866
Iteration 16:  log pseudolikelihood = -5214.1866
Iteration 17:  log pseudolikelihood = -5214.1866
Iteration 18:  log pseudolikelihood = -5214.1866
Iteration 19:  log pseudolikelihood = -5214.1866
Iteration 20:  log pseudolikelihood = -5214.1866
Iteration 21:  log pseudolikelihood = -5214.1866
Iteration 22:  log pseudolikelihood = -5214.1866
Iteration 23:  log pseudolikelihood = -5214.1866
Iteration 24:  log pseudolikelihood = -5214.1866
Iteration 25:  log pseudolikelihood = -5214.1866
Iteration 26:  log pseudolikelihood = -5214.1866
Iteration 27:  log pseudolikelihood = -5214.1866
Iteration 28:  log pseudolikelihood = -5214.1866
Refining estimates:
Iteration 0:   log pseudolikelihood = -5214.1866
Iteration 1:   log pseudolikelihood = -5214.1866

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,916             Number of obs    =       4,916
No. of failures      =          867
Time at risk         =       151399
                                                Wald chi2(46)    =     3276.63
Log pseudolikelihood =   -5214.1866             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 932 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .3541334   .2109437    -1.74   0.081     .1101891    1.138138
 only 12-18  |   .6060508   .4590469    -0.66   0.509     .1373331    2.674501
      mixed  |   .5365249   .2552754    -1.31   0.191     .2111511    1.363285
             |
        age1 |    .983247    .012927    -1.29   0.199     .9582343    1.008913
        age2 |   1.046495    .042417     1.12   0.262     .9665761    1.133023
        age3 |   .9181735   .1047207    -0.75   0.454     .7342475    1.148172
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9729232   .0659342    -0.41   0.685     .8519092    1.111127
             |
   ethnicity |
Asian or ..  |   .8958771   .1062536    -0.93   0.354     .7100574    1.130325
      Other  |    .928667   .1084879    -0.63   0.526     .7386211    1.167611
             |
   obese4cat |
Obese I ..)  |   1.091547   .1037448     0.92   0.357     .9060263    1.315054
Obese II..)  |    .864972   .1151052    -1.09   0.276     .6663914    1.122729
Obese II..)  |   .9764925   .1469695    -0.16   0.874     .7270372    1.311539
             |
smoke_nomiss |
     Former  |   .9979044   .2356179    -0.01   0.993     .6282166    1.585143
    Current  |   1.112008   .1116763     1.06   0.290     .9133215    1.353917
             |
         imd |
          4  |    .978253   .0828435    -0.26   0.795     .8286421    1.154876
5 most de..  |   1.023884   .1180501     0.20   0.838     .8167894    1.283486
             |
tot_adults~h |
          2  |   .9591701   .5873898    -0.07   0.946     .2888186    3.185416
          3  |   .6440521   .3212766    -0.88   0.378     .2422763    1.712108
             |
    1.shield |   .4445395   .2208908    -1.63   0.103      .167861    1.177256
1.htdiag_o~p |   1.059484   .0769165     0.80   0.426     .9189649     1.22149
1.~y_disease |   1.023049   .0860042     0.27   0.786     .8676389    1.206297
    1.asthma |   .9004985   .1255988    -0.75   0.452     .6851095    1.183603
1.~c_disease |    .970778   .0872203    -0.33   0.741      .814035    1.157702
             |
     diabcat |
T1DM, con..  |   .9198013   .1915936    -0.40   0.688     .6114905    1.383561
T1DM, unc..  |   .8853673   .4945219    -0.22   0.827      .296268    2.645831
T2DM, con..  |   1.016823    .091192     0.19   0.852     .8529174    1.212227
T2DM, unc..  |   1.057222    .192885     0.30   0.760     .7393816    1.511694
Diabetes,..  |   3.05e-13   1.62e-13   -54.32   0.000     1.08e-13    8.62e-13
             |
cancer_exh~t |
  Last year  |   .4928285   .4887795    -0.71   0.476     .0705485    3.442738
2-5 years..  |   1.017812   .2582247     0.07   0.945     .6190321    1.673487
   5+ years  |   1.016115   .0917823     0.18   0.860     .8512487    1.212911
             |
cancer_hae~t |
  Last year  |   2.340116   .8399892     2.37   0.018     1.157969    4.729093
2-5 years..  |   1.385703   .3320006     1.36   0.173     .8664249    2.216203
   5+ years  |   1.158791   .1046927     1.63   0.103     .9707383    1.383274
             |
1.~r_disease |   .9899003   .0859001    -0.12   0.907     .8350782    1.173426
1.stroke_d~a |   .8383826   .0750616    -1.97   0.049     .7034496    .9991981
1.other_ne~o |   1.052203   .0861018     0.62   0.534     .8962846    1.235246
             |
reduced_ki~t |
Stage 3a/..  |   .6654821   .4639605    -0.58   0.559     .1697056    2.609616
      1.esrd |   1.049053   .0752778     0.67   0.505     .9114173    1.207475
1.other_tr~t |   .9984653   .0922818    -0.02   0.987     .8330323    1.196752
  1.asplenia |   1.021398   .0926292     0.23   0.815     .8550683    1.220083
1.ra_sle_p~s |   1.028266   .0860087     0.33   0.739     .8727849    1.211445
1.other_im~o |   1.259233   .1039248     2.79   0.005     1.071164    1.480321
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   3.403936   2.137175     1.95   0.051     .9943775     11.6523
          1 #|
 only 12-18  |   2.117799   1.614459     0.98   0.325     .4753239    9.435828
    1#mixed  |   2.210889   1.110699     1.58   0.114     .8259303    5.918214
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.205448   .3366302     0.67   0.503      .697339    2.083784
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.283494   .5382824     0.60   0.552     .5641697    2.919966
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.186197   .3097458     0.65   0.513     .7110283    1.978914
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_t
> imeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_0_timeperi
> od4.ster saved
(9,403 observations (episodes) created)
(cat_time: 9403 changes made)
(covid_death: 9403 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,915        317 |     2,232 
         1 |     9,871      1,851 |    11,722 
-----------+----------------------+----------
     Total |    11,786      2,168 |    13,954 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood =  -4040.444
Iteration 1:   log pseudolikelihood = -4015.2538
Iteration 2:   log pseudolikelihood = -4014.0698
Iteration 3:   log pseudolikelihood = -4013.7904
Iteration 4:   log pseudolikelihood = -4013.6936
Iteration 5:   log pseudolikelihood =  -4013.658
Iteration 6:   log pseudolikelihood = -4013.6449
Iteration 7:   log pseudolikelihood = -4013.6401
Iteration 8:   log pseudolikelihood = -4013.6384
Iteration 9:   log pseudolikelihood = -4013.6377
Iteration 10:  log pseudolikelihood = -4013.6375
Iteration 11:  log pseudolikelihood = -4013.6374
Iteration 12:  log pseudolikelihood = -4013.6373
Iteration 13:  log pseudolikelihood = -4013.6373
Iteration 14:  log pseudolikelihood = -4013.6373
Iteration 15:  log pseudolikelihood = -4013.6373
Iteration 16:  log pseudolikelihood = -4013.6373
Iteration 17:  log pseudolikelihood = -4013.6373
Iteration 18:  log pseudolikelihood = -4013.6373
Iteration 19:  log pseudolikelihood = -4013.6373
Iteration 20:  log pseudolikelihood = -4013.6373
Iteration 21:  log pseudolikelihood = -4013.6373
Iteration 22:  log pseudolikelihood = -4013.6373
Iteration 23:  log pseudolikelihood = -4013.6373
Iteration 24:  log pseudolikelihood = -4013.6373
Iteration 25:  log pseudolikelihood = -4013.6373
Iteration 26:  log pseudolikelihood = -4013.6373
Iteration 27:  log pseudolikelihood = -4013.6373
Iteration 28:  log pseudolikelihood = -4013.6373
Iteration 29:  log pseudolikelihood = -4013.6373
Refining estimates:
Iteration 0:   log pseudolikelihood = -4013.6373
Iteration 1:   log pseudolikelihood = -4013.6373
Iteration 2:   log pseudolikelihood = -4013.6373

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        4,549             Number of obs    =       4,549
No. of failures      =          674
Time at risk         =       366077
                                                Wald chi2(45)    =     8610.96
Log pseudolikelihood =   -4013.6373             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 924 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.429635   .9188972     0.56   0.578     .4056166    5.038886
 only 12-18  |   2.78e-09   1.16e-09   -47.16   0.000     1.23e-09    6.31e-09
      mixed  |   1.127014   .6792451     0.20   0.843     .3458713    3.672348
             |
        age1 |   .9785205   .0344079    -0.62   0.537     .9133536    1.048337
        age2 |   1.078747   .2033676     0.40   0.688     .7455029    1.560953
        age3 |   .8798572   .3561104    -0.32   0.752     .3980153    1.945023
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.066298    .086115     0.79   0.427     .9101957    1.249172
             |
   ethnicity |
Asian or ..  |   .9847072   .1289443    -0.12   0.906      .761807    1.272827
      Other  |   1.006274   .1302084     0.05   0.961     .7808613    1.296758
             |
   obese4cat |
Obese I ..)  |   .8590491   .0983708    -1.33   0.185     .6863502    1.075202
Obese II..)  |   1.005744   .1323884     0.04   0.965      .777037    1.301766
Obese II..)  |    1.11672   .1862802     0.66   0.508     .8052956    1.548579
             |
smoke_nomiss |
     Former  |   1.279048   .3211804     0.98   0.327     .7818846    2.092335
    Current  |   .9804997    .116538    -0.17   0.868     .7767429    1.237707
             |
         imd |
          4  |   .8835904   .0921068    -1.19   0.235     .7203118    1.083881
5 most de..  |   .9943126   .1343446    -0.04   0.966     .7629824     1.29578
             |
tot_adults~h |
          2  |   .3751246   .4156388    -0.88   0.376     .0427605    3.290853
          3  |   1.566311   .7938658     0.89   0.376     .5800387    4.229599
             |
    1.shield |   1.426136   .9555277     0.53   0.596     .3835711    5.302442
1.htdiag_o~p |   1.048123   .0904896     0.54   0.586       .88496    1.241368
1.~y_disease |   .9101981   .0911208    -0.94   0.347     .7480341    1.107517
    1.asthma |   .9705656   .1399912    -0.21   0.836     .7315607    1.287655
1.~c_disease |   .8639046   .0878242    -1.44   0.150     .7078365    1.054383
             |
     diabcat |
T1DM, con..  |   1.493023   .2966837     2.02   0.044     1.011396    2.204001
T1DM, unc..  |   1.497421   .6085944     0.99   0.321     .6751361     3.32121
T2DM, con..  |   .8839316   .0961704    -1.13   0.257     .7141827    1.094027
T2DM, unc..  |   .8972323    .186216    -0.52   0.601     .5973686     1.34762
Diabetes,..  |   3.31e-14   1.69e-14   -60.87   0.000     1.22e-14    8.99e-14
             |
cancer_exh~t |
  Last year  |   1.582709   .7033249     1.03   0.302     .6624359     3.78145
2-5 years..  |   .8995076   .2969292    -0.32   0.748     .4710007    1.717861
   5+ years  |    1.19526   .1182015     1.80   0.071     .9846582    1.450906
             |
cancer_hae~t |
  Last year  |   .9650634    .467769    -0.07   0.942     .3732295    2.495374
2-5 years..  |   .5653356   .2335108    -1.38   0.167     .2516049    1.270263
   5+ years  |   .7609989   .0854864    -2.43   0.015     .6106112    .9484256
             |
1.~r_disease |   1.265253   .1155124     2.58   0.010     1.057952    1.513173
1.stroke_d~a |   .9973255   .0950665    -0.03   0.978     .8273689    1.202194
1.other_ne~o |   1.056972   .0962724     0.61   0.543     .8841651    1.263554
             |
reduced_ki~t |
Stage 3a/..  |   1.162271   .2258258     0.77   0.439     .7941847    1.700957
      1.esrd |   1.106645   .0959596     1.17   0.243     .9336815     1.31165
1.other_tr~t |   1.097481   .1085195     0.94   0.347     .9041274    1.332184
  1.asplenia |   1.191738   .1178408     1.77   0.076     .9817768    1.446601
1.ra_sle_p~s |   1.084485   .1001887     0.88   0.380     .9048703    1.299752
1.other_im~o |   1.099927   .1080506     0.97   0.332     .9072913    1.333463
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .5424108   .3886087    -0.85   0.393     .1331948    2.208866
          1 #|
 only 12-18  |   2.16e+08          .        .       .            .           .
    1#mixed  |   .6759083   .4570255    -0.58   0.562     .1796119    2.543551
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7754494   .2467399    -0.80   0.424     .4156329    1.446761
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6010702   .2511128    -1.22   0.223     .2650412    1.363129
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7617578   .2335144    -0.89   0.375     .4177186    1.389153
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_t
> imeperiod0.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_timeperi
> od0.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,915        317 |     2,232 
         1 |     9,871      1,851 |    11,722 
-----------+----------------------+----------
     Total |    11,786      2,168 |    13,954 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2637.5026
Iteration 1:   log pseudolikelihood = -2621.0009
Iteration 2:   log pseudolikelihood = -2616.9947
Iteration 3:   log pseudolikelihood = -2616.6119
Iteration 4:   log pseudolikelihood = -2616.5923
Iteration 5:   log pseudolikelihood = -2616.5873
Iteration 6:   log pseudolikelihood = -2616.5855
Iteration 7:   log pseudolikelihood = -2616.5848
Iteration 8:   log pseudolikelihood = -2616.5846
Iteration 9:   log pseudolikelihood = -2616.5845
Iteration 10:  log pseudolikelihood = -2616.5844
Iteration 11:  log pseudolikelihood = -2616.5844
Iteration 12:  log pseudolikelihood = -2616.5844
Iteration 13:  log pseudolikelihood = -2616.5844
Iteration 14:  log pseudolikelihood = -2616.5844
Iteration 15:  log pseudolikelihood = -2616.5844
Iteration 16:  log pseudolikelihood = -2616.5844
Iteration 17:  log pseudolikelihood = -2616.5844
Iteration 18:  log pseudolikelihood = -2616.5844
Iteration 19:  log pseudolikelihood = -2616.5844
Iteration 20:  log pseudolikelihood = -2616.5844
Iteration 21:  log pseudolikelihood = -2616.5844
Iteration 22:  log pseudolikelihood = -2616.5844
Iteration 23:  log pseudolikelihood = -2616.5844
Iteration 24:  log pseudolikelihood = -2616.5844
Iteration 25:  log pseudolikelihood = -2616.5844
Iteration 26:  log pseudolikelihood = -2616.5844
Iteration 27:  log pseudolikelihood = -2616.5844
Iteration 28:  log pseudolikelihood = -2616.5844
Iteration 29:  log pseudolikelihood = -2616.5844
Iteration 30:  log pseudolikelihood = -2616.5844
Refining estimates:
Iteration 0:   log pseudolikelihood = -2616.5844
Iteration 1:   log pseudolikelihood = -2616.5844
Iteration 2:   log pseudolikelihood = -2616.5844

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,427             Number of obs    =       3,427
No. of failures      =          461
Time at risk         =       209290
                                                Wald chi2(46)    =     3282.41
Log pseudolikelihood =   -2616.5844             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 886 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.657445   2.708574     0.96   0.338     .3604837    19.59038
 only 12-18  |   3.464325   4.027807     1.07   0.285     .3547863    33.82754
      mixed  |   3.059195   2.886804     1.18   0.236     .4812516    19.44653
             |
        age1 |   .9195513   .0403859    -1.91   0.056     .8437075    1.002213
        age2 |   1.492656   .3432123     1.74   0.081     .9511291    2.342501
        age3 |   .4600867   .2259745    -1.58   0.114     .1756979    1.204794
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9918096   .0922804    -0.09   0.930     .8264763    1.190217
             |
   ethnicity |
Asian or ..  |   1.127757   .1732039     0.78   0.434     .8346137     1.52386
      Other  |   .9851372   .1482976    -0.10   0.921     .7334341    1.323221
             |
   obese4cat |
Obese I ..)  |   .7839949   .1098434    -1.74   0.082     .5957358    1.031746
Obese II..)  |   .9414291   .1671743    -0.34   0.734      .664715    1.333336
Obese II..)  |   .8537662   .1862697    -0.72   0.469     .5567098     1.30933
             |
smoke_nomiss |
     Former  |   .8455226   .3080855    -0.46   0.645     .4139715    1.726951
    Current  |   .9149994   .1466869    -0.55   0.580     .6682848    1.252795
             |
         imd |
          4  |   .9589059   .1125254    -0.36   0.721      .761885    1.206876
5 most de..  |   1.029146   .1646519     0.18   0.857     .7521326    1.408186
             |
tot_adults~h |
          2  |   .3112779    .362957    -1.00   0.317     .0316686    3.059626
          3  |   .8511532    .475109    -0.29   0.773     .2850177    2.541813
             |
    1.shield |    2.79496   2.943205     0.98   0.329     .3548349    22.01531
1.htdiag_o~p |   1.034724    .104279     0.34   0.735     .8492601     1.26069
1.~y_disease |   1.005158   .1251845     0.04   0.967     .7874516    1.283053
    1.asthma |   .9562685   .1746368    -0.24   0.807     .6685451     1.36782
1.~c_disease |   .9504351   .1142323    -0.42   0.672     .7509603    1.202896
             |
     diabcat |
T1DM, con..  |   1.210974   .3459264     0.67   0.503     .6918008     2.11977
T1DM, unc..  |   .8056642   .5732196    -0.30   0.761     .1997723    3.249174
T2DM, con..  |     .98773    .125912    -0.10   0.923     .7693613    1.268079
T2DM, unc..  |   .8276476   .2253996    -0.69   0.487     .4853234    1.411431
Diabetes,..  |   1.12e-14   6.69e-15   -53.86   0.000     3.48e-15    3.61e-14
             |
cancer_exh~t |
  Last year  |   3.354859   1.445422     2.81   0.005     1.441912     7.80566
2-5 years..  |   .7039039   .3261132    -0.76   0.449     .2838953    1.745294
   5+ years  |   1.126742   .1424592     0.94   0.345     .8794343    1.443597
             |
cancer_hae~t |
  Last year  |   1.368751   .8528571     0.50   0.614     .4035972    4.641955
2-5 years..  |   1.411331   .4677671     1.04   0.299     .7370713    2.702393
   5+ years  |   1.169243   .1363338     1.34   0.180     .9303681    1.469451
             |
1.~r_disease |    .959767   .1134602    -0.35   0.728     .7612719    1.210018
1.stroke_d~a |   .8989261   .1098194    -0.87   0.383     .7075138    1.142123
1.other_ne~o |   1.288855    .142068     2.30   0.021     1.038432     1.59967
             |
reduced_ki~t |
Stage 3a/..  |    .871859   .2215159    -0.54   0.589     .5298816    1.434543
      1.esrd |   1.001826    .112141     0.02   0.987     .8044735    1.247593
1.other_tr~t |   .9248853   .1231221    -0.59   0.557     .7124832    1.200608
  1.asplenia |   .8426319    .109925    -1.31   0.189     .6525217     1.08813
1.ra_sle_p~s |   .9751236   .1169748    -0.21   0.834     .7708155    1.233584
1.other_im~o |   1.064939   .1271896     0.53   0.598     .8426799     1.34582
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   .3806829   .4326517    -0.85   0.395     .0410356    3.531558
          1 #|
 only 12-18  |   .5340047   .6877786    -0.49   0.626     .0427788    6.665943
    1#mixed  |   .3914881   .4136813    -0.89   0.375     .0493473    3.105805
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.011644   .3799338     0.03   0.975     .4845624    2.112057
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.849966   .8473558     1.34   0.179     .7538424    4.539907
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.197639   .4221098     0.51   0.609     .6002308    2.389644
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_t
> imeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_timeperi
> od1.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,915        317 |     2,232 
         1 |     9,871      1,851 |    11,722 
-----------+----------------------+----------
     Total |    11,786      2,168 |    13,954 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -2380.2034
Iteration 1:   log pseudolikelihood = -2363.7598
Iteration 2:   log pseudolikelihood = -2362.8765
Iteration 3:   log pseudolikelihood = -2362.8162
Iteration 4:   log pseudolikelihood = -2362.8002
Iteration 5:   log pseudolikelihood = -2362.7942
Iteration 6:   log pseudolikelihood = -2362.7921
Iteration 7:   log pseudolikelihood = -2362.7913
Iteration 8:   log pseudolikelihood =  -2362.791
Iteration 9:   log pseudolikelihood = -2362.7909
Iteration 10:  log pseudolikelihood = -2362.7908
Iteration 11:  log pseudolikelihood = -2362.7908
Iteration 12:  log pseudolikelihood = -2362.7908
Iteration 13:  log pseudolikelihood = -2362.7908
Iteration 14:  log pseudolikelihood = -2362.7908
Iteration 15:  log pseudolikelihood = -2362.7908
Iteration 16:  log pseudolikelihood = -2362.7908
Iteration 17:  log pseudolikelihood = -2362.7908
Iteration 18:  log pseudolikelihood = -2362.7908
Iteration 19:  log pseudolikelihood = -2362.7908
Iteration 20:  log pseudolikelihood = -2362.7908
Iteration 21:  log pseudolikelihood = -2362.7908
Iteration 22:  log pseudolikelihood = -2362.7908
Iteration 23:  log pseudolikelihood = -2362.7908
Iteration 24:  log pseudolikelihood = -2362.7908
Iteration 25:  log pseudolikelihood = -2362.7908
Iteration 26:  log pseudolikelihood = -2362.7908
Iteration 27:  log pseudolikelihood = -2362.7908
Refining estimates:
Iteration 0:   log pseudolikelihood = -2362.7908
Iteration 1:   log pseudolikelihood = -2362.7908

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        2,658             Number of obs    =       2,658
No. of failures      =          438
Time at risk         =       140582
                                                Wald chi2(46)    =     2460.92
Log pseudolikelihood =   -2362.7908             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 836 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .3730679   .2292519    -1.60   0.109     .1118718      1.2441
 only 12-18  |   .6117047   .5155073    -0.58   0.560     .1172739    3.190674
      mixed  |   .5486463   .2417803    -1.36   0.173     .2313026    1.301381
             |
        age1 |   1.060734   .0538431     1.16   0.245     .9602831    1.171693
        age2 |   .7545524    .195821    -1.09   0.278     .4537181    1.254853
        age3 |   1.761705   .9704727     1.03   0.304     .5984543    5.186037
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9133174   .0928275    -0.89   0.372     .7483548    1.114643
             |
   ethnicity |
Asian or ..  |   1.212978   .1905647     1.23   0.219     .8915075    1.650368
      Other  |   .8601279   .1453792    -0.89   0.373      .617579    1.197936
             |
   obese4cat |
Obese I ..)  |   1.076638   .1503772     0.53   0.597      .818804    1.415662
Obese II..)  |   1.080784   .1937766     0.43   0.665     .7605449    1.535865
Obese II..)  |   1.205074   .2600645     0.86   0.387     .7894375    1.839542
             |
smoke_nomiss |
     Former  |   .6373072   .2632711    -1.09   0.275     .2836078     1.43212
    Current  |   1.275307   .1782379     1.74   0.082     .9697287    1.677179
             |
         imd |
          4  |   .9905761   .1215625    -0.08   0.938     .7788059     1.25993
5 most de..  |   1.029991   .1696629     0.18   0.858     .7457984    1.422479
             |
tot_adults~h |
          2  |   .6293429   .4408353    -0.66   0.509     .1594582    2.483864
          3  |   .5516522   .2804107    -1.17   0.242     .2036998    1.493964
             |
    1.shield |   .6670395   .3408183    -0.79   0.428     .2450401    1.815791
1.htdiag_o~p |   1.268473   .1338561     2.25   0.024     1.031473    1.559929
1.~y_disease |   .9857825   .1192401    -0.12   0.906     .7777139    1.249518
    1.asthma |   1.011181    .176179     0.06   0.949     .7186593    1.422769
1.~c_disease |   1.004451   .1147307     0.04   0.969     .8029758    1.256478
             |
     diabcat |
T1DM, con..  |   1.219017   .3431082     0.70   0.482     .7021474     2.11637
T1DM, unc..  |   1.031412   .6001695     0.05   0.958     .3297048    3.226553
T2DM, con..  |   .9713165   .1301989    -0.22   0.828     .7469001    1.263162
T2DM, unc..  |   .8374276   .2220061    -0.67   0.503     .4980691    1.408007
Diabetes,..  |   6.50e-13   3.98e-13   -45.78   0.000     1.95e-13    2.16e-12
             |
cancer_exh~t |
  Last year  |   .7450417   .8012652    -0.27   0.784     .0905199    6.132208
2-5 years..  |   1.033658   .3909269     0.09   0.930     .4925544    2.169198
   5+ years  |   1.054396   .1386108     0.40   0.687     .8149014    1.364277
             |
cancer_hae~t |
  Last year  |   .8649734   .6114853    -0.21   0.837     .2163981     3.45742
2-5 years..  |   1.072596   .4285531     0.18   0.861     .4901636      2.3471
   5+ years  |   .9279043   .1186635    -0.59   0.558     .7221854    1.192223
             |
1.~r_disease |   .9784663   .1223465    -0.17   0.862     .7657949    1.250199
1.stroke_d~a |   .8882608   .1048387    -1.00   0.315     .7048161    1.119451
1.other_ne~o |   1.119979   .1359259     0.93   0.350      .882885    1.420744
             |
reduced_ki~t |
Stage 3a/..  |   1.149639   .2534278     0.63   0.527     .7463142     1.77093
      1.esrd |   .9634876   .1092338    -0.33   0.743     .7715118    1.203233
1.other_tr~t |   1.048403   .1245901     0.40   0.691     .8305641    1.323376
  1.asplenia |   1.006303   .1227773     0.05   0.959     .7922739    1.278152
1.ra_sle_p~s |   1.305242   .1517434     2.29   0.022     1.039281    1.639265
1.other_im~o |   .9465719   .1186327    -0.44   0.661     .7404122    1.210135
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   2.293178   1.555102     1.22   0.221      .607018     8.66311
          1 #|
 only 12-18  |   .5975261   .6651572    -0.46   0.644     .0674236    5.295437
    1#mixed  |   1.526963   .7934754     0.81   0.415     .5514521     4.22814
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8555109   .2949959    -0.45   0.651     .4352268     1.68165
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3655095   .2379167    -1.55   0.122     .1020555    1.309064
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8377627   .2719767    -0.55   0.586     .4433854    1.582926
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_t
> imeperiod2.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_timeperi
> od2.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,915        317 |     2,232 
         1 |     9,871      1,851 |    11,722 
-----------+----------------------+----------
     Total |    11,786      2,168 |    13,954 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1750.1713
Iteration 1:   log pseudolikelihood = -1732.3607
Iteration 2:   log pseudolikelihood =  -1728.048
Iteration 3:   log pseudolikelihood = -1727.6187
Iteration 4:   log pseudolikelihood = -1727.5922
Iteration 5:   log pseudolikelihood = -1727.5852
Iteration 6:   log pseudolikelihood = -1727.5826
Iteration 7:   log pseudolikelihood = -1727.5816
Iteration 8:   log pseudolikelihood = -1727.5813
Iteration 9:   log pseudolikelihood = -1727.5811
Iteration 10:  log pseudolikelihood = -1727.5811
Iteration 11:  log pseudolikelihood = -1727.5811
Iteration 12:  log pseudolikelihood =  -1727.581
Iteration 13:  log pseudolikelihood =  -1727.581
Iteration 14:  log pseudolikelihood =  -1727.581
Iteration 15:  log pseudolikelihood =  -1727.581
Iteration 16:  log pseudolikelihood =  -1727.581
Iteration 17:  log pseudolikelihood =  -1727.581
Iteration 18:  log pseudolikelihood =  -1727.581
Iteration 19:  log pseudolikelihood =  -1727.581
Iteration 20:  log pseudolikelihood =  -1727.581
Iteration 21:  log pseudolikelihood =  -1727.581
Iteration 22:  log pseudolikelihood =  -1727.581
Iteration 23:  log pseudolikelihood =  -1727.581
Iteration 24:  log pseudolikelihood =  -1727.581
Iteration 25:  log pseudolikelihood =  -1727.581
Iteration 26:  log pseudolikelihood =  -1727.581
Iteration 27:  log pseudolikelihood =  -1727.581
Iteration 28:  log pseudolikelihood =  -1727.581
Iteration 29:  log pseudolikelihood =  -1727.581
Iteration 30:  log pseudolikelihood =  -1727.581
Iteration 31:  log pseudolikelihood =  -1727.581
Iteration 32:  log pseudolikelihood =  -1727.581
Iteration 33:  log pseudolikelihood =  -1727.581
Iteration 34:  log pseudolikelihood =  -1727.581
Iteration 35:  log pseudolikelihood =  -1727.581
Refining estimates:
Iteration 0:   log pseudolikelihood =  -1727.581
Iteration 1:   log pseudolikelihood =  -1727.581

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,946             Number of obs    =       1,946
No. of failures      =          342
Time at risk         =        79767
                                                Wald chi2(46)    =     3534.31
Log pseudolikelihood =    -1727.581             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 758 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .2746612   .1540615    -2.30   0.021     .0914842    .8246103
 only 12-18  |   .2758197   .2635017    -1.35   0.178     .0424071    1.793959
      mixed  |    .201234   .0855017    -3.77   0.000     .0875058    .4627704
             |
        age1 |   1.050463   .0548561     0.94   0.346     .9482657    1.163673
        age2 |   .8570033   .2329523    -0.57   0.570     .5030455    1.460017
        age3 |   1.280376   .7438414     0.43   0.671     .4100414    3.998045
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.031931   .1178543     0.28   0.783     .8249674    1.290816
             |
   ethnicity |
Asian or ..  |   1.037403   .2041215     0.19   0.852     .7054453    1.525568
      Other  |   .7339896   .1457951    -1.56   0.119     .4972933    1.083346
             |
   obese4cat |
Obese I ..)  |   .9795095    .145898    -0.14   0.889     .7315132    1.311581
Obese II..)  |   .8842175   .1868109    -0.58   0.560     .5844179    1.337811
Obese II..)  |   .6695557   .2064326    -1.30   0.193     .3658899    1.225245
             |
smoke_nomiss |
     Former  |   1.196171    .397059     0.54   0.589     .6240858    2.292675
    Current  |   .8710059   .1572429    -0.77   0.444     .6114395    1.240763
             |
         imd |
          4  |   1.049599   .1358973     0.37   0.708     .8143545    1.352798
5 most de..  |   .6998796   .1558964    -1.60   0.109     .4522935    1.082995
             |
tot_adults~h |
          2  |    1.16091   1.421508     0.12   0.903     .1053225    12.79605
          3  |   1.496271   1.096557     0.55   0.582     .3557944    6.292475
             |
    1.shield |   .1451104   .1112996    -2.52   0.012     .0322721    .6524835
1.htdiag_o~p |   .9720141   .1138968    -0.24   0.809     .7725597    1.222962
1.~y_disease |   .8166436    .120842    -1.37   0.171     .6110502    1.091411
    1.asthma |   .9278261   .1996016    -0.35   0.728      .608624    1.414438
1.~c_disease |   1.111405   .1508367     0.78   0.436     .8518239     1.45009
             |
     diabcat |
T1DM, con..  |   1.037813   .3471609     0.11   0.912     .5387435      1.9992
T1DM, unc..  |   1.092563   .8164323     0.12   0.906     .2525659    4.726267
T2DM, con..  |   .7466642   .1214105    -1.80   0.072      .542896    1.026914
T2DM, unc..  |   1.489395   .3547616     1.67   0.094     .9338146    2.375522
Diabetes,..  |   2.47e-16   1.61e-16   -55.13   0.000     6.87e-17    8.85e-16
             |
cancer_exh~t |
  Last year  |   1.303104   .8202933     0.42   0.674     .3794504    4.475107
2-5 years..  |   1.568566   .6065092     1.16   0.244     .7351456    3.346821
   5+ years  |   .9525542   .1426621    -0.32   0.746      .710243    1.277534
             |
cancer_hae~t |
  Last year  |   .9578733   .6306591    -0.07   0.948      .263561    3.481248
2-5 years..  |   1.163055   .4911733     0.36   0.721      .508308    2.661177
   5+ years  |   .9819869   .1341998    -0.13   0.894     .7512409    1.283607
             |
1.~r_disease |   1.005753   .1375058     0.04   0.967     .7693358    1.314822
1.stroke_d~a |   1.033942   .1365826     0.25   0.801     .7980928    1.339488
1.other_ne~o |   1.093122   .1543219     0.63   0.528     .8288963    1.441576
             |
reduced_ki~t |
Stage 3a/..  |   1.091437   .3063411     0.31   0.755      .629631    1.891957
      1.esrd |   .9808237   .1267549    -0.15   0.881     .7613555    1.263556
1.other_tr~t |   1.118272   .1484373     0.84   0.400     .8621061    1.450556
  1.asplenia |   .7756128   .1111242    -1.77   0.076     .5857213    1.027067
1.ra_sle_p~s |   .9935306   .1432162    -0.05   0.964     .7489997    1.317895
1.other_im~o |   1.076787   .1508495     0.53   0.597     .8182446    1.417022
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   9.548699   8.463758     2.55   0.011     1.680575    54.25385
          1 #|
 only 12-18  |   7.086793   8.458538     1.64   0.101     .6831038    73.52124
    1#mixed  |    11.4658   8.980564     3.11   0.002      2.47003    53.22385
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.622658   1.767916     1.43   0.153     .6997653    9.829484
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.954677   1.580507     0.83   0.407     .4006944    9.535356
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.307308   1.502729     1.28   0.199     .6437621    8.269621
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_t
> imeperiod3.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_timeperi
> od3.ster saved
(no new episodes generated)
(cat_time: 9403 changes made)
(covid_death: 0 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,549       32.60       32.60
          1 |      3,427       24.56       57.17
          2 |      2,658       19.05       76.22
          3 |      1,946       13.95       90.17
          4 |      1,372        9.83      100.00
------------+-----------------------------------
      Total |     13,952      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,875        674 |     4,549 
         1 |     2,966        461 |     3,427 
         2 |     2,220        438 |     2,658 
         3 |     1,604        342 |     1,946 
         4 |     1,119        253 |     1,372 
-----------+----------------------+----------
     Total |    11,784      2,168 |    13,952 

           |   Failure/censoring
           |     indicator for
  Probable | outcome: covid death
 shielding |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,915        317 |     2,232 
         1 |     9,871      1,851 |    11,722 
-----------+----------------------+----------
     Total |    11,786      2,168 |    13,954 

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -1205.0131
Iteration 1:   log pseudolikelihood =    -1189.5
Iteration 2:   log pseudolikelihood = -1179.6724
Iteration 3:   log pseudolikelihood = -1178.6964
Iteration 4:   log pseudolikelihood = -1178.6449
Iteration 5:   log pseudolikelihood = -1178.6446
Iteration 6:   log pseudolikelihood = -1178.6446
Refining estimates:
Iteration 0:   log pseudolikelihood = -1178.6446

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,372             Number of obs    =       1,372
No. of failures      =          253
Time at risk         =        41696
                                                Wald chi2(46)    =       82.09
Log pseudolikelihood =   -1178.6446             Prob > chi2      =      0.0008

                         (Std. Err. adjusted for 669 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .2617218   .2037444    -1.72   0.085     .0569114    1.203596
 only 12-18  |   .2791026     .29489    -1.21   0.227     .0351896    2.213674
      mixed  |    .214543   .1380562    -2.39   0.017      .060782     .757275
             |
        age1 |   .8971407   .0558957    -1.74   0.081     .7940121    1.013664
        age2 |   1.691862   .5713272     1.56   0.119     .8728133    3.279505
        age3 |   .3350111   .2423235    -1.51   0.131     .0811633    1.382798
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9445667   .1224445    -0.44   0.660     .7326409    1.217795
             |
   ethnicity |
Asian or ..  |   .9052185   .2019847    -0.45   0.655       .58455    1.401797
      Other  |   .8797839    .195788    -0.58   0.565     .5687858    1.360828
             |
   obese4cat |
Obese I ..)  |   .8497692   .1605548    -0.86   0.389     .5867802    1.230627
Obese II..)  |   1.239828   .2639508     1.01   0.313     .8168575    1.881812
Obese II..)  |   .5181513   .1781533    -1.91   0.056     .2641145    1.016531
             |
smoke_nomiss |
     Former  |   1.497826   .5576626     1.09   0.278     .7220156     3.10725
    Current  |   1.356734   .2331237     1.78   0.076     .9688021    1.900003
             |
         imd |
          4  |   .9402608    .152496    -0.38   0.704      .684221    1.292112
5 most de..  |   1.131053   .2443999     0.57   0.569     .7405494    1.727476
             |
tot_adults~h |
          2  |   1.102564    .861015     0.13   0.900     .2386071     5.09477
          3  |   .5408764   .3720881    -0.89   0.372     .1404514    2.082907
             |
    1.shield |   .2282453   .1535149    -2.20   0.028     .0610794    .8529219
1.htdiag_o~p |   .9328695   .1405729    -0.46   0.645     .6943116    1.253393
1.~y_disease |   1.018034   .1623445     0.11   0.911     .7447704    1.391561
    1.asthma |   1.318694    .266577     1.37   0.171     .8873024    1.959821
1.~c_disease |   .8810736   .1428463    -0.78   0.435     .6412228    1.210641
             |
     diabcat |
T1DM, con..  |   .7021888   .3642268    -0.68   0.495     .2540586     1.94077
T1DM, unc..  |   1.444895   1.194111     0.45   0.656     .2860056    7.299589
T2DM, con..  |   .9008625   .1588071    -0.59   0.554     .6376845    1.272656
T2DM, unc..  |   1.393979   .3955958     1.17   0.242     .7992724    2.431184
Diabetes,..  |   3.110522   3.708871     0.95   0.341      .300533    32.19395
             |
cancer_exh~t |
  Last year  |   1.100588   1.177992     0.09   0.929     .1350701    8.967901
2-5 years..  |   .2732907   .2872779    -1.23   0.217     .0348224    2.144823
   5+ years  |   1.406289   .2465028     1.95   0.052     .9974029    1.982797
             |
cancer_hae~t |
  Last year  |   .6428394   .5958605    -0.48   0.634     .1044978    3.954558
2-5 years..  |   2.047104   .9554779     1.53   0.125     .8200583    5.110165
   5+ years  |   1.386428   .2113719     2.14   0.032     1.028312     1.86926
             |
1.~r_disease |   1.057699   .1673757     0.35   0.723     .7756456    1.442316
1.stroke_d~a |   .8655556   .1425628    -0.88   0.381      .626753    1.195346
1.other_ne~o |   1.015557   .1687166     0.09   0.926     .7333182    1.406424
             |
reduced_ki~t |
Stage 3a/..  |   1.751305   .4597801     2.13   0.033     1.046866    2.929764
      1.esrd |   1.129567   .1696932     0.81   0.417     .8414675    1.516306
1.other_tr~t |   1.025131   .1816675     0.14   0.889     .7243267    1.450855
  1.asplenia |   1.186473   .2001004     1.01   0.311     .8525144    1.651256
1.ra_sle_p~s |   .8697563   .1589884    -0.76   0.445     .6078563    1.244498
1.other_im~o |    .991312   .1713592    -0.05   0.960     .7064328    1.391073
             |
      shield#|
   kids_cat4 |
          1 #|
only <12 ..  |   3.998865   3.454594     1.60   0.109      .735511    21.74124
          1 #|
 only 12-18  |   2.008474   2.556797     0.55   0.584     .1656849    24.34723
    1#mixed  |   4.884185   3.420683     2.26   0.024     1.237785    19.27254
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.shield#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.04659   .4717389     0.10   0.920     .4326204    2.531899
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.shield#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5605703     .40154    -0.81   0.419     .1376921    2.282186
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.shield#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.047868   .4442553     0.11   0.912     .4564888    2.405376
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_t
> imeperiod4.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_shield_1_timeperi
> od4.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_shield_covid_death.lo
> g
  log type:  text
 closed on:  28 Oct 2021, 11:44:46
-------------------------------------------------------------------------------
