-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_death_s
> tratified.log
  log type:  text
 opened on:  30 Nov 2021, 14:51:29

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
  4. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
  5. drop if covid_vacc_date<d(20dec2020)
  6. drop if covid_vacc_second_dose_date<d(20dec2020)
  7. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  8. replace `outcome'=0 if stime_`outcome'<date_`outcome'
  9. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 10. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 11. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 12. format first_vacc_plus_7d second_vacc_plus_7d %td
 13. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 14. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 15. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 16. 
. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 17. recode `outcome' .=0 
 18. stsplit split2, after(second_vacc_plus_7d) at(0)
 19. recode `outcome' .=0 
 20. 
. stset
 21. bysort patient_id (_t): gen vaccine=_n
 22. strate vaccine if kids_cat4==0, per(100000)
 23. strate vaccine if kids_cat4==1, per(100000)
 24. 
. 
. 
. 
. foreach int_type in  vaccine  {
 25. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 26. 
. 
. *Unadjusted  model (interaction)
. stcox   i.`exposure_type'       ///
>                         i.`int_type'##i.`exposure_type' ///
>                         , strata(stp) vce(cluster household_id) 
 27. 
. if _rc==0 {
 28. *testparm 1.`int_type'#i.`exposure_type'
. di _n "kids_cat4=0 " _n "****************"
 29. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 30. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 31. lincom 0.`exposure_type' + 3.`int_type'#0.`exposure_type', eform
 32. 
. di _n "kids_cat4=1 " _n "****************"
 33. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 34. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 35. lincom 1.`exposure_type' + 3.`int_type'#1.`exposure_type', eform
 36. 
. di _n "kids_cat4=2 " _n "****************"
 37. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 38. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 39. lincom 2.`exposure_type' + 3.`int_type'#2.`exposure_type', eform
 40. 
. di _n "kids_cat4=3 " _n "****************"
 41. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 42. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 43. lincom 3.`exposure_type' + 3.`int_type'#3.`exposure_type', eform
 44. }
 45. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"             
>       
 46. 
. *Age spline model (not adj ethnicity, interaction)
. stcox   i.`exposure_type'       age1 age2 age3                  ///
>                         $demogadjlist                                   ///
>                         $comordidadjlist                ///
>                         i.`int_type'##i.`exposure_type' ///
>                         , strata(stp) vce(cluster household_id) 
 47. if _rc==0{
 48. *testparm 1.`int_type'#i.`exposure_type'
. di _n "`exposure_type' " _n "****************"
 49. 
. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 50. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 51. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 52. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 53. 
. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 54. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 55. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 56. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 57. 
. lincom 0.`exposure_type' + 3.`int_type'#0.`exposure_type', eform
 58. lincom 1.`exposure_type' + 3.`int_type'#1.`exposure_type', eform
 59. lincom 2.`exposure_type' + 3.`int_type'#2.`exposure_type', eform
 60. lincom 3.`exposure_type' + 3.`int_type'#3.`exposure_type', eform
 61. 
. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type'_`
> int_type'_`x'_stratified, replace
 62. }
 63. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 64. }
 65. }
 66. }
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(673 records included in the analysis)

  +----------------------------------------------------+
  | vaccine     D        Y     Rate    Lower     Upper |
  |----------------------------------------------------|
  |       1   154   0.7408   207.89   177.52    243.46 |
  |       2    50   0.2172   230.19   174.47    303.72 |
  |       3     2   0.0021   947.87   237.06   3789.99 |
  +----------------------------------------------------+


         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(2056 records included in the analysis)

  +------------------------------------------------------+
  | vaccine     D        Y      Rate     Lower     Upper |
  |------------------------------------------------------|
  |       1   221   1.3008   169.898   148.912   193.841 |
  |       2    64   0.2357   271.509   212.512   346.884 |
  |       3     2   0.0135   148.038    37.024   591.923 |
  +------------------------------------------------------+


         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -6957.2226
Iteration 1:   log pseudolikelihood = -6951.8414
Iteration 2:   log pseudolikelihood = -6950.3779
Iteration 3:   log pseudolikelihood = -6950.3015
Iteration 4:   log pseudolikelihood = -6950.2748
Iteration 5:   log pseudolikelihood =  -6950.265
Iteration 6:   log pseudolikelihood = -6950.2614
Iteration 7:   log pseudolikelihood = -6950.2601
Iteration 8:   log pseudolikelihood = -6950.2596
Iteration 9:   log pseudolikelihood = -6950.2594
Iteration 10:  log pseudolikelihood = -6950.2593
Iteration 11:  log pseudolikelihood = -6950.2593
Iteration 12:  log pseudolikelihood = -6950.2593
Iteration 13:  log pseudolikelihood = -6950.2593
Iteration 14:  log pseudolikelihood = -6950.2593
Iteration 15:  log pseudolikelihood = -6950.2593
Iteration 16:  log pseudolikelihood = -6950.2593
Iteration 17:  log pseudolikelihood = -6950.2593
Iteration 18:  log pseudolikelihood = -6950.2593
Iteration 19:  log pseudolikelihood = -6950.2593
Iteration 20:  log pseudolikelihood = -6950.2593
Iteration 21:  log pseudolikelihood = -6950.2593
Iteration 22:  log pseudolikelihood = -6950.2593
Iteration 23:  log pseudolikelihood = -6950.2593
Iteration 24:  log pseudolikelihood = -6950.2593
Iteration 25:  log pseudolikelihood = -6950.2593
Iteration 26:  log pseudolikelihood = -6950.2593
Iteration 27:  log pseudolikelihood = -6950.2593
Iteration 28:  log pseudolikelihood = -6950.2593
Iteration 29:  log pseudolikelihood = -6950.2593
Iteration 30:  log pseudolikelihood = -6950.2593
Iteration 31:  log pseudolikelihood = -6950.2593
Iteration 32:  log pseudolikelihood = -6950.2593
Iteration 33:  log pseudolikelihood = -6950.2593
Iteration 34:  log pseudolikelihood = -6950.2593
Iteration 35:  log pseudolikelihood = -6950.2593
Iteration 36:  log pseudolikelihood = -6950.2593
Iteration 37:  log pseudolikelihood = -6950.2593
Iteration 38:  log pseudolikelihood = -6950.2593
Refining estimates:
Iteration 0:   log pseudolikelihood = -6950.2593
Iteration 1:   log pseudolikelihood = -6950.2593
Iteration 2:   log pseudolikelihood = -6950.2593

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,528             Number of obs    =      13,980
No. of failures      =        1,199
Time at risk         =       705195
                                                Wald chi2(11)    =     2596.34
Log pseudolikelihood =   -6950.2593             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 988 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9156562   .1019381    -0.79   0.429     .7361562    1.138924
 only 12-18  |   1.054732   .2519703     0.22   0.823     .6603808    1.684574
      mixed  |    .889725   .0931098    -1.12   0.264     .7247322     1.09228
             |
     vaccine |
          2  |   .8219271   .1339137    -1.20   0.229     .5972415    1.131141
          3  |   4.496136   .9642191     7.01   0.000     2.953214    6.845165
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   1.596377    .354536     2.11   0.035     1.032985    2.467045
          2 #|
 only 12-18  |   .7367952   .3732362    -0.60   0.547     .2729959    1.988554
    2#mixed  |   1.508962   .3070621     2.02   0.043     1.012664    2.248492
          3 #|
only <12 ..  |   .1693482   .1252601    -2.40   0.016     .0397357     .721739
          3 #|
 only 12-18  |   1.39e-18   1.16e-18   -49.43   0.000     2.72e-19    7.10e-18
    3#mixed  |   .1566243    .112031    -2.59   0.010     .0385485     .636372
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9156562   .1019381    -0.79   0.429     .7361562    1.138924
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.461733   .2879954     1.93   0.054     .9934854    2.150674
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1550647   .1149124    -2.52   0.012     .0362845    .6626817
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.054732   .2519703     0.22   0.823     .6603808    1.684574
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7771218   .3375911    -0.58   0.562     .3316781    1.820796
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.47e-18   1.20e-18   -50.34   0.000     2.96e-19    7.25e-18
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .889725   .0931098    -1.12   0.264     .7247322     1.09228
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.342561   .2536612     1.56   0.119     .9270638     1.94428
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1393526   .0990495    -2.77   0.006     .0346015    .5612221
------------------------------------------------------------------------------

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
Iteration 0:   log pseudolikelihood = -6957.2226
Iteration 1:   log pseudolikelihood = -6943.8224
Iteration 2:   log pseudolikelihood = -6931.2059
Iteration 3:   log pseudolikelihood = -6928.7952
Iteration 4:   log pseudolikelihood = -6928.5482
Iteration 5:   log pseudolikelihood = -6928.5384
Iteration 6:   log pseudolikelihood = -6928.5363
Iteration 7:   log pseudolikelihood = -6928.5356
Iteration 8:   log pseudolikelihood = -6928.5353
Iteration 9:   log pseudolikelihood = -6928.5352
Iteration 10:  log pseudolikelihood = -6928.5352
Iteration 11:  log pseudolikelihood = -6928.5352
Iteration 12:  log pseudolikelihood = -6928.5351
Iteration 13:  log pseudolikelihood = -6928.5351
Iteration 14:  log pseudolikelihood = -6928.5351
Iteration 15:  log pseudolikelihood = -6928.5351
Iteration 16:  log pseudolikelihood = -6928.5351
Iteration 17:  log pseudolikelihood = -6928.5351
Iteration 18:  log pseudolikelihood = -6928.5351
Iteration 19:  log pseudolikelihood = -6928.5351
Iteration 20:  log pseudolikelihood = -6928.5351
Iteration 21:  log pseudolikelihood = -6928.5351
Iteration 22:  log pseudolikelihood = -6928.5351
Iteration 23:  log pseudolikelihood = -6928.5351
Iteration 24:  log pseudolikelihood = -6928.5351
Iteration 25:  log pseudolikelihood = -6928.5351
Iteration 26:  log pseudolikelihood = -6928.5351
Iteration 27:  log pseudolikelihood = -6928.5351
Iteration 28:  log pseudolikelihood = -6928.5351
Iteration 29:  log pseudolikelihood = -6928.5351
Iteration 30:  log pseudolikelihood = -6928.5351
Iteration 31:  log pseudolikelihood = -6928.5351
Iteration 32:  log pseudolikelihood = -6928.5351
Iteration 33:  log pseudolikelihood = -6928.5351
Iteration 34:  log pseudolikelihood = -6928.5351
Iteration 35:  log pseudolikelihood = -6928.5351
Iteration 36:  log pseudolikelihood = -6928.5351
Iteration 37:  log pseudolikelihood = -6928.5351
Iteration 38:  log pseudolikelihood = -6928.5351
Iteration 39:  log pseudolikelihood = -6928.5351
Iteration 40:  log pseudolikelihood = -6928.5351
Iteration 41:  log pseudolikelihood = -6928.5351
Iteration 42:  log pseudolikelihood = -6928.5351
Iteration 43:  log pseudolikelihood = -6928.5351
Iteration 44:  log pseudolikelihood = -6928.5351
Refining estimates:
Iteration 0:   log pseudolikelihood = -6928.5351

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,528             Number of obs    =      13,980
No. of failures      =        1,199
Time at risk         =       705195
                                                Wald chi2(49)    =      242.39
Log pseudolikelihood =   -6928.5351             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 988 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   .9213642   .1130905    -0.67   0.505     .7243571    1.171952
 only 12-18  |   1.100201   .2648993     0.40   0.692     .6863178    1.763676
      mixed  |   .9020038   .1064463    -0.87   0.382     .7157433    1.136735
             |
        age1 |   .9941807   .0102631    -0.57   0.572     .9742675    1.014501
        age2 |   1.017745   .0329864     0.54   0.587     .9551034    1.084495
        age3 |   .9527216   .0862366    -0.54   0.593      .797845    1.137662
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   1.024543   .0608441     0.41   0.683     .9119697    1.151013
             |
   ethnicity |
Asian or ..  |   .9499373   .0893701    -0.55   0.585      .789976    1.142289
      Other  |   1.161174   .1099605     1.58   0.115     .9644737     1.39799
             |
   obese4cat |
Obese I ..)  |   .8911964   .0809203    -1.27   0.205     .7459069    1.064786
Obese II..)  |   1.072745   .1128435     0.67   0.504     .8728854    1.318364
Obese II..)  |   .9149829   .1098009    -0.74   0.459     .7232127    1.157604
             |
smoke_nomiss |
     Former  |   1.131408   .2462185     0.57   0.570     .7385495    1.733241
    Current  |   1.003508   .0870113     0.04   0.968     .8466733    1.189395
             |
         imd |
          4  |   1.183641   .0836059     2.39   0.017     1.030613     1.35939
5 most de..  |   1.328152   .1236364     3.05   0.002      1.10665    1.593989
             |
tot_adults~h |
          2  |   1.001777   .2277766     0.01   0.994     .6415511    1.564267
          3  |   .9713023   .1746555    -0.16   0.871     .6828022      1.3817
             |
1.htdiag_o~p |   .9429817   .0585498    -0.95   0.344     .8349339    1.065012
1.~y_disease |   1.141838   .0775193     1.95   0.051     .9995776    1.304345
    1.asthma |   .8392309   .0977428    -1.50   0.132     .6679508    1.054432
1.~c_disease |   .9586751   .0756443    -0.53   0.593     .8213105    1.119014
             |
     diabcat |
T1DM, con..  |   1.188179    .188889     1.08   0.278     .8700886    1.622559
T1DM, unc..  |    .851125   .3471532    -0.40   0.693     .3826563    1.893118
T2DM, con..  |    .963772   .0782787    -0.45   0.650     .8219374    1.130082
T2DM, unc..  |   1.062005   .1539328     0.42   0.678     .7993716    1.410926
Diabetes,..  |   6.101237   2.759959     4.00   0.000     2.514015    14.80703
             |
cancer_exh~t |
  Last year  |   .6465575   .2853366    -0.99   0.323     .2722436    1.535524
2-5 years..  |   .8759544   .1892473    -0.61   0.540     .5735642    1.337769
   5+ years  |   .8530693   .0670812    -2.02   0.043     .7312232     .995219
             |
cancer_hae~t |
  Last year  |   .4030063   .2951021    -1.24   0.215      .095944      1.6928
2-5 years..  |   1.205242   .2220693     1.01   0.311     .8399203    1.729461
   5+ years  |   .9333458     .07087    -0.91   0.364     .8042849    1.083117
             |
1.~r_disease |    .999493    .079647    -0.01   0.995     .8549678    1.168449
1.stroke_d~a |   1.024762   .0754485     0.33   0.740     .8870602     1.18384
1.other_ne~o |    1.00202   .0756892     0.03   0.979     .8641309    1.161912
             |
reduced_ki~t |
Stage 3a/..  |   1.132006   .4596346     0.31   0.760     .5107762    2.508804
      1.esrd |   .9324007    .054556    -1.20   0.232     .8313763    1.045701
1.other_tr~t |   .9874612   .0688489    -0.18   0.856     .8613341    1.132057
  1.asplenia |   1.119247   .0771188     1.64   0.102     .9778589    1.281079
1.ra_sle_p~s |   .9686356   .0725256    -0.43   0.670      .836426    1.121743
1.other_im~o |   .9783422   .0677477    -0.32   0.752     .8541758    1.120558
             |
     vaccine |
          2  |    .835213   .1353458    -1.11   0.266     .6079396    1.147451
          3  |   4.256422   .9841289     6.26   0.000     2.705441    6.696553
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   1.575295   .3464638     2.07   0.039     1.023651    2.424217
          2 #|
 only 12-18  |    .694148   .3527609    -0.72   0.473     .2563762    1.879431
    2#mixed  |   1.490117   .3037547     1.96   0.050     .9993237    2.221951
          3 #|
only <12 ..  |   .1760215    .127856    -2.39   0.017     .0423918    .7308858
          3 #|
 only 12-18  |   1.84e-20          .        .       .            .           .
    3#mixed  |   .1695818   .1220165    -2.47   0.014     .0413931    .6947535
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9213642   .1130905    -0.67   0.505     .7243571    1.171952
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.100201   .2648993     0.40   0.692     .6863178    1.763676
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9020038   .1064463    -0.87   0.382     .7157433    1.136735
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.45142   .2945214     1.84   0.066     .9751418    2.160322
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7637023   .3371897    -0.61   0.541     .3214413    1.814456
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.344091   .2671638     1.49   0.137     .9104082    1.984364
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1621799   .1197474    -2.46   0.014     .0381507    .6894318
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.02e-20   4.87e-21  -188.34   0.000     1.26e-20    3.25e-20
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1529634   .1108362    -2.59   0.010     .0369669    .6329398
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_0_
> stratified.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_0_stratif
> ied.ster saved
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(208 records included in the analysis)

  +------------------------------------------------------+
  | vaccine    D        Y      Rate     Lower      Upper |
  |------------------------------------------------------|
  |       1   49   0.2093   234.114   176.940    309.761 |
  |       2   19   0.0722   263.194   167.879    412.625 |
  |       3    1   0.0021   487.805    68.714   3462.962 |
  +------------------------------------------------------+


         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Estimated rates (per 100000) and lower/upper bounds of 95% confidence intervals
(553 records included in the analysis)

  +--------------------------------------------------+
  | vaccine    D        Y     Rate    Lower    Upper |
  |--------------------------------------------------|
  |       1   68   0.3236   210.17   165.71   266.56 |
  |       2   20   0.0570   350.75   226.29   543.67 |
  |       3    0   0.0026     0.00        .        . |
  +--------------------------------------------------+


         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 3.vaccine#2.kids_cat4 identifies no observations in the sample
Iteration 0:   log pseudolikelihood = -1569.0534
Iteration 1:   log pseudolikelihood = -1565.7304
Iteration 2:   log pseudolikelihood = -1565.4894
Iteration 3:   log pseudolikelihood = -1565.4305
Iteration 4:   log pseudolikelihood = -1565.4091
Iteration 5:   log pseudolikelihood = -1565.4012
Iteration 6:   log pseudolikelihood = -1565.3983
Iteration 7:   log pseudolikelihood = -1565.3973
Iteration 8:   log pseudolikelihood = -1565.3969
Iteration 9:   log pseudolikelihood = -1565.3967
Iteration 10:  log pseudolikelihood = -1565.3967
Iteration 11:  log pseudolikelihood = -1565.3967
Iteration 12:  log pseudolikelihood = -1565.3967
Iteration 13:  log pseudolikelihood = -1565.3967
Iteration 14:  log pseudolikelihood = -1565.3967
Iteration 15:  log pseudolikelihood = -1565.3967
Iteration 16:  log pseudolikelihood = -1565.3967
Iteration 17:  log pseudolikelihood = -1565.3967
Iteration 18:  log pseudolikelihood = -1565.3967
Iteration 19:  log pseudolikelihood = -1565.3967
Iteration 20:  log pseudolikelihood = -1565.3967
Iteration 21:  log pseudolikelihood = -1565.3967
Iteration 22:  log pseudolikelihood = -1565.3967
Iteration 23:  log pseudolikelihood = -1565.3967
Iteration 24:  log pseudolikelihood = -1565.3967
Iteration 25:  log pseudolikelihood = -1565.3967
Iteration 26:  log pseudolikelihood = -1565.3967
Iteration 27:  log pseudolikelihood = -1565.3967
Iteration 28:  log pseudolikelihood = -1565.3967
Iteration 29:  log pseudolikelihood = -1565.3967
Refining estimates:
Iteration 0:   log pseudolikelihood = -1565.3967
Iteration 1:   log pseudolikelihood = -1565.3967
Iteration 2:   log pseudolikelihood = -1565.3967

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,489             Number of obs    =       3,890
No. of failures      =          352
Time at risk         =       190711
                                                Wald chi2(10)    =     2574.31
Log pseudolikelihood =   -1565.3967             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 777 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.038869   .1893658     0.21   0.834     .7267798    1.484972
 only 12-18  |   .6283204   .2878612    -1.01   0.310     .2559813    1.542247
      mixed  |   .8728566   .1456509    -0.81   0.415     .6293692    1.210543
             |
     vaccine |
          2  |   .9419098   .2552266    -0.22   0.825     .5538112     1.60198
          3  |   1.556706   .4251493     1.62   0.105     .9114573    2.658745
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |   1.199961   .4199788     0.52   0.602     .6042994    2.382771
          2 #|
 only 12-18  |    .760448    .667325    -0.31   0.755     .1361772    4.246534
    2#mixed  |    .942934   .3406048    -0.16   0.871      .464528    1.914038
          3 #|
only <12 ..  |   1.86e-14   1.29e-14   -45.49   0.000     4.76e-15    7.26e-14
          3 #|
 only 12-18  |          1  (empty)
    3#mixed  |    1.19048   .9076358     0.23   0.819     .2671507    5.305032
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4=0 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

kids_cat4=1 
****************

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.038869   .1893658     0.21   0.834     .7267798    1.484972
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.246602   .3863199     0.71   0.477     .6791128    2.288305
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.93e-14   1.33e-14   -46.02   0.000     5.03e-15    7.41e-14
------------------------------------------------------------------------------

kids_cat4=2 
****************

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6283204   .2878612    -1.01   0.310     .2559813    1.542247
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4778049   .3677608    -0.96   0.337     .1057039    2.159785
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3o.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6283204   .2878612    -1.01   0.310     .2559813    1.542247
------------------------------------------------------------------------------

kids_cat4=3 
****************

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8728566   .1456509    -0.81   0.415     .6293692    1.210543
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8230462   .2745803    -0.58   0.559      .428007    1.582696
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.039119   .7722322     0.05   0.959     .2421506    4.459074
------------------------------------------------------------------------------

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: age1 omitted because of collinearity
note: age2 omitted because of collinearity
note: age3 omitted because of collinearity
note: 3.vaccine#2.kids_cat4 identifies no observations in the sample
Iteration 0:   log pseudolikelihood = -1569.0534
Iteration 1:   log pseudolikelihood = -1551.6817
Iteration 2:   log pseudolikelihood = -1544.4089
Iteration 3:   log pseudolikelihood =  -1543.504
Iteration 4:   log pseudolikelihood = -1543.4079
Iteration 5:   log pseudolikelihood = -1543.3885
Iteration 6:   log pseudolikelihood = -1543.3814
Iteration 7:   log pseudolikelihood = -1543.3789
Iteration 8:   log pseudolikelihood = -1543.3779
Iteration 9:   log pseudolikelihood = -1543.3776
Iteration 10:  log pseudolikelihood = -1543.3774
Iteration 11:  log pseudolikelihood = -1543.3774
Iteration 12:  log pseudolikelihood = -1543.3774
Iteration 13:  log pseudolikelihood = -1543.3774
Iteration 14:  log pseudolikelihood = -1543.3774
Iteration 15:  log pseudolikelihood = -1543.3774
Iteration 16:  log pseudolikelihood = -1543.3774
Iteration 17:  log pseudolikelihood = -1543.3774
Iteration 18:  log pseudolikelihood = -1543.3774
Iteration 19:  log pseudolikelihood = -1543.3774
Iteration 20:  log pseudolikelihood = -1543.3774
Iteration 21:  log pseudolikelihood = -1543.3774
Iteration 22:  log pseudolikelihood = -1543.3774
Iteration 23:  log pseudolikelihood = -1543.3774
Iteration 24:  log pseudolikelihood = -1543.3774
Iteration 25:  log pseudolikelihood = -1543.3774
Iteration 26:  log pseudolikelihood = -1543.3774
Iteration 27:  log pseudolikelihood = -1543.3774
Iteration 28:  log pseudolikelihood = -1543.3774
Iteration 29:  log pseudolikelihood = -1543.3774
Iteration 30:  log pseudolikelihood = -1543.3774
Iteration 31:  log pseudolikelihood = -1543.3774
Iteration 32:  log pseudolikelihood = -1543.3774
Iteration 33:  log pseudolikelihood = -1543.3774
Iteration 34:  log pseudolikelihood = -1543.3774
Iteration 35:  log pseudolikelihood = -1543.3774
Iteration 36:  log pseudolikelihood = -1543.3774
Iteration 37:  log pseudolikelihood = -1543.3774
Iteration 38:  log pseudolikelihood = -1543.3774
Iteration 39:  log pseudolikelihood = -1543.3774
Iteration 40:  log pseudolikelihood = -1543.3774
Iteration 41:  log pseudolikelihood = -1543.3774
Iteration 42:  log pseudolikelihood = -1543.3774
Iteration 43:  log pseudolikelihood = -1543.3774
Iteration 44:  log pseudolikelihood = -1543.3774
Refining estimates:
Iteration 0:   log pseudolikelihood = -1543.3774

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,489             Number of obs    =       3,890
No. of failures      =          352
Time at risk         =       190711
                                                Wald chi2(47)    =       65.72
Log pseudolikelihood =   -1543.3774             Prob > chi2      =      0.0369

                         (Std. Err. adjusted for 777 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |    1.14413   .2279925     0.68   0.499     .7742035    1.690813
 only 12-18  |   .6050125   .2725859    -1.12   0.265     .2501836    1.463086
      mixed  |   .9781761    .181403    -0.12   0.905     .6800823     1.40693
             |
        age1 |   .9911679   .0458887    -0.19   0.848     .9051876    1.085315
        age2 |   1.034645   .2213641     0.16   0.874     .6802601    1.573647
        age3 |   .8916617   .4662595    -0.22   0.826     .3199614    2.484864
        age1 |          1  (omitted)
        age2 |          1  (omitted)
        age3 |          1  (omitted)
      1.male |   .9389654   .1095363    -0.54   0.589     .7470532    1.180178
             |
   ethnicity |
Asian or ..  |   .6839916   .1397922    -1.86   0.063     .4582313    1.020979
      Other  |   1.083911   .1840653     0.47   0.635     .7770449    1.511963
             |
   obese4cat |
Obese I ..)  |    .862309   .1404389    -0.91   0.363     .6266616    1.186568
Obese II..)  |   .8294699   .1677356    -0.92   0.355     .5580466    1.232908
Obese II..)  |   .8013415   .1977993    -0.90   0.370      .493982    1.299943
             |
smoke_nomiss |
     Former  |   1.917898   .6655303     1.88   0.061     .9715154    3.786179
    Current  |   .9786392   .1762301    -0.12   0.905     .6876083    1.392849
             |
         imd |
          4  |   .8558938   .1200991    -1.11   0.267     .6500985    1.126836
5 most de..  |   .8881616   .1730568    -0.61   0.543     .6062291    1.301209
             |
tot_adults~h |
          2  |   1.196144   .5403884     0.40   0.692     .4934369    2.899582
          3  |   .7505673    .237534    -0.91   0.365     .4036525    1.395634
             |
1.htdiag_o~p |   .8148191   .0993052    -1.68   0.093      .641685    1.034667
1.~y_disease |   .9006494   .1259819    -0.75   0.454     .6846846    1.184734
    1.asthma |   .9987165   .1908384    -0.01   0.995     .6867386    1.452422
1.~c_disease |   1.034167   .1467238     0.24   0.813     .7831145    1.365702
             |
     diabcat |
T1DM, con..  |   .6593732   .2640269    -1.04   0.298     .3008101    1.445341
T1DM, unc..  |   .6432354   .6909845    -0.41   0.681     .0783396    5.281514
T2DM, con..  |   .9258022   .1498131    -0.48   0.634     .6741817    1.271333
T2DM, unc..  |   1.154991   .2900084     0.57   0.566     .7060728    1.889331
Diabetes,..  |   5.397808   3.450432     2.64   0.008     1.542074    18.89425
             |
cancer_exh~t |
  Last year  |   2.089628   1.359634     1.13   0.257     .5837512    7.480149
2-5 years..  |   1.666536   .5798295     1.47   0.142     .8426758    3.295862
   5+ years  |   1.269482   .1671638     1.81   0.070     .9807115     1.64328
             |
cancer_hae~t |
  Last year  |   6.58e-20          .        .       .            .           .
2-5 years..  |   1.498286    .529116     1.14   0.252     .7498854    2.993604
   5+ years  |   1.236727   .1782622     1.47   0.140      .932355    1.640462
             |
1.~r_disease |   1.174351   .1545152     1.22   0.222     .9074054    1.519829
1.stroke_d~a |   1.021801   .1417811     0.16   0.876      .778497    1.341145
1.other_ne~o |    1.18328   .1660666     1.20   0.230     .8987234    1.557933
             |
reduced_ki~t |
Stage 3a/..  |   1.110763   .3391147     0.34   0.731     .6105914    2.020656
      1.esrd |   1.008561   .1091285     0.08   0.937     .8158309    1.246821
1.other_tr~t |   1.067803   .1360986     0.51   0.607     .8317637    1.370826
  1.asplenia |   .8906169   .1225613    -0.84   0.400     .6800702    1.166348
1.ra_sle_p~s |   .9556703   .1255791    -0.35   0.730     .7386805    1.236402
1.other_im~o |   1.347318   .1883161     2.13   0.033     1.024464    1.771917
             |
     vaccine |
          2  |   .9810209   .2879372    -0.07   0.948     .5518792    1.743864
          3  |   1.739729   .7770437     1.24   0.215     .7249294    4.175108
             |
     vaccine#|
   kids_cat4 |
          2 #|
only <12 ..  |    1.16879   .4286231     0.43   0.671     .5696141    2.398238
          2 #|
 only 12-18  |   .7785329   .6750132    -0.29   0.773     .1423173    4.258888
    2#mixed  |   .9098434   .3433305    -0.25   0.802     .4342749      1.9062
          3 #|
only <12 ..  |   3.39e-20          .        .       .            .           .
          3 #|
 only 12-18  |          1  (empty)
    3#mixed  |   1.103211   .8662295     0.13   0.900     .2367578     5.14059
------------------------------------------------------------------------------
                                                             Stratified by stp

kids_cat4 
****************

 ( 1)  0b.kids_cat4 + 1b.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1b.vaccine#1o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.14413   .2279925     0.68   0.499     .7742035    1.690813
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1b.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6050125   .2725859    -1.12   0.265     .2501836    1.463086
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1b.vaccine#3o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9781761    .181403    -0.12   0.905     .6800823     1.40693
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.337248   .4265766     0.91   0.362     .7156193    2.498859
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4710221   .3669457    -0.97   0.334     .1023105    2.168515
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .889987   .3124457    -0.33   0.740     .4472541    1.770977
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 3o.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          1  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 3.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.88e-20   7.73e-21  -224.30   0.000     2.63e-20    5.73e-20
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 3o.vaccine#2o.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6050125   .2725859    -1.12   0.265     .2501836    1.463086
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 3.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.079135   .8232768     0.10   0.920     .2419302    4.813503
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_1_
> stratified.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_1_stratif
> ied.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_death_s
> tratified.log
  log type:  text
 closed on:  30 Nov 2021, 14:51:43
-------------------------------------------------------------------------------
