-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b.log
  log type:  text
 opened on:  28 Oct 2021, 11:47:39

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 1 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  4. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  5.         
.         
. gen first_vacc_plus_7d=covid_vacc_date+7
  6. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
  7. format first_vacc_plus_7d second_vacc_plus_7d %td
  8.  
. stsplit vaccine, after(first_vacc_plus_7d) at(0)
  9. replace vaccine = vaccine +1
 10. stsplit vaccine2, after(second_vacc_plus_7d) at(0)
 11. replace vaccine=2 if vaccine==1 &vaccine2==0 & second_vacc_plus_7d!=.
 12. recode `outcome' .=0 
 13. 
. tab vaccine
 14. tab vaccine `outcome' if kids_cat4==0
 15. 
. foreach int_type in  vaccine  {
 16. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 17. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ///
> interaction(1.`int_type'#0.`exposure_type' 1.`int_type'#1.`exposure_type' 1.`
> int_type'#2.`exposure_type' 1.`int_type'#3.`exposure_type' 2.`int_type'#0.`ex
> posure_type' 2.`int_type'#1.`exposure_type' 2.`int_type'#2.`exposure_type' 2.
> `int_type'#3.`exposure_type')
 18. if _rc==0{
 19. *testparm 1.`int_type'#i.`exposure_type'
. di _n "`exposure_type' " _n "****************"
 20. lincom 0.`exposure_type' 
 21. lincom 1.`exposure_type' 
 22. lincom 2.`exposure_type' 
 23. lincom 3.`exposure_type' 
 24. lincom 0.`exposure_type' + 1.`int_type'#0.`exposure_type', eform
 25. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 26. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 27. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 28. lincom 0.`exposure_type' + 2.`int_type'#0.`exposure_type', eform
 29. lincom 1.`exposure_type' + 2.`int_type'#1.`exposure_type', eform
 30. lincom 2.`exposure_type' + 2.`int_type'#2.`exposure_type', eform
 31. lincom 3.`exposure_type' + 2.`int_type'#3.`exposure_type', eform
 32. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x', replace
 33. }
 34. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 35. }
 36. }
 37. }
(12,445 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,082  total observations
      3,956  observations end on or before enter()
------------------------------------------------------------------------------
     12,126  observations remaining, representing
     12,126  subjects
     11,427  failures in single-failure-per-subject data
    539,445  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(8,043 missing values generated)
(12,880 missing values generated)
(1,198 observations (episodes) created)
(13,324 real changes made)
(1,052 observations (episodes) created)
(789 real changes made)
(covid_tpp_prob: 2250 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,312       43.91       43.91
          1 |      7,275       50.61       94.51
          2 |        789        5.49      100.00
------------+-----------------------------------
      Total |     14,376      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |       157        100 |       257 
         1 |        61        257 |       318 
         2 |         2         59 |        61 
-----------+----------------------+----------
     Total |       220        416 |       636 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -70033.653
Iteration 1:   log pseudolikelihood = -69493.151
Iteration 2:   log pseudolikelihood = -69463.594
Iteration 3:   log pseudolikelihood = -69462.876
Iteration 4:   log pseudolikelihood = -69462.875
Refining estimates:
Iteration 0:   log pseudolikelihood = -69462.875

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,126             Number of obs    =      14,376
No. of failures      =       11,427
Time at risk         =       539445
                                                Wald chi2(50)    =      648.90
Log pseudolikelihood =   -69462.875             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 940 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   2.475402   .2994962     7.49   0.000     1.952809    3.137846
 only 12-18  |   1.719911   .2401818     3.88   0.000      1.30809    2.261385
      mixed  |   4.172797   .3824493    15.59   0.000      3.48668     4.99393
             |
        age1 |   1.010517    .003648     2.90   0.004     1.003393    1.017693
        age2 |   .9664223   .0105709    -3.12   0.002     .9459243    .9873645
        age3 |   1.101677   .0339793     3.14   0.002     1.037052    1.170329
      1.male |   .9877899   .0189001    -0.64   0.521     .9514324    1.025537
             |
   ethnicity |
Asian or ..  |   .9955571   .0304903    -0.15   0.884     .9375555    1.057147
      Other  |   .9962126   .0319644    -0.12   0.906     .9354929    1.060873
             |
   obese4cat |
Obese I ..)  |   .9817714   .0265661    -0.68   0.497     .9310594    1.035246
Obese II..)  |   .9798293    .031318    -0.64   0.524     .9203303    1.043175
Obese II..)  |   .9026446   .0387363    -2.39   0.017      .829828    .9818508
             |
smoke_nomiss |
     Former  |   1.031299   .0635156     0.50   0.617      .914031    1.163613
    Current  |    1.03396   .0296512     1.16   0.244      .977448     1.09374
             |
         imd |
          4  |   .9900492   .0237827    -0.42   0.677     .9445163    1.037777
5 most de..  |   1.008641   .0334101     0.26   0.795     .9452385    1.076296
             |
tot_adults~h |
          2  |   .9312824   .1158912    -0.57   0.567     .7297191    1.188522
          3  |   1.067267    .109132     0.64   0.524     .8734429    1.304102
             |
1.htdiag_o~p |   .9888074   .0203741    -0.55   0.585     .9496704    1.029557
1.~y_disease |   1.005091   .0228814     0.22   0.823     .9612303    1.050953
    1.asthma |   1.061633   .0363756     1.75   0.081     .9926795    1.135377
1.~c_disease |    1.00636   .0243806     0.26   0.794     .9596912    1.055297
             |
     diabcat |
T1DM, con..  |   1.101049   .0689599     1.54   0.124     .9738563    1.244854
T1DM, unc..  |   1.081437   .1142316     0.74   0.459     .8792029    1.330188
T2DM, con..  |   1.016137   .0226886     0.72   0.473     .9726271    1.061593
T2DM, unc..  |   1.052483   .0485535     1.11   0.268     .9614951    1.152081
Diabetes,..  |   1.156382    .324675     0.52   0.605     .6669776    2.004894
             |
cancer_exh~t |
  Last year  |    1.15717   .1618948     1.04   0.297     .8796484    1.522247
2-5 years..  |   .9808314   .0727886    -0.26   0.794     .8480583    1.134392
   5+ years  |   1.029429   .0243774     1.22   0.221     .9827423    1.078334
             |
cancer_hae~t |
  Last year  |   .9287066   .1247759    -0.55   0.582     .7137001    1.208485
2-5 years..  |   .9393043   .0704184    -0.84   0.404     .8109478    1.087977
   5+ years  |   .9488795   .0220091    -2.26   0.024     .9067084    .9930121
             |
1.~r_disease |   .9670575   .0239181    -1.35   0.176     .9212969    1.015091
1.stroke_d~a |    1.00468    .023937     0.20   0.845     .9588427    1.052708
1.other_ne~o |   1.009217   .0228133     0.41   0.685     .9654798    1.054935
             |
reduced_ki~t |
Stage 3a/..  |   1.137597   .1548521     0.95   0.344     .8712063    1.485442
      1.esrd |   .9868721   .0189913    -0.69   0.492     .9503432    1.024805
1.other_tr~t |   1.036692   .0219512     1.70   0.089      .994549    1.080621
  1.asplenia |   .9982777    .022716    -0.08   0.940     .9547333    1.043808
1.ra_sle_p~s |   1.005044   .0242593     0.21   0.835     .9586041    1.053735
1.other_im~o |   1.028606   .0250978     1.16   0.248     .9805727    1.078992
             |
     vaccine#|
   kids_cat4 |
     1#none  |   1.315917     .14374     2.51   0.012     1.062307    1.630072
          1 #|
only <12 ..  |   1.041429   .0686447     0.62   0.538     .9152155    1.185047
          1 #|
 only 12-18  |   1.059101   .1265634     0.48   0.631     .8379504    1.338618
    1#mixed  |   1.011759   .0227384     0.52   0.603     .9681593    1.057321
     2#none  |    1.62715   .2159433     3.67   0.000     1.254476    2.110536
          2 #|
only <12 ..  |   1.055538   .1251161     0.46   0.648     .8367168    1.331587
          2 #|
 only 12-18  |    1.35302    .311613     1.31   0.189     .8615182    2.124925
    2#mixed  |   .9566514   .0526687    -0.80   0.421     .8587971    1.065656
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      8.13 /        1 =       8.1260

kids_cat4 
****************

 ( 1)  0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9064026   .1209889     7.49   0.000     .6692687    1.143537
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5422727   .1396478     3.88   0.000     .2685681    .8159773
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.428587    .091653    15.59   0.000      1.24895    1.608223
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 1bn.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.315917     .14374     2.51   0.012     1.062307    1.630072
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1bn.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.577954   .2703901     9.03   0.000     2.098922    3.166313
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1bn.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.82156   .2213314     4.94   0.000     1.435546    2.311373
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1bn.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   4.221863   .3844035    15.82   0.000     3.531845     5.04669
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.62715   .2159433     3.67   0.000     1.254476    2.110536
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.612881   .3465403     7.24   0.000     2.014776    3.388539
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.327074   .5116051     3.84   0.000     1.512426    3.580519
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.991912   .4037817    13.69   0.000     3.274025    4.867209
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine
> _0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine_0.ster
>  saved
(3,468 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,551  total observations
      1,102  observations end on or before enter()
------------------------------------------------------------------------------
      3,449  observations remaining, representing
      3,449  subjects
      3,239  failures in single-failure-per-subject data
    152,710  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       306
(2,302 missing values generated)
(3,628 missing values generated)
(326 observations (episodes) created)
(3,775 real changes made)
(288 observations (episodes) created)
(226 real changes made)
(covid_tpp_prob: 614 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,777       43.74       43.74
          1 |      2,060       50.70       94.44
          2 |        226        5.56      100.00
------------+-----------------------------------
      Total |      4,063      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |        43         32 |        75 
         1 |        17         76 |        93 
         2 |         0         19 |        19 
-----------+----------------------+----------
     Total |        60        127 |       187 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -15828.186
Iteration 1:   log pseudolikelihood = -15670.156
Iteration 2:   log pseudolikelihood = -15662.682
Iteration 3:   log pseudolikelihood =  -15662.56
Iteration 4:   log pseudolikelihood =  -15662.56
Refining estimates:
Iteration 0:   log pseudolikelihood =  -15662.56

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,449             Number of obs    =       4,063
No. of failures      =        3,239
Time at risk         =       152710
                                                Wald chi2(50)    =      297.58
Log pseudolikelihood =    -15662.56             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 754 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.526412   .2813566     2.29   0.022     1.063589    2.190634
 only 12-18  |   1.351198   .2803646     1.45   0.147     .8997051     2.02926
      mixed  |   3.292029   .4940511     7.94   0.000     2.453124    4.417816
             |
        age1 |   .9862783   .0156948    -0.87   0.385     .9559919    1.017524
        age2 |   1.087912   .0911158     1.01   0.314     .9232158    1.281989
        age3 |   .8322711   .1493256    -1.02   0.306     .5855214    1.183006
      1.male |   1.050684   .0365992     1.42   0.156     .9813448    1.124923
             |
   ethnicity |
Asian or ..  |   1.079732   .0617205     1.34   0.180      .965292    1.207739
      Other  |   .9357395   .0492564    -1.26   0.207     .8440119    1.037436
             |
   obese4cat |
Obese I ..)  |   .9669216   .0471828    -0.69   0.491     .8787297    1.063965
Obese II..)  |   1.038726   .0646755     0.61   0.542     .9193936    1.173547
Obese II..)  |   .9331791   .0696478    -0.93   0.354     .8061867    1.080176
             |
smoke_nomiss |
     Former  |   .9407383   .1142968    -0.50   0.615     .7413964    1.193678
    Current  |   .9979262   .0501988    -0.04   0.967      .904233    1.101328
             |
         imd |
          4  |   .9389337   .0432416    -1.37   0.171     .8578943    1.027628
5 most de..  |   .9946222   .0592773    -0.09   0.928     .8849696    1.117861
             |
tot_adults~h |
          2  |   1.018955   .2380216     0.08   0.936     .6446437     1.61061
          3  |   1.411222   .2287718     2.12   0.034     1.027089    1.939022
             |
1.htdiag_o~p |   .9769002   .0334991    -0.68   0.496     .9134009    1.044814
1.~y_disease |   .9765904   .0423046    -0.55   0.584     .8970973    1.063127
    1.asthma |   .9762492   .0575157    -0.41   0.683     .8697855    1.095744
1.~c_disease |   .9682281   .0394183    -0.79   0.428     .8939716    1.048653
             |
     diabcat |
T1DM, con..  |    1.09218   .1057323     0.91   0.362     .9034219    1.320376
T1DM, unc..  |   .9197218   .1786661    -0.43   0.667     .6284941    1.345897
T2DM, con..  |    1.01124   .0515183     0.22   0.826     .9151439    1.117428
T2DM, unc..  |   1.202648   .1011536     2.19   0.028      1.01987    1.418183
Diabetes,..  |   1.545364   .6521201     1.03   0.302     .6758288    3.533661
             |
cancer_exh~t |
  Last year  |   1.451569   .3349803     1.61   0.106     .9234315    2.281762
2-5 years..  |   .9614068   .1217244    -0.31   0.756     .7501291    1.232192
   5+ years  |   1.002899   .0470657     0.06   0.951     .9147672    1.099522
             |
cancer_hae~t |
  Last year  |   1.567875   .2993404     2.36   0.018     1.078448    2.279417
2-5 years..  |   .9536958   .1241462    -0.36   0.716     .7389341    1.230875
   5+ years  |   1.001525   .0446981     0.03   0.973     .9176407    1.093078
             |
1.~r_disease |   1.026869   .0450839     0.60   0.546     .9422013    1.119145
1.stroke_d~a |   1.016582   .0413294     0.40   0.686      .938721    1.100901
1.other_ne~o |   .9949535   .0475104    -0.11   0.916     .9060595    1.092569
             |
reduced_ki~t |
Stage 3a/..  |   .9794201   .0796803    -0.26   0.798     .8350643     1.14873
      1.esrd |    .987102   .0366579    -0.35   0.727     .9178063     1.06163
1.other_tr~t |   .9735636   .0424858    -0.61   0.539     .8937548    1.060499
  1.asplenia |   .9969769   .0451913    -0.07   0.947      .912224    1.089604
1.ra_sle_p~s |   1.038551   .0460105     0.85   0.393     .9521765    1.132761
1.other_im~o |   1.026267   .0451588     0.59   0.556     .9414664    1.118705
             |
     vaccine#|
   kids_cat4 |
     1#none  |    1.19221   .2006155     1.04   0.296     .8572737    1.658006
          1 #|
only <12 ..  |   1.401009   .1472914     3.21   0.001     1.140124     1.72159
          1 #|
 only 12-18  |   1.242684   .2500343     1.08   0.280     .8377116     1.84343
    1#mixed  |   .9594317   .0392756    -1.01   0.312     .8854601    1.039583
     2#none  |   1.509602   .3776667     1.65   0.100     .9245105    2.464977
          2 #|
only <12 ..  |   1.409667   .2541043     1.90   0.057     .9901029    2.007025
          2 #|
 only 12-18  |   1.411364   .4184566     1.16   0.245     .7893422    2.523554
    2#mixed  |   .9149115   .0833239    -0.98   0.329     .7653455    1.093706
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      2.25 /        1 =       2.2480

kids_cat4 
****************

 ( 1)  0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |          0  (omitted)
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4229198   .1843254     2.29   0.022     .0616486    .7841911
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3009914   .2074934     1.45   0.147    -.1056882     .707671
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.191504    .150075     7.94   0.000     .8973625    1.485646
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 1bn.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.19221   .2006155     1.04   0.296     .8572737    1.658006
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 1bn.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.138516   .3583829     4.54   0.000     1.539799    2.970032
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 1bn.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.679111   .3308578     2.63   0.009     1.141185    2.470604
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 1bn.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.158477   .4738632     7.67   0.000     2.353817    4.238212
------------------------------------------------------------------------------

 ( 1)  0b.kids_cat4 + 2.vaccine#0b.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.509602   .3776667     1.65   0.100     .9245105    2.464977
------------------------------------------------------------------------------

 ( 1)  1.kids_cat4 + 2.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.151733   .4662166     3.54   0.000     1.407208     3.29017
------------------------------------------------------------------------------

 ( 1)  2.kids_cat4 + 2.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.907031   .5437513     2.26   0.024     1.090574     3.33473
------------------------------------------------------------------------------

 ( 1)  3.kids_cat4 + 2.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.011915   .5142241     6.46   0.000     2.155347    4.208897
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine
> _1.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine_1.ster
>  saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b.log
  log type:  text
 closed on:  28 Oct 2021, 11:47:52
-------------------------------------------------------------------------------
