-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b.log
  log type:  text
 opened on:  26 Aug 2021, 10:18:20

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  4. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  5.         
.         
. gen first_vacc_plus_7d=covid_vacc_date+7
  6. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
  7. format first_vacc_plus_7d second_vacc_plus_7d %td
  8.  
. stsplit vaccine, after(first_vacc_plus_7d) at(0)
  9. replace vaccine = vaccine +1
 10. stsplit vaccine2, after(second_vacc_plus_7d) at(0)
 11. replace vaccine=2 if vaccine==1 &vaccine2==0 & second_vacc_plus_7d!=.
 12. recode `outcome' .=0 
 13. 
. tab vaccine
 14. tab vaccine `outcome'
 15. 
. 
. foreach int_type in  vaccine  {
 16. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 17. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 18. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ///
> interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type' 1.`
> int_type'#3.`exposure_type' 2.`int_type'#1.`exposure_type' 2.`int_type'#2.`ex
> posure_type' 2.`int_type'#3.`exposure_type')
 19. if _rc==0{
 20. testparm 1.`int_type'#i.`exposure_type'
 21. di _n "`exposure_type' " _n "****************"
 22. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 23. di "`exposure_type'" _n "****************"
 24. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 25. di "`exposure_type'" _n "****************"
 26. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 27. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x', replace
 28. }
 29. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 30. }
 31. }
 32. }
(11,665 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,117  total observations
      3,500  observations end on or before enter()
------------------------------------------------------------------------------
     12,617  observations remaining, representing
     12,617  subjects
     10,412  failures in single-failure-per-subject data
    515,248  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(8,073 missing values generated)
(12,894 missing values generated)
(1,195 observations (episodes) created)
(13,812 real changes made)
(1,027 observations (episodes) created)
(815 real changes made)
(covid_tpp_prob: 2222 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,573       44.30       44.30
          1 |      7,451       50.21       94.51
          2 |        815        5.49      100.00
------------+-----------------------------------
      Total |     14,839      100.00

           |   Failure/censoring
           |     indicator for
           |  outcome: covid prob
observatio |         case
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,439      4,134 |     6,573 
         1 |     1,830      5,621 |     7,451 
         2 |       158        657 |       815 
-----------+----------------------+----------
     Total |     4,427     10,412 |    14,839 

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -64737.569
Iteration 1:   log pseudolikelihood = -64449.841
Iteration 2:   log pseudolikelihood = -64440.243
Iteration 3:   log pseudolikelihood = -64440.179
Iteration 4:   log pseudolikelihood = -64440.179
Refining estimates:
Iteration 0:   log pseudolikelihood = -64440.179

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,617             Number of obs    =      14,839
No. of failures      =       10,412
Time at risk         =       515248
                                                Wald chi2(42)    =      382.95
Log pseudolikelihood =   -64440.179             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 971 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.498935    .127593     4.75   0.000     1.268605    1.771084
 only 12-18  |     1.4755   .2256598     2.54   0.011     1.093348    1.991224
      mixed  |   2.367281    .153197    13.32   0.000     2.085282    2.687415
             |
        age1 |   1.000628   .0035546     0.18   0.860     .9936851    1.007619
        age2 |   .9995786   .0113732    -0.04   0.970     .9775343     1.02212
        age3 |   .9983377   .0328611    -0.05   0.960     .9359647    1.064867
      1.male |   .9844391   .0190459    -0.81   0.418     .9478088    1.022485
             |
   ethnicity |
Asian or ..  |   .9759558   .0340337    -0.70   0.485     .9114795    1.044993
      Other  |   .9906782   .0311372    -0.30   0.766     .9314922    1.053625
             |
   obese4cat |
Obese I ..)  |   .9727815   .0272249    -0.99   0.324     .9208586    1.027632
Obese II..)  |   1.004647   .0354474     0.13   0.895     .9375193    1.076582
Obese II..)  |   1.084644   .0422344     2.09   0.037     1.004945    1.170662
             |
smoke_nomiss |
     Former  |   .9318959   .0701353    -0.94   0.349      .804091    1.080014
    Current  |   .9901853   .0299532    -0.33   0.744     .9331845    1.050668
             |
         imd |
          4  |   .9546831   .0239397    -1.85   0.064     .9088966    1.002776
5 most de..  |   .9851133   .0340826    -0.43   0.665     .9205272    1.054231
             |
tot_adults~h |
          2  |   .7898468   .0926019    -2.01   0.044     .6276936    .9938893
          3  |   .9798837   .0923972    -0.22   0.829     .8145379    1.178794
             |
1.htdiag_o~p |    1.06153    .022832     2.78   0.006      1.01771    1.107236
1.~y_disease |   .9906366   .0243193    -0.38   0.702     .9441002    1.039467
    1.asthma |   .9459289   .0331927    -1.58   0.113      .883059    1.013275
1.~c_disease |   1.032619   .0259724     1.28   0.202     .9829485      1.0848
             |
     diabcat |
T1DM, con..  |   .9675082   .0596472    -0.54   0.592     .8573889    1.091771
T1DM, unc..  |   .8858101    .107034    -1.00   0.316     .6990181    1.122517
T2DM, con..  |   1.047012   .0276179     1.74   0.082     .9942572    1.102566
T2DM, unc..  |   .9862169   .0495826    -0.28   0.783     .8936713    1.088346
Diabetes,..  |   .5461383   .2071487    -1.59   0.111     .2596834    1.148579
             |
cancer_exh~t |
  Last year  |   1.432743    .192391     2.68   0.007     1.101203    1.864099
2-5 years..  |   1.081117   .0757096     1.11   0.265      .942462    1.240171
   5+ years  |   1.022283   .0271332     0.83   0.406     .9704629    1.076871
             |
cancer_hae~t |
  Last year  |   .7009756   .0974543    -2.56   0.011     .5337812    .9205399
2-5 years..  |    1.13958    .091672     1.62   0.104     .9733548    1.334193
   5+ years  |    1.03461   .0270067     1.30   0.192     .9830087    1.088919
             |
1.~r_disease |   1.009781   .0260518     0.38   0.706     .9599896    1.062154
1.stroke_d~a |   1.014072    .024838     0.57   0.568     .9665404    1.063941
1.other_ne~o |   .9966294   .0226503    -0.15   0.882     .9532099    1.042027
             |
reduced_ki~t |
Stage 3a/..  |   1.333837   .2348563     1.64   0.102     .9445543    1.883557
      1.esrd |    1.02253   .0196312     1.16   0.246     .9847688     1.06174
1.other_tr~t |   1.003348    .025179     0.13   0.894     .9551918    1.053931
  1.asplenia |   1.011682   .0242368     0.48   0.628     .9652772    1.060319
1.ra_sle_p~s |   1.020317   .0236587     0.87   0.386     .9749846    1.067757
1.other_im~o |   1.048145   .0264874     1.86   0.063     .9974957    1.101367
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      2.60 /        1 =       2.6050

         failure _d:  covid_tpp_prob
   analysis time _t:  (stime_covid_tpp_prob-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -64737.569
Iteration 1:   log pseudolikelihood = -64448.566
Iteration 2:   log pseudolikelihood = -64438.835
Iteration 3:   log pseudolikelihood =  -64438.77
Iteration 4:   log pseudolikelihood =  -64438.77
Refining estimates:
Iteration 0:   log pseudolikelihood =  -64438.77

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,617             Number of obs    =      14,839
No. of failures      =       10,412
Time at risk         =       515248
                                                Wald chi2(48)    =      389.56
Log pseudolikelihood =    -64438.77             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 971 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.463873   .1493914     3.73   0.000     1.198496    1.788011
 only 12-18  |   1.327854   .2745634     1.37   0.170     .8854125    1.991385
      mixed  |   2.344537    .153903    12.98   0.000     2.061492    2.666446
             |
        age1 |    1.00049   .0035496     0.14   0.890     .9935569    1.007471
        age2 |   1.000107    .011348     0.01   0.992     .9781112    1.022598
        age3 |   .9968025   .0327048    -0.10   0.922     .9347197    1.063009
      1.male |   .9842648   .0190452    -0.82   0.412      .947636     1.02231
             |
   ethnicity |
Asian or ..  |   .9759053   .0339687    -0.70   0.483     .9115481    1.044806
      Other  |   .9896045   .0310954    -0.33   0.739     .9304975    1.052466
             |
   obese4cat |
Obese I ..)  |   .9734012   .0272278    -0.96   0.335     .9214721    1.028257
Obese II..)  |   1.005654   .0354362     0.16   0.873     .9385448    1.077563
Obese II..)  |   1.086659   .0424185     2.13   0.033     1.006621    1.173061
             |
smoke_nomiss |
     Former  |    .931072   .0701071    -0.95   0.343      .803323    1.079136
    Current  |   .9893962   .0298953    -0.35   0.724     .9325038     1.04976
             |
         imd |
          4  |   .9548997   .0239895    -1.84   0.066     .9090198    1.003095
5 most de..  |   .9848996   .0340437    -0.44   0.660     .9203852    1.053936
             |
tot_adults~h |
          2  |   .7937568   .0924896    -1.98   0.047     .6316905    .9974028
          3  |   .9818874   .0922148    -0.19   0.846     .8168088    1.180329
             |
1.htdiag_o~p |   1.061697    .022828     2.78   0.005     1.017885    1.107395
1.~y_disease |   .9908856   .0242886    -0.37   0.709     .9444062    1.039652
    1.asthma |   .9465206   .0331703    -1.57   0.117     .8836905    1.013818
1.~c_disease |   1.032408   .0258935     1.27   0.203     .9828849    1.084427
             |
     diabcat |
T1DM, con..  |   .9672626    .059665    -0.54   0.589      .857114    1.091567
T1DM, unc..  |   .8858212   .1068185    -1.01   0.315     .6993624    1.121992
T2DM, con..  |   1.047016   .0276105     1.74   0.081      .994275    1.102554
T2DM, unc..  |   .9869704   .0495626    -0.26   0.794      .894457    1.089052
Diabetes,..  |   .5440902   .2075955    -1.60   0.111     .2575718    1.149327
             |
cancer_exh~t |
  Last year  |   1.435252   .1925695     2.69   0.007     1.103371     1.86696
2-5 years..  |   1.082096   .0759905     1.12   0.261     .9429531    1.241772
   5+ years  |   1.022941   .0271132     0.86   0.392     .9711571    1.077487
             |
cancer_hae~t |
  Last year  |   .7000849   .0977183    -2.55   0.011     .5325243     .920369
2-5 years..  |   1.141194   .0916856     1.64   0.100     .9749275    1.335816
   5+ years  |    1.03485   .0270264     1.31   0.190     .9832122      1.0892
             |
1.~r_disease |   1.009908   .0260664     0.38   0.702     .9600899    1.062312
1.stroke_d~a |   1.014482   .0248564     0.59   0.557     .9669155    1.064388
1.other_ne~o |   .9963736   .0226236    -0.16   0.873     .9530042    1.041717
             |
reduced_ki~t |
Stage 3a/..  |   1.331583   .2339905     1.63   0.103     .9436093    1.879077
      1.esrd |   1.022034    .019626     1.13   0.256     .9842827    1.061233
1.other_tr~t |   1.003518   .0252249     0.14   0.889      .955276    1.054196
  1.asplenia |    1.01191   .0242921     0.49   0.622     .9654013     1.06066
1.ra_sle_p~s |   1.019805   .0237292     0.84   0.399     .9743409     1.06739
1.other_im~o |   1.047963   .0264802     1.85   0.064     .9973275     1.10117
             |
     vaccine#|
   kids_cat4 |
          1 #|
only <12 ..  |   1.046449   .0677237     0.70   0.483     .9217867    1.187971
          1 #|
 only 12-18  |   1.183273     .14999     1.33   0.184     .9229707    1.516988
    1#mixed  |   1.011793   .0233086     0.51   0.611     .9671245    1.058524
          2 #|
only <12 ..  |   .9834591   .1412911    -0.12   0.908     .7421067    1.303306
          2 #|
 only 12-18  |   1.051527   .2817451     0.19   0.851     .6219423    1.777831
    2#mixed  |   1.033678   .0550818     0.62   0.534     .9311664    1.147476
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      2.94 /        1 =       2.9380

 ( 1)  1bn.vaccine#1.kids_cat4 = 0
 ( 2)  1bn.vaccine#2.kids_cat4 = 0
 ( 3)  1bn.vaccine#3.kids_cat4 = 0

           chi2(  3) =    2.54
         Prob > chi2 =    0.4688

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1bn.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.531869   .1292359     5.06   0.000     1.298405    1.807312
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1bn.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.571214   .2416399     2.94   0.003     1.162325    2.123945
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1bn.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.372186   .1553893    13.19   0.000     2.086368    2.697158
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine
> _0.ster not found)
file ./output/an_interaction_cox_models_covid_tpp_prob_kids_cat4_vaccine_0.ster
>  saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_tpp_pro
> b.log
  log type:  text
 closed on:  26 Aug 2021, 10:18:26
-------------------------------------------------------------------------------
