-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_death.l
> og
  log type:  text
 opened on:  17 Aug 2021, 07:52:44

. 
. 
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ET
> HNICITY:
. cap prog drop basemodel

. prog define basemodel
  1.         syntax , exposure(string)  age(string) [ethnicity(real 0) interact
> ion(string)] 
  2. timer clear
  3. timer on 1
  4. stcox   `exposure'                                                        
>       ///
>                         $demogadjlist                                        
>            ///
>                         $comordidadjlist                                     
>            ///
>                         `interaction'                                        
>            ///
>                         , strata(stp) vce(cluster household_id)
  5.         timer off 1
  6. timer list
  7. end

. *****************************************************************************
> ********
. 
. * Open dataset and fit specified model(s)
. foreach x in 0 {
  2. 
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
  3. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
  4. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  5.         
.         
. gen first_vacc_plus_14d=covid_vacc_date+14
  6. gen second_vacc_plus_14d=covid_vacc_second_dose_date+14
  7. format first_vacc_plus_14d second_vacc_plus_14d %td
  8. 
. stsplit vaccine, after(first_vacc_plus_14d) at(0)
  9. replace vaccine = vaccine +1
 10. stsplit vaccine2, after(second_vacc_plus_14d) at(2)
 11. replace vaccine2 = vaccine2 +1
 12. replace vaccine=2 if vaccine2==2
 13. 
. bysort patient: replace vaccine=0 if _N==1
 14. sort patient vaccine
 15. bysort patient: replace vaccine=2 if _N==3 & vaccine2==3
 16. 
. recode `outcome' .=0 
 17. tab vaccine
 18. tab vaccine `outcome'
 19. recode vaccine 1=0 2=1
 20. 
. foreach int_type in  vaccine  {
 21. 
. *Age interaction for 3-level exposure vars
. foreach exposure_type in kids_cat4  {
 22. 
. *Age spline model (not adj ethnicity, no interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  
 23. 
. *Age spline model (not adj ethnicity, interaction)
. basemodel, exposure("i.`exposure_type'") age("age1 age2 age3")  ///
> interaction(1.`int_type'#1.`exposure_type' 1.`int_type'#2.`exposure_type' 1.`
> int_type'#3.`exposure_type')
 24. if _rc==0{
 25. testparm 1.`int_type'#i.`exposure_type'
 26. di _n "`exposure_type' " _n "****************"
 27. lincom 1.`exposure_type' + 1.`int_type'#1.`exposure_type', eform
 28. di "`exposure_type'" _n "****************"
 29. lincom 2.`exposure_type' + 1.`int_type'#2.`exposure_type', eform
 30. di "`exposure_type'" _n "****************"
 31. lincom 3.`exposure_type' + 1.`int_type'#3.`exposure_type', eform
 32. estimates save ./output/an_interaction_cox_models_`outcome'_`exposure_type
> '_`int_type'_`x'_timeperiod1, replace
 33. }
 34. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 35. }
 36. }
 37. }
(13,067 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     16,149  total observations
      3,439  observations end on or before enter()
------------------------------------------------------------------------------
     12,710  observations remaining, representing
     12,710  subjects
      5,341  failures in single-failure-per-subject data
    638,700  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       208
(8,075 missing values generated)
(12,912 missing values generated)
(1,397 observations (episodes) created)
(14,107 real changes made)
(1,090 observations (episodes) created)
(15,197 real changes made)
(0 real changes made)
(9,218 real changes made)
(345 real changes made)
(covid_death: 2487 changes made)

observation |
   interval |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,881       85.22       85.22
          1 |      2,410       12.93       98.15
          2 |        345        1.85      100.00
------------+-----------------------------------
      Total |     18,636      100.00

           |   Failure/censoring
           |     indicator for
observatio | outcome: covid death
n interval |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,859      6,022 |    15,881 
         1 |     1,739        671 |     2,410 
         2 |       274         71 |       345 
-----------+----------------------+----------
     Total |    11,872      6,764 |    18,636 
(vaccine: 2755 changes made)

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -33580.864
Iteration 1:   log pseudolikelihood = -33359.658
Iteration 2:   log pseudolikelihood = -33350.843
Iteration 3:   log pseudolikelihood = -33350.747
Iteration 4:   log pseudolikelihood = -33350.747
Refining estimates:
Iteration 0:   log pseudolikelihood = -33350.747

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,710             Number of obs    =      15,197
No. of failures      =        5,341
Time at risk         =       638700
                                                Wald chi2(42)    =      268.83
Log pseudolikelihood =   -33350.747             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 975 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.723181   .1703355     5.51   0.000     1.419679    2.091567
 only 12-18  |   1.610429   .1898469     4.04   0.000     1.278194    2.029019
      mixed  |   2.951814   .2378744    13.43   0.000     2.520544    3.456876
             |
        age1 |   1.001114   .0051729     0.22   0.829     .9910262    1.011304
        age2 |   .9891739   .0158033    -0.68   0.496     .9586799    1.020638
        age3 |   1.037652    .046265     0.83   0.407     .9508238     1.13241
      1.male |   1.004535   .0256478     0.18   0.859     .9555037    1.056083
             |
   ethnicity |
Asian or ..  |   .9646625   .0457494    -0.76   0.448     .8790366    1.058629
      Other  |   .9804909   .0448709    -0.43   0.667     .8963744    1.072501
             |
   obese4cat |
Obese I ..)  |   .9406275   .0390358    -1.47   0.140     .8671475    1.020334
Obese II..)  |   .9636124   .0496664    -0.72   0.472     .8710233    1.066044
Obese II..)  |   1.036922   .0587389     0.64   0.522     .9279564    1.158682
             |
smoke_nomiss |
     Former  |   1.069072   .1077401     0.66   0.507     .8774524    1.302537
    Current  |    1.00431   .0408074     0.11   0.916     .9274304    1.087562
             |
         imd |
          4  |   .9818668   .0335494    -0.54   0.592     .9182646    1.049874
5 most de..  |   .9849645   .0481353    -0.31   0.757     .8949984    1.083974
             |
tot_adults~h |
          2  |   1.248255   .2433516     1.14   0.255     .8518408    1.829144
          3  |   1.265696   .2029663     1.47   0.142     .9243388    1.733116
             |
1.htdiag_o~p |   1.000597   .0311508     0.02   0.985     .9413679    1.063552
1.~y_disease |   1.039464   .0344001     1.17   0.242     .9741806    1.109121
    1.asthma |   1.020396   .0511735     0.40   0.687     .9248698    1.125789
1.~c_disease |    1.00232   .0339929     0.07   0.946     .9378608    1.071209
             |
     diabcat |
T1DM, con..  |   1.120722    .100144     1.28   0.202       .94067    1.335237
T1DM, unc..  |   1.263588   .2469293     1.20   0.231     .8615183    1.853304
T2DM, con..  |   1.044561   .0377207     1.21   0.227      .973186    1.121172
T2DM, unc..  |   1.055329   .0724512     0.78   0.433     .9224667    1.207328
Diabetes,..  |   1.074447   .5908454     0.13   0.896     .3656824    3.156939
             |
cancer_exh~t |
  Last year  |   1.153451   .2419083     0.68   0.496     .7646809    1.739875
2-5 years..  |   1.061263   .1088391     0.58   0.562     .8680144    1.297535
   5+ years  |   .9832638   .0360711    -0.46   0.645     .9150476    1.056565
             |
cancer_hae~t |
  Last year  |   1.060795   .2157448     0.29   0.772      .712055    1.580334
2-5 years..  |   1.045833   .1339104     0.35   0.726     .8137162    1.344163
   5+ years  |   1.005201   .0350611     0.15   0.882     .9387789    1.076323
             |
1.~r_disease |   .9962342   .0352758    -0.11   0.915     .9294396    1.067829
1.stroke_d~a |   1.009241   .0351821     0.26   0.792      .942588    1.080606
1.other_ne~o |   1.017979   .0339522     0.53   0.593     .9535622    1.086747
             |
reduced_ki~t |
Stage 3a/..  |   1.343356   .2559559     1.55   0.121     .9247147    1.951527
      1.esrd |   1.029645   .0291942     1.03   0.303      .973986    1.088484
1.other_tr~t |   .9664312    .031525    -1.05   0.295     .9065771    1.030237
  1.asplenia |   1.041228    .037475     1.12   0.262     .9703094     1.11733
1.ra_sle_p~s |   .9808771   .0331531    -0.57   0.568     .9180037    1.048057
1.other_im~o |   .9907764   .0338024    -0.27   0.786     .9266914    1.059293
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      9.66 /        1 =       9.6570

         failure _d:  covid_death
   analysis time _t:  (stime_covid_death-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -33580.864
Iteration 1:   log pseudolikelihood = -33346.399
Iteration 2:   log pseudolikelihood = -33336.831
Iteration 3:   log pseudolikelihood = -33336.725
Iteration 4:   log pseudolikelihood = -33336.725
Refining estimates:
Iteration 0:   log pseudolikelihood = -33336.725

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       12,710             Number of obs    =      15,197
No. of failures      =        5,341
Time at risk         =       638700
                                                Wald chi2(45)    =      293.65
Log pseudolikelihood =   -33336.725             Prob > chi2      =      0.0000

                         (Std. Err. adjusted for 975 clusters in household_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   kids_cat4 |
only <12 ..  |   1.778194    .177092     5.78   0.000     1.462875    2.161479
 only 12-18  |   1.630775   .1926425     4.14   0.000     1.293725    2.055635
      mixed  |   3.004477   .2426875    13.62   0.000      2.56456    3.519857
             |
        age1 |   1.000972   .0051816     0.19   0.851     .9908681     1.01118
        age2 |   .9893252   .0158642    -0.67   0.503     .9587155    1.020912
        age3 |   1.037769   .0464339     0.83   0.407     .9506371    1.132888
      1.male |   1.006253   .0256566     0.24   0.807     .9572028    1.057817
             |
   ethnicity |
Asian or ..  |    .964233    .045752    -0.77   0.443      .878604    1.058207
      Other  |   .9761591   .0447015    -0.53   0.598     .8923624    1.067825
             |
   obese4cat |
Obese I ..)  |   .9386244   .0391121    -1.52   0.128     .8650129      1.0185
Obese II..)  |   .9625008    .049825    -0.74   0.460     .8696363    1.065282
Obese II..)  |   1.032006   .0587102     0.55   0.580     .9231194    1.153736
             |
smoke_nomiss |
     Former  |   1.072107   .1071565     0.70   0.486     .8813751    1.304113
    Current  |   1.003522   .0408387     0.09   0.931     .9265882    1.086843
             |
         imd |
          4  |   .9804298    .033528    -0.58   0.563       .91687    1.048396
5 most de..  |   .9865569   .0480987    -0.28   0.781     .8966492     1.08548
             |
tot_adults~h |
          2  |   1.252782   .2443498     1.16   0.248     .8547757     1.83611
          3  |   1.274234   .2049181     1.51   0.132      .929741    1.746372
             |
1.htdiag_o~p |   1.002236   .0311215     0.07   0.943     .9430585    1.065128
1.~y_disease |   1.037929   .0343524     1.12   0.261     .9727368     1.10749
    1.asthma |   1.014887   .0510492     0.29   0.769     .9196064     1.12004
1.~c_disease |   1.002948   .0340286     0.09   0.931     .9384227    1.071911
             |
     diabcat |
T1DM, con..  |    1.11918   .1001822     1.26   0.208      .939086    1.333811
T1DM, unc..  |   1.250299   .2453376     1.14   0.255     .8511152    1.836705
T2DM, con..  |   1.043536   .0377543     1.18   0.239     .9721017     1.12022
T2DM, unc..  |   1.053393    .072335     0.76   0.449     .9207458    1.205151
Diabetes,..  |   1.059963   .5832114     0.11   0.916     .3605322    3.116288
             |
cancer_exh~t |
  Last year  |   1.172044   .2453207     0.76   0.448     .7776407    1.766481
2-5 years..  |   1.057294    .108597     0.54   0.588     .8645037    1.293077
   5+ years  |   .9820304   .0360082    -0.49   0.621      .913932    1.055203
             |
cancer_hae~t |
  Last year  |   1.088828    .215003     0.43   0.666     .7393989    1.603393
2-5 years..  |   1.050931    .135227     0.39   0.699     .8166707    1.352388
   5+ years  |   1.004524   .0352083     0.13   0.898     .9378339    1.075956
             |
1.~r_disease |   .9967603   .0352209    -0.09   0.927     .9300647    1.068239
1.stroke_d~a |   1.007136   .0350487     0.20   0.838     .9407324    1.078227
1.other_ne~o |   1.014861   .0337464     0.44   0.657     .9508284    1.083206
             |
reduced_ki~t |
Stage 3a/..  |   1.333249   .2551608     1.50   0.133      .916233    1.940066
      1.esrd |   1.031744   .0292213     1.10   0.270     .9760322    1.090636
1.other_tr~t |   .9660962   .0316053    -1.05   0.292     .9060951    1.030071
  1.asplenia |   1.042979   .0374639     1.17   0.241     .9720764    1.119054
1.ra_sle_p~s |   .9772856   .0330591    -0.68   0.497     .9145923    1.044276
1.other_im~o |   .9904255    .033794    -0.28   0.778     .9263566    1.058926
             |
     vaccine#|
   kids_cat4 |
          1 #|
only <12 ..  |   .4745601   .1194314    -2.96   0.003     .2897819    .7771612
          1 #|
 only 12-18  |   .4737208   .6199913    -0.57   0.568     .0364331    6.159548
    1#mixed  |   .5720443   .0799092    -4.00   0.000     .4350356     .752202
------------------------------------------------------------------------------
                                                             Stratified by stp
   1:      8.42 /        1 =       8.4230

 ( 1)  1.vaccine#1.kids_cat4 = 0
 ( 2)  1.vaccine#2.kids_cat4 = 0
 ( 3)  1.vaccine#3.kids_cat4 = 0

           chi2(  3) =   25.70
         Prob > chi2 =    0.0000

kids_cat4 
****************

 ( 1)  1.kids_cat4 + 1.vaccine#1.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .8438599   .2132754    -0.67   0.502     .5142087    1.384845
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  2.kids_cat4 + 1.vaccine#2.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7725321   1.011329    -0.20   0.844     .0593746    10.05154
------------------------------------------------------------------------------
kids_cat4
****************

 ( 1)  3.kids_cat4 + 1.vaccine#3.kids_cat4 = 0

------------------------------------------------------------------------------
          _t |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.718694   .2707066     3.44   0.001       1.2622    2.340286
------------------------------------------------------------------------------
(note: file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_0_
> timeperiod1.ster not found)
file ./output/an_interaction_cox_models_covid_death_kids_cat4_vaccine_0_timeper
> iod1.ster saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/10_an_interaction_cox_models_vaccine_covid_death.l
> og
  log type:  text
 closed on:  17 Aug 2021, 07:53:04
-------------------------------------------------------------------------------
