-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_death.log
  log type:  text
 opened on:  28 Oct 2021, 11:49:47

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("period") _tab ("age") _tab ("exposure") _ta
> b ("exposure level") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach period in 0 1 2 3 4   {
  4. foreach x in 0 1 {
  5. forvalues i=`min'/`max'{
  6. foreach int_type in male shield {
  7. 
. foreach int_level in 0 1 {
  8. 
. local endwith "_tab"
  9. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`period'") _tab ("`x'") _tab ("`variab
> le'") _tab ("`i'") _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'"
> ) _tab
 10. 
.         foreach modeltype of any fulladj {
 11. 
.                 local noestimatesflag 0 /*reset*/
 12. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 13. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 14.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'_timeperiod`period'
 15.                                 if _rc!=0 local noestimatesflag 1
 16.                                 }
 17.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 18.                         if `int_level'==0 {
 19.                         test 1.`int_type'#`i'.`variable'
 20.                         *overall p-value for interaction: test 1.`int_type
> '#1.`variable' test 1.`int_type'#2.`variable'
.                         local pval=r(p)
 21.                         cap lincom `i'.`variable', eform
 22.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 23. 
.                                 else file write tablecontents_int %4.2f ("ERR
>  IN MODEL") `endwith'
 24.                                 }
 25.                         if `int_level'==1 {
 26.                         cap lincom `i'.`variable'+ 1.`int_type'#`i'.`varia
> ble', eform
 27.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 28.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 29.                                 }
 30.                         }
 31.                         else file write tablecontents_int %4.2f ("DID NOT 
> FIT") `endwith'
 32. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 33.                         if "`modeltype'"=="fulladj" {
 34.                                 local hr = r(estimate)
 35.                                 local lb = r(lb)
 36.                                 local ub = r(ub)
 37.                                 cap gen `variable'=.
 38.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 39.                                 local pval=r(p)
 40.                                 post HRestimates_int ("`period'") ("`x'") 
> ("`outcome'") ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb')
>  (`ub') (`pval')
 41.                                 drop `variable'
 42.                                 }
 43.                 }
 44.                 }
 45.                 } /*int_level*/
 46.                 } /*full adj*/
 47. 
. } /*variable levels*/
 48. } /*agebands*/
 49. } /*datsets*/
 50. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11_an_int_tab_contents_HRtable_`ou
> tcome'.txt, t w replace
(note: file ./output/11_an_int_tab_contents_HRtable_covid_death.txt not found)

. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 period str10 x str10 outcome str27 variable st
> r27 int_type level int_level hr lci uci pval using `HRestimates_int'

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.54
         Prob > chi2 =    0.4641

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.54
         Prob > chi2 =    0.4641

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    5.65
         Prob > chi2 =    0.0594

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    5.65
         Prob > chi2 =    0.0594

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.39
         Prob > chi2 =    0.5304

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.54
         Prob > chi2 =    0.4641

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.54
         Prob > chi2 =    0.4641

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    5.56
         Prob > chi2 =    0.0184

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    5.65
         Prob > chi2 =    0.0594

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    5.65
         Prob > chi2 =    0.0594

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    1.52
         Prob > chi2 =    0.2172

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.54
         Prob > chi2 =    0.4641

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.54
         Prob > chi2 =    0.4641

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    1.14
         Prob > chi2 =    0.2856

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    5.65
         Prob > chi2 =    0.0594

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    5.65
         Prob > chi2 =    0.0594

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    1.72
         Prob > chi2 =    0.1892

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.54
         Prob > chi2 =    0.4641

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.54
         Prob > chi2 =    0.4641

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    6.13
         Prob > chi2 =    0.0133

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    5.65
         Prob > chi2 =    0.0594

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    5.65
         Prob > chi2 =    0.0594

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7427

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7427

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.73
         Prob > chi2 =    0.3932

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.73
         Prob > chi2 =    0.3932

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.47
         Prob > chi2 =    0.4914

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7427

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7427

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    0.73
         Prob > chi2 =    0.3932

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.73
         Prob > chi2 =    0.3932

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.73
         Prob > chi2 =    0.3932

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.01
         Prob > chi2 =    0.9327

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7427

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7427

 ( 1)  1.shield#2.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.73
         Prob > chi2 =    0.3932

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.73
         Prob > chi2 =    0.3932

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.78
         Prob > chi2 =    0.3778

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7427

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.59
         Prob > chi2 =    0.7427

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.34
         Prob > chi2 =    0.5624

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.73
         Prob > chi2 =    0.3932

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  1) =    0.73
         Prob > chi2 =    0.3932

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.17
         Prob > chi2 =    0.5584

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.17
         Prob > chi2 =    0.5584

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.46
         Prob > chi2 =    0.4822

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.46
         Prob > chi2 =    0.4822

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.15
         Prob > chi2 =    0.6948

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.17
         Prob > chi2 =    0.5584

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.17
         Prob > chi2 =    0.5584

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    0.27
         Prob > chi2 =    0.6038

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.46
         Prob > chi2 =    0.4822

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.46
         Prob > chi2 =    0.4822

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    1.14
         Prob > chi2 =    0.2853

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.17
         Prob > chi2 =    0.5584

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.17
         Prob > chi2 =    0.5584

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    1.43
         Prob > chi2 =    0.2323

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.46
         Prob > chi2 =    0.4822

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.46
         Prob > chi2 =    0.4822

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.06
         Prob > chi2 =    0.8027

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.17
         Prob > chi2 =    0.5584

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.17
         Prob > chi2 =    0.5584

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.04
         Prob > chi2 =    0.8322

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.46
         Prob > chi2 =    0.4822

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.46
         Prob > chi2 =    0.4822

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.32
         Prob > chi2 =    0.8542

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.32
         Prob > chi2 =    0.8542

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.77
         Prob > chi2 =    0.6812

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.77
         Prob > chi2 =    0.6812

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9482

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.32
         Prob > chi2 =    0.8542

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.32
         Prob > chi2 =    0.8542

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    0.72
         Prob > chi2 =    0.3954

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.77
         Prob > chi2 =    0.6812

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.77
         Prob > chi2 =    0.6812

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.14
         Prob > chi2 =    0.7085

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.32
         Prob > chi2 =    0.8542

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.32
         Prob > chi2 =    0.8542

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    0.24
         Prob > chi2 =    0.6262

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.77
         Prob > chi2 =    0.6812

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.77
         Prob > chi2 =    0.6812

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.01
         Prob > chi2 =    0.9053

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.32
         Prob > chi2 =    0.8542

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.32
         Prob > chi2 =    0.8542

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.79
         Prob > chi2 =    0.3748

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.77
         Prob > chi2 =    0.6812

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.77
         Prob > chi2 =    0.6812

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.18
         Prob > chi2 =    0.9133

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.18
         Prob > chi2 =    0.9133

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.21
         Prob > chi2 =    0.9023

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.21
         Prob > chi2 =    0.9023

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.07
         Prob > chi2 =    0.7893

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.18
         Prob > chi2 =    0.9133

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.18
         Prob > chi2 =    0.9133

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    0.15
         Prob > chi2 =    0.7018

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.21
         Prob > chi2 =    0.9023

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.21
         Prob > chi2 =    0.9023

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.02
         Prob > chi2 =    0.8975

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.18
         Prob > chi2 =    0.9133

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.18
         Prob > chi2 =    0.9133

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9717

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.21
         Prob > chi2 =    0.9023

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.21
         Prob > chi2 =    0.9023

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.26
         Prob > chi2 =    0.6103

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.18
         Prob > chi2 =    0.9133

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.18
         Prob > chi2 =    0.9133

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.04
         Prob > chi2 =    0.8487

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.21
         Prob > chi2 =    0.9023

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    0.21
         Prob > chi2 =    0.9023

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    5.59
         Prob > chi2 =    0.0612

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    5.59
         Prob > chi2 =    0.0612

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.36
         Prob > chi2 =    0.3079

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.36
         Prob > chi2 =    0.3079

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    4.19
         Prob > chi2 =    0.0407

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    5.59
         Prob > chi2 =    0.0612

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    5.59
         Prob > chi2 =    0.0612

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    1.50
         Prob > chi2 =    0.2210

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.36
         Prob > chi2 =    0.3079

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.36
         Prob > chi2 =    0.3079

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    3.40
         Prob > chi2 =    0.0652

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    5.59
         Prob > chi2 =    0.0612

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    5.59
         Prob > chi2 =    0.0612

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    0.21
         Prob > chi2 =    0.6437

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.36
         Prob > chi2 =    0.3079

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.36
         Prob > chi2 =    0.3079

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    4.50
         Prob > chi2 =    0.0339

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    5.59
         Prob > chi2 =    0.0612

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    5.59
         Prob > chi2 =    0.0612

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.66
         Prob > chi2 =    0.4153

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.36
         Prob > chi2 =    0.3079

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.36
         Prob > chi2 =    0.3079

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.32
         Prob > chi2 =    0.3128

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.32
         Prob > chi2 =    0.3128

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5262

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5262

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.70
         Prob > chi2 =    0.4031

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.32
         Prob > chi2 =    0.3128

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.32
         Prob > chi2 =    0.3128

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9944

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5262

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5262

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.25
         Prob > chi2 =    0.6177

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.32
         Prob > chi2 =    0.3128

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.32
         Prob > chi2 =    0.3128

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    0.71
         Prob > chi2 =    0.3980

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5262

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5262

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.58
         Prob > chi2 =    0.4444

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.32
         Prob > chi2 =    0.3128

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.32
         Prob > chi2 =    0.3128

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    0.12
         Prob > chi2 =    0.7337

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5262

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5262

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5265

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5265

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    6.82
         Prob > chi2 =    0.0330

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    6.82
         Prob > chi2 =    0.0330

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.75
         Prob > chi2 =    0.3868

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5265

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5265

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    6.48
         Prob > chi2 =    0.0109

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    6.82
         Prob > chi2 =    0.0330

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    6.82
         Prob > chi2 =    0.0330

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9705

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5265

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5265

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    2.69
         Prob > chi2 =    0.1009

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    6.82
         Prob > chi2 =    0.0330

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    6.82
         Prob > chi2 =    0.0330

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.79
         Prob > chi2 =    0.3753

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5265

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.28
         Prob > chi2 =    0.5265

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    9.70
         Prob > chi2 =    0.0018

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    6.82
         Prob > chi2 =    0.0330

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    6.82
         Prob > chi2 =    0.0330

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    3.61
         Prob > chi2 =    0.1647

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    3.61
         Prob > chi2 =    0.1647

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    3.81
         Prob > chi2 =    0.1489

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    3.81
         Prob > chi2 =    0.1489

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.04
         Prob > chi2 =    0.8434

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    3.61
         Prob > chi2 =    0.1647

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    3.61
         Prob > chi2 =    0.1647

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    3.81
         Prob > chi2 =    0.0511

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    3.81
         Prob > chi2 =    0.1489

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    3.81
         Prob > chi2 =    0.1489

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    2.29
         Prob > chi2 =    0.1302

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    3.61
         Prob > chi2 =    0.1647

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    3.61
         Prob > chi2 =    0.1647

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    0.97
         Prob > chi2 =    0.3250

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    3.81
         Prob > chi2 =    0.1489

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    3.81
         Prob > chi2 =    0.1489

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.06
         Prob > chi2 =    0.8127

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    3.61
         Prob > chi2 =    0.1647

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    3.61
         Prob > chi2 =    0.1647

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    2.49
         Prob > chi2 =    0.1143

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    3.81
         Prob > chi2 =    0.1489

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    3.81
         Prob > chi2 =    0.1489

 ( 1)  1o.male#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.90
         Prob > chi2 =    0.3867

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.90
         Prob > chi2 =    0.3867

 ( 1)  1o.shield#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.60
         Prob > chi2 =    0.2727

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.60
         Prob > chi2 =    0.2727

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    1.44
         Prob > chi2 =    0.2302

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.90
         Prob > chi2 =    0.3867

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.90
         Prob > chi2 =    0.3867

 ( 1)  1.shield#1.kids_cat4 = 0

           chi2(  1) =    2.57
         Prob > chi2 =    0.1086

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.60
         Prob > chi2 =    0.2727

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.60
         Prob > chi2 =    0.2727

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9757

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.90
         Prob > chi2 =    0.3867

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.90
         Prob > chi2 =    0.3867

 ( 1)  1.shield#2.kids_cat4 = 0

           chi2(  1) =    0.30
         Prob > chi2 =    0.5838

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.60
         Prob > chi2 =    0.2727

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.60
         Prob > chi2 =    0.2727

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    2.48
         Prob > chi2 =    0.1155

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.90
         Prob > chi2 =    0.3867

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.90
         Prob > chi2 =    0.3867

 ( 1)  1.shield#3.kids_cat4 = 0

           chi2(  1) =    5.13
         Prob > chi2 =    0.0235

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.60
         Prob > chi2 =    0.2727

 ( 1)  1.shield#2.kids_cat4 = 0
 ( 2)  1.shield#1.kids_cat4 = 0

           chi2(  2) =    2.60
         Prob > chi2 =    0.2727

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_death.log
  log type:  text
 closed on:  28 Oct 2021, 11:49:51
-------------------------------------------------------------------------------
