-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_tpp_prob_
> vaccine_main.log
  log type:  text
 opened on:  30 Nov 2021, 19:16:51

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("age") _tab ("exposure") _tab ("exposure lev
> el") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("events") _tab ("person_years") _tab ("rate") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach x in 0 1 {
  4. forvalues i=`min'/`max'{
  5. foreach int_type in vaccine {
  6. 
. foreach int_level in  1 2 3 {
  7. 
. local endwith "_tab"
  8. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`x'") _tab ("`variable'") _tab ("`i'")
>  _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'") _tab
  9.  
.  use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", c
> lear
 10. 
. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
 11. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
 12. drop if covid_vacc_date<d(20dec2020)
 13. drop if covid_vacc_second_dose_date<d(20dec2020)
 14. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
 15. replace `outcome'=0 if stime_`outcome'<date_`outcome'
 16. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 17. 
. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 18.         
. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 19. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 20. format first_vacc_plus_7d second_vacc_plus_7d %td
 21. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 22. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 23. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 24. recode `outcome' .=0 
 25. stsplit split2, after(second_vacc_plus_7d) at(0)
 26. recode `outcome' .=0 
 27. bysort patient_id: gen vaccine=_n
 28. tab vaccine, miss
 29.         
.         
.         keep if vaccine==`int_level'
 30. *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 31.         local event = r(N)
 32.         gen fup=_t-_t0
 33.     bysort `variable': egen total_follow_up = total(fup)
 34.         su total_follow_up if `variable' == `i'
 35.         local person_days = r(mean)
 36.         local person_years=`person_days'/365.25
 37.         local rate = 100000*(`event'/`person_years')
 38.         
.         file write tablecontents_int (`event') _tab %10.0f (`person_years') _
> tab %3.2f (`rate') _tab
 39.         drop total_follow_up
 40.  
.         foreach modeltype of any fulladj {
 41. 
.                 local noestimatesflag 0 /*reset*/
 42. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 43. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 44.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'
 45.                                 if _rc!=0 local noestimatesflag 1
 46.                                 }
 47.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 48.                         if `int_level'==1 {
 49.                         cap lincom 1.vaccine+`i'.`variable'+ 1.vaccine#`i'
> .`variable', eform
 50.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 51. 
.                                 else file write tablecontents_int %4.2f ("ERR
>  IN MODEL") `endwith'
 52.                                 }
 53.                         if `int_level'==2 {
 54.                         cap lincom 2.vaccine+`i'.`variable'+ 2.vaccine#`i'
> .`variable', eform
 55.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 56.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 57.                                 }
 58.                         
.                         if `int_level'==3 {
 59.                         cap lincom 3.vaccine+`i'.`variable'+ 3.vaccine#`i'
> .`variable', eform
 60.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 61.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 62.                                 }
 63.                         }
 64.                         
.                         else file write tablecontents_int %4.2f ("DID NOT FIT
> ") `endwith'
 65. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 66.                         if "`modeltype'"=="fulladj" {
 67.                                 local hr = r(estimate)
 68.                                 local lb = r(lb)
 69.                                 local ub = r(ub)
 70.                                 cap gen `variable'=.
 71.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 72.                                 local pval=r(p)
 73.                                 post HRestimates_int ("`x'") ("`outcome'")
>  ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb') (`ub') (`pva
> l')
 74.                                 drop `variable'
 75.                                 }
 76.                 }
 77.                 }
 78.                 } /*int_level*/
 79.                 } /*full adj*/
 80. 
. } /*variable levels*/
 81. }
 82. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11_an_int_tab_contents_HRtable_`ou
> tcome'_vaccine_main.txt, t w replace
(note: file ./output/11_an_int_tab_contents_HRtable_covid_tpp_prob_vaccine_main
> .txt not found)

. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 x str10 outcome str27 variable str27 int_type 
> level int_level hr lci uci pval using `HRestimates_int'

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       91.29       91.29
          2 |      1,136        8.28       99.56
          3 |         60        0.44      100.00
------------+-----------------------------------
      Total |     13,724      100.00
(1,196 observations deleted)
  206

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        508       50740           0      50740      50740
invalid syntax
r(198);

end of do-file
r(198);

end of do-file

r(198);


