-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_death_vac
> cine_main.log
  log type:  text
 opened on:  24 Nov 2021, 11:53:10

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("age") _tab ("exposure") _tab ("exposure lev
> el") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("events") _tab ("person_years") _tab ("rate") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach x in 0 1 {
  4. forvalues i=`min'/`max'{
  5. foreach int_type in vaccine {
  6. 
. foreach int_level in  1 2 3 {
  7. 
. local endwith "_tab"
  8. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`x'") _tab ("`variable'") _tab ("`i'")
>  _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'") _tab
  9.  
.  use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", c
> lear
 10. 
. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
 11. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
 12. drop if covid_vacc_date<d(20dec2020)
 13. drop if covid_vacc_second_dose_date<d(20dec2020)
 14. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
 15. replace `outcome'=0 if stime_`outcome'<date_`outcome'
 16. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 17. 
. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 18.         
. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 19. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 20. format first_vacc_plus_7d second_vacc_plus_7d %td
 21. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 22. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 23. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 24. recode `outcome' .=0 
 25. stsplit split2, after(second_vacc_plus_7d) at(0)
 26. recode `outcome' .=0 
 27. bysort patient_id: gen vaccine=_n
 28. tab vaccine, miss
 29.         
.         
.         keep if vaccine==`int_level'
 30. *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 31.         local event = r(N)
 32.     bysort `variable': egen total_follow_up = total(_t)
 33.         su total_follow_up if `variable' == `i'
 34.         local person_days = r(mean)
 35.         local person_years=`person_days'/365.25
 36.         local rate = 100000*(`event'/`person_years')
 37.         
.         file write tablecontents_int (`event') _tab %10.0f (`person_years') _
> tab %3.2f (`rate') _tab
 38.         drop total_follow_up
 39.  
.         foreach modeltype of any fulladj {
 40. 
.                 local noestimatesflag 0 /*reset*/
 41. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 42. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 43.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'
 44.                                 if _rc!=0 local noestimatesflag 1
 45.                                 }
 46.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 47.                         if `int_level'==1 {
 48.                         test 1.`int_type'#`i'.`variable'
 49.                         *overall p-value for interaction: test 1.`int_type
> '#1.`variable' test 1.`int_type'#2.`variable'
.                         local pval=r(p)
 50.                         cap lincom `i'.`variable', eform
 51.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 52. 
.                                 else file write tablecontents_int %4.2f ("ERR
>  IN MODEL") `endwith'
 53.                                 }
 54.                         if `int_level'==2 {
 55.                         cap lincom `i'.`variable'+ 2.`int_type'#`i'.`varia
> ble', eform
 56.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 57.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 58.                                 }
 59.                         
.                         if `int_level'==3 {
 60.                         cap lincom `i'.`variable'+ 3.`int_type'#`i'.`varia
> ble', eform
 61.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 62.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 63.                                 }
 64.                         }
 65.                         
.                         else file write tablecontents_int %4.2f ("DID NOT FIT
> ") `endwith'
 66. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 67.                         if "`modeltype'"=="fulladj" {
 68.                                 local hr = r(estimate)
 69.                                 local lb = r(lb)
 70.                                 local ub = r(ub)
 71.                                 cap gen `variable'=.
 72.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 73.                                 local pval=r(p)
 74.                                 post HRestimates_int ("`x'") ("`outcome'")
>  ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb') (`ub') (`pva
> l')
 75.                                 drop `variable'
 76.                                 }
 77.                 }
 78.                 }
 79.                 } /*int_level*/
 80.                 } /*full adj*/
 81. 
. } /*variable levels*/
 82. }
 83. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11_an_int_tab_contents_HRtable_`ou
> tcome'_vaccine_main.txt, t w replace
(note: file ./output/11_an_int_tab_contents_HRtable_covid_death_vaccine_main.tx
> t not found)

. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 x str10 outcome str27 variable str27 int_type 
> level int_level hr lci uci pval using `HRestimates_int'

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(1,452 observations deleted)
  154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        508       74077           0      74077      74077

 ( 1)  1bn.vaccine#0b.kids_cat4 = 0

           chi2(  1) =    1.70
         Prob > chi2 =    0.1928

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(12,598 observations deleted)
  50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        163       39768           0      39768      39768

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(13,910 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          2         346           0        346        346

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(1,452 observations deleted)
  221

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,739      130078           0     130078     130078

 ( 1)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  1) =    2.05
         Prob > chi2 =    0.1526

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(12,598 observations deleted)
  64

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        303       45506           0      45506      45506

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(13,910 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         14        2040           0       2040       2040

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(1,452 observations deleted)
  35

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        169       18087           0      18087      18087

 ( 1)  1bn.vaccine#2.kids_cat4 = 0

           chi2(  1) =    0.36
         Prob > chi2 =    0.5486

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(12,598 observations deleted)
  6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         40        7116           0       7116       7116

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(13,910 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          3         513           0        513        513

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(1,452 observations deleted)
  590

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     10,112      393465           0     393465     393465

 ( 1)  1bn.vaccine#3.kids_cat4 = 0

           chi2(  1) =    0.07
         Prob > chi2 =    0.7951

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(12,598 observations deleted)
  73

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        876       78571           0      78571      78571

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     15,750  total observations
      3,222  observations end on or before enter()
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     12,528       89.61       89.61
          2 |      1,382        9.89       99.50
          3 |         70        0.50      100.00
------------+-----------------------------------
      Total |     13,980      100.00
(13,910 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         51        4401           0       4401       4401

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    2.38
         Prob > chi2 =    0.3035
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(401 observations deleted)
  49

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        155       20930           0      20930      20930

 ( 1)  1bn.vaccine#0b.kids_cat4 = 0

           chi2(  1) =    1.43
         Prob > chi2 =    0.2311

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(3,501 observations deleted)
  19

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         52       11568           0      11568      11568

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(3,878 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          1         236           .        236        236

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(401 observations deleted)
  68

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        470       32355           0      32355      32355

 ( 1)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  1) =    0.39
         Prob > chi2 =    0.5344

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(3,501 observations deleted)
  20

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         79       11695           0      11695      11695

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(3,878 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          4         523           0        523        523

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(401 observations deleted)
  6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         45        4352           0       4352       4352

 ( 1)  1bn.vaccine#2.kids_cat4 = 0

           chi2(  1) =    6.92
         Prob > chi2 =    0.0085

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(3,501 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         18        3087           0       3087       3087

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(3,878 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(401 observations deleted)
  168

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,819      107059           0     107059     107059

 ( 1)  1bn.vaccine#3.kids_cat4 = 0

           chi2(  1) =    0.36
         Prob > chi2 =    0.5484

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(3,501 observations deleted)
  18

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        240       22176           0      22176      22176

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      4,387  total observations
        898  observations end on or before enter()
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)

    vaccine |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,489       89.69       89.69
          2 |        389       10.00       99.69
          3 |         12        0.31      100.00
------------+-----------------------------------
      Total |      3,890      100.00
(3,878 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          7         622           0        622        622

 ( 1)  1bn.vaccine#2.kids_cat4 = 0
 ( 2)  1bn.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.33
         Prob > chi2 =    0.0256

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_death_vac
> cine_main.log
  log type:  text
 closed on:  24 Nov 2021, 11:53:20
-------------------------------------------------------------------------------
