-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_icu.log
  log type:  text
 opened on:  25 Jul 2021, 08:36:12

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("period") _tab ("age") _tab ("exposure") _ta
> b ("exposure level") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach period in 0 1 2  {
  4. forvalues x=0/1 {
  5. forvalues i=`min'/`max'{
  6. foreach int_type in male vaccine {
  7. 
. forvalues int_level=0/1 {
  8. 
. local endwith "_tab"
  9. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`period'") _tab ("`x'") _tab ("`variab
> le'") _tab ("`i'") _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'"
> ) _tab
 10. 
.         foreach modeltype of any fulladj {
 11. 
.                 local noestimatesflag 0 /*reset*/
 12. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 13. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 14.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'_timeperiod`period'
 15.                                 if _rc!=0 local noestimatesflag 1
 16.                                 }
 17.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 18.                         if `int_level'==0 {
 19.                         test 1.`int_type'#`i'.`variable'
 20.                         *overall p-value for interaction: test 1.`int_type
> '#1.`variable' test 1.`int_type'#2.`variable'
.                         local pval=r(p)
 21.                         cap lincom `i'.`variable', eform
 22.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 23. 
.                                 else file write tablecontents_int %4.2f ("ERR
>  IN MODEL") `endwith'
 24.                                 }
 25.                         if `int_level'==1 {
 26.                         cap lincom `i'.`variable'+ 1.`int_type'#`i'.`varia
> ble', eform
 27.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 28.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 29.                                 }
 30.                         }
 31.                         else file write tablecontents_int %4.2f ("DID NOT 
> FIT") `endwith'
 32. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 33.                         if "`modeltype'"=="fulladj" {
 34.                                 local hr = r(estimate)
 35.                                 local lb = r(lb)
 36.                                 local ub = r(ub)
 37.                                 cap gen `variable'=.
 38.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 39.                                 local pval=r(p)
 40.                                 post HRestimates_int ("`period'") ("`x'") 
> ("`outcome'") ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb')
>  (`ub') (`pval')
 41.                                 drop `variable'
 42.                                 }
 43.                 }
 44.                 }
 45.                 } /*int_level*/
 46.                 } /*full adj*/
 47. 
. } /*variable levels*/
 48. } /*agebands*/
 49. } /*datsets*/
 50. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11_an_int_tab_contents_HRtable_`ou
> tcome'.txt, t w replace
(note: file ./output/11_an_int_tab_contents_HRtable_covid_icu.txt not found)

. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 period str10 x str10 outcome str27 variable st
> r27 int_type level int_level hr lci uci pval using `HRestimates_int'

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(1) max(3) outcome(`outcome')

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    1.43
         Prob > chi2 =    0.2320

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.10
         Prob > chi2 =    0.3497

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.10
         Prob > chi2 =    0.3497

 ( 1)  1.vaccine#1.kids_cat4 = 0

           chi2(  1) =    3.92
         Prob > chi2 =    0.0478

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    1.73
         Prob > chi2 =    0.1879

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.10
         Prob > chi2 =    0.3497

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.10
         Prob > chi2 =    0.3497

 ( 1)  1.vaccine#2.kids_cat4 = 0

           chi2(  1) =    0.92
         Prob > chi2 =    0.3378

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    1.50
         Prob > chi2 =    0.2214

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.10
         Prob > chi2 =    0.3497

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.10
         Prob > chi2 =    0.3497

 ( 1)  1.vaccine#3.kids_cat4 = 0

           chi2(  1) =   19.73
         Prob > chi2 =    0.0000

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.63
         Prob > chi2 =    0.4261

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    4.67
         Prob > chi2 =    0.0967

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    4.67
         Prob > chi2 =    0.0967

 ( 1)  1.vaccine#1.kids_cat4 = 0

           chi2(  1) =    1.34
         Prob > chi2 =    0.2469

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    1.16
         Prob > chi2 =    0.2809

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    4.67
         Prob > chi2 =    0.0967

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    4.67
         Prob > chi2 =    0.0967

 ( 1)  1.vaccine#2.kids_cat4 = 0

           chi2(  1) =    6.30
         Prob > chi2 =    0.0121

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.71
         Prob > chi2 =    0.3985

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    4.67
         Prob > chi2 =    0.0967

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    4.67
         Prob > chi2 =    0.0967

 ( 1)  1.vaccine#3.kids_cat4 = 0

           chi2(  1) =    6.56
         Prob > chi2 =    0.0105

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    1.15
         Prob > chi2 =    0.2829

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.25
         Prob > chi2 =    0.3242

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.25
         Prob > chi2 =    0.3242

 ( 1)  1.vaccine#1.kids_cat4 = 0

           chi2(  1) =    3.92
         Prob > chi2 =    0.0478

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.09
         Prob > chi2 =    0.7589

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.25
         Prob > chi2 =    0.3242

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.25
         Prob > chi2 =    0.3242

 ( 1)  1.vaccine#2.kids_cat4 = 0

           chi2(  1) =    0.92
         Prob > chi2 =    0.3378

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    2.40
         Prob > chi2 =    0.1211

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.25
         Prob > chi2 =    0.3242

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    2.25
         Prob > chi2 =    0.3242

 ( 1)  1.vaccine#3.kids_cat4 = 0

           chi2(  1) =   19.73
         Prob > chi2 =    0.0000

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.21
         Prob > chi2 =    0.6496

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.34
         Prob > chi2 =    0.8438

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.34
         Prob > chi2 =    0.8438

 ( 1)  1.vaccine#1.kids_cat4 = 0

           chi2(  1) =    1.34
         Prob > chi2 =    0.2469

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9741

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.34
         Prob > chi2 =    0.8438

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.34
         Prob > chi2 =    0.8438

 ( 1)  1.vaccine#2.kids_cat4 = 0

           chi2(  1) =    6.30
         Prob > chi2 =    0.0121

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.00
         Prob > chi2 =    0.9644

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.34
         Prob > chi2 =    0.8438

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.34
         Prob > chi2 =    0.8438

 ( 1)  1.vaccine#3.kids_cat4 = 0

           chi2(  1) =    6.56
         Prob > chi2 =    0.0105

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    1.18
         Prob > chi2 =    0.2779

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.36
         Prob > chi2 =    0.5059

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.36
         Prob > chi2 =    0.5059

 ( 1)  1.vaccine#1.kids_cat4 = 0

           chi2(  1) =    3.92
         Prob > chi2 =    0.0478

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.05
         Prob > chi2 =    0.8150

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.36
         Prob > chi2 =    0.5059

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.36
         Prob > chi2 =    0.5059

 ( 1)  1.vaccine#2.kids_cat4 = 0

           chi2(  1) =    0.92
         Prob > chi2 =    0.3378

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.77
         Prob > chi2 =    0.3797

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.36
         Prob > chi2 =    0.5059

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    1.36
         Prob > chi2 =    0.5059

 ( 1)  1.vaccine#3.kids_cat4 = 0

           chi2(  1) =   19.73
         Prob > chi2 =    0.0000

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    4.83
         Prob > chi2 =    0.0892

 ( 1)  1.male#1.kids_cat4 = 0

           chi2(  1) =    0.08
         Prob > chi2 =    0.7837

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.41
         Prob > chi2 =    0.8163

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.41
         Prob > chi2 =    0.8163

 ( 1)  1.vaccine#1.kids_cat4 = 0

           chi2(  1) =    1.34
         Prob > chi2 =    0.2469

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.male#2.kids_cat4 = 0

           chi2(  1) =    0.38
         Prob > chi2 =    0.5373

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.41
         Prob > chi2 =    0.8163

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.41
         Prob > chi2 =    0.8163

 ( 1)  1.vaccine#2.kids_cat4 = 0

           chi2(  1) =    6.30
         Prob > chi2 =    0.0121

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.male#3.kids_cat4 = 0

           chi2(  1) =    0.06
         Prob > chi2 =    0.8054

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.41
         Prob > chi2 =    0.8163

 ( 1)  1.male#2.kids_cat4 = 0
 ( 2)  1.male#1.kids_cat4 = 0

           chi2(  2) =    0.41
         Prob > chi2 =    0.8163

 ( 1)  1.vaccine#3.kids_cat4 = 0

           chi2(  1) =    6.56
         Prob > chi2 =    0.0105

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    7.73
         Prob > chi2 =    0.0210

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_icu.log
  log type:  text
 closed on:  25 Jul 2021, 08:36:13
-------------------------------------------------------------------------------
