-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_death_vac
> cine_stratified.log
  log type:  text
 opened on:  30 Nov 2021, 15:58:29

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("age") _tab ("exposure") _tab ("exposure lev
> el") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("events") _tab ("person_years") _tab ("rate") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach x in 0 1 {
  4. forvalues i=`min'/`max'{
  5. foreach int_type in vaccine {
  6. 
. foreach int_level in  1 2 3 {
  7. 
. local endwith "_tab"
  8. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`x'") _tab ("`variable'") _tab ("`i'")
>  _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'") _tab
  9.  
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
 10. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
 11. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
 12. drop if covid_vacc_date<d(20dec2020)
 13. drop if covid_vacc_second_dose_date<d(20dec2020)
 14. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
 15. replace `outcome'=0 if stime_`outcome'<date_`outcome'
 16. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 17. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 18. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 19. format first_vacc_plus_7d second_vacc_plus_7d %td
 20. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 21. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 22. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 23. 
. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 24. recode `outcome' .=0 
 25. stsplit split2, after(second_vacc_plus_7d) at(0)
 26. recode `outcome' .=0 
 27. 
. stset
 28. bysort patient_id (_t): gen vaccine=_n
 29. 
. 
. 
.         
.         
.         keep if vaccine==`int_level'
 30. *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 31.         local event = r(N)
 32.         gen fup=_t-_t0
 33.     bysort `variable': egen total_follow_up = total(fup)
 34.         su total_follow_up if `variable' == `i'
 35.         local person_days = r(mean)
 36.         local person_years=`person_days'/365.25
 37.         local rate = 100000*(`event'/`person_years')
 38.         
.         file write tablecontents_int (`event') _tab %10.0f (`person_years') _
> tab %3.2f (`rate') _tab
 39.         drop total_follow_up
 40.  
.         foreach modeltype of any fulladj {
 41. 
.                 local noestimatesflag 0 /*reset*/
 42. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 43. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 44.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'_stratified
 45.                                 if _rc!=0 local noestimatesflag 1
 46.                                 }
 47.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 48.                         if `int_level'==1 {
 49.                         test 1.`int_type'#`i'.`variable'
 50.                         *overall p-value for interaction: test 1.`int_type
> '#1.`variable' test 1.`int_type'#2.`variable'
.                         local pval=r(p)
 51.                         cap lincom `i'.`variable', eform
 52.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 53. 
.                                 else file write tablecontents_int %4.2f ("ERR
>  IN MODEL") `endwith'
 54.                                 }
 55.                         if `int_level'==2 {
 56.                         cap lincom `i'.`variable'+ 1.`int_type'#`i'.`varia
> ble', eform
 57.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 58.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 59.                                 }
 60.                         
.                         if `int_level'==3 {
 61.                         cap lincom `i'.`variable'+ 2.`int_type'#`i'.`varia
> ble', eform
 62.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 63.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 64.                                 }
 65.                         }
 66.                         
.                         else file write tablecontents_int %4.2f ("DID NOT FIT
> ") `endwith'
 67. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 68.                         if "`modeltype'"=="fulladj" {
 69.                                 local hr = r(estimate)
 70.                                 local lb = r(lb)
 71.                                 local ub = r(ub)
 72.                                 cap gen `variable'=.
 73.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 74.                                 local pval=r(p)
 75.                                 post HRestimates_int ("`x'") ("`outcome'")
>  ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb') (`ub') (`pva
> l')
 76.                                 drop `variable'
 77.                                 }
 78.                 }
 79.                 }
 80.                 } /*int_level*/
 81.                 } /*full adj*/
 82. 
. } /*variable levels*/
 83. }
 84. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11_an_int_tab_contents_HRtable_`ou
> tcome'_vaccine_stratified.txt, t w replace
(note: file ./output/11_an_int_tab_contents_HRtable_covid_death_vaccine_stratif
> ied.txt not found)

. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 x str10 outcome str27 variable str27 int_type 
> level int_level hr lci uci pval using `HRestimates_int'

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,452 observations deleted)
  154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        508       74077           0      74077      74077

 ( 1)  1b.vaccine#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(12,598 observations deleted)
  50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        163       21721           0      21721      21721

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(13,910 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          2         211           0        211        211

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,452 observations deleted)
  221

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,739      130078           0     130078     130078

 ( 1)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(12,598 observations deleted)
  64

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        303       23572           0      23572      23572

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(13,910 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         14        1351           0       1351       1351

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,452 observations deleted)
  35

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        169       18087           0      18087      18087

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(12,598 observations deleted)
  6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         40        3719           0       3719       3719

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(13,910 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          3         323           0        323        323

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,452 observations deleted)
  590

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     10,112      393465           0     393465     393465

 ( 1)  1b.vaccine#3o.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(12,598 observations deleted)
  73

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        876       36656           0      36656      36656

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(13,436 real changes made)
(5,586 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,742 real changes made, 4,742 to missing)
(112 real changes made, 112 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,382 observations (episodes) created)
(covid_death: 1382 changes made)
(70 observations (episodes) created)
(covid_death: 70 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,980  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,980  observations remaining, representing
     12,528  subjects
      1,199  failures in single-failure-per-subject data
    705,195  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(13,910 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         51        1935           0       1935       1935

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(401 observations deleted)
  49

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        155       20930           0      20930      20930

 ( 1)  1b.vaccine#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,501 observations deleted)
  19

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         52        7219           0       7219       7219

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,878 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          1         205           .        205        205

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(401 observations deleted)
  68

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        470       32355           0      32355      32355

 ( 1)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,501 observations deleted)
  20

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         79        5702           0       5702       5702

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,878 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          4         259           0        259        259

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(401 observations deleted)
  6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         45        4352           0       4352       4352

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,501 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         18        1661           0       1661       1661

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,878 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(401 observations deleted)
  168

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,819      107059           0     107059     107059

 ( 1)  1b.vaccine#3o.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,501 observations deleted)
  18

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        240       10705           0      10705      10705

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,710 real changes made)
(1,489 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,307 real changes made, 1,307 to missing)
(36 real changes made, 36 to missing)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(389 observations (episodes) created)
(covid_death: 389 changes made)
(12 observations (episodes) created)
(covid_death: 12 changes made)
-> stset stime_covid_death, id(patient_id) failure(covid_death) enter(time
                            enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_death != 0 & covid_death < .
obs. time interval:  (stime_covid_death[_n-1], stime_covid_death]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,890  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,890  observations remaining, representing
      3,489  subjects
        352  failures in single-failure-per-subject data
    190,711  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,878 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          7         264           0        264        264

 ( 1)  1b.vaccine#2o.kids_cat4 = 0
 ( 2)  1b.vaccine#1o.kids_cat4 = 0
       Constraint 1 dropped
       Constraint 2 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_death_vac
> cine_stratified.log
  log type:  text
 closed on:  30 Nov 2021, 15:58:42
-------------------------------------------------------------------------------
