-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_tpp_prob_
> vaccine_stratified.log
  log type:  text
 opened on:  30 Nov 2021, 11:14:25

. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real) outcome(string)
  2. file write tablecontents_int ("age") _tab ("exposure") _tab ("exposure lev
> el") ///
> _tab ("outcome") _tab ("int_type") _tab ("int_level") ///
> _tab ("events") _tab ("person_years") _tab ("rate") ///
> _tab ("HR")  _tab ("lci")  _tab ("uci") _tab ("pval") _n
  3. foreach x in 0 1 {
  4. forvalues i=`min'/`max'{
  5. foreach int_type in vaccine {
  6. 
. foreach int_level in  1 2 3 {
  7. 
. local endwith "_tab"
  8. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_int ("`x'") _tab ("`variable'") _tab ("`i'")
>  _tab ("`outcome'") _tab ("`int_type'") _tab ("`int_level'") _tab
  9.  
. use "$tempdir/cr_create_analysis_dataset_STSET_`outcome'_ageband_`x'.dta", cl
> ear
 10. 
. replace covid_vacc_second_dose_date=. if covid_vacc_date>=covid_vacc_second_d
> ose_date
 11. replace covid_vacc_second_dose_date=. if covid_vacc_date==. 
 12. drop if covid_vacc_date<d(20dec2020)
 13. drop if covid_vacc_second_dose_date<d(20dec2020)
 14. 
. *Censor at date of first child being vaccinated in hh
. replace stime_`outcome'         = under18vacc if stime_`outcome'>under18vacc
 15. replace `outcome'=0 if stime_`outcome'<date_`outcome'
 16. *Drop those without any eligible follow-up
. drop if enter_date>=stime_`outcome'
 17. *Generate first and second vacc dates   
. gen first_vacc_plus_7d=covid_vacc_date+7
 18. gen second_vacc_plus_7d=covid_vacc_second_dose_date+7
 19. format first_vacc_plus_7d second_vacc_plus_7d %td
 20. 
. *Replace vacc date with missing if occur after end follow-up
. replace first_vacc_plus_7d=. if first_vacc_plus_7d> stime_`outcome'
 21. replace second_vacc_plus_7d=. if second_vacc_plus_7d> stime_`outcome'
 22. 
. stset stime_`outcome', fail(`outcome')          ///
>         id(patient_id) enter(enter_date) origin(enter_date)
 23. 
. 
. stsplit split1, after(first_vacc_plus_7d) at(0)
 24. recode `outcome' .=0 
 25. stsplit split2, after(second_vacc_plus_7d) at(0)
 26. recode `outcome' .=0 
 27. 
. stset
 28. bysort patient_id (_t): gen vaccine=_n
 29. 
. 
. 
.         
.         
.         keep if vaccine==`int_level'
 30. *put total N, PYFU and Rate in table
.         cou if `variable' == `i' & _d == 1 
 31.         local event = r(N)
 32.         gen fup=_t-_t0
 33.     bysort `variable': egen total_follow_up = total(fup)
 34.         su total_follow_up if `variable' == `i'
 35.         local person_days = r(mean)
 36.         local person_years=`person_days'/365.25
 37.         local rate = 100000*(`event'/`person_years')
 38.         
.         file write tablecontents_int (`event') _tab %10.0f (`person_years') _
> tab %3.2f (`rate') _tab
 39.         drop total_follow_up
 40.  
.         foreach modeltype of any fulladj {
 41. 
.                 local noestimatesflag 0 /*reset*/
 42. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="fulladj" local endwith "_n"
 43. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
. 
.                 if "`modeltype'"=="fulladj" {
 44.                                 cap estimates use ./output/an_interaction_
> cox_models_`outcome'_kids_cat4_`int_type'_`x'_stratified
 45.                                 if _rc!=0 local noestimatesflag 1
 46.                                 }
 47.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
. 
.                 if `noestimatesflag'==0{
 48.                         if `int_level'==1 {
 49.                         test 1.`int_type'#`i'.`variable'
 50.                         *overall p-value for interaction: test 1.`int_type
> '#1.`variable' test 1.`int_type'#2.`variable'
.                         local pval=r(p)
 51.                         cap lincom `i'.`variable', eform
 52.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab %4.2f (`pval') `endwith'
 53. 
.                                 else file write tablecontents_int %4.2f ("ERR
>  IN MODEL") `endwith'
 54.                                 }
 55.                         if `int_level'==2 {
 56.                         cap lincom `i'.`variable'+ 1.`int_type'#`i'.`varia
> ble', eform
 57.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 58.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 59.                                 }
 60.                         
.                         if `int_level'==3 {
 61.                         cap lincom `i'.`variable'+ 2.`int_type'#`i'.`varia
> ble', eform
 62.                         if _rc==0 file write tablecontents_int %4.2f (r(es
> timate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab  `endwith'
 63.                                 else file write tablecontents_int %4.2f ("
> ERR IN MODEL") `endwith'
 64.                                 }
 65.                         }
 66.                         
.                         else file write tablecontents_int %4.2f ("DID NOT FIT
> ") `endwith'
 67. 
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 68.                         if "`modeltype'"=="fulladj" {
 69.                                 local hr = r(estimate)
 70.                                 local lb = r(lb)
 71.                                 local ub = r(ub)
 72.                                 cap gen `variable'=.
 73.                                 test 1.`int_type'#2.`variable' 1.`int_type
> '#1.`variable'
 74.                                 local pval=r(p)
 75.                                 post HRestimates_int ("`x'") ("`outcome'")
>  ("`variable'") ("`int_type'") (`i') (`int_level') (`hr') (`lb') (`ub') (`pva
> l')
 76.                                 drop `variable'
 77.                                 }
 78.                 }
 79.                 }
 80.                 } /*int_level*/
 81.                 } /*full adj*/
 82. 
. } /*variable levels*/
 83. }
 84. end

. *****************************************************************************
> ******************************************
. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. cap file close tablecontents_int

. file open tablecontents_int using ./output/11_an_int_tab_contents_HRtable_`ou
> tcome'_vaccine_stratified.txt, t w replace
(note: file ./output/11_an_int_tab_contents_HRtable_covid_tpp_prob_vaccine_stra
> tified.txt not found)

. 
. tempfile HRestimates_int

. cap postutil clear

. postfile HRestimates_int str10 x str10 outcome str27 variable str27 int_type 
> level int_level hr lci uci pval using `HRestimates_int'

. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(0) max(3) outcome(`outcome')
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,196 observations deleted)
  206

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        508       50740           0      50740      50740

 ( 1)  1o.vaccine#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(12,588 observations deleted)
  68

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        116       10860           0      10860      10860

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(13,664 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          2          52           0         52         52

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,196 observations deleted)
  368

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      1,739      101512           0     101512     101512

 ( 1)  1.vaccine#1.kids_cat4 = 0

           chi2(  1) =    3.35
         Prob > chi2 =    0.0671

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(12,588 observations deleted)
  58

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        236       14157           0      14157      14157

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(13,664 observations deleted)
  4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         12         875           0        875        875

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,196 observations deleted)
  47

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        169       14226           0      14226      14226

 ( 1)  1.vaccine#2.kids_cat4 = 0

           chi2(  1) =    1.84
         Prob > chi2 =    0.1746

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(12,588 observations deleted)
  11

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         31        2092           0       2092       2092

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(13,664 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          2         213           0        213        213

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,196 observations deleted)
  1,141

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |     10,112      348561           0     348561     348561

 ( 1)  1.vaccine#3.kids_cat4 = 0

           chi2(  1) =    5.53
         Prob > chi2 =    0.0187

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(12,588 observations deleted)
  109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        753       28031           0      28031      28031

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(2,911 real changes made, 2,911 to missing)
(0 real changes made)
(373 observations deleted)
(0 observations deleted)
(12,153 real changes made)
(11,537 real changes made)
(3,222 observations deleted)
(6,391 missing values generated)
(12,345 missing values generated)
(4,984 real changes made, 4,984 to missing)
(123 real changes made, 123 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     12,528  total observations
          0  exclusions
------------------------------------------------------------------------------
     12,528  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(1,136 observations (episodes) created)
(covid_tpp_prob: 1136 changes made)
(60 observations (episodes) created)
(covid_tpp_prob: 60 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     13,724  total observations
          0  exclusions
------------------------------------------------------------------------------
     13,724  observations remaining, representing
     12,528  subjects
      2,022  failures in single-failure-per-subject data
    572,927  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(13,664 observations deleted)
  8

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         44        1608           0       1608       1608

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    3.50
         Prob > chi2 =    0.1735
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(325 observations deleted)
  61

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        155       15056           0      15056      15056

 ( 1)  1o.vaccine#0b.kids_cat4 = 0
       Constraint 1 dropped

           chi2(  0) =       .
         Prob > chi2 =         .

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,500 observations deleted)
  19

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         35        3220           0       3220       3220

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,803 observations deleted)
  1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          1         145           .        145        145

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(325 observations deleted)
  98

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        470       25651           0      25651      25651

 ( 1)  1.vaccine#1.kids_cat4 = 0

           chi2(  1) =    0.68
         Prob > chi2 =    0.4108

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,500 observations deleted)
  17

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         62        3219           0       3219       3219

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,803 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          4         259           0        259        259

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(325 observations deleted)
  12

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         45        3755           0       3755       3755

 ( 1)  1.vaccine#2.kids_cat4 = 0

           chi2(  1) =    0.02
         Prob > chi2 =    0.8758

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,500 observations deleted)
  2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |         12         754           0        754        754

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,803 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          0

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(325 observations deleted)
  291

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |      2,819       94859           0      94859      94859

 ( 1)  1.vaccine#3.kids_cat4 = 0

           chi2(  1) =    1.59
         Prob > chi2 =    0.2079

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,500 observations deleted)
  31

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |        205        7914           0       7914       7914

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691
(830 real changes made, 830 to missing)
(0 real changes made)
(121 observations deleted)
(0 observations deleted)
(3,384 real changes made)
(3,226 real changes made)
(898 observations deleted)
(1,786 missing values generated)
(3,440 missing values generated)
(1,382 real changes made, 1,382 to missing)
(37 real changes made, 37 to missing)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,489  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,489  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(314 observations (episodes) created)
(covid_tpp_prob: 314 changes made)
(11 observations (episodes) created)
(covid_tpp_prob: 11 changes made)
-> stset stime_covid_tpp_prob, id(patient_id) failure(covid_tpp_prob)
                               enter(time enter_date) origin(time enter_date)

                id:  patient_id
     failure event:  covid_tpp_prob != 0 & covid_tpp_prob < .
obs. time interval:  (stime_covid_tpp_prob[_n-1], stime_covid_tpp_prob]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
      3,814  total observations
          0  exclusions
------------------------------------------------------------------------------
      3,814  observations remaining, representing
      3,489  subjects
        532  failures in single-failure-per-subject data
    155,076  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       298
(3,803 observations deleted)
  0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |          6         244           0        244        244

 ( 1)  1.vaccine#2.kids_cat4 = 0
 ( 2)  1.vaccine#1.kids_cat4 = 0

           chi2(  2) =    0.80
         Prob > chi2 =    0.6691

. file write tablecontents_int _n

. 
. file close tablecontents_int

. 
. postclose HRestimates_int

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11_an_interaction_HR_tables_forest_covid_tpp_prob_
> vaccine_stratified.log
  log type:  text
 closed on:  30 Nov 2021, 11:14:36
-------------------------------------------------------------------------------
