-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/15_an_tablecontents_HRtable_all_outcomes_ANALYSES_
> SENSE.log
  log type:  text
 opened on:  28 Oct 2021, 13:57:30

. 
. 
. *****************************************************************************
> ******************************************
. *Generic code to ouput the HRs across outcomes for all levels of a particular
>  variables, in the right shape for table
. cap prog drop outputHRsforvar

. prog define outputHRsforvar
  1. syntax, variable(string) min(real) max(real)
  2. file write tablecontents_all_outcomes ("sense") _tab ("period") _tab ("age
> ") _tab ("exposure") _tab ("exposure level") ///
> _tab ("outcome") _tab ("HR")  _tab ("lci")  _tab ("uci")  _n
  3. foreach period in 0 1 2 3 4 {
  4. foreach x in 0 1 {
  5. foreach outcome in  covid_tpp_prob covidadmission covid_death  {
  6. forvalues i=1/3 {
  7. foreach sense in 11thJuneCensor 1stVaccCensor 2ndVaccCensor {
  8. local endwith "_tab"
  9. 
.         *put the varname and condition to left so that alignment can be check
> ed vs shell
.         file write tablecontents_all_outcomes ("`sense'") _tab ("`period'") _
> tab ("`x'") _tab ("`variable'") _tab ("`i'") _tab ("`outcome'") _tab
 10. 
.         foreach modeltype of any plus_ethadj {
 11.         
.                 local noestimatesflag 0 /*reset*/
 12. 
. *CHANGE THE OUTCOME BELOW TO LAST IF BRINGING IN MORE COLS
.                 if "`modeltype'"=="plus_ethadj" local endwith "_n"
 13. 
.                 ***********************
.                 *1) GET THE RIGHT ESTIMATES INTO MEMORY
.         
.                 if "`modeltype'"=="plus_ethadj" {
 14.                                  estimates use ./output/an_multivariate_co
> x_models_`outcome'_`variable'_FULLYADJMODEL_ageband_`x'_timeperiod`period'_`s
> ense'
 15.                                 if _rc!=0 local noestimatesflag 1
 16.                                 }
 17.                 
.                 ***********************
.                 *2) WRITE THE HRs TO THE OUTPUT FILE
.                 
.                 if `noestimatesflag'==0 & "`modeltype'"=="plus_ethadj"  {
 18.                         cap lincom `i'.`variable', eform
 19.                         if _rc==0 file write tablecontents_all_outcomes %4
> .2f (r(estimate)) _tab %4.2f (r(lb)) _tab %4.2f (r(ub)) _tab (e(N))  `endwith
> '
 20.                                 else file write tablecontents_all_outcomes
>  %4.2f ("ERR IN MODEL") `endwith'
 21.                         }
 22.                         
.                 *3) Save the estimates for plotting
.                 if `noestimatesflag'==0{
 23.                         if "`modeltype'"=="plus_ethadj"   {
 24.                                 local hr = r(estimate)
 25.                                 local lb = r(lb)
 26.                                 local ub = r(ub)
 27.                                 post HRestimates_all_outcomes  ("`sense'")
>  ("`period'") ("`x'") ("`outcome'") ("`variable'") (`i') (`hr') (`lb') (`ub')
>  
 28.                                 }
 29.                 }       
 30.                 } /*min adj, full adj*/
 31.         } /*datasets*/
 32.                 
. } /*variable levels*/
 33. } /*age levels*/
 34. } /*sense levels*/
 35. }
 36. end

. 
. *MAIN CODE TO PRODUCE TABLE CONTENTS
. 
. 
. cap file close tablecontents_all_outcomes

. file open tablecontents_all_outcomes using ./output/15_an_tablecontents_HRtab
> le_all_outcomes_ANALYSES_SENSE.txt, t w replace 
(note: file ./output/15_an_tablecontents_HRtable_all_outcomes_ANALYSES_SENSE.tx
> t not found)

. 
. tempfile HRestimates_all_outcomes

. cap postutil clear

. postfile HRestimates_all_outcomes str10 sense str10 period str10 x str10 outc
> ome str27 variable i hr lci uci using `HRestimates_all_outcomes'

. 
. 
. *Primary exposure
. outputHRsforvar, variable("kids_cat4") min(1) max(3) 

. file write tablecontents_all_outcomes _n

. 
. file close tablecontents_all_outcomes

. 
. postclose HRestimates_all_outcomes

. 
. use `HRestimates_all_outcomes', clear

. save ./output/HRestimates_all_outcomes_SENSE, replace
(note: file ./output/HRestimates_all_outcomes_SENSE.dta not found)
file ./output/HRestimates_all_outcomes_SENSE.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/15_an_tablecontents_HRtable_all_outcomes_ANALYSES_
> SENSE.log
  log type:  text
 closed on:  28 Oct 2021, 13:57:40
-------------------------------------------------------------------------------
